<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>St. Louisin antia - Amiga 2001</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;<br>
							Valokuvat (luvalla): Wayne Hunt / Amiga.org</font></td>
				</tr>
			</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ Osa 1 ] [ <a href="amiga2001_2.html" target="_self">Osa 2</a> ] [ <a href="amiga2001_3.html" target="_self">Osa 3</a> ] [ <a href="amiga2001_4.html" target="_self">Osa 4</a> ]</font></p>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica">
					<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
						<tr>
							<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i>&quot;28. helmikuuta 2001 pidettiin tiedotustilaisuus joukolle ty&ouml;ntekij&ouml;it&auml; ja muita tunnettuja teknisen alan henkil&ouml;it&auml; Puget Soundin alueella. Hetke&auml; my&ouml;hemmin maanj&auml;ristys, voimakkuudeltaan 6,8 Richterin asteikolla, j&auml;risytti Yhdysvaltain luoteisosia. Mit&auml; sanottiin? Mik&auml; oli syyn&auml; maan &auml;killiseen liikahteluun? Tule St. Louisiin ja kuule vastaukset.&quot;</i></font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">N&auml;in melodramaattisesti (suomennettuna alkuper&auml;ist&auml; teksti&auml; mukaillen) Amiga Inc. hy&ouml;dynsi kotisivuillaan julkaisemassaan lyhyess&auml; tiedotteessa toimistopaikkakuntaansa ja sen l&auml;hiseutuja helmikuussa vavisuttanutta maanj&auml;ristyst&auml;. Kyseisen Seattlen maanj&auml;ristyksen, joka uutisoitiin Suomenkin televisiossa, keskus oli tiett&auml;v&auml;sti vain noin 30 kilometrin p&auml;&auml;ss&auml; Amiga Inc.:n Snoqualmiessa, Washingtonin osavaltiossa sijaitsevasta toimistosta. Amigalta kukaan ei loukkaantunut eik&auml; laitteistoja hajonnut.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Parin vuoden takaa saatamme muistaa esimerkiksi Gatewayn silloin omistaman Amiga Inc.:n liikkeelle laskeman &quot;It's gonna be BIG&quot; -huhun ennen World of Amiga '98 -messuja ja vastaavia esimerkkej&auml; lienee muitakin, joten kahdeksas St. Louisissa j&auml;rjestetty Gateway Computer Show (jonka nimi viittaa St. Louisissa sijaitsevaan suomalaissyntyisen Eero Saarisen suunnittelemaan kaarimonumenttiin, Gateway Archiin, ei suinkaan Gateway-tietokonefirmaan) eli Amiga 2001, ei alkanut Amiga-messuille mitenk&auml;&auml;n poikkeavissa merkeiss&auml;.</font></p>
								<div align="center">
									<p><img src="kuvat/remember.jpg" width="328" height="277" border="0" alt="A time to remember..."></p>
								</div>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ilmassa oli j&auml;lleen kerran paljon hype&auml; ja sen my&ouml;t&auml; odotuksia. Toiset tulisivat taas kerran yll&auml;ttym&auml;&auml;n positiivisesti, toiset kenties pettym&auml;&auml;n karvaasti. Kokoamme t&auml;ss&auml; artikkelissa yhteen messuilta tihkuneita tiedonjyv&auml;si&auml; ja yrit&auml;mme hahmottaa Amigan tulevaisuudensuunnitelmia. Tutustu my&ouml;s Sakun kattavaan <a href="uutiset.html" target="_self">uutispalstaan</a>, johon on ker&auml;tty lis&auml;&auml; katsauksia messuilla tehtyihin julkistuksiin.</font></p>
							</td>
						</tr>
					</table>
					<br>
				</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
					<tr>
						<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Takuutapahtuma portin varjossa</b></font></td>
					</tr>
					<tr>
						<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Gateway Computer Show tai kenties paremmin vain nimell&auml; &quot;Amiga&quot; tutuksi tulleet avioparin Bob ja Diana Scharp j&auml;rjest&auml;m&auml;t St. Louisin Amiga-messut ovat olleet yksi harvoista kiintot&auml;hdist&auml; 90-luvun loppupuoliskon Amiga-taivaalla. Ensimm&auml;isen kerran Gateway Amiga Clubin k&auml;ytt&auml;j&auml;ryhm&auml;projektina vuonna 1994 j&auml;rjest&auml;m&auml;t messut on nyt j&auml;rjestetty kahdeksana vuotena per&auml;kk&auml;in, mik&auml; on harvinaisen kunnioitettava suoritus. Nykyisin messuja j&auml;rjest&auml;&auml; Bobin ja Dianan vet&auml;m&auml; pikkufirma Amigan-St. Louis.</font></p>
						<div align="center">
							<p><img src="kuvat/amiga2001.gif" width="468" height="60" border="0" alt="Amiga 2001"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">St. Louisin Amiga-messuista onkin oikeutetusti tullut yksi vuoden puhutuimmista Amiga-tapauksista, jonne Amiga-yritt&auml;j&auml;t ovat t&auml;hd&auml;nneet kuumimpia uutuuksiaan tai ainakin julkistuksiaan. Viime vuodelta muistamme, kuinka Bill McEwenin uunituore Amiga Inc. julkisti St. Louisissa Amigan developer-ty&ouml;aseman, d'Amigan. Vuonna 1999 Jim Collas piti messuilla kuuluisan revolution-puheensa ja vuosi 1998 toi n&auml;ytille sellaisia kuuluisuuksia kuin Jeff Schindler, Joe Torre ja Darreck Lisle silloiselta Amigalta. Vuosi 1999 ker&auml;si messujen k&auml;vij&auml;enn&auml;tyksen, 1142 vierasta, kun taas viime vuonna tapahtuma veti Amiga-maailman alam&auml;en my&ouml;t&auml; vain 750 k&auml;vij&auml;&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Messut muistetaan my&ouml;s Amiga User Group Networkin aktiivisesta osallistumisesta. UGN, joka on kunnostautunut monilla muillakin Amiga-messuilla niin Yhdysvalloissa kuin Euroopassa, on jo useampana vuotena tuonut tapahtuman Internet-kansan ulottuville IRC:n, web-kameroiden, &auml;&auml;niyhteyksien ja jopa pikkuruisten kameralla varustettujen ilmalaivojen voimalla. N&auml;in ollen St. Louisin messuista on tullut maailmanluokan tapahtuma Amiga-yhteis&ouml;ss&auml;, jota seurataan tapahtumapaikan lis&auml;ksi kaikkialta maailmasta. T&auml;m&auml; kansainv&auml;lisyys on vet&auml;nyt tapahtumaan paljon monikansallista v&auml;ri&auml;.</font></p>
							<div align="center">
								<p><img src="kuvat/smiley.jpg" width="360" height="279" border="0" alt="Smiley Boing"></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga Inc.:n ei siis v&auml;ltt&auml;m&auml;tt&auml; olisi tarvinnut edes kasvattaa hype&auml; heitt&auml;m&auml;ll&auml; huhumyllyyn vett&auml;, sill&auml; Gateway Computer Show on joka tapauksessa seurattu ja seuraamisen arvoinen tapaus. Eik&auml; tapahtuman uutisanti t&auml;n&auml;k&auml;&auml;n vuonna j&auml;tt&auml;nyt kylm&auml;ksi - eik&auml; my&ouml;sk&auml;&auml;n vaille ristiriitaisia tunteita. Omaa tarinaansa kertoo mm. UGN:n sivun ja uutispalvelua tarjonneen Amiga.org:n k&auml;vij&auml;luvut tapahtumaviikonloppuna: yli 2,5 miljoonaa hitti&auml;, m&auml;&auml;r&auml; jonka saavuttamiseen normaalisti kuluu kuukausi. Tietoa siirtyi saitilta yli 40 gigatavua viikonlopussa, tuplasti enemm&auml;n kuin normaalisti kuukaudessa. Lopulta ISP sulki Amiga.org:n v&auml;liaikaisesti liiallisen trafiikin vuoksi.</font></p>
						</td>
					</tr>
				</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
					<tr>
						<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Bilehileiden bittipippalot</font></b></td>
					</tr>
					<tr>
						<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga-messut ovat nykyisell&auml;&auml;n yht&auml; paljon ellei enemm&auml;nkin yst&auml;vien tapaamista ja juhlimista kuin tietokoneita ja tuotejulkistuksia - sellaisena tapahtuvat ovatkin melko lailla my&ouml;s Amiga-yhteis&ouml;n peili. Niinp&auml; ei ollut yll&auml;tys, ett&auml; ensimm&auml;iset messuilta kantautuneet uutiset liittyiv&auml;t ennen tapahtumaa j&auml;rjestettyihin bileisiin.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Messut j&auml;rjestettiin St. Louisin Sheraton West Port -hotellissa 30. maaliskuuta - 1. huhtikuuta. Bob ja Diana Scharp j&auml;rjestiv&auml;t ennen tapahtuman alkua er&auml;&auml;ss&auml; hotellihuoneessa j&auml;rjest&auml;jille ja muille Amiga-kuuluisuuksille juhlat. Paikalla olivat mm. jenkkil&auml;isen AmigaZone-palvelun Harv Laser, Amiga Inc.:n developer-tuesta vastaava Gary Peake, UGN:n Bill Borsari, Amiga-reliikkien ker&auml;&auml;misest&auml; kuuluisaksi tullut Merlancian Ryan Czerwinski, Saksasta Chicagon kautta tapahtumaan saapunut Petro Tyschtschenko, Michael Battilana Cloantolta Italiasta, Alan Redhouse Eyetechilt&auml; Englannista ja mm. Disney Animation Studion tehnyt Leo Schwab.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Juhlien kansainv&auml;linen osanottajajoukko ei j&auml;tt&auml;nyt tapahtuman keskeisyytt&auml; arvailujen varaan. Harventuneessa Amiga-maailmassa t&auml;llaiset tapaamiset ovat osoittautuneet et&auml;isyyksist&auml; huolimatta harvinaisen suosituiksi. Messut ker&auml;siv&auml;t muitakin kuuluisia nimi&auml;, kuten Individual Computersin Saku 99:ss&auml;kin vieraillut Jens Sch&ouml;nfeld Saksasta sek&auml; mm. Zorro III -v&auml;yl&auml;n suunnittelut Amiga-guru Dave Haynie. </font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Seuraavat (julkisuutta saaneet) juhlat j&auml;rjestettiin tapahtumalauantaina p&auml;iv&auml;ll&auml; - Petro Party. Petro Tyschtschenkohan j&auml;i virallisesti Amigalta el&auml;kkeelle tuolla p&auml;iv&auml;m&auml;&auml;r&auml;ll&auml; 31. maaliskuuta 2001. Saksan Amiga-ostasto lopetti toimintansa jo vuodenvaihteessa Amiga 1200 -varaston huvettua loppuun. Petrokin oli j&auml;rjest&auml;nyt juhlille hieman rahoitusta ja kuvista p&auml;&auml;tellen kaikilla oli niin mukavaa - Petro hengasi tilaisuudessa VIP-nauha rintapieless&auml;&auml;n ja tarjolla oli laatikkokaupalla pannupizzaa, j&auml;&auml;kylm&auml;&auml; olutta sek&auml; Boing-pallon ja Petron kuvan yhdist&auml;v&auml;ll&auml; piirroksella ja tekstill&auml; &quot;Best Wishes Petro on your Retirement From all The Amigans&quot; varustettu t&auml;ytekakku. Petro kertoi etsiv&auml;ns&auml; julkaisijaa kirjalle, jonka h&auml;n aikoo kirjoittaa Amiga-kokemuksistaan.</font></p>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdysvaltain Amiga-messuilla on ollut tapana huipentua banquetiin, juhlaillalliseen, joka yleens&auml; j&auml;rjestet&auml;&auml;n tapahtumaviikon lauantai-iltana. Tilaisuus alkoi suomalaisittain oudolta kuulostavan Petro Roastin merkeiss&auml;. Petroa ei kuitenkaan fyysisesti grillattu tilaisuudessa, mutta henkisesti hieman - h&auml;nest&auml; kerrottiin hauskoja tarinoita ja samalla h&auml;nelle annettiin lukuisia l&auml;ksi&auml;islahjoja. Useammat tarinoitsijat mainitsivat jo Jim Collasin pari vuotta sitten p&auml;ivittelem&auml;n Petron ajotyylin autobahnilla - ilmeisesti leppoisassa Petrossa piilee melkoinen rallikuski. My&ouml;s Haage &amp; Partnerin J&uuml;rgen Haage yritti pist&auml;&auml; Petroa leikkis&auml;sti halvalla, mutta pilkka osui omaan nilkkaan Petron kerrottua tapahtumavieraille J&uuml;rgenin sekoiluista yhteisty&ouml;kumppanin humalaisen vaimon kanssa...</font></p>
							<div align="center">
								<p><img src="kuvat/kakku.jpg" width="360" height="243" border="0" alt="Petron kakku"></p>
							</div>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Juhlaillallisella ollaan tyypillisesti my&ouml;s kuultu Amigan edustajan puhe ja tapahtuman suurimmat julkistukset. Sama kuvio toistui t&auml;ll&auml;kin kertaa, sill&auml; juhlapuhujana oli Amiga Inc.:n p&auml;&auml;pomo Bill McEwen ja suurimmat uutiset oli pidetty visusti vakan alla ennen illallista. Uutisten kuulemisen lis&auml;ksi kaikki illalliselle osallistuneet saivat uudet Amiga-julisteet, joita Petro ja muut allekirjoittelivat. Joidenkin tapahtumavieraiden mukaan t&auml;m&auml; juhlaillallinen oli hauskin miesmuistiin, vaikka kestikin kaikkiaan nelisen tuntia. Videoesityksiin kuului mm. videomanipulaatio &quot;dancing baby Petrosta&quot; sek&auml; &quot;Bill Gatesin&quot; terveiset Petrolle.</font></p>
							<div align="center">
								<p><img src="kuvat/petro.jpg" width="360" height="281" border="0" alt="Petro"></p>
							</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Maininnan ansaitsevat my&ouml;s hurjat huhut aamun sarastukseen jatkuneista hotellihuonebileist&auml;, mm. huoneessa 666... Lis&auml;ksi sunnuntaiaamuna Amiga 2001 -messuilla j&auml;rjestettiin Team Amiga -brunssi. Team Amiga on p&auml;&auml;asiassa Internetiss&auml; toiminut Amiga-k&auml;ytt&auml;jien yhteis&ouml;, jonka suosituimpia saavutuksia on ollut Team Amiga -postituslista. Mm. Amigan Gary Peake on ollut Team Amigan toiminnassa aktiivisesti mukana.</font></p>
					</td>
					</tr>
				</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[&nbsp;Osa 1 ] [ <a href="amiga2001_2.html" target="_self">Osa 2</a> ] [ <a href="amiga2001_3.html" target="_self">Osa 3</a> ] [<a href="amiga2001_4.html" target="_self"> Osa 4</a> ]</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		</center>
	</body>

</html>