<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Castle Master</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H1 align="center">Castle Master</H1>

                  <H3>Eine Komplettl&ouml;sung die mit den Prinzen
                  erspielt wurde:</H3>

                  <P>Man startet au&szlig;erhalb der Burg und
                  schlie&szlig;t erst einmal die Br&uuml;cke auf
                  (das schwarze Loch links daneben). Nun geht man
                  in die Zauberh&uuml;tte links neben der Burg,
                  nimmt den K&auml;se und den Solar-Schl&uuml;ssel
                  auf der Stuhllehne und springt ins Loch unter dem
                  Teppich.</P>

                  <H3>Die Katabomben:</H3>

                  <P>In der H&ouml;hle vernichtet man zuerst den
                  Geist, nimmt dann das Pentacle und betritt die
                  Katabomben. Hier sucht man jede H&ouml;hle auf
                  und schickt jeden Geist ins Jenseits. Erst wenn
                  alle Gesiter beseitigt sind, geht es &uuml;ber
                  die Kellertreppe in die erste Etage. Dort begibt
                  man sich in K&uuml;che oder Speisekammer und
                  futtert, bis man den Herkules-Status erreicht
                  hat. &Uuml;ber die Kellertreppe geht es
                  zur&uuml;ck in die Katabomben, wo man das
                  Hindernis &uuml;ber die Fallt&uuml;re schiebt und
                  den letzten Geist in der H&ouml;hle
                  vernichtet.</P>

                  <P>Jetzt geht man raus aus der Burg, schiebt den
                  Felsblock vor der Burg weg und springt hinein.
                  Man nimmt wie in jeder anderen H&ouml;hle das
                  Pentacle und begibt sich zur Kapelle. Dort ist
                  die Wand mit dem Kreuz eine doppelte, hinter ihr
                  ist der Gang zum Glockenturm, wo man am Seil
                  zieht und wieder ein Pentacle findet. Nun kriecht
                  man unter das Pult und befindet sich wieder in
                  den Katabomben. Dort gibt es nochmals ein
                  Pentacle, das n&auml;chste Ziel ist der Brunnen
                  im Innenhof. Den Schl&uuml;ssel im Brunnen
                  aktiviert man und springt in den Brunnen. Wieder
                  das Pentacle gekrallt und weiter zur Sauna. Dort
                  das Wasser ablassen und vorsichtig &uuml;ber die
                  Treppen in den Pool und ins Loch steigen. Dort
                  das Pentacle nehmen und den Gruftvorraum
                  aufsuchen.</P>

                  <H3>Die Burg:</H3>

                  <P>Im Vorraum findet man den
                  Treppenschl&uuml;ssel und kann die Pentacles
                  betrachten-die blinkenden m&uuml;ssen noch
                  gefunden werden. In den Stallungen kriecht man
                  unter das Pferd und findet den
                  Kasernenschl&uuml;ssel. In der Scheune rechts
                  hinter dem Strohballen liegt der Schl&uuml;ssel
                  f&uuml;r die vierte Etage. Nun begibt man sich in
                  Igors Kammer, wo man vom ersten
                  gr&ouml;&szlig;eren Gegner erwartet wird. Mit
                  einigen Sch&uuml;ssen in den Mund l&auml;&szlig;t
                  er sich jedoch leicht erledigen. Danach kann man
                  die Truhe &ouml;ffnen, alles einsacken und den
                  "?"-Schl&uuml;ssel mitnehmen. Weiter geht es in
                  die Bibliothek, dort aktivieren wir ein Buch,
                  woraufhin ein Stuhl an der Wand erscheint. Wir
                  laufen auf ihn zu und drehen uns mit der Wand in
                  den Schrein. Auf dem Goldbrocken liegt der
                  Zellenschl&uuml;ssel.</P>

                  <P>Nun gehen wir in den Gro&szlig;en Saal und
                  dort Vorsichtig den Sims entlang -Vorsicht, an
                  der Ecke fehlt ein St&uuml;ck! Sobald wir zur
                  anderen T&uuml;re drau&szlig;en sind, betreten
                  wir einen winzigen Vorsprung im Wachtraum. Dort
                  nehmen wir uns das Pentacle und verlassen die
                  Burg wieder. Wir stehen auf der Zugbr&uuml;cke
                  und katapulieren uns mit ihr auf das Dach der
                  Kapelle, wo wir uns den Truhenschl&uuml;ssel
                  aneignen. Durch das Loch geht es weiter in die
                  Kapelle und von dort in den dritten Stock. In der
                  Rumpelkammer kriechen wir hinter das Regal,
                  stehen wieder auf, klettern auf das unterste
                  Brett und nehmen das Pentacle. Zur St&auml;rkung
                  geht es jetzt in die Kneipe, dort gibt es einen
                  St&auml;rketrank mit unbegrenzter Wirkungsdauer.
                  Weiter geht es in den obersten Stock, wo wir uns
                  im Tanzsaal durch das Loch fallen lassen. In der
                  dritten Etage geht es weiter zur
                  Drachenh&ouml;hle, deren Bewohner gemeuchelt wird
                  - wozu man auf H&ouml;rner, Z&auml;hne und AUgen
                  schie&szlig;en sollte. Danach k&ouml;nnen wir die
                  Truhe im hinteren Zimmer ausr&auml;umen und das
                  neunte Pentacle organisieren. Das letzte Pentacle
                  finden wir in der Kornkammer. Dort schaufeln wir
                  das Korn beiseite, &ouml;ffnen die Truhe, setzen
                  uns hinein, schlie&szlig;en den Deckel und fallen
                  sicher in den Schauraum.</P>

                  <P>Diesen r&auml;umen wir vollst&auml;ndig aus
                  und begeben uns in den Vorraum der Gruft. Hier
                  kann man jetzt die T&uuml;re &ouml;ffnen und den
                  "Magisterspuk"-Schl&uuml;ssel aus der Gruft
                  holen.</P>

                  <H3>Das Finale:</H3>

                  <P>Weiter gehts im vierten Stock. Nachdem im
                  King`s Solar die Klingel bet&auml;tigt wurde,
                  sollte das erste Hindernis beseitigt sein und der
                  Aktivierung des Steines nichts mehr im Wege
                  stehen. Ist letzteres getan, sollte der Weg zur
                  S&uuml;dpassage frei sein. In der Turnhalle wird
                  solange mit der Hantel trainiert, bis man wieder
                  Herkules ist. Dann geht es zum Magister und damit
                  zum letzten Kampf. (Der geht allerdings nur dann
                  gut aus, wenn auch alle 26 Geister beseitigt
                  wurden.) Nachdem der Magister verkloppt wurde,
                  braucht man nur noch durch die T&uuml;re am
                  anderen Ende des Raumes zu gehen und die (etwas
                  lasche) Schlu&szlig;sequenz bewundern.</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

