<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>B.A.T.</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H1 align="center">B.A.T.</H1>

                  <P>Hallo!</P>

                  <P>Gerade bin ich auf Selenia angekommen. Zum
                  Vorstellen bleibt leider wenig Zeit, da Selenia
                  sonst zerst&ouml;rt wird. Sofort suche ich meinen
                  Kontaktmann im WC auf. Hier erfahre ich die
                  genaue Missionsorder. Zus&auml;tzlich zu meiner
                  Nova erhalte ich noch eine "Creditcard", ein
                  Hologramm von Merigo, 2 Prospekte und 800 Krells.
                  Da ich mich mit einer leeren Nova schlecht
                  verteidigen kann, suche ich Gunsmith`s Laden auf.
                  Hier kaufe ich mir zwei Novabatterien. Nach einem
                  Besuch beim Arzt ( hier kaufe ich mir ausreichend
                  Medizin ) begebe ich mich zum Parkeingang. Ich
                  treffe einen Stickrob, welcher mir um 5 Krells
                  eine "Technicians-Security-Permit-Card" anbietet.
                  Ich greife nat&uuml;rlich zu und nach einigen
                  Bildschirmen befinde ich mich im Technikerraum.
                  Ich spreche mit einem Techniker und bringe
                  folgende Daten in Erfahrung:<BR>
                   Station Beta: Access Code: LLLRLRRL Call Sign:
                  52699 Station<BR>
                   Station Epsilon: Access Code: LLLRRLLR Call
                  Sign: 34365<BR>
                   Station Lambda: Access Code: RRLRRRRL Call Sign:
                  92140<BR>
                   Selenia: Bridge Jericho VII Temperatur: 165 Grad
                  C</P>

                  <P>Distance: 0,96 AU Pressure: 10.000 MB<BR>
                   Diameter: 19,143 Miles Rotation: 85.364
                  secs.<BR>
                   Mass: 9 Terra Atmosphere: 98% CO2</P>

                  <P>Da ich schon einige Male nach Merigo gefragt
                  habe, wei&szlig; ich, da&szlig; Merigo von einer
                  Person in der N&auml;he des Parks erw&auml;hnt
                  wurde. Leider wei&szlig; ich nicht, welche es
                  ist. Daher gehe ich nach 19 Uhr in die "Night
                  Bar". Die Frau verr&auml;t mir gegen ein kleines
                  Entgelt, da&szlig; sie von einem Skunk (kann uach
                  jede andere Figur sein) von Merigo geh&ouml;rt
                  hat. Sofort gehe ich ins "Hot Quater", um den
                  Skunk zu finden. Nach einiger Fragerei komme ich
                  an den richtigen Mann, der mich um 22 Uhr im
                  Museum treffen will. Von ihm kaufe ich auch die
                  Eintrittskarte zum Xifo-Club. austeilen kann ich
                  bei Gefechten schon. Beim Einstecken aber leidet
                  meine Gesundheit darunter. Also mu&szlig; ich mir
                  ein Schutzschild zulegen, welches aber 450 Krells
                  kostet. Nach einiger Zeit mu&szlig; ich
                  aufh&ouml;ren, da Sonst meine Finger zu lang
                  w&uuml;rden. Ich mache mich auf den Weg zum
                  Gesch&auml;ft und besorge mir "Force 8-Schild".
                  Um 22 Uhr treffe ich den Skunk beim Museum. Gegen
                  200 Krells sagt er mir, da&szlig; er Merigo am
                  vorhergehenden Abend um 0 Uhr im Xifo-Club
                  gesehen hat. Auch ich erscheine zur gleichen
                  Zeit, am gleichen Ort. Es dauert nicht lange, bis
                  Mergio mich unter Beschu&szlig; nimmt. Fast
                  gleichzeitig aktiviere ich die Nova und mein
                  Schild und feuere aus allen Rohren. Schon bald
                  ist er erledigt, so da&szlig; ich den Raum
                  untersuchen kann. Ich finde einen
                  Elektronik-Key.</P>

                  <P>Mir ist ziemlich langweilig und so betrete ich
                  gegen 200 Krells den noblen Laden gegen&uuml;ber
                  der Spielhalle. Schon bald quatscht mich Lydia an
                  und fragt mich, ob ich mit ihr tanzen will.
                  Schnell den Puls auf Accelerate geturnt und schon
                  fliegen die Fetzen. Nach gelungenem Tanz fragt
                  Lydia ob ich mit ihr gehen will. Zusammen
                  verlassen wir den Schuppen und besuchen Crisa
                  Kortakis in ihrem Geb&auml;ude. Lydia bekommt von
                  ihr ein Collier mit einem Edelstein geschenkt.
                  Als ich Crisa nach Geld frage, werden mir
                  &uuml;ber 7000 Credits auf meine Creditcard
                  gebucht. Mit Hilfe des gefundenen Elektronik-Keys
                  betreten wir das Tunnelsystem. Im "Evaporation
                  Chamber" sehen wir uns um und entdecken einen
                  Raum, wo wir den Edelstein aus dem Collier von
                  Lydia unterbringen.</P>

                  <P>Ihr f&auml;llt eine "Surface Radar Decoding
                  Device MK VI"-Card in die H&auml;nde, welche ich
                  in Verwahrung nehme. Den richtigen Weg des
                  Labyrinths brauchen wir nicht lange zu suchen,
                  denn ein geschickter Bursche hat zum Gl&uuml;ck
                  die Karte gezeichnet. Jetzt kann es ja nicht mehr
                  lange dauern, denke ich mir. Recht so. Schnell
                  noch ein Schild gekauft und ab zur Spielhalle.
                  Zwischen 13 und 14 Uhr betreten wir die Halle.
                  Als ich ein Spielchen wagen will, zwingt sich
                  Sloan, der beste Bizzy-Spieler der Stadt, mir auf
                  und wettet um 1000 Krells, da&szlig; er mich
                  besiegen kann. Ich willige ein (man mu&szlig;
                  1000 Krells vorweisen k&ouml;nnen) und Sloan
                  zeigt sein ganzes K&ouml;nnen. Sein Spiel ist
                  bald vorbei und ich mu&szlig; nur Level 6
                  erreichen, um ihn zu besiegen. Nach dem
                  gewonnenen Spiel nehme ich Sloan zum F&uuml;hrer
                  (1000 Krells vergessen). Nur mit ihm kommen wir
                  an der Wache vorbei, die den Hangar bewacht. Beim
                  Vermieter bezahlen wir 5900 Credits und schwingen
                  uns darauf in den Gleiter. Am Radar erscheint ein
                  orangefarbiger Punkt, den ich auch sogleich
                  ansteuere. Als die Kuppel der feindlichen Basis
                  in Sicht ist, schie&szlig;e ich ein Loch in sie.
                  Nach sicherer Landung stehen wir vor einem
                  Codepanel. Nach einigem Probieren pa&szlig;t der
                  Epsiloncode, der aber verkehrt eingegeben werden
                  mu&szlig;. LLLRRLLR = RLLRRLLL. Nach erfogreichem
                  Zutritt ersp&auml;he ich Vrangor, der mich mit
                  einer geladenen Kanone anvisiert. Auch Vrangor
                  erledige ich so wie Merigo. Nun zum Gleiter
                  zur&uuml;ck und man erh&auml;lt die entsprechende
                  Meldung (Happy End).</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

