<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>CHUCK YEAGER`S AIR COMBAT</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <P></P>

                  <H1 align="center">CHUCK YEAGER`S AIR COMBAT</H1>

                  <H2>Erfahrungen als Testpilot:</H2>

                  <H2>II Weltkrieg :</H2>

                  <H3>The Abbeville Boys:</H3>
                  Eine der schwierigsten Missionen des
                  2.Weltkriegs. Man mu&szlig; hier mindestens drei
                  Flugzeuge abschie&szlig;en. Zuerst kommen zwei
                  Messerschmitts auf einen zu. Diese sollte man so
                  schnell wie m&ouml;glich abschie&szlig;en - sonst
                  hat man das zweifelhafte Vergn&uuml;gen, gegen
                  die beiden 109er und gegen zwei weitere Focke
                  Wulf 190 A-8 mit sehr guten Piloten zu
                  k&auml;mpfen. Andere feindliche Flieger sind
                  ebenfalls in der Luft. Einstufung : schwierig. 

                  <H3>Schweinfurt :</H3>
                  Eine leichte Mission. Man mu&szlig; B-17-Bomber
                  ohne Eskorte abschie&szlig;en. Wenn man ihrer
                  sechs angreift, wird man sehr oft von den
                  heckensch&uuml;tzen getroffen. Deshalb sollte man
                  von der Seite angreifen. 

                  <H3>Escort :</H3>
                  Hier fliegt man mit einer P-51 Mustang "Wachhund"
                  f&uuml;r B-17-Bomber. Die Bomber werden von ME
                  110 und man selbst von FW 190 angegriffen. Die
                  Mission ist mittelschwer. 

                  <H3>The Big Week:</H3>
                  Hier fliegt man in einer FW 190 gegen B-17
                  Bomber. Ziel der Mission ist es, mindestens einen
                  Bomber abzuschie&szlig;en. Sie werden von P-47
                  Thunderbolts begleitet, die man zuerst in Angriff
                  nehmen sollte. Dann widmet sich den Bombern. Man
                  kann ungef&auml;hr drei Bomber abschie&szlig;en.
                  Insgesamt ist die Mission leicht bis
                  mittelschwer. 

                  <H3>Operation Argument :</H3>
                  Man begleitet hier in seiner Mustang Bomber und
                  wird von feindlichen J&auml;gern agegriffen. Die
                  Bomber m&uuml;ssen nicht unbedingt besch&uuml;tzt
                  werden, man kann also in aller Ruhe die
                  J&auml;ger abschie&szlig;en. Insgesamt: Leicht. 

                  <H3>Wolf Pack :</H3>
                  Hier mu&szlig; man mindestens zwei P-47
                  abschie&szlig;en. Die P-47 war ein sehr gutes
                  Flugzeug, und die Piloten in den Kisten sind auch
                  nicht schlecht. Also ist es eine mittelschwere
                  Aktion. 

                  <H3>P-47 Strafing Attack :</H3>
                  P-47 greifen den eigenen Flugplatz an. Man sollte
                  schnell starten, sonst erwischt es einen schon am
                  Boden. Es m&uuml;ssen nicht alle Thunderbolts
                  abgeschossen werden, aber f&uuml;r die eigene
                  Gesundheit nach dem Landen sollte man sich doch
                  alle vornehmen. Schwierigkeit: mittel. 

                  <H3>Ground Attack :</H3>
                  50+50 Meilen &uuml;berwachen und auf alles
                  schie&szlig;en, was sich bewegt. Trucks und
                  Flugzeuge m&uuml;ssen abgescho&szlig;en werden.
                  Schwierigkeit: mittel. 

                  <H3>Head On:</H3>
                  Mindestens ein B-17-Bomber mu&szlig; abgeschossen
                  werden. Der Begleitschutz besteht aus Mustangs,
                  und die Piloten sind sehr gut. 

                  <H3>Ace in a Day :</H3>
                  F&uuml;nf deutsche Flugzeuge greifen auf einmal
                  an. man kann sie sehr leicht abschie&szlig;en. 

                  <H3>Storm Birds :</H3>
                  drei ME 262 sollen abgeschossen werden. Man
                  mu&szlig; sich hier nicht beeilen, da sie nach
                  einiger Zeit landen. leicht ist dennoch nicht:
                  Vor der Landung tauchen noch andere Deutesche
                  auf. Wenn diese ausgeschaltet sind, kann man sich
                  ungest&ouml;rt den ME 262 widmen. Mit einer
                  abgeschossenen Maschine dieses Typs ist die
                  Mission schon geschafft. 

                  <H3>Gauntlet :</H3>
                  Hier mu&szlig; man mit seiner FW 190 zu seiner
                  Basis zur&uuml;ckkehren, was an und f&uuml;r sich
                  nicht so schwierig ist. Den direkten Weg kann man
                  jedoch nicht nehmen, weil dort Amerikaner
                  herumschwirren. Man kann erstens k&auml;mpfen und
                  zweitens die J&auml;ger umfliegen. 

                  <H3>Ramrod :</H3>
                  Man begleitet B-17-Bomber in seiner Mustang. 2 ME
                  262 greifen an. Der eine nimmt die Bomber auf
                  Korn, der andere legt sich mit den Mustangs an.
                  Es ist Walter Novotny, das Fliegeras der
                  Deutschen. Beide ME 262 m&uuml;ssen abgeschossen
                  werden. 

                  <H3>Meat on the Table :</H3>
                  Hier m&uuml;ssen einfach ME 110 abgeschossen
                  werden. Die Piloten sind gut, die Formation
                  besteht aus f&uuml;nf Flugzeugen. Man sollte sich
                  beeilen. 

                  <H3>The Great Blow :</H3>
                  Man mu&szlig; in dieser Mission feindliche
                  Flugzeuge auf dem Boden und in der Luft
                  abschie&szlig;en. Auf dem Boden sind Mustangs und
                  B-17-Bomber. Die Mustangs sollte man so schnell
                  wie m&ouml;glich abschie&szlig;en, da sie sonst
                  starten. Dawn Patrol :  Viele ME 109 und FW 190
                  greifen in dieser Mission an. Die Piloten sind
                  aber nicht sehr gut. 

                  <H3>Rocket Fighters :</H3>
                  Man mu&szlig; hier ME 163 abschie&szlig;en. Das
                  wichtigste ist, da&szlig; man nicht von den
                  30-mm-Kanonen getroffen wird. Wenn die Kometen
                  keinen Sprit mehr haben und landen m&uuml;ssen,
                  kann man sie leicht abschie&szlig;en. 

                  <H2>Koreakrieg :</H2>

                  <H3>B-29-Escort:</H3>
                  B-29-Bomber m&uuml;ssen in dieser Mission
                  besch&uuml;tzt werden. Feindliche Flugzeuge
                  m&uuml;ssen abgeschossen werden, bis man den
                  Funkspruch erh&auml;lt, da&szlig; die Bomber
                  au&szlig;er Reichweite der J&auml;ger sind. Man
                  wird am Anfang von einer Yak-19 angegriffen. Wenn
                  man die Yak zerst&ouml;rt hat, bekommt man bald
                  den Funkspruch von den Bombern und die Mission
                  ist geschafft. man mu&szlig; also nur ein
                  Flugzeug abschie&szlig;en. 

                  <H3>Ground Attack :</H3>
                  Hier sollte man mit seiner Mustang einen Truck
                  zerst&ouml;ren. Man wird von Mig-15-J&auml;gern
                  angegriffen. Die Migs sind schneller und
                  k&ouml;nnen besser steigen als die altersschwache
                  Mustang. Dennoch kann man Migs abschie&szlig;en. 

                  <H3>Outclassed:</H3>
                  Mit seiner brandneuen Mig-15 mu&szlig; man hier
                  f&uuml;nf P-51 Mustangs abschie&szlig;en. Obwohl
                  die Mustangs nur Propellermaschinen sind, sollte
                  man sie nicht untersch&auml;tzen, denn es sind
                  immerhin f&uuml;nf. 

                  <H3>First Blood:</H3>
                  Mit einem Fl&uuml;gelmann zusammen mu&szlig; man
                  gegen drei Mig-15 antreten. Man kann in dieser
                  Mission der erste Pilot werden, der mit der neuen
                  F-86 Sabre eine Mig-15 abschie&szlig;t. 

                  <H3>Disguise:</H3>
                  Auch hier mu&szlig; man mit einem Fl&uuml;gelmann
                  zusammen Jagd auf Migs machen. 

                  <H3>Mig Cap:</H3>
                  In dieser Mission fliegen drei Migs in 12 Uhr
                  hoch. man sollte sich anschleichen und eine
                  abschie&szlig;en, bevor sie wissen, da&szlig; man
                  da ist. 

                  <H3>Res Cap:</H3>
                  Das ist die schwierigste Mission in diesem Spiel.
                  Ein F-86-Pilot wurde abgeschossen und soll nun
                  mit einer L-15 gerettet werden. Man mu&szlig; in
                  einer F-86 die Rettung des Piloten
                  &uuml;berwachen. Wie es der teufel will, sind
                  auch Migs in der Luft. Eine greift die L-5 an.
                  Bald darauf sollte man auch eine Mig hinter einem
                  selbst auftauchen. Egal was passiert- man darf
                  die L-5 keinen Moment aus den Augen lassen. 

                  <H3>Air Superiority:</H3>
                  Hier mu&szlig; man Luft&uuml;berlegenheit
                  erreichen, damit Stormaviks Bomben auf ihre Ziele
                  werfen k&ouml;nnen. Man fliegt eine Mig-15 und
                  wird von chienesischen Ausbildern begleitet, die
                  allerdings nicht herausragend sind. Man mu&szlig;
                  schon auf die F-86 aufpassen, sonst geht es
                  &uuml;bel aus. 

                  <H3>Top Cover:</H3>
                  Diese Mission ist vom Sinn her wie "B-29-Escort".
                  

                  <H3>Double Bounce:</H3>
                  P-51 Mustangs greifen die Luftbasis an, auf der
                  man stationiert ist. Mit einem Fl&uuml;gelmann
                  mu&szlig; man die P-51 Mustangs abschie&szlig;en,
                  bevor sie zu gro&szlig;en Schaden anrichten. 

                  <H3>Final Exam:</H3>
                  Eine Gruppe Mig-15 mit Piloten, die kurz vor den
                  Abschlu&szlig; ihrer Ausbildung stehen, hat es
                  hier auf einem abgesehen. Sie wollen
                  Testmaterial, und da kommt man als geplagter
                  F-86-Pilot gerade recht. Aber wie schon gesagt,
                  die Piloten sind unerfahren, wenn sie auch schon
                  einiges von ihrem Ausbilder gelernt haben. 

                  <H3>B-29 Intercept:</H3>
                  In dieser Mission m&uuml;ssen B-29-Bomber
                  abgefangen werden. Man sollte sich beeilen, da
                  man sonst mit den Bombern zu weit nach S&uuml;den
                  ger&auml;t, wo es von amerikanischen J&auml;gern
                  nur so wimmelt. 

                  <H3>Instructor:</H3>
                  Hier ist man selber Ausbilder. Man sieht eine
                  Gruppe F-86-J&auml;ger und mu&szlig; den
                  Sch&uuml;lern eine Demonstration des eigenen
                  K&ouml;nnens geben. Die Sch&uuml;ler bleiben auf
                  30 000 Fu&szlig; und werden nicht eingreifen. Die
                  Gruppe der Amerikaner ist recht klein. vTurkey
                  Shoot:  Mit seiner F-86 Jagd auf Mig-15 Fagots
                  machen, ist hier die Aufgabe. Die Maschinen
                  werden von Anf&auml;ngern geflogen, sind also
                  leichte Beute. Leider sind es doch recht viele
                  Migs, und die 37-mm-Kanone so einer Mig kann
                  einem ganz sch&ouml;n zusetzen. Pa&szlig;t also
                  auf, wo Ihr hinfliegt. 

                  <H3>Last Blood:</H3>
                  Wird man der letzte Mig-Pilot sein, der von einer
                  F-86 abgeschossen wird? Man ist mit einer Gruppe
                  von vier Migs in der Luft und sieht F-86 auf 9
                  Uhr. Hier mu&szlig; man h&ouml;llisch aufpassen,
                  denn die anderen Piloten in der Gruppe sind
                  allesamt Anf&auml;nger. Es kann schon einmal
                  vorkommen, da&szlig; man von den eigenen Leuten
                  getroffen wird. 

                  <H3>Project Moolah:</H3>
                  Die Amerikaner haben 100 000 Dollar Belohnung
                  ausgesetzt, wenn man eine flugt&uuml;chtige
                  Mig-15 abliefert. Man mu&szlig; in seiner eigenen
                  Mig-15 den eigenen Leuten entkommen. Sobald man
                  startet, gibt die Bodenstation das Kommando zum
                  Abschu&szlig;. Wenn man unter 50 Fu&szlig;
                  fliegt, wird man so schnell nicht angegriffen.
                  Dann mu&szlig; man noch die Amerikaner von seiner
                  friedlichen Absicht &uuml;berzeugen und so
                  schnell wie m&ouml;glich landen. Diese Mission
                  ist damit geschafft. 

                  <H2>Vietnamkrieg :</H2>

                  <H3>The Dragon Jaw:</H3>
                  Mit einer Mig-21 und einem Fl&uuml;gelmann
                  mu&szlig; man mindestens zwei F-105
                  abschie&szlig;en. Die F-105er haben ihre Bomben
                  schon auf eine Br&uuml;cke abgeworfen. Man
                  mu&szlig; die F-105 nun daran hindern, da&szlig;
                  sie ungeschoren nach Hause kommen. 

                  <H3>First Fishbed Kill:</H3>
                  In einer F-4E Phantom kommen einem zwei brandneue
                  Mig-21 entgegen. Man mu&szlig; das Radar
                  anschalten, auf die AIM7 umstellen, die linke Mig
                  ins Ziel nehmen und feuern. In 90 Prozent aller
                  F&auml;lle mu&szlig; man sich dann nur noch um
                  eine Mig k&uuml;mmern, da man die erste mit einer
                  oder besser zwei raketen erledigt hat. 

                  <H3>Bolo:</H3>
                  Es wird von Chuck Yeager gesagt, da&szlig; man
                  F-105er ohne Eskorte abschie&szlig;en mu&szlig;.
                  Das ist aber nicht der Fall, es handelt sich hier
                  um zahlenm&auml;&szlig;ig &uuml;berlegene F-4E
                  Phantoms und die MAerikaner haben die
                  &Uuml;berraschung auf ihrer Seite. 

                  <H3>Thud Ridge:</H3>
                  F-105er m&uuml;ssen hier abgeschossen werden. Man
                  sollte hier auf keinen Fall sein radar
                  ausgeschaltet lassen, sonst kann man den
                  Amerikanern gleich &uuml;ber Funk sagen,
                  da&szlig; man da ist. Die &Uuml;berraschung hat
                  man auf seiner Seite, man sollte sich allerdings
                  beeilen, da sonst F-4E Phantoms auftauchen. 

                  <H3>Migcap:</H3>
                  In seiner F-4E Phantom mu&szlig; man B-52-Bomber
                  eskortieren, bis diese s&uuml;dlich der
                  Reichweite der migs sind. Jede Bedrohung der
                  Bomber sollte man rechtzeitig abschie&szlig;en.
                  Es sind vier Migs in der Luft. 

                  <H3>Eye in the Sky:</H3>
                  Hier mu&szlig; eine unbewaffnete RF-4
                  besch&uuml;tzt werden. Drei Migs greifen an. 

                  <H3>Red Crown:</H3>
                  In dieser Mission mu&szlig; man sich an Phantoms
                  anschleichen. Nach ihrem Abschu&szlig; sollte man
                  sich schnell verkr&uuml;meln, sonst kommen noch
                  mehr davon. 

                  <H3>Ambush:</H3>
                  Mit anderen Migs greift man F-4E Phantoms an.
                  Zwei von ihnen m&uuml;ssen abgeschossen werden. 

                  <H3>Alone, Unarmed, Unafraid:</H3>
                  In einer unbewaffneten Phantom mu&szlig; man zwei
                  Migs entkommen. Man sollte versuchen, sie
                  auszukurven. Die Phantom hat mehr Sprit als die
                  Mig, man mu&szlig; also nur Gedult haben. 

                  <H3>Colonel Tomb:</H3>
                  Wie der Name schon sagt, mu&szlig; man Colonel
                  Tomb, der eine Mig-17 fliegt, abschie&szlig;en.
                  Er ist aber l&auml;ngst nicht so gut, wie
                  behauptet wird. 

                  <H3>Oyster 01:</H3>
                  Die eigene F-4-Staffel sieht viele Banditen in
                  Elf Uhr. Es m&uuml;ssen aber nicht alle
                  abgeschossen werden. 

                  <H3>Going Downtown:</H3>
                  In seiner Mig-21 mu&szlig; man so viele F-105 und
                  F-4E abschie&szlig;en wie m&ouml;glich. 

                  <H3>Linebacker:</H3>
                  Hier mu&szlig; man zwei F-4 eskortieren.
                  Vorsicht, die Migs greifen von hinten an. 

                  <H3>Air Pirates:</H3>
                  In dieser mission mu&szlig; man den 100sten
                  Abschu&szlig; seiner Einheit erzielen. Man fliegt
                  in einer Mig-21 gegen B-52-Bomber und Eskorte.
                  Eine Gruppe Mig-21, die gerade landen will, wird
                  von F-4E Phantoms &uuml;berrascht. Man befindet
                  sich in seiner M-21 auf der Startbahn seiner
                  Basis und mu&szlig; sich beeilen, damit keine Mig
                  abgeschossen wird. Wird auch nur eine
                  abgeschossen, ist die Mission nicht erf&uuml;llt.
                  

                  <H3>Bar Cap:</H3>
                  Mit seiner Mig-21 mu&szlig; man gegen Phantoms
                  antreten. Man kann sich anschleichen und aus
                  n&auml;chster N&auml;he schie&szlig;en. Die
                  Piloten reagieren, als h&auml;tten sie 20
                  Valium-Tabletten geschluckt. 

                  <H3>Linebacker Migcap:</H3>
                  Hier greifen Mig-21 an. Die Piloten sind gut. Ihr
                  solltet aber inzwischen ausreichend Erfahrungen
                  gesammelt haben. <BR>
                  <BR>
                   
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

