<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>COUNTDOWN</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H1 align="center">COUNTDOWN</H1>

                  <P>Die Story beginnt in einer Einzelzelle eines
                  Sanatotiums. Zuerst begutachtet man den
                  Krankenbericht am Bett. Nach einer kleinen Demo
                  nimmt Mason den Schl&uuml;ssel, der unter dem
                  Bett liegt, die Tasse vom Boden und die
                  Dr&auml;hte beim Fenster. Danach f&auml;ngt er
                  mit der Tasse das Insekt an der Wand. Jetzt
                  wartet man, bis der W&auml;chter vor der T&uuml;r
                  vorbeikommt und spricht ihn an. Im folgenden
                  Gespr&auml;ch sollte man den W&auml;chter durch
                  &Uuml;bergabe des Insekts dazu bringen, einem ein
                  Essen zu versprechen. Das Mahl schmeckt zwar
                  nicht gut, daf&uuml;r kann man aber das Messer,
                  das mitgeliefert wird, um so besser gebrauchen.
                  Mit dem Messer entfernt man das Gitter vom
                  Fenster und schon ist man frei. Zwei Fenster
                  weiter rechts betritt man das Sanatorium wieder.
                  Abspeichern ist hier das erste mal notwendig. Der
                  W&auml;chter patroulliert immer im
                  Gegenuhrzeigersinn durch die G&auml;nge. Es ist
                  deshalb angebracht, in der gleichen Richtung
                  vorzugehen. Zuerst betritt man die Vorratskammer
                  auf der gegen&uuml;berliegenden Seite des Ganges.
                  Dort beh&auml;ndigt man sich der Schere und der
                  Decke. Wenn man jetzt alle R&auml;ume einzeln
                  absucht, begegnet man schnell dem Problem,
                  da&szlig; der W&auml;chter das eigene
                  Verschwinden bemerkt und man gezwungen ist, auf
                  einen abgespeicherten Spielstand
                  zur&uuml;ckzugreifen.</P>

                  <P>Damit dies nicht passiert, begibt man sich
                  nach Verlassen der Vorratskammer direkt zum
                  gro&szlig;en Schlafsaal am oberen Ende des
                  Rundganges. Dort nimmt man sich die Puppeund den
                  Kleiderb&uuml;gel. Nachdem man wieder in die
                  eigene Zelle zur&uuml;ckgekehrt ist, legt man die
                  Puppe ins Bett und t&auml;uscht auf diese Weise
                  den W&auml;chter. Jetzt hat man beliebig viel
                  Zeit, den rundgang abzusuchen. Man kann nun
                  Leonard Spalding im Versuchsraum besuchen. Da er
                  es zu kalt hat, gibt man ihm die Decke aus dem
                  vorratsraum. Auf dem Tisch im selben Raum sollte
                  man noch die Tabelle betrachten. Danach begibt
                  man sich in den Raum von B.S. und liest zuerst
                  die Spr&uuml;che an der Wand. Das Bild kann man
                  betrachten und dann auch verschieben. Eine
                  weitere Inschrift kommt zum Vorschein. Als
                  letztes sollte man das Kopfkissen verschieben und
                  den Schl&uuml;ssel darunter an sich nehmen.
                  Dieser Stock ist damit erforscht und man benutzt
                  die Treppe nach oben. Mason betritt gleich die
                  Umkleidekabine und versucht ein Tuch zu nehmen.
                  Das funktioniert zwar nicht, aber immerhin findet
                  er einen Schl&uuml;ssel, der darunter versteckt
                  war. Mit diesem Schl&uuml;ssel l&auml;&szlig;t
                  sich der dritte Schrank von links &ouml;ffnen.
                  Die darin befindlichen Schuhe nimmt man
                  nat&uuml;rlich an sich. Auf der rechten Seite
                  findet man am Boden verschiedene Blutflecken, die
                  man untersuchen sollte. Mason erinnert sich jetzt
                  schon an einen Teil des Vorgefallenen. Im
                  obersten Stock hat er nur noch den Vorratsraum,
                  den er untersuchen kann. Auf dem Gestell findet
                  er einen Atlas, der sehr informativ ist.
                  Zus&auml;tzlich findet man in diesem Raum noch
                  ein Brecheisen, mit dem man sofort eine
                  verschlossene Kiste aufbricht. Dadurch kommt man
                  auch noch in Besitz eines Hackens. Dieses
                  Stockwerk ist jetzt auch erforscht und man begibt
                  sich zwei Etagen tiefer. Zuerst sollte man hier
                  die drei R&auml;ume auf der rechten Seite
                  durchsuchen. Man findet dabei eine Taschenlampe
                  und ein Skalpell.</P>

                  <P>Jetzt kann man den Arbeitsraum des Doktors
                  aufsuchen.Die Zeitung am Boden informiert einen
                  &uuml;ber die momentane weltpolitische Lage. Das
                  Bild an der Wand verbirgt etwas Wesentliches.
                  Damit man den gefundenen Code auch benutzen kann,
                  verschiebt man die zweith&ouml;chste
                  B&uuml;cherreihe. Nachdem man den Safe
                  ge&ouml;ffnet hat, nimmt man das Geld an sich.
                  Auf dem Tisch liegen noch einige Schl&uuml;ssel,
                  die man sp&auml;ter brauchen wird. Da der Doktor
                  auf ein normales Gespr&auml;ch nicht eingeht,
                  nimmt man das Skalpell und unterst&uuml;tzt damit
                  seine Redefreudigkeit ein bi&szlig;chen. Jetzt
                  gibt er zwar sch&ouml;n Antwort, aber das
                  GEw&uuml;nschte ist noch nicht dabei. Man setzt
                  ihn also weiter unter Druck, bis man den Namen
                  Fontaine erhalten hat.</P>

                  <P>Die Punkte steigen sofort, wenn man von der
                  Existenz dieser Person erfahren hat. Der letzte
                  Stock im Sanatorium ist der Keller. Die T&uuml;re
                  &ouml;ffnet man mit dem Schl&uuml;ssel aus
                  Barney`s Zimmer. Den Telefonkasten kann man
                  &ouml;ffnen und die Dr&auml;hte darin mit der
                  Schere zerschneiden. Jetzt braucht man nur noch
                  einen Pickel, um das Loch in der Wand zu
                  vergr&ouml;&szlig;ern. Diesen findet man unter
                  dem mittleren Kohlehaufen. Das Labyrinth
                  durchquert man entsprechend der beiliegenden
                  Karte. Man kommt danach in einen Weinkeller. Man
                  betrachtet den Toten und nimmt danach den Lumpen
                  vom Boden auf. Mit diesem Lumpen s&auml;ubert man
                  die Tafel an der hinteren Wand, damit man sie
                  betrachten kann. Mit dem Brecheisen, das man
                  immer noch bei sich f&uuml;hrt, kann man noch
                  eine Kiste &ouml;ffnen, die eine Weinflasche
                  enth&auml;lt. Dann versucht man, das
                  Weinflaschenr&auml;tsel zu l&ouml;sen. Links
                  neben dem Gestell befindet sich eine weitere
                  Kiste, die sich verschieben l&auml;&szlig;t.
                  Dahinter entdeckt man die jahreszahl 1433, die
                  das R&auml;tsel l&ouml;st:</P>

                  <P>1. Reihe - 1.Flasche<BR>
                  2. Reihe - 4.Flasche<BR>
                  3. Reihe - 3.Flasche<BR>
                  4. Reihe - 3.Flasche</P>

                  <P>Sobald man au&szlig;erhalb des Raumes ist,
                  klettert man die Wand hinauf und benutzt zuoberst
                  den Haken. Den ersten Teil beendet man, indem man
                  die Schl&uuml;ssel des Doktors benutzt und in
                  dessen Auto davonf&auml;hrt. Dem Drang nach Hause
                  folgend, bleibt man in Istanbul und durchsucht
                  die eigene Wohnung. Nachdem man den eigenen
                  Schreibtisch betrachtet hat, bekommt man wieder
                  eine kurze Demo aus dem Ged&auml;chtnis
                  vorgespielt. Die eigene Arbeit auf dem Tisch ist
                  interessant, gibt jedoch keine Punkte.</P>

                  <P>Handlungen, die belohnt werden sind: die
                  Pflanze verschieben, den Computer nehmen, das
                  Kopfkissen verschieben, den Schl&uuml;ssel
                  nehmen, die K&auml;figt&uuml;re mit dem
                  Schl&uuml;ssel &ouml;ffnen, den Keks vom Tisch
                  nehmen, ihn dem Vogel geben, den neuen
                  Schl&uuml;ssel nehmen, damit die
                  Schreibtischschublade &ouml;ffnen, die Notiz
                  lesen, die Batterie von Fernseher nehmen, den
                  Kasten &uuml;ber dem Lavabo &ouml;ffnen, die
                  Werkzeuge herausnehmen und noch den
                  K&uuml;hlschrank &ouml;ffnen. Als letztes sollte
                  man das Foto betrachten. Nachdem man dies alles
                  getan hat, w&auml;hlt man "Travel" an und besucht
                  McBain. Wenn man sehr genau hinschaut, entdeckt
                  man neben dem Tisch einen Schl&uuml;ssel. Diesen
                  braucht man, nachdem man das Schild der Statue
                  verschoben hat. Im sich &ouml;ffnenden Geheimfach
                  findet man etwas Sprengstoff und einen Schalter,
                  um den Monitor einzuschalten. Die Nachricht auf
                  dem Bildschirm zeigt uns die von
                  Terroranschl&auml;gen gef&auml;hrderten Ziele an.
                  Nun wendet man sich der rechten Seite des Zimmers
                  zu. Im Gestell findet man einen Pa&szlig;, den
                  man braucht, um das Land zu verlassen. Wenn wir
                  das Gestell auch noch verschieben, entdecken wir
                  einen Safe, f&uuml;r den wir zwei Schl&uuml;ssel
                  und einen Code brauchen. Da wir nichts davon
                  besitzen, benutzen wir einfach den Sprengstoff.
                  Die Papiere aus dem Tresor werden uns sehr bald
                  dienlich sein. Um in den Genu&szlig; einer
                  weiteren Demo zu kommen, betrachten wir das
                  kaputte Fenster. Dann nehmen wir noch die Notiz
                  vom Tisch und benutzen nun endlich den eigenen
                  Computer. Das Pa&szlig;wort dazu fanden wir in
                  der eigenen Wohnung. Man kann nun die
                  blutverschmierte Notiz analysieren und hat somit
                  eine weitere Persion, die man bald besuchen wird.
                  Zuerst w&auml;hlt man jetzt Lisa Loomis an und
                  befragt sie - vor allem &uuml;ber Jack Quinn.
                  Lisa ist fast die einzigste Person in diesem
                  Spiel, die an unsere Unschuld glaubt.</P>

                  <P>Jetzt reist man zum ersten Mal in`s Ausland,
                  und zwar zu Rachel Akure. Die Redensart "Hassle"
                  ist hier nicht so geeignet, man sollte bessser
                  freundlich sein. Wenn man sie ausfragt, gibt sie
                  leider keine Antworten. Dies &auml;ndert sich
                  jedoch, nachdem man ihr die Unterlagen aus dem
                  Tresor von McBain g egeben hat.Jetzt kann man sie
                  &uuml;ber alle Personen ausfragen, sogar
                  &uuml;ber sie selbst. Rachel hat aber noch etwas
                  anderes f&uuml;r uns, das wir nur im Tausch gegen
                  Geld (500) ausgeh&auml;ndigt bekommen. Dieser
                  vergiftete Pfeil ist der Schl&uuml;ssel zum
                  Erfolg bei unserer n&auml;chsten Person-
                  Fontaine.</P>

                  <P>Sobald man in Kairo angekommen ist, lohnt es
                  sich wieder einmal abzuspeichern. Man mu&szlig;
                  jetzt versuchen, den Pfeil von hinten auf den
                  Hitman (=Fontaine) abzufeuern. Es empfiehlt sich,
                  links unten zu warten, bis der Hitman von oben
                  kommt und nach rechts geht. Jetzt kann man ihn
                  verfolgen und mit dem Pfeil zustechen. Sobald
                  dies geschehen ist, erweist sich Fontaine als
                  ausgesprochen gespr&auml;chig und verr&auml;t uns
                  ohne weiteres die Adresse des "Black
                  December"-Hauptquartiers. Nach Athen reisen wir,
                  wie auch sonst immer, per Flugzeug. Alte
                  Folterwerkzeuge laden geradezu dazu ein, sie zu
                  benutzen. Wir entscheiden uns f&uuml;r das
                  Katakult, das zuf&auml;lligerweise gerade auf den
                  Eingang gerichtet ist.</P>

                  <P>Zuerst nehmen wir den Arm und setzten ihn auf
                  das Katapult. Dann bet&auml;tigen wir den Hebel,
                  damit wir laden k&ouml;nnen.. Jetzt
                  ben&ouml;tigen wir nur noch ein Gescho&szlig;.
                  Sobald ein W&auml;chter nach seinem Rundgang in
                  der T&uuml;re verschwindet, rennen wir nach
                  rechts und nehmen den Stein. Nachdem man wieder
                  beim Katapult angekommen ist, legt man den Stein
                  in die Abschu&szlig;vorrichtung und wartet auf
                  den W&auml;chter. Timing ist gefragt, neu starten
                  eventuell notwendig. Sobald man im innersten Teil
                  ist, sollte man sich in der linken oberen Ecke
                  verstecken und warten, bis der Aufseher wieder
                  davonl&auml;uft. Man verzieht sich nun in den
                  oberen rechten Raum mit dem Tresor. Das Sprechen
                  mit dem Gefangenen ist noch ein wenig
                  aufzuschieben. der zweite W&auml;chter wird nicht
                  erschlagen, sondern kurzerhand in die Luft
                  gesprengt. Timing ist erneut gefragt, wenn man
                  W&auml;chter und Schaltpult gleichzeitig in die
                  Luft jagen will. Der Tresor l&auml;&szlig;t sich
                  leider nicht &ouml;ffnen, nicht einmal mit
                  Sprengstoff. Man kommt jedoch zur n&auml;chsten
                  Person, indem man den Gefangenen &uuml;ber die
                  Terrororganisation ausfragt und danach das Foto
                  analysiert und die Informationen &uuml;ber Jackal
                  ausruft. Man reist also weiter nach Barcelona und
                  unterh&auml;lt sich mit Ramirez. Gegen Geld (300)
                  gibt er uns einen Ditrich, mit dem wir den Tresor
                  knacken k&ouml;nnen. Um noch mehr Informationen
                  aus ihm herauszuholen, bieten wir Ramirez Wein
                  an. Sobald er uns Auskunft gibt, fragen wir ihn
                  &uuml;ber Scorpio aus. Bevor wir jedoch nach
                  Venedig reisen, fliegen wir abermals nach Athen
                  und &ouml;ffnen den Tresor. Die Notiz kann man
                  wiederum mit dem Computer analysieren. Nun geht
                  man nach Venedig zu Scorpo`s Freundin. Den
                  Barkeeper mu&szlig; man bestechen (500), damit er
                  ein Treffen mit Desire organisiert. Danach schaut
                  man sich noch die zeitung an und begibt sich dann
                  nach rechts in den n&auml;chsten Raum. Desire
                  sitzt am ersten Tisch und gibt freiwillig
                  Auskunft. Sie will uns jedoch weismachen,
                  da&szlig; Scorpio wirklich gestorben sei. In
                  diesem Raum gibt es noch einen
                  Geldspielautomaten, an dem man sein Konto wieder
                  erh&ouml;hen kann (bis ca.5000). Jetzt braucht
                  man Gedult, denn man mu&szlig; warten, bis Desire
                  tantz und der T&uuml;rw&auml;chter an die Bar
                  geht. Sobald dies eintrifft, begibt man sich in
                  die Umkleidekabine. Dort nimmt man die Box am
                  Boden und den Schl&uuml;ssel auf der T&uuml;r.
                  Mit diesem Schl&uuml;ssel &ouml;ffnet man nun die
                  Juwelenschatulle und findet einen neuen
                  Schl&uuml;ssel, mit dem sich die rechte Schublade
                  &ouml;ffnen l&auml;&szlig;t. Darin befindet sich
                  ein Bief, der sofort analysiert wird. Dadurch
                  erh&auml;lt man den Namen "Buzz Brezhney", doch
                  braucht man auch dessen Adresse. DIe bekommt man
                  gratis vom Barkeeper. Gl&uuml;cklicherweise
                  befindet sich Buzz in Venedig, so da&szlig; man
                  gar nicht reisen mu&szlig;. Man &uuml;berredet
                  ihn die Adresse seines Freundes Scorpio
                  herauszur&uuml;cken. F&uuml;r etwas Geld gibt er
                  uns ein Gift, das man ins Essen geben kann.
                  Scorpio stellt sich als sehr freundlich heraus
                  und erz&auml;hlt uns einige Neuigkeiten, doch
                  leider gibt er uns keinen neuen Namen an, der in
                  die Story verwickelt w&auml;re. Das Spiel geht
                  aber trotzdem weiter, denn wir erhalten nach
                  diesem Gespr&auml;ch einen Brief von Lisa. Wir
                  besuchen sie sofort in Rom. Sie verweist uns an
                  unseren Freund Quinn, der f&uuml;r unsere
                  Einlieferung ins Sanatorium zust&auml;ndig
                  war.</P>

                  <P>Jetzt ben&ouml;tigt er unsere Hilfe. Wir
                  besuchen also das Koloseum, um uns mit Hakeem zu
                  treffen. Das Gespr&auml;ch kommt jedoch nicht
                  zustande: wir werden &uuml;berw&auml;ltigt und
                  gefangengenommen. Sobald der Strick, an dem wir
                  h&auml;ngen, rei&szlig;t, rennen wir nach rechts
                  und bet&auml;tigen danach den Hebel. Die
                  n&auml;chsten Schritte ben&ouml;tigen wieder ein
                  genaues Timing, denn wir &ouml;ffnen die zwei
                  T&uuml;ren, genau in dem Moment, in dem der Tiger
                  durch die untere hineinkommt. Danach
                  schlie&szlig;en wir die T&uuml;ren wieder und
                  schon ist die Raubkatze gefangen. Jetzt
                  untersuchen wir die Knochen und entdecken
                  darunter einen Haken. Mit diesem erreichen wir
                  das Fenster und k&ouml;nnen diesen
                  gef&auml;hrlichen Ort verlassen. Jetzt endlich
                  begegnen wir Hakeem.</P>

                  <P>Wir nehmen den Sack mit unseren eigenen
                  Gegenst&auml;nden, den Stab f&uuml;r die Kohlen,
                  die "Blueprints" vom Tisch und verschieben noch
                  den Sack am Boden. Die so gefundene Postkarte
                  analysieren wir mit unserem kleinen Computer. Um
                  den Raum zu verlassen, dr&uuml;cken wir auf einen
                  Stein links neben den F&uuml;&szlig;en von
                  Hakeem. Darauf erscheint ein Ausgang, den wir
                  auch benutzen. Man erh&auml;lt daraufhin wieder
                  einen Brief von Lisa. Wir reisen jedoch nach
                  Belgrad und besteigen den Zug nach Paris. Zuerst
                  lesen wir die Zeitung und das Telegramm, das wir
                  auch gleich mitnehmen. Im n&auml;chsten Wagen
                  versuchen wir alle Abteile zu inspizieren.
                  Bereits im ersten finden wir einen Toten. Bevor
                  wir das Vierte Abteil durchsuchen, bitte
                  abspeichern. Man versucht nun, Jackal durch Reden
                  dazu zu bringen, da&szlig; er den Raum
                  verl&auml;&szlig;t. Sobald dies geschehen ist,
                  mischt man das Gift unter sein Essen, &ouml;ffnet
                  das Fach links oben und nimmt die Werkzeuge an
                  sich. Jetzt verl&auml;&szlig;t man das Zimmer und
                  rennt so schnell wie m&ouml;glich nach rechts in
                  den n&auml;chsten Wagen. Fast am Ende dieses
                  Wagens befindet sich eine Kiste, die man mit dem
                  Werkzeug &ouml;ffnen kann. Daraus entfernt man
                  den Sprengstoff und geht wieder zur&uuml;ck in
                  Jackal`s Abteil. Dieser schl&auml;ft nun
                  friedlich &uuml;ber seinem Teller. Inspiziert den
                  Koffer und nehmt ihn mit. Man verkleidet sich mit
                  Jackal`s Kleidung. Die Frau, in Paris, blufft man
                  mit einem Pa&szlig;wort und gibt ihr dann den
                  Geldkoffer.</P>

                  <P>Sie bringt uns direkt zu einem Maschinenraum.
                  Wir verlassen diesen nach links, um dort ein
                  einzelnes Getriebe aufzunehmen. Dieses setzen wir
                  im Maschinenraum sofort ein und bet&auml;tigen
                  den Schalter. Jetzt hat sich der Kanal entleert
                  und wir k&ouml;nnen ihn &uuml;berqueren. An der
                  Leiter steigen wir in den n&auml;chsten Stock
                  hinauf. Die T&uuml;re nach rechts m&uuml;ssen wir
                  mit dem Sprengstoff &ouml;ffnen. Danach schieben
                  wir den Elefanten beiseite und den Stein dahinter
                  bewegen wir ebenfalls. Der Countdown l&auml;uft,
                  sobald wird die letzte SChraube des Panels
                  entfernt haben. Mit dem Schraubenzieher stellen
                  wir die farbigen Schrauben um (Blau=3 Uhr,
                  Gr&uuml;n=9 Uhr, Rot=6 Uhr). Jetzt m&uuml;ssen
                  wir nur noch die Kabel in der richtigen
                  Reihenfolge durchschneiden (Gr&uuml;n, Rot, Blau)
                  und das Spiel ist abgeschlossen !</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

