<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Diverses</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="diverses02.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="diverses04.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Diverses
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>




<H2>3. Falke Verlag k&uuml;ndigt neue AMIGA-Fachzeitschrift 'amigaOS' an</H2>
<P>
Der Falke Verlag, in dem unter anderem das Atari-Magazin "ST-Computer"
erscheint, will zur Computer '98 im November die neue AMIGA-Zeitschrift
"amigaOS" vorstellen, die in erster Linie &uuml;ber anwendungsbezogene
Applikationen auf dem Amiga berichten will. Die Erstausgabe soll 68 oder 84 
Seiten besitzen, in einer Auflage von 40.000 Exemplaren gedruckt und f&uuml;r
7,90 Mark verkauft werden.
</P><P>
Hier die Original-Bekanntmachung:
</P>
&raquo;<H3>*** amigaOS - das Fachmagazin f&uuml;r Amiga-Anwender ***</H3>
<P>
<A HREF="mailto:info@amigaos.de">info@amigaos.de</A><BR>
<A HREF="http://www.amigaos.de">http://www.amigaos.de</A>
</P><P>
Kiel/Osterr&ouml;nfeld, den 23. September 1998
</P><P>
Nach wie vor gibt es im Amiga-Bereich eine breite Anwenderbasis. Leider 
wird diese Tatsache von vielen gr&ouml;&szlig;eren Verlagen  durch die entstandene
Marktdominanz von Windows zunehmend ignoriert. Als Folge ist eine 
quantitative aber auch qualitative "Ausd&uuml;nnung" im Bereich der lesernahen
Amiga-Fachzeitschriften zu verzeichnen.
</P><P>
Um dieser Tendenz erfolgreich entgegenzuwirken, stellt der Falke-Verlag 
nach mehrmonatlicher Konzeption ein dem Leser und dem Markt gerecht 
werdendes Printmagazin vor: die amigaOS.
</P>
<H4>&Uuml;ber den Falke Verlag</H4>
<P>
Der Falke Verlag ist seit &uuml;ber 4 Jahren im Bereich der Publikation
systembezogener Computerfachzeitschriften t&auml;tig. Seit 1996 ver&ouml;ffentlichen
wir die "ST-Computer", das weltweit f&uuml;hrende Atari-Fachmagazin.
</P><P>
Bereits mit der "ST-Computer" hat der Falke Verlag beweisen k&ouml;nnen, da&szlig; er
mit einem engagierten und markttreuen Team in der Lage ist, einem sich in 
einer entscheidenden Phase befindlichen Markt positive Impulse zu geben.
Als Erg&auml;nzung zu unserem Verlagsprogramm vertreiben wir hochwertige
Anwendungssoftware f&uuml;r verschiedene Computersysteme.
</P>
<H4>&Uuml;ber die amigaOS</H4>
<P>
Erstmals auf der "Computer &acute;98" vorgestellt, versteht sich die amigaOS als
konzeptionell neue Fachzeitschrift f&uuml;r Amiga-Anwender. Obwohl wir unser
Themenangebot durch eine  Entertainment-Rubrik abrunden werden, liegt das 
Hauptgewicht in der  Berichterstattung &uuml;ber anwendungsbezogene
Applikationen auf dem Amiga. Durch objektive Recherchen berichten wir 
ebenso &uuml;ber gegenw&auml;rtige Produkte wie auch &uuml;ber Chancen und Entwicklungen
des Amigas und des Betriebssystems AmigaOS.
</P><P>
Wir verstehen den Amiga als eine den heutigen Anforderungen gen&uuml;gende Hard-
und Softwareplattform und spiegeln dieses auch in unserer Artikelauswahl 
wider.
</P>
<H4>Unsere Homepage</H4>
<P>
Unter <A HREF="http://www.amigaos.de/">www.amigaos.de</A> finden Sie unsere Internetpr&auml;senz. Diese enth&auml;lt mit
einem Online-Formular Ihre Chance, aktiv an der Gestaltung des Magazins 
teilzuhaben.
</P>
<H4>Autoren gesucht!</H4>
<P>
Zur Erg&auml;nzung unseres Redaktionsteams suchen wir freiberufliche Autoren.
Jetzt ist Ihre Chance, als freiberuflicher Autor bei der AmigaOS 
einzusteigen und damit zum Stil und Profil dieser neuen Amiga-
Fachzeitschrift aktiv beizutragen. Um sich bei uns als Autor vorzustellen, 
nutzen Sie bitte das Bewerbungsformular auf unserer Homepage.
Bedenken Sie, da&szlig; wir m&ouml;glichst schnell von Ihnen h&ouml;ren m&uuml;ssen, da die
Artikel f&uuml;r die Erstausgabe bis Mitte Oktober fertig sein m&uuml;ssen, und wir
Ihre Arbeit bis zu diesem Termin gerne integrieren m&ouml;chten!
Sollten Sie &uuml;ber keinen direkten Internet-Zugang verf&uuml;gen, schreiben Sie
bitte eine eMail an: <A HREF="mailto:jobs@amigaos.de">jobs@amigaos.de</A>
</P>
<H4>Themenvorschl&auml;ge gesucht!</H4>
<P>
Erg&auml;nzend zu unseren bisherigen Pl&auml;nen m&ouml;chten wir gerne direkt von Ihnen
Ihre Meinungen, Erwartungen und Vorschl&auml;ge zu einer neuen Amiga-Zeitschrift
h&ouml;ren.
</P><P>
Bitte benutzen Sie auch in diesem Fall unser Online-Formular unter: <A HREF="http://www.amigaos.de/">www.amigaos.de</A>
</P>
<H4>Kontaktadressen:</H4>
<P>
F&uuml;r Mitteilungen auf dem Postweg schreiben Sie bitte an:
</P><P>
AmigaOS - Redaktion<BR>
c/o Thomas Raukamp Communications<BR>
Bahnhofstra&szlig;e 28<BR>
D - 24783 Osterr&ouml;nfeld<BR>
Germany<BR>
Tel. +49(0)4331-849337<BR>
Fax: +49(0)431-27368<BR>
</P>
<H4>Die Zeit dr&auml;ngt!</H4>
<P>
F&uuml;r die endg&uuml;ltige Realisierung der AmigaOS bleibt uns nicht mehr viel
Zeit, da die Erstausgabe wie erw&auml;hnt bereits zur Computer &acute;98 Mitte
November erscheinen soll. Aus diesem Grund bitten wir besonders zuk&uuml;nftige
weitere Autoren, sich schnellstm&ouml;glich mit uns auf einem der genannten Wege
in Verbindung zu setzen.
</P><P>
Vielen Dank f&uuml;r Ihre Aufmerksamkeit. Wir sehen uns auf der Computer &acute;98
oder h&ouml;ren schon bald per eMail voneinander.
</P><P>
Ihr<BR>
Thomas Raukamp - Chefredakteur amigaOS<BR>
Ali Goukassian - Inhaber Falke Verlag&laquo;
</P>


<P ALIGN="RIGHT">
  <A HREF="diverses02.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="diverses04.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

