<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Diverses</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="diverses.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="diverses02.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Diverses
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>



<H2>1. Blittersoft und Weird Science k&uuml;ndigen 'Cerberus' an</H2>

<P>
&raquo;ZUR SOFORTIGEN VER&Ouml;FFENTLICHUNG<BR>
Kontaktadressen: <A HREF="mailto:sales@blittersoft.com">sales@blittersoft.com</A> und <A HREF="mailto:sales@weird-science.co.uk">sales@weird-science.co.uk</A>
</P><P>
24. September 1998<BR>
Blittersoft und Weird Science haben heute mitgeteilt, dass sie eine neue 
Maschine ausliefern wollen, den Cerberus.
</P><P>
Cerberus ist ist ein komplettes Multimedia-Heim-Unterhaltungssystem.
Beide Gesellschaften sehen im Cerberus haupts&auml;chlich einen Weg, der ihnen 
Zugang zur neuen DVD-Technologie bietet, dabei aber gleichzeitig in hohem 
Grad die R&uuml;ckw&auml;rts-Kompatibilit&auml;t zur bestehenden Amiga-Software aufrecht 
erh&auml;lt.
</P><P>
Auf Cerberus l&auml;uft die gesamte neue Software mit Ber&uuml;cksichtigung der neuen 
"digital convergence technology" (= Technologie zur digitalen Umwandlung). 
Es bietet ein hohes Ma&szlig; an R&uuml;ckw&auml;rts-Kompatibilit&auml;t zur existierenden 
Amiga- und Mac-Software.
</P><P>
Das System beruht auf einem PC nach Industriestandard und hat umfangreichen 
Zugang zu ernsthaften und Unterhaltungsprogrammen, die es schon gibt, und 
zum st&auml;ndigen Zustrom fantastischer neuer Programme.
</P><P>
Das integrierte Multimedia-System verwendet den Mpact2-Multimedia-Prozessor 
als Kernelement des Motherboards, das damit seine gro&szlig;e Menge an 
Eigenschaften ohne irgendwelche Zusatzkarten bietet. Cerberus kann mit 
hoher Qualit&auml;t 2D- und 3D-Grafiken, Musik, General-MIDI und DVD darstellen.
</P><P>
Das integrierte DVD-Laufwerk und eine beschleunigte Hardware-Mpeg2-
Dekodierung bieten eine in der Industrie f&uuml;hrende Qualit&auml;t f&uuml;r die DVD-
Ausgabe sowohl auf dem Monitor wie auch einem Fernseher. Dazu hat Cerberus 
einen Dolby-Digital-AC3-Ausgang f&uuml;r Systeme mit Surround-Klang.
Mit diesen Eigenschaften hat Cerberus alle Voraussetzungen, ein integraler 
Teil der heimischen Unterhaltung zu werden.
</P><P>
Cerberus ist f&auml;hig, die meisten Amiga- und Mac-Programme mit der 
eingebauten 'Software' Amiga und der optionalen 'Software' Macintosh laufen 
zu lassen. Picasso-96-Software ist Standard auf der Amiga-Seite f&uuml;r einen 
RTG-Grafik-f&auml;higen Amiga, der das meiste aus der 2D-Grafikmaschine des 
Cerberus herausholen kann. In der Zukunft wird ein 040/060-Amiga-auf-Karte 
verf&uuml;gbar sein.
</P><P>
Cerberus hat vollst&auml;ndige Internet-Unterst&uuml;tzung mit einem schnellen 56k-
Modem mit aller n&ouml;tigen Software zur Verbindung, zum Surfen und f&uuml;r den 
Austausch von E-Mails.
</P><P>
Sp&uuml;ren Sie die unglaublich hohe Qualit&auml;t des digitalen Videos, spielen Sie
die neuesten Spiele, schwelgen Sie in der Leistungsf&auml;higkeit der besten 
ernsthaften Anwendungen der Welt und bewundern Sie die Kompatibilit&auml;t des 
Cerberus mit ihrer eigenen Softwaresammlung f&uuml;r den Amiga.
</P><P>
Die Zukunft hat begonnen!
</P><P>

Weitere Informationen finden Sie bei folgenden Web-Adressen:
</P><P>
Blittersoft - <A HREF="http://209.27.18.123/">http://209.27.18.123/</A>
(Linked von <A HREF="http://www.blittersoft.com/">http://www.blittersoft.com/</A>)
</P><P>
Verbindung zu Weird Science &uuml;ber <A HREF="http://www.weird-science.co.uk/">http://www.weird-science.co.uk/</A> &laquo;
</P><P>
(Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.)
</P>


<P ALIGN="RIGHT">
  <A HREF="diverses.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="diverses02.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

