<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Forum</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="Forum02.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="Forum04.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Forum
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>




<H2>3. Reaktion auf Jens Illigens Leserbrief (von John McCain)</H2>
<P>
&raquo;Also grunds&auml;tzlich bin ich ja ebenfalls der Meinung, es sollte alles
M&ouml;gliche getan werden, um den Amiga am Leben zu erhalten, aber ich bin
nicht davon &uuml;berzeugt, dass eine solche HP (mit Forderungen wie sie Jens 
vorschl&auml;gt) wesentlich dazu beitragen k&ouml;nnte. Denn es gibt ja schon so 
einiges an Organisation wie ICOA und andere Dinge, um der schlechten 
(Informations-) Politik von AI, AInc ein wenig entgegenzuwirken. Aber was 
nutzt es uns denn, wenn wir st&uuml;ckchenweise minimalste Informationen (wie 
z.B. 5% Steigerung da und da...) bekommen??? Auf was warten wir denn alle? 
Also ich warte eigentlich auf den Tag, an dem der Hammer f&auml;llt und ein 
echter Kracher pr&auml;sentiert wird!!! Und auf nichts weniger. Da kann ich auf 
alles andere verzichten, wie z.B. die Newsseite von Amiga oder so. Die 
Leute bei Amiga sollen ruhig in ihren Labors eingeschlossen bleiben, ohne 
irgendwelchen &uuml;berfl&uuml;ssigen Kram zu berichten, bis sie eine echte Sensation 
vorweisen k&ouml;nnen. Denn erst dann werden alle Amiganten wieder sagen k&ouml;nnen, 
"Hey, Wintel-User, guck mal, was ich hier machen kann!"! Und erst dann 
werden genau diese User wieder auf AMIGA gucken, denn die interessiert 
eigentlich nur, was am Bildschirm sch&ouml;ner aussieht. Sollte dieser 
gl&uuml;ckliche Zustand denn jemals eintreten, haben AI, AInc es geschafft, 
wieder einen Fu&szlig; in die Computerbranche zu setzen. Alles andere ist zwar 
sch&ouml;n und gut, aber letzten Endes kann es o.g. "Hammereffekt" nicht 
herbeizaubern, selbst wenn alle noch existierenden Amiga-User an AI, AInc 
mailen sollten.
</P><P>
Dann noch ein letztes Wort zur vorgeschlagenen Homepage:
Ich betrachte es als eher negativ, wenn zu viele (d.h. letztendlich sogar 
die Enduser) Leute am zuk&uuml;nftigen Amiga mitwirken wollen. Meiner Meinung 
nach f&uuml;hrt dies nur zu Verwirrung. Einen solchen Computer, der alle 
Anforderungen eines jeden Einzelnen erf&uuml;llen soll, kann es &uuml;berhaupt nicht 
geben. Noch dazu unter dem Preis eines Wintel-PC!!! Nein, ich denke, diese 
eine Hauptaufgabe m&uuml;ssen einige wenige absolut PROFESSIONELLE Entwickler 
leisten (hoffentlich sitzen solche bei AI, AInc), und wer bitte sch&ouml;n will 
von sich behaupten, er sei in Sachen Amiga wirklich ABSOLUT professionell 
:)) ??
</P><P>

So, das sind meine Gedanken dazu, alles in allem sage ich immer wieder: Wir 
k&ouml;nnen eh nur warten, ob jemand Mut, Geld, Know-How und Gl&uuml;ck hat, das 
Wunder zu vollbringen, auf das wir alle warten! Alles andere verl&auml;ngert 
zwar das Leben unserer Freundin, aber es macht sie nicht unsterblich!
</P><P>

Greetings to all the amigans out there...
</P><P>
John McCain<BR>
E-Mail: <A HREF="mailto:alange@student.uni-kassel.de">alange@student.uni-kassel.de</A> &laquo;
</P>



<P ALIGN="RIGHT">
  <A HREF="Forum02.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="Forum04.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

