<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Forum</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="Forum04.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="Forum06.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Forum
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>



<H2>5. Reaktion auf Jens Illigens Leserbrief (von Jens Kaenner)</H2>
<P>
&raquo;Ich bin ganz der Meinung von Herrn Illigen. Ich bin nun schon seit vielen
Jahren &uuml;berzeugter Besitzer und Benutzer eines Amigas. Angefangen hat alles
mit einem C64, gefolgt von einem A500 bis hin zu dem A1200, den ich jetzt
benutze. Ich halte den Amiga immer noch f&uuml;r den besseren Computer. Mit
dieser Meinung stehe ich aber heutzutage allein da. Alle Freunde und
Verwandte, die ich habe, besitzen einen PC. F&uuml;r sie ist es auch
unverst&auml;ndlich, wie man noch einen Amiga benutzen kann. Obwohl sie 
tagt&auml;glich mit Programmabst&uuml;rzen (Windows) und anderen Problemen zu k&auml;mpfen 
haben.
</P><P>
Zu der Informationspolitik von Amiga, Inc. m&ouml;chte ich sagen, dass sie doch 
sehr zu w&uuml;nschen &uuml;brig l&auml;sst. Schlie&szlig;lich sind es doch die Amiga-User, die
dem Amiga die Treue halten, diejenigen, die &uuml;ber alles Neue informiert 
werden sollten. Ohne die vielen Amiga-User g&auml;be es den Amiga doch gar nicht 
mehr.
</P><P>
Deshalb finde ich es auch unverst&auml;ndlich, dass man sich bei Amiga, Inc. so
bedeckt h&auml;lt, wenn es um Neuigkeiten geht. Denn gerade die vielen Amiga-
User, die noch da sind, haben doch ein Recht darauf, umfassend &uuml;ber alles 
Neue rund um den Amiga informiert zu werden. Und so lange sich daran nichts 
&auml;ndert, werden wohl noch viele ins PC-Lager wechseln.
Abschlie&szlig;end m&ouml;chte ich sagen, dass ich dem Amiga treu bleiben werde, 
obwohl das heutzutage gar nicht so einfach ist, bei der doch geringen 
Information zum Amiga seitens Amiga, Inc. und dem sehr kleinen Angebot an 
Software. Trotzdem hoffe ich, dass bald wieder bessere Zeiten f&uuml;r den Amiga 
anbrechen.
</P><P>
Mit freundlichen Gr&uuml;&szlig;en<BR>
J. Kaenner&laquo;
</P>


<P ALIGN="RIGHT">
  <A HREF="Forum04.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="Forum06.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

