<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Forum</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="Forum01.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="Forum03.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Forum
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>



<H2>2. Reaktion auf Jens Illigens Leserbrief (von Markus Lunk)</H2>
<P>
&raquo;Ich bin mit Jens und dir v&ouml;llig einer Meinung, wir als Anwenderschaft 
m&uuml;ssen in Zukunft geballter und forciert auftreten, damit wir endlich ernst 
genommen werden. Wie hie&szlig; es fr&uuml;her doch immer, wenn jemand Neues das Wort 
in Sachen Amiga-Entwicklung hatte, und was t&ouml;nt Petro Tyschtschenko 
jedesmal: "Wir wollen wissen, was die User brauchen, damit wir nicht an 
deren Interessen vorbei entscheiden." Ich bin daf&uuml;r, dass wir eine 
Institution gr&uuml;nden, die sich um solche Belange k&uuml;mmert und aktiv daf&uuml;r 
einsetzt.
</P><P>
Nennen wir sie "ATFG - Amiga Task Force Group", eine User-
Vereinigung, die nachhaltigen Druck auf die Verantwortlichen aus&uuml;bt, um zum 
einen zu zeigen, dass wir immer noch da sind und eine starke Gemeinschaft
bilden, zum anderen aber nicht l&auml;nger gewillt sind, uns veralbern und immer
wieder mit faulen Ausreden hinhalten zu lassen. Ich finde, der Name ATFG 
klingt gut und signalisiert ein engagiertes, kompetentes und entschlossenes 
Auftreten.
</P><P>
Wir sollten den Anspruch haben, als eine Art unabh&auml;ngige Kontrollinstanz 
oder &Uuml;berwachungsgremium zu fungieren, das - anders als bislang AI -
geschlossen die Gemeinschaft der Anwender vertritt und solches von AI 
abfordert, denn der Amiga-Markt braucht ein geschlossenes und konsequentes 
Auftreten in der &Ouml;ffentlichkeit. 
</P><P>
Wir treten als Ansprechpartner f&uuml;r die gesam(mel)te Anwenderschaft in
Erscheinung und vermitteln ihre Position gegen&uuml;ber AI. AI darf nicht 
vergessen: Wenn sie uns wirklich ernst nehmen wollen, dann m&uuml;ssen sie es 
jetzt tun, solange noch Zeit daf&uuml;r ist, denn ohne uns User sind sie nichts 
und werden endg&uuml;ltig den Weg der Titanic gehen: untergehen.
</P><P>
Um dieses Vorhaben mit eigener Homepage zu realisieren, m&uuml;ssen wir
nat&uuml;rlich irgendwo Webspace organisieren. In Analogie zu Jens&acute; Vorschlag 
sollten wir versuchen, uns auf Mediaspace.net plazieren zu k&ouml;nnen. Das 
h&auml;tte den Vorteil, dass wir als Tr&auml;ger dieser Organisation auf diese wie 
auf Aakt den gleichen Zugriffsweg h&auml;tten, zumal der Bekanntheitsgrad von 
Mediaspace durch Aakt sicherlich zugenommen hat und dies durch ein solches 
Projekt erst recht der Fall w&auml;re. 
</P><P>
Vielleicht w&auml;re es also m&ouml;glich, dort eine parallele Sektion aufzubauen.
W&auml;re Mediaspace in der Lage, uns m&ouml;glichst kosteng&uuml;nstig eine eigene Domain 
www.ATFG.org aufzubauen? Wenn nicht: Wer sonst k&ouml;nnte dies tun?
</P><P>

Mit freundlichen Gr&uuml;&szlig;en
</P><P>
Markus Lunk<BR>
E-Mail: <A HREF="mailto:Markus.Lunk@SoftM-Berlin.de">Markus.Lunk@SoftM-Berlin.de</A>&laquo;
</P>



<P ALIGN="RIGHT">
  <A HREF="Forum01.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="Forum03.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

