<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="game05.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="game07.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Spieleteil
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>



<H2>6. Review: Foundation</H2>
<P>
Hier ist er endlich, der lang angek&uuml;ndigte Foundation-Test. Foundation
ist, f&uuml;r die, die es immer noch nicht wissen, ein Echtzeit-Strategiespiel.
Es vereint Elemente aus Spielen wie Die Siedler, Civilization und
MegaLoMania. Dominierend sind dabei die Elemente des Spiels "Die Siedler",
vor allem die Grafik erinnert stark an den einstigen Hit.
</P><P>
Foundation kommt, wie im AMIGA-Markt mittlerweile leider &uuml;blich, in einem
schlichten Jewelcase. Eine gedruckte Anleitung fehlt deswegen. Als
Ausgleich daf&uuml;r findet sich auf der CD-ROM eine mittelm&auml;&szlig;ige HTML-
Anleitung, die leider nur wenige Fragen beantwortet. Ein Update diese
Anleitung und viele weitere Tips und Tricks zu Foundation findet man im
Aminet und im WWW. Zu nennen ist hier wohl vor allem die Foundation-
Support-Page (URL siehe Bookmarks), auf der sich auch immer die neuesten
Patches und Updates f&uuml;r Foundation finden. Momentan befindet sich das
Update bei Version 17c. Allein daran sieht man, da&szlig; Peter Burkey,
Programmierer des Spiels sehr viel Kraft in sein Projekt legt. Zahlreiche
Bugfixes und Verbesserungen wurden durch die Updates verwirklicht. Dies
war auch deswegen n&ouml;tig, weil die Verkaufsversion von Foundation leider
einige Bugs enthielt. Dem Test liegt deswegen die aktuelle Version 1.17c
zugrunde.
</P><P>
Nach der Installation und den Einstellungen im Prefs-Men&uuml; kann man sich
ein kleines, h&uuml;bsches, aber &uuml;berfl&uuml;ssiges Intro ansehen, bevor das
Hauptmen&uuml; auf dem Bildschirm erscheint. Hier l&auml;&szlig;t sich der Spielmodus
w&auml;hlen (Eroberungsspiel oder Sonderspiel), ein alter Spielstand laden.
Weiterhin kann man diverse Einstellungen vornehmen, die Credits ansehen
oder das Spiel wieder verlassen. Da wir das aber ncht tun wollen und noch
keinen alten Spielstand haben, befassen wir uns mal mit den beiden
Spielmodi Eroberungsspiel und Sonderspiel. Das Eroberungsspiel bietet dem
Spieler die M&ouml;glichkeit, diverse Missionen zu erf&uuml;llen. Im Sonderspiel hat
kann er ausw&auml;hlen, gegen welchen Gegner, auf welcher Karte und mit welchen
Voraussetzungen und Spielzielen er antritt.
</P><P>
Das eigentliche Spielprinzip ist in beiden Spielmodi dasselbe. Der Spieler
lenkt die Geschicke eines kleinen V&ouml;lkchen, um es weiterzuentwickeln und
auszubreiten.
</P><P>
Die Grafik erinnert tats&auml;chlich sehr stark an "Die Siedler". Auf dem
gr&ouml;&szlig;ten Teil des Bildschrims findet man die Landschaft, in der das Volk
lebt. Am Anfang steht hier ein Schlo&szlig;, der das Hauptquartier darstellt.
Der Rest des Bildschirms wird durch die Steuerleiste, eine &Uuml;bersichtskarte
und eine Auflistung der vorhandenen Ressourcen gef&uuml;llt.
</P><P>
Das kleine Volk besteht aus einer Reihe von Menschen, unter denen es
Arbeiter, Magier, Soldaten, Wissenschaftler und vieles mehr gibt.
Mit Hilfe dieser kleinen Leute erkundet man nun seine Insel, beschafft
Rohstoffe, baut neue H&auml;user, bek&auml;mpft Gegner, zaubert und vieles mehr.
Ziel dabei ist, eine gute Kombination von Geb&auml;uden zu bauen, die
vorhandenen Rohstoffe zu verwalten und seine Sch&uuml;tzlinge gut zu ern&auml;hren
und bei Laune zu halten. Schafft man dies, wird man genug Kraft haben,
die verschiedenen Missionen zu erf&uuml;llen.
</P><P>
Etwas negativ an Foundation ist die Steuerung, die an einigen Ecken etwas
zu kompliziert ist. Gerade auf dem PC-Sektor gibt es Spiele, die viel
einfacher zu bedienen sind. Auch die Komplexit&auml;t des Spiels wird viele
Leute, die sich mit dem Genre nicht so gut auskennen, abschrecken. Auf
der anderen Seite wird es gerade diese Komplexit&auml;t sein, die Fans des
Genres begeistern wird. Alle Features von Foundation aufzuz&auml;hlen, w&uuml;rde
den Rahmen dieser AGPJ-Ausgabe bei weitem sprengen. Auch die Anleitung,
die sich aif der CD-ROM befindet, ist sehr d&uuml;rftig. Gerade ein solch
komplexes Spiel wie Foundation mu&szlig; man ausf&uuml;hrlicher erkl&auml;ren. Der K&auml;ufer
ist somit leider darauf angewiesen, im Internet nach Tips, Tricks und
besseren Anleitungen zu suchen, oder sich die eine oder andere Zeitschrift
zu kaufen, die Tips und Tricks anbietet.
</P><P>
Auf der positiven Seite sind vor allem die detailreiche Grafik (die ihre
volle Pracht nur auf Grafikkarten-AMIGAs entfaltet) und die Riesenmenge
an Features zu nennen.
</P><P>
Unter dem Strich ist Foundation ein sehr komplexes Spiel, das jedem Fan
des Genres, der die Zeit und Interesse hat, sich einzuarbeiten, einen
Spielspa&szlig; &uuml;ber Monate hinweg bietet. Alldiejenigen, die keinerlei
Erfahrungen mit Echtzeitstrategiespielen dieser Art haben, sollten sich
erst eine Demoversion des Spiels ansehen.
</P>
<BR><BR>
<TABLE BORDER="1" ALIGN="CENTER" WIDTH="80%">
<TR>
  <TH ALIGN="LEFT">Name:</TH>
  <TD COLSPAN="3">Foundation </TD>
</TR>
<TR>
  <TH ALIGN="LEFT">Hersteller:</TH>
  <TD COLSPAN="3">Sadeness Software, 13 Russell Terrace, Mundesley,<BR>
                 Norfolk, NR11 8LJ, UK, Tel./Fax: +44 (0) 1263 722169<BR>
                 e-mail: <A HREF="mailto:rich@sadeness.demon.co.uk">rich@sadeness.demon.co.uk</A><BR>
  </TD>
</TR>
<TR>
  <TH ALIGN="LEFT">Preis:</TH>
  <TD COLSPAN="3">79,- DM</TD>
</TR>
<TR>
  <TH ALIGN="LEFT">Datentr&auml;ger:</TH>
  <TD COLSPAN="3">1 CD-ROM</TD>
</TR>
<TR>
  <TH ALIGN="LEFT">Genre:</TH>
  <TD>Echtzeit-Strategie</TD>
  <TH ALIGN="LEFT">Spieler:</TH>
  <TD>1</TD>
</TR>
<TR>
  <TH ALIGN="LEFT">Sprache:</TH>
  <TD>deutsch, englisch</TD>
  <TH ALIGN="LEFT">Anleitung:</TH>
  <TD>englisch</TD>
</TR>
<TR>
  <TH ALIGN="LEFT">System:</TH>
  <TD COLSPAN="3">mind. AGA o. Grafikkarte, 2 MB RAM, CD-ROM-Laufwerk, HD</TD>
</TR>
<TR>
  <TH ALIGN="LEFT">Fazit:</TH>
  <TD COLSPAN="3">sehr komplexes Strategiespiel, da&szlig; viel Spa&szlig; macht, wenn man sich in das Spiel eingearbeitet hat
</TD>
</TR>
<TR>
  <TH ALIGN="LEFT">Wertung:</TH>
  <TD COLSPAN="3">


  <TABLE>
  <TR>
    <TD>Grafik:     8/10</TD>
    <TD></TD>
    <TD>Sound:      8/10</TD>
  </TR>
  <TR>
    <TD>Handhabung: 7/10 </TD>
    <TD></TD>
    <TD>Spielspa&szlig;:  9/10</TD>
  </TR>
  <TR>
    <TD COLSPAN="3">GESAMT:      81%</TD>
  </TR>
  </TABLE>
  </TD>
</TR>
</TABLE>
<BR><BR>



<P ALIGN="RIGHT">
  <A HREF="game05.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="game07.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

