<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Workshops</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="workshop.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="workshop02.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Workshops
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>



<H2>1. Workshop: Installation und Nutzung von GhostScript (von Uwe Pannecke)</H2>

<H3>&raquo;Geisterhaftes im Amiga</H3>

<H3>Im H&uuml;rdenlauf zum Erfolg mit GhostScript</H3>

<P>
GhostScript ist ein plattform&uuml;bergreifender PostScript-Interpreter, seit 
Jahren auch f&uuml;r den Amiga verf&uuml;gbar und in der Zwischenzeit bei Version 
5.10 angelangt.
</P><P>
Neben Postscript-Dokumenten kann GhostScript seit l&auml;ngerem ebenfalls PDF- 
Dateien (das von der Firma Adobe Systems Inc. entwickelte Portable Document 
Format) verarbeiten.
</P><P>
Dabei zeigt sich gegen&uuml;ber dem in der Amiga aktuell 08/98 vorgestellten 
XPDF eine h&ouml;here Flexibilit&auml;t und Kompatibilit&auml;t, aber auch h&ouml;here 
Anforderungen an die Amiga-Hardware und den Amiga-User.
</P><P>
Trotz der Leistungsf&auml;higkeit ist f&uuml;r viele User nach dem ersten Kontakt mit 
GhostScript selbiges ein rotes Tuch. Dies liegt wohl haupts&auml;chlich an einer 
fehlenden Programmoberfl&auml;che, einem intuitiv bedienbaren GUI.
Sicher, die Installation und insbesondere die Konfiguration ist ein wenig 
beschwerlich. Ohne Tipparbeit im CLI wird man kaum auskommen. Aber der Lohn 
f&uuml;r die M&uuml;he ist ein Programm, mit dem sich PostScript- und PDF-Dateien 
elegant anzeigen und ausdrucken lassen.
</P><P>
Da viele Amiga-User sicher nach dem x-ten vergeblichen Versuch, GhostScript 
korrekt zu installieren und vor allem zu nutzen, frustriert aufgegeben 
haben, soll an dieser Stelle in einer Schritt-f&uuml;r-Schritt-Anleitung die 
Installation und erfolgreiche Nutzung GhostScripts beschrieben werden.
</P><P>
Ganz bewusst werde ich die notwendigen Schritte sehr ausf&uuml;hrlich 
darstellen.
</P><P>
Der Lohn wird ein GhostScript-Erfolgserlebnis sein. Und dann bekommt 
vielleicht, so hoffe ich zumindest, GhostScript einen Stammplatz auf eurer 
Festplatte (das Programmpaket verdient es).
</P>
<H3>Erste H&uuml;rde:</H3>

<H3>Die Installation des Programmpaketes.</H3>
<P>
Ihr ben&ouml;tigt als Erstes den Installer sowie LhA im Verzeichnis C: (sollte 
eigentlich zur Standard-Ausr&uuml;stung eines jeden Amiganers geh&ouml;ren).
</P><P>
Besitzt ihr die Aminet CD 25, so seid ihr auch gleichzeitig im Besitz aller 
unbedingt notwendigen Daten.
Wenn nicht, so findet ihr im Aminet unter /text/dtp/ die notwendigen LhA- 
Files.
</P><P>
Im einzelnen ben&ouml;tigt ihr zwingend
</P><P>
GS510-data.lha,<BR>
GS510FontMap.lha,<BR>
GS510-fonts-st.lha  sowie<BR>
</P><P>
GS510_000.lha,      wenn Euer Amiga einen 68000-Prozessor beherbergt   ODER<BR>
GS510_020.lha       f&uuml;r einen 68020-Prozessor                          ODER<BR>
GS510_020fpu.lha    f&uuml;r einen 68020-Prozessor mit FPU                  ODER<BR>
GS510_040fpu.lha    f&uuml;r einen 68040/060-Prozessor mit funktionierender FPU!<BR>
<BR>
<STRONG>EC030- oder EC040-Prozessoren ben&ouml;tigen das GS510_020.lha-Paket!</STRONG>
</P><P>
Zus&auml;tzlich k&ouml;nnt ihr noch die Datei GS510-fonts-ot.lha  downloaden /
auf eure Festplatte kopieren. Sie enth&auml;lt zus&auml;tzliche Schriften. Diese sind f&uuml;r die Funktion
jedoch nicht unbedingt notwendig.
</P><P>
Au&szlig;erdem findet ihr im Paket GS510_main_src.lha einige sehr hilfreiche 
Textfiles, zwar in Englisch, aber nicht nur in Notf&auml;llen gut zu gebrauchen. 
Wenn ihr die Daten per Modem ziehen wollt, verzichtet f&uuml;rs Erste lieber auf 
diese sehr umfangreiche GS510_main_src-Datei (3,3 MB und, wie schon 
angedeutet, f&uuml;r die Programmfunktion nicht notwendig). Es sei denn, ihr
wollt der Telekom etwas Gutes tun ;-)
</P><P>
Jetzt solltet ihr aus dem Aminet oder von der Aminet CD 26 noch die Datei 
GS510_Install.lha auf eure Festplate kopieren. Dies wird euch viel Arbeit 
bei der Installation ersparen.
</P><P>
Wenn ihr alle Daten beisammen und GS510_Install.lha schon nach Work kopiert 
habt, entpackt ihr als Erstes die Datei GS510_Install.lha.
Nehmen wir an, ihr habt ausreichend Platz (mind. 4 MB f&uuml;r die 
Installationsdaten, f&uuml;r das fertig installierte GhostScript sind noch 
einmal 7 MB notwendig) auf eurer Festplatte(npartition) Work , dann &ouml;ffnet 
ihr ein Shell-Fenster und tippt Folgendes:
</P><P>
<CODE>&gt;cd Work: ENTER<BR>
&gt;lha x -r GS510_Install.lha ENTER.</CODE>
</P><P>
(Bitte die &gt; nicht mittippen, dies soll nur das Promptzeichen im Shell-
Fenster verdeutlichen.)
</P><P>
Im Shell-Fenster k&ouml;nnt ihr jetzt den Entpack-Vorgang beobachten und nach 
kurzer Zeit sollte auf Work: eine Schublade Install_Ghost vorhanden sein.
Als N&auml;chstes kopiert (NICHT entpacken!) ihr die oben genannten 
GS510xxx.lha-Pakete in die nun vorhandene Schublade Install_Ghost.
</P><P>
Leider besitzen die GhostScript-Lha-Files auf der Aminet CD 25 nicht die 
gleichen Namen wie (in aktualisierter Form) im Aminet. Deshalb wird die 
Installationsroutine in Install_Ghost nicht funktionieren.
Aber keine Panik, mit einem kleinen Trick wird es trotzdem klappen:
</P><P>
Solltet ihr die Daten von der Aminet CD 25 nehmen, m&uuml;sst ihr jetzt 
unbedingt die Dateien
</P>
<BR>
<TABLE CELLPADDING="0">
<TR><TD>GS510_data.lha     </TD><TD>&nbsp;&nbsp;in&nbsp;&nbsp;</TD><TD>GS510-data.lha,    </TD></TR>
<TR><TD>GS510fonts_ot.lha  </TD><TD>&nbsp;&nbsp;in&nbsp;&nbsp;</TD><TD>GS510-fonts-ot.lha,</TD></TR>
<TR><TD>GS510_fonts_st.lha </TD><TD>&nbsp;&nbsp;in&nbsp;&nbsp;</TD><TD>GS510-fonts-st.lha </TD></TR>
<TR><TD>GS510020.lha       </TD><TD>&nbsp;&nbsp;in&nbsp;&nbsp;</TD><TD>GS510_020.lha   (nur, wenn ihr diese Prozessor-Version installieren wollt)</TD></TR>
</TABLE>

<P>
umbenennen, ansonsten wird das Install-Skript diese Pakete nicht finden 
k&ouml;nnen und seine Arbeit abbrechen.
</P><P>
Dazu geht ihr wie folgt vor:
Wieder ins Shell-Fenster, dort tippt ihr
</P><P>
<CODE>&gt;cd Work:Install_Ghost ENTER<BR>
&gt;rename GS510_data.lha      GS510-data.lha  ENTER<BR>
&gt;rename GS510fonts_ot.lha   GS510-fonts-ot.lha  ENTER<BR>
&gt;rename GS510_fonts_st.lha  GS510-fonts-st.lha  ENTER<BR>
&gt;rename GS510020.lha        GS510_020.lha   (nur, wenn ihr diese Prozessor-Version installieren wollt)</CODE>
</P><P>
Jetzt sollte sich folgendes Bild zeigen:<BR CLEAR="ALL">
</P>
<CENTER><A HREF="img/Ghostscript_01.png"><IMG SRC="thumb/ghostscript_01.png" ALT="7378" WIDTH="94" HEIGHT="80"></A></CENTER>

<P>
Soll GhostScript sp&auml;ter auf eurer Work-Partition zu finden sein, schafft 
dem Programm jetzt seine Heimstatt und tippt
</P><P>
<CODE>&gt;makedir Work:GhostScript ENTER</CODE>
</P><P>
ein.
</P><P>
<A HREF="img/Ghostscript_02.png"><IMG SRC="thumb/ghostscript_02.png" ALT="3231" ALIGN="LEFT" VSPACE="5" HSPACE="10" WIDTH="111" HEIGHT="160"></A>

Alternativ k&ouml;nnt ihr nat&uuml;rlich auch mittels Workbench-Men&uuml; eine neue
Schublade mit dem Namen GhostScript erstellen.
Endlich d&uuml;rft ihr die Shell verlassen und &ouml;ffnet auf der Workbench die 
Install_Ghost-Schublade.
</P><P>
Dort wird nun durch einen Doppelklick auf Install_GS510_deutsch die 
eigentliche Installation gestartet.
Nachdem ihr dann innerhalb der Installation die (vorher geschaffene) 
Schublade, den passenden Prozessor sowie den Druckertreiber gew&auml;hlt habt, 
wandert GhostScript in lauff&auml;higer Form mit allen notwendigen Daten 
endg&uuml;ltig auf eure Festplatte.
Und ihr k&ouml;nnt euch den Schwei&szlig; von der Stirn wischen.
</P><BR CLEAR="ALL"><P>
Halt, da war doch noch was:
</P><P>
Sollte GhostScript bei einem PDF-File folgende Meldung ausgeben:
</P>
<PRE>
___________________________________________________________________________
Aladdin Ghostscript 5.10 (1998-1-9)
Copyright (C) 1997 Aladdin Enterprises, Menlo Park, CA.  All rights 
reserved.
This software comes with NO WARRANTY: see the file PUBLIC for details.


    **** The PDF input file uses encryption and cannot be processed.
    **** Please get and install the patch available from
    ****     http://www.ozemail.com.au/~geoffk/pdfencrypt/pdf_sec.ps

Error: /invalidfileaccess in pdfopen
GS&gt;
___________________________________________________________________________
</PRE>
<P>
dann wisst ihr ja aus dem XPDF-Nachtrag in der Amiga aktuell 09/98, was zu 
tun ist. (Ihr seht also, das regelm&auml;&szlig;ige Studium der Amiga aktuell bringt 
Euch weiter ;-) .)
</P><P>
Das PDF-File ist wohl verschl&uuml;sselt.
GhostScript beherrscht die Entschl&uuml;sselung in der aktuellen Aminet-Version
nicht. Deshalb auch die Fehlermeldung "Error: /invalidfileaccess in 
pdfopen".
</P><P>
Dies k&ouml;nnte am verwendeten Verschl&uuml;sselungsalgorithmus liegen, denn dieser 
f&auml;llt unter die US-Exportbeschr&auml;nkungen.
</P><P>
Auch hier hei&szlig;t es wieder, keine Panik!
Auf der Homepage <A TARGET="_top" HREF="http://www.ozemail.com.au/~geoffk/pdfencrypt/">http://www.ozemail.com.au/~geoffk/pdfencrypt/</A> findet ihr
die Datei "pdf_sec.ps".
Nachdem diese Datei im "data"-Verzeichnis des Ghostscript-Paketes ihren 
Platz gefunden hat, steht der Anzeige und dem Ausdruck auch dieser PDF- 
Dokumente nichts mehr im Wege.
Ein Beispiel f&uuml;r diese Art PDF-Dateien ist das Cinema4D-XL-Handbuch auf der 
Heft-CD der Amiga Plus 08/98.
</P>
<H3>Zweite H&uuml;rde:</H3>

<H3>Die GhostScript-Konfiguration.</H3>
<P>
GhostScript stellt u.a. f&uuml;r die Anzeige und Druckausgabe von Dateien 
verschiedene Devices (logische Ger&auml;te) zur Verf&uuml;gung. Je nach Bedarf 
m&uuml;sstet ihr nun &uuml;ber das CLI die passenden Kommandos an GhostScript 
schicken. Bevor euch jetzt die Haare zu Berge stehen, sei gesagt, dass euch 
hier Manfred Tremmel (der Programm-Autor von Install_Ghost) viel Arbeit
abgenommen hat.
</P><P>
<A HREF="img/Ghostscript_03.png"><IMG SRC="thumb/ghostscript_03.png" ALT="5343" ALIGN="RIGHT" VSPACE="5" HSPACE="10" WIDTH="115" HEIGHT="75"></A>

Nach einem Doppelklick auf die GhostScript-Schublade seht ihr einige Icons,
die eine einfache und (nicht nur f&uuml;r erste Versuche) oft ausreichende 
Bedienung erm&ouml;glichen.
</P><P>
<A HREF="img/Ghostscript_04.png"><IMG SRC="thumb/ghostscript_04.png" ALT="26K" ALIGN="LEFT" VSPACE="5" HSPACE="10" WIDTH="100" HEIGHT="75"></A>

"GhostView" erm&ouml;glicht die Anzeige der PS-/PDF-Datei in einem Fenster auf 
der Workbench, "GhostViewScreen" selbiges auf einem eigenen Bildschirm.
Probiert die Icons einfach aus. Mit einem Doppelklick &ouml;ffnet sich nach 
kurzer Zeit ein Dateirequester und ihr k&ouml;nnt die gew&uuml;nschte Datei 
ausw&auml;hlen.
</P><BR CLEAR="ALL"><P>
Je nach Prozessor k&ouml;nnt ihr nun nach mehr oder weniger kurzer Zeit mit 
erfreutem "Ah" und "Oh" die erste PS-, EPSF- oder PDF-Datei betrachten. :-)
</P><P>
Etwas problematischer ist der Ausdruck von PS- und PDF-Dokumenten.
</P><P>
<A HREF="img/Ghostscript_05.png"><IMG SRC="thumb/ghostscript_05.png" ALT="4458" ALIGN="RIGHT" WIDTH="125" HEIGHT="70"></A>

Sollte in der Installation kein passender Drucker zur Auswahl gestanden 
haben, w&auml;hlt "GhostScript mit Workbench-Druckertreiber".

</P><P>
Solltet ihr dies nicht getan haben, oder der gew&auml;hlte Druckertreiber 
(scheinbar) doch nicht mit eurem Drucker zusammenarbeiten:
Vielleicht kein Problem, denn ihr findet in der "Install_Ghost"-Schublade 
eine weitere, mit "GSZusatz" bezeichnete. Dort sind alle verf&uuml;gbaren 
Skripte zur passenden Wahl von Anzeige und Drucker gespeichert.
</P><P>
<A HREF="img/Ghostscript_06.png"><IMG SRC="thumb/ghostscript_06.png" ALT="8010" ALIGN="LEFT" VSPACE="5" HSPACE="10" WIDTH="187" HEIGHT="72"></A>

Nun k&ouml;nnt ihr auch nachtr&auml;glich noch ein passendes Druckerskript ausw&auml;hlen 
und in die "GhostScript"-Schublade kopieren.
Im Zweifelsfall probiert bitte "GhostScript_PrefPrinter" aus. Hierbei 
schickt GhostScript die zu druckende Datei an den voreingestellten 
Workbench-Druckertreiber. Dieser wird dann entsprechend seiner 
Konfiguration (die ihr irgendwann selbst &uuml;ber die Workbench festgelegt
habt) die Datei dann drucken.
</P><P>
Sollte auch nach einem Doppelklick auf das Icon "GhostScript_PrefPrinter" 
kein Ausdruck erfolgen, hier ein (etwas m&uuml;hseligerer) Weg zum Ziel:
</P><P>
Da ich einen Canon BJC 620 besitze, war f&uuml;r mich GhostPrint_BJC600 das 
passende Script.
</P><P>
Leider funktionierte der Ausdruck nicht. GhostScript brach mit einer 
Fehlermeldung ab. Das Skript ist wohl fehlerhaft. Ich musste also selbst 
Hand anlegen.
</P><P>
Sollte es euch auch so gehen, dann bleibt immer noch der Weg &uuml;ber das CLI. 
&Ouml;ffnet eine Shell, und dann wieder 'rein ins Vergn&uuml;gen.
Ich stelle die Druckkonfiguration am Beispiel eines Canon BJC-Druckers dar:
</P><P>
Nehmen wir an, GhostScript soll die auf der Festplattenpartition Work 
befindliche Datei "Beispiel.ps" ausdrucken.
Dazu sind folgende Eingaben notwendig:
</P><P>
<CODE>&gt;cd GhostScript: ENTER<BR>
&gt;SetEnv GS_LIB data ENTER<BR>
&gt;Stack 32768 ENTER<BR>
&gt;gs -sDEVICE=bjc600 -sOutputFile=par: -r180x180 -sPAPERSIZE=a4 Work:Beispiel.ps ENTER<BR></CODE>
</P><P>
ODER
</P><P>
<CODE>&gt;gs -sDEVICE=bjc600 -sOutputFile=par: -r180x180 -sPAPERSIZE=a4 'RequestFile PATTERN "(#?.ps|#?.pdf)"' ENTER</CODE>
</P><P>
Die ersten drei Zeilen sorgen daf&uuml;r, dass wir im Verzeichnis GhostScript 
sind, eine Umgebungsvariable gesetzt sowie Stack-Speicher f&uuml;r GhostScript 
reserviert wird.
Die letzte Zeile will ich n&auml;her erl&auml;utern:
</P>

<TABLE>
<TR>
  <TD>"gs"</TD>
  <TD>ruft GhostScript auf :-)</TD>
</TR>
<TR>
  <TD VALIGN="TOP">"-sDevice=bjc600"</TD>
  <TD>
    teilt GhostScript mit, es ist das Device bjcC600 (das
    logische Ger&auml;t Drucker BJC600) zu verwenden, hier kann
    anstelle "bjc600" jedes andere vorhandene (!) Device
    angegeben werden.<BR><BR>
    An Drucker-Devices stehen u.a.

    <TABLE>
    <TR><TD>amige_printer       </TD><TD>der &uuml;ber die Workbench eingestellte Drucker,    </TD></TR>
    <TR><TD>cdeskjet, deskjet   </TD><TD>Hewlett Packard,                                </TD></TR>
    <TR><TD>laserjet,           </TD><TD>Hewlett Packard,                                </TD></TR>
    <TR><TD>epson,epsonc,stcolor</TD><TD>Epson (9-, 24-Nadel, StylusColor) zur Verf&uuml;gung.</TD></TR>
    </TABLE> 
    <BR>
       
    Um die unterst&uuml;tzten Devices herauszufinden, hilft neben
    dem Studium der Anleitung folgende Eingabe unter
    GhostScript: &gt;devicenames ==
    <CENTER><A HREF="img/Ghostscript_07.png"><IMG SRC="thumb/ghostscript_07.png" ALT="10266" VSPACE="5" HSPACE="10" WIDTH="199" HEIGHT="60"></A></CENTER>


  </TD>
</TR>
</TABLE>
                  


<TABLE>
<TR><TD VALIGN="TOP">"-sOutputFile=par:"</TD><TD>es wird festgelegt, wohin die Datei geschickt werden soll, hier par:, d.h. die parallele Schnittstelle,</TD></TR>
<TR><TD VALIGN="TOP">"-r180x180"</TD><TD>die Druckeraufl&ouml;sung, andere Aufl&ouml;sungen sind je nach Drucker z.B. 360x360, 720x720,</TD></TR>
<TR><TD VALIGN="TOP">"-PAPERSIZE=a4"</TD><TD>die zu bedruckende Papiergr&ouml;&szlig;e, hier a4, viele weitere Papiergr&ouml;&szlig;en sind m&ouml;glich, z.B. a0, a3, a5, a6, a7,..., b0, b1,..., legal,...</TD></TR>
<TR><TD VALIGN="TOP">"Work:Beispiel.ps"</TD><TD>die zu druckende Datei mit Pfadangabe,</TD></TR>
</TABLE>

<P>
ODER
</P><P>

<TABLE>
<TR>
  <TD VALIGN="TOP">"'RequestFile&nbsp;PATTERN&nbsp;"(#?.ps|#?.pdf)"'"</TD>
  <TD>&ouml;ffnet einen Dateiauswahlrequester und gibt als Dateiendung .ps und .pdf vor, d.h. es werden nur Dateien mit den vorgegebenen Endungen angezeigt.</TD>
</TR>
</TABLE>


<BR>
<P>
Mit diesen Angaben sollte es euch m&ouml;glich sein, f&uuml;r den eigenen Drucker die 
passende Kommandofolge zusammenzustellen.
</P><P>
Macht GhostScript dann, was ihr wollt, startet einen Texteditor, &ouml;ffnet 
eines der vorhanden Druckerskripte und passt dieses an eure Bed&uuml;rfnisse an. 
Speichert es unter neuem Namen, verpasst ihm ein Icon, in dem IconX
als Standardprogramm angegeben ist, und schon k&ouml;nnt ihr jede noch zu 
druckende Datei mit einem Doppelklick auf das von euch geschaffene 
Druckerskript auf Papier bannen.
</P><P>
Ein Beispiel daf&uuml;r seht ihr im folgenden Screenshot.<BR>
<A HREF="img/Ghostscript_08.png"><IMG SRC="thumb/ghostscript_08.png" ALT="9622" VSPACE="5" HSPACE="10" WIDTH="199" HEIGHT="88"></A>
</P><BR CLEAR="ALL"><P>
Hier noch einmal das Skript:
</P>
<PRE>
____________________________________________________________
__________________________________________________
.key FILE
.bra [
.ket ]

SetEnv GS_LIB data
Stack 32768 &lt;&gt;NIL:

IF [FILE]
        gs -sDEVICE=bjc600 -sOutputFile=par: -r180x180 -sPAPERSIZE=a4 
[FILE] &lt;&gt;NIL:
Else
        gs -sDEVICE=bjc600 -sOutputFile=par: -r180x180 -sPAPERSIZE=a4 
`RequestFile PATTERN "(#?.ps|#?.pdf)"` &lt;&gt;NIL:
ENDIF
_____________________________________________________________
_________________________________________________
</PRE><P>
Ihr braucht nur das Drucker-Device, die Druckaufl&ouml;sung und die gew&uuml;nschte 
Papiergr&ouml;&szlig;e euren Gegebenheiten anzupassen.
Dann wird GhostScript alle Seiten des entsprechenden Dokuments ausdrucken.
</P><P>
Viele weitere Details f&uuml;r eine optimale Nutzung des Programms findet ihr 
u.a. in den Dateien "use.txt" und "new-user.txt" im Paket 
GS510_main_src.lha. Die Texte sind zwar in Englisch gehalten, aber viele 
Beispiele erleichtern das Verst&auml;ndnis.
</P><P>

Ist die Installation und Konfiguration zu eurer Zufriedenheit verlaufen, 
k&ouml;nnt ihr jetzt das nicht mehr ben&ouml;tigte Install_Ghost-Verzeichnis l&ouml;schen 
und so etwas Platz auf eurer Festplatte schaffen.
</P><P>

Viel Spa&szlig; mit GhostScript!
</P><P>

Uwe Pannecke<BR>
<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&laquo;
</P>



<P ALIGN="RIGHT">
  <A HREF="workshop.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="workshop02.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

