<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
<TITLE>Workshops</TITLE>

  <META NAME="description" CONTENT="Amiga Aktuell">
  <META NAME="keywords"    CONTENT="Amiga">
  <META NAME="author"      CONTENT="Stephan Manske">
  <META NAME="generator"   CONTENT="WWW publishing extensions for GoldED and with hsc">

</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" CELLSPACING="0">
  <TR>
    <TD BGCOLOR="#000000">
      <A HREF="workshop01.html"><IMG SRC="../menu/links.gif" ALT="zurück" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <A HREF="workshop03.html"><IMG SRC="../menu/rechts.gif" ALT="weiter" BORDER="0" WIDTH="15" HEIGHT="15"></A>
      <FONT COLOR="#FFFFFF">
        Workshops
      </FONT>
    </TD>
  </TR>
</TABLE>

<BR>



<H2>2. Update: So senkt ihr eure Telekom-Rechnung!</H2>
<P>
Und schon wieder hat sich etwas ge&auml;ndert: Viag Interkom bietet nun 
ebenfalls den Call-by-Call-Dienst an, und wird somit ab sofort in AMIGA 
aktuell ber&uuml;cksichtigt. Da der Standard-Tarif von Viag nicht wie bei 
anderen Unternehmen werktags ab 9 Uhr gilt, sondern bereits ab 8 Uhr, 
musste die Festnetz-Tabelle um eine weitere Zeile erg&auml;nzt werden.
</P><P>
Dagegen war bei der Mobilfunk-Tabelle eine Vereinfachung m&ouml;glich, bewirkt 
durch eine Tarifsenkung bei Viatel.
</P><P>

Bevor wir aber zu den aktualisierten Tabellen kommen, zun&auml;chst ein Hinweis 
von Alexander Untergasser:
</P><P>
&raquo;Zu der Telefongeb&uuml;hren-&Uuml;bersicht ein Tip: F&uuml;r kurze Netcalls (ZConnect, 
Fido...) lohnt es sich unter Umst&auml;nden, sogar im Ortstarif auf einen 
Anbieter, der sekundengenau ohne Verbindungsgeb&uuml;hr (z.B. TelDaFax, Tele2) 
abrechnet, auszuweichen. Beispiel: Ein durchschnittlicher ZConnect-Netcall 
im Ortstarif dauert bei mir per ISDN 12 Sekunden. Das kostet bei der 
Telekom pauschal 12 Pfennig, via TelDaFax tags&uuml;ber 4,8 Pfennig. Bei bis zu 
4 Netcalls am Tag spart man sich im Jahr ca. 80 Mark. Die kann man 
sinnvoller verwenden, als sie der Telekom zu schenken. :)&laquo;
</P><P>

Hier nun die aktualisierten Tabellen (alle Angaben ohne Gew&auml;hr):
</P><P>
G&uuml;nstigster Anbieter f&uuml;r Verbindungen innerhalb des Festnetzes:
</P>
<BR>

<TABLE ALIGN="CENTER" BORDER="1" CELLPADDING="5">
<TR>
  <TH>Tag, Uhrzeit</TH>
  <TH>Bis 50 km Entfernung</TH>
  <TH>Ab 50 km Entfernung</TH>
</TR>
<TR><TD>Mo-Fr, 05.00-08.00</TD><TD>Arcor (01070), 11 Pfg.&sup1; </TD><TD>TelDaFax (01030), 14 Pfg.</TD></TR>
<TR><TD>Mo-Fr, 08.00-09.00</TD><TD>Arcor (01070), 11 Pfg.&sup3; </TD><TD>TelDaFax (01030), 14 Pfg.</TD></TR>
<TR><TD>Mo-Fr, 09.00-18.00</TD><TD>Arcor (01070), 15 Pfg.  </TD><TD>Mobilcom (01019), 19 Pfg.</TD></TR>
<TR><TD>Mo-Fr, 18.00-21.00</TD><TD>Arcor (01070), 11 Pfg.&sup1; </TD><TD>TelDaFax (01030), 14 Pfg.</TD></TR>
<TR><TD>Mo-Fr, 21.00-02.00</TD><TD>Arcor (01070), 7,5 Pfg.&sup2;</TD><TD>TelDaFax (01030), 14 Pfg.</TD></TR>
<TR><TD>Mo-Fr, 02.00-05.00</TD><TD>Deutsche Telekom, 6 Pfg.</TD><TD> Deutsche Telekom, 6 Pfg.</TD></TR>
<TR><TD>                  </TD><TD>                        </TD><TD>                         </TD></TR>
<TR><TD>Sa/So, 05.00-21.00</TD><TD>Arcor (01070), 11 Pfg.&sup1; </TD><TD>TelDaFax (01030), 14 Pfg.</TD></TR>
<TR><TD>Sa/So, 21.00-05.00</TD><TD>Arcor (01070), 7,5 Pfg.&sup2;</TD><TD>TelDaFax (01030), 14 Pfg.</TD></TR>
</TABLE>


<DL>
  <DT>&sup1;:</DT>
  <DD>Bei Verbindungen von bis zu 6 Minuten Dauer ist auf Grund der Arcor-Verbindungsgeb&uuml;hr (s.u.) Viag Interkom (01090), 12 Pfg., g&uuml;nstiger.</DD>
  <DT>&sup2;:</DT>
  <DD>Bei Verbindungen von bis zu etwa 1,5 Minuten Dauer ist auf Grund der Arcor-Verbindungsgeb&uuml;hr (s.u.) Viag Interkom (01090), 12 Pfg., g&uuml;nstiger.</DD>
  <DT>&sup3;:</DT>
  <DD>Bei Verbindungen von bis zu 2 Minuten Dauer ist auf Grund der Arcor-Verbindungsgeb&uuml;hr (s.u.) TelDaFax (01030), 14 Pfg., g&uuml;nstiger.</DD>
</DL>

     
     
     

<P>
(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 55,9 Pfg.!)
</P><P>

G&uuml;nstigster Anbieter f&uuml;r Verbindungen vom Festnetz in ein Mobilfunknetz:
</P>

<BR>
<TABLE ALIGN="CENTER" BORDER="1" CELLPADDING="5">
<TR><TH>Tag, Uhrzeit</TH><TH>gilt f&uuml;r alle Mobilfunknetze (0161x, 017x)</TH></TR>
<TR><TD>Mo-Fr, 09.00-18.00</TD><TD>Viatel (01079), 73 Pfg.</TD></TR>
<TR><TD>Mo-Fr, 18.00-09.00</TD><TD>Viatel (01079), 36 Pfg.</TD></TR>
<TR><TD>                  </TD><TD>                       </TD></TR>
<TR><TD>Sa/So, 00.00-24.00</TD><TD>Viatel (01079), 36 Pfg.</TD></TR>
</TABLE>

  <BR>

<P>
(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 137 Pfg.!)
</P><P>

Die Tabellen sollten im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:
</P>
<UL>
  <LI>
    Angegeben ist jeweils der f&uuml;r 1 Gespr&auml;chs- / Onlineminute f&auml;llig
    werdende Betrag.
    <BR><BR>
  </LI><LI>
    An Feiertagen gilt der Samstag/Sonntag-Tarif.
    <BR><BR>
  </LI><LI>
    Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein
    Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften
    g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei
    Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
    Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr
    &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte
    es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen
    Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom
    - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.
    <BR><BR>
  </LI><LI>
    Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,
    jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass
    sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im
    Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen
    l&auml;sst. Mein Favorit: http://www.teltarif.de/db/index.html
  </LI>
</UL>

<P>
Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:
</P>
<UL>
  <LI>
    TelDafax und Viag Interkom rechnen sekundengenau ab, d.h. ihr zahlt hier
    wirklich nur f&uuml;r die Zeit, die das Gespr&auml;ch / die Online-Sitzung dauert.
    <BR><BR>
  </LI><LI>
    Dasselbe gilt im Prinzip auch f&uuml;r Arcor, blo&szlig; berechnet das Unternehmen
    pro Gespr&auml;ch zus&auml;tzlich eine Verbindungsgeb&uuml;hr von 6 Pfg.
    <BR><BR>
  </LI><LI>
    Viatel berechnet bei Gespr&auml;chen bis 30 Sekunden Dauer die gesamten 30
    Sekunden, danach wird exakt abgerechnet.
    <BR><BR>
  </LI><LI>
    Mobilcom rechnet minuten(un)genau ab, d.h. auch wenn das Gespr&auml;ch nur 5
    Sekunden dauert, zahlt ihr 19 Pfg.
  </LI>
</UL>

<P>
F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.
</P>



<P ALIGN="RIGHT">
  <A HREF="workshop01.html"><IMG SRC="../menu/pfeil_links.gif" ALT="zurück" BORDER="0" WIDTH="20" HEIGHT="20"></A>
  <A HREF="workshop03.html"><IMG SRC="../menu/pfeil_rechts.gif" ALT="weiter" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>


</BODY>

</HTML>

