<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x06 - Quake</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x008C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x008B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x008D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x008A.html">Soliton</A> | <A HREF="0x008B.html">Hexamine</A> | <A HREF="0x008C.html">Quake</A> | <A HREF="0x008D.html">Quake (Forts.)</A> | <A HREF="0x008E.html">Street Racer</A> | <A HREF="0x008F.html">T.S.o.t.T.M.</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0081.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0082.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0083.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0084.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0085.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0086.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0089.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x008A.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0090.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0091.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0092.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Quake - Frag'em all...</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Es gab viele Spiele, die neue Ma&szlig;st&auml;be in
Sachen Pr&auml;sentation und technischer Ausf&uuml;hrung setzten, von der
Zeit der Home-Computer bis heute: Elite, F-16 Falcon, Wing Commander,
Wolfenstein 3D und Doom. Danach begann der &quot;3D-Wahn&quot; schlechthin,
hunderte von Clones mit zahlreichen Verbesserungen erschienen, und so ging
es bis zum Jahre 1996. Das Jahr, in dem der bis dato mystischste und
technisch am weitesten fortgeschrittene 3D-Shooter erschien: Quake.
</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das Spiel, das mehr als die H&auml;lfte aller PC-User dieser Welt zum
H&auml;ndler laufen lie&szlig;, um eine neue Grafikkarte oder einen
besseren Prozessor zu erbetteln. Das Spiel, das einem eine G&auml;nsehaut
und eiskalte Schauer &uuml;ber den R&uuml;cken jagen kann, wie es
&quot;Elvira&quot; wohl nie geschafft h&auml;tte. Das Spiel, das mit
(Sound-) Effekten aufwarten kann, die einen geradewegs aus den Sessel heben
und die Realit&auml;t vergessen lassen. Das Spiel, das zur weltweiten
Bildung und massiven Verbreitung von Quake-Clans, Quake-Servern und
Quake-Homepages gef&uuml;hrt hat. Das wohl meistdiskutierte und bekannteste
Spiel aller Zeiten, der ultimativste Benchmark, der interaktivste
Bildschirmschoner - die Rede ist noch immer von Quake.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Nun ist die Zeit gekommen - Quake Amiga ist erschienen. Zum Test stand
uns einerseits die Version 1.08 zur Verf&uuml;gung, sowie die inoffizielle
PPC-Version 1.02. Eines mu&szlig; jedoch ganz am Anfang gesagt werden:
Ohne ausreichend schnellem Prozessor ist Quake leider unspielbar. Die CD
kommt im mattschwarzen FOC (fold out cover) daher, sowohl Verpackung, als
auch CD sehen extrem edel aus. Weiters befindet sich noch die Anleitung in
Form eines edlen (und zu einem Poster aufklappbaren) hochgl&auml;nzenden
Booklets in der H&uuml;lle. Darin sind Monster, Fallen und das Spiel an
sich beschrieben, eine kurze Vorgeschichte, Tips und so weiter.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die Installation</B></H3>&nbsp;

<BR>Man lege die CD ins CD-Laufwerk und klicke zweimal auf Install, gebe
danach zweimal seine Registriernummer und seinen Namen ein - fertig. Ein
Doppelklick auf das Quake-Icon und es kann losgehen. Das Programm kann
&uuml;ber Workbench oder CLI gestartet werden, weiters befinden sich ein
paar zus&auml;tzliche Icons mit anderen Startoptionen in der
Quake-Schublade (Shell-Aufrufe, die durch IconX gestartet werden). Quake
ben&ouml;tigt 60MB auf der Harddisk und vern&uuml;nftig spielen kann man es
bereits mit 16MB RAM (mindestens 8MB). Es gibt keinerlei Kollisionen mit
Commodities, das Spiel l&auml;uft fein im Multitasking und ist kein
einziges Mal abgest&uuml;rzt, also absolut sauber programmiert. ClickBOOM
hat einmal mehr bewiesen, da&szlig; sie im Amiga Spielesektor unangefochten
an der Spitze liegen.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Das Spiel</B></H3>&nbsp;

<BR>Die gute Nachricht zuerst: Alle Features der PC-Version wurden
eins zu eins &uuml;bernommen, es gibt nirgends auch nur die geringsten
Abstriche. Die noch bessere Nachricht: Zus&auml;tzlich kann man am Amiga
den Sound (statt vom Quake Player) durch AHI-Routinen oder die Paula
abspielen, Screenmodes bis zum &quot;geht nicht mehr&quot; einstellen,
einschlie&szlig;lich der Darstellung eines stufenlos
vergr&ouml;&szlig;erbaren Windows auf der Workbench. Anstatt durch die
elends komplizierten Quake-Men&uuml;s zu stolpern, bequem
(zus&auml;tzlich!) alle Optionen &uuml;ber die gewohnten
Intuition-Men&uuml;s erreichen, und vieles mehr. Allerdings sollte man
schon einen schnellen Prozessor (Motorola MC68060, 50MHz oder 66MHz) sein
eigen nennen, sonst macht das Spiel wenig Spa&szlig;.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=160 HEIGHT=96 SRC="../images_06/quake00tn.gif" ALT="[Z&auml;hne fletschen]"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=160>
<TR><TD ALIGN=LEFT BGCOLOR="#FFFFFF"><FONT SIZE="-1" COLOR="#000000">
&quot;Roarrrrr!&quot;
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Nachdem alle Settings nach pers&ouml;nlichem Belieben eingestellt
worden sind, geht es los: Wir befinden uns in Necropolis und alles ist
d&uuml;ster, unheimliche Musik (CDDA Soundtrack von Nine Inch Nails) macht
das Stimmungsbild, das vor allem von den gewaltigen Grafiken geschaffen
wird, perfekt. &Uuml;berall sind R&auml;tsel versteckt, aber es ist nicht
so, da&szlig; man jetzt alle W&auml;nde abgrasen mu&szlig;, um sie alle zu
entdecken. Wer klug ist und aufmerksam durch die Hallen rennt, der
sp&uuml;rt diese &quot;Secrets&quot; durch Intuition auf, nicht durch
hirnloses Herumprobieren. &Uuml;berhaupt ist das Spiel von der Steuerung
her ein Traum. Es gibt auch keine Taste f&uuml;r &quot;Use&quot; mehr.
Steht man direkt vor einer T&uuml;r, geht sie auf, rennt man einen
Schalter an, wird er bet&auml;tigt, usw. Man kann mit der Maus z.B. frei
herumblicken, w&auml;hrend man die Bewegung mit den Feuertasten steuert,
oder nat&uuml;rlich seine eigenen Keyfunctions einstellen. Alle Optionen
werden bei Verlassen des Spiels automatisch abgespeichert.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die Konsole</B></H3>&nbsp;

<BR>Durch Dr&uuml;cken der Taste &quot;~&quot; (Tilde) gelangt man in die
Konsole, von wo man das gesamte Spiel und dessen Settings einstellen kann.
(Nat&uuml;rlich kann man auch alles bequem per Men&uuml; einstellen, wir
Amiganer haben sogar noch zus&auml;tzlich die M&ouml;glichkeit, die
Intuition-Men&uuml;s zu benutzen.) Wie in der Shell gibt es auch hier eine
History (CsrUp / Down), man kann vorbeigescrollten Inhalt mit PgUp / PgDown
scrollen, bestimmte Ereignisse an Tasten(kombinationen) binden, den
Speicher flushen, Optionen einstellen, Men&uuml;s aufrufen - eine
praktische Sache. Die Aufz&auml;hlung aller Console Kommandos lasse ich
lieber bleiben, daf&uuml;r gibt's eine kurze Liste aller Amiga-only Console
Kommandos<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=MIDDLE ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> host_maxframetime <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> menu_sound<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> menu_about<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> _config_com_device<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> _config_com_unit  <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> aga_type          <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> cgx8_type         <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> cgx16_type        <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> wincgx8_type      <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> wincgx16_type     <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> winaga_type       <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> winwidth          <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> winheight         <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> winsize           <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> nomenufade        <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> pixelmode         <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> diffusion         <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> palchange         <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> r_pri             <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> smd_mode          <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> snd_freq          <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> snd_balance       <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> snd_swapchannels  <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> snd_pri           <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> ahi_surround      <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> analog_joystick	  <BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> analog_jinvert    <BR>
</TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Weiter geht es...</B></H3>&nbsp;

<BR>Ein Lift f&uuml;hrt uns schlie&szlig;lich nach unten, wo ein
W&auml;chter uns gleich seinen Rottweiler auf den Hals hetzt. Wir gehen
&uuml;ber eine Br&uuml;cke, springen ins Wasser und waten herum.
Schlie&szlig;lich entscheiden wir uns doch zu einem Tauchgang, sehen alles
ganz verschwommen, Luftblasen steigen auf... - unser Atem wird knapp.
Sp&auml;ter begegnen uns schon die ersten fliegenden Gerippe und Zombies,
Orks mit Kettens&auml;gen (der Sound von den Dingern klingt sooo
derma&szlig;en echt - einfach genial!), eiserne Ritter mit Bih&auml;ndern,
und viele andere b&ouml;se Kreaturen. Den Zombies kann man mit der Shotgun
zwar beikommen, aber nach einiger Zeit stehen sie wackelnd wieder auf und
wanken halb verwest, grinsend, auf den Spieler zu. Nur durch gezielte
Explosionen mit dem Raketenwerfer kann man ihnen garaus machen. Die Gegner
werden dadurch so richtig grauslich in ihre Einzelteile zerlegt, die dann
mitsamt dem Blut, das kr&auml;ftig spritzt, manchmal fast schon meterhoch
durch die Luft wirbeln, um schlie&szlig;lich irgendwo liegenzubleiben.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=160 HEIGHT=96 SRC="../images_06/quake01tn.gif" ALT="[]"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=160>
<TR><TD ALIGN=LEFT BGCOLOR="#FFFFFF"><FONT SIZE="-1" COLOR="#000000">
Irgendwie lassen die Leute in Quake nicht so recht mit sich reden...
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Die Ritter schwingen ihre Schwerter, man sieht sie richtig ausholen,
mit aller Kraft, alle Animationen sind so detailgetreu, alles gehorcht
streng physikalischen Gesetzen. Man kann Granaten an der Wand geschickt im
richtigen Winkel abprallen lassen, um den Gegner hinter der Ecke zu
vernichten, manche Gegner vernichten sich auch selber. &Uuml;berall
h&auml;ngen Fackeln, sind G&auml;nge, Winkel, Licht und Schatten, Wasser,
Lava, S&auml;ure, Lifte, Plattformen, Stufen, Portale, die Abwechslung ist
gro&szlig;. Und schlie&szlig;lich gibt es noch eine Menge Fallen,
Plattformen, die einen erdr&uuml;cken, von Sensoren gesteuerte Fallen,
Splitter, die aus Mauerl&ouml;chern sausen, und vieles mehr. Im Vergleich
zu Doom, wo ich dem Einspielermodus gerade mal ein G&auml;hnen und die
langweiligsten 5 Minuten meines Lebens abgewinnen konnte, macht das
Solo-Abenteuer in Quake richtig Spa&szlig;, vor allem weil es manchmal
richtig unheimlich wird (bei den Soldaten und Monstern aus Doom konnte man
ja nur lachen).<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=160 HEIGHT=96 SRC="../images_06/quake02tn.gif" ALT="[]"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=160>
<TR><TD ALIGN=LEFT BGCOLOR="#FFFFFF"><FONT SIZE="-1" COLOR="#000000">
&quot;Entschuldigung, mein Herr, aber DAS ist eine Kanone!&quot;
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Ein weiterer wesentlicher Unterschied zu Doom ist die Tatsache,
da&szlig; es sich bei Quake um ein 3D-Spiel handelt. Jetzt wird sich
sicherlich jeder fragen, warum denn Doom kein 3D-Spiel gewesen sein soll.
Jeder, der einmal durch die enormen Hallen von Quake gewandelt ist, von
oben rechts eine Granate &uuml;ber den Kopf geworfen bekommen hat,
&uuml;ber Schluchten und Abgr&uuml;nde geblickt hat, metertief, oder der
gen Himmel geschaut hat um irgendwo oben auf den Kaskaden ein paar Monster
herunterzuballern, der wei&szlig;: Doom war 2D, links, rechts, vorne,
hinten. Quake ist das wahre 3D-Spiel, es ist eine ganze
&quot;Dimension&quot; besser als Doom. Selbst wenn man getroffen wird,
sinkt man nicht nach unten (wie bei Doom), sondern man kippt irgendwohin,
wom&ouml;glich auf die Seite, und sieht dann das Geschehen zwar auch von
der Froschperspektive, aber seitlich. Die Programmierer haben wirklich an
alles gedacht.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Multiplayer</B></H3>&nbsp;

<BR>Im Gegensatz zu Duke Nuke'em 3D oder Doom versteht es Quake, den
Spieler wirklich ganz und gar in seinen Bann zu ziehen: Das Spiel baut
eine ergreifende Atmosph&auml;re auf, die auf diesem Genre Sektor
ihresgleichen sucht. Nichts desto trotz &uuml;berragt Quake auch im
Multiplayermodus alles bisher dagewesene. Bis zu 16 Spieler k&ouml;nnen
per IPX, TCP, Modem oder Nullmodem gegeneinander antreten. Die beste
L&ouml;sung d&uuml;rfte AmIPX sein (ist der Quake-CD beigef&uuml;gt), denn
mit AmiTCP gibt es ab und zu kurze Aussetzer. Allerdings haben wir
die Netzwerkf&auml;higkeit von Quake Amiga nur ganz kurz angetestet. Wer
sich f&uuml;r Quakeserver interessiert, der sollte einmal einen Blick in
die Quake-Newsgroups werfen. Interessant ist auch die M&ouml;glichkeit,
Teams zu bilden, wahlweise mit oder ohne der Option, Teammitglieder
verletzen zu k&ouml;nnen. Mit der Einf&uuml;hrung von Quake entstand ja
auch eine wahre Clan-Hysterie: Ein jeder glaubte, sein Clan sei der beste,
und quer durch alle m&ouml;glichen elektronischen Bretter wurde geprahlt
und alle machten sich wichtig. Jetzt ist dieses &quot;Privileg&quot;
auch den Amiga-Leuten gegeben. Wer von &quot;Killing Grounds&quot;
abgeh&auml;rtet ist, dem d&uuml;rfte der Einstieg in die Quake-Welt leicht
fallen. Apropos Welt, Quakeworld wird demn&auml;chst f&uuml;r den Amiga
erh&auml;ltlich sein.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>QuakeC</B></H3>&nbsp;

<BR>Abgesehen von der M&ouml;glichkeit, Quake per Internet zu spielen,
haben wir Amiganer der Sony Playstation bzw. dem Nintendo 64 noch etwas
voraus: QuakeC, die Programmiersprache. In Wahrheit kauft man sich mit
Quake kein Spiel, nein, man kauft sich gleich hunderte! Warum das? Nun,
mit Hilfe von QuakeC ist es m&ouml;glich, Add-Ons zu schreiben (z.B. neue
Waffen, Monster, computergesteuerte Mitspieler, die u.U. ein spezielles
Verhalten an den Tag legen k&ouml;nnen, neue Levels, Auto-Sentrys a la
&quot;Hired Guns&quot;, usw.) - eine sehr interessante Variante. Jedoch
nicht nur kleine Ver&auml;nderungen sind m&ouml;glich, sogar komplett neue
Spiele k&ouml;nnen damit geschaffen werden, z.B. QuakeChess, AirQuake (mit
Flugzeugen), Malice, Painkeep, X-Men: The Apocalypse (Clones), und viele
andere. Nat&uuml;rlich gibt es auch von offizieller Seite Erweiterungen,
wie zum Beispiel die &quot;Quake Mission Packs&quot; mit neuen Waffen und
Monstern. QuakeC ist angeblich schon f&uuml;r den Amiga verf&uuml;gbar,
alle Add-Ons, die f&uuml;r den PC erschienen sind, k&ouml;nnen ohne
weiteres f&uuml;r den Amiga verwendet werden. Diese werden in Zukunft auch
auf den kongenialen &quot;CU Amiga Cover-CDs&quot; zu finden sein.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Das Fazit</B></H3>&nbsp;

<BR>Quake ist ein Meilenstein und macht richtig Spa&szlig;. Wer Doom ein
wenig mochte, wird Quake lieben. Wer Doom bis jetzt fanatisch gespielt
hat, wird es nun aus dem Fenster werfen wollen. Der Sourcecode von Quake
wurde im &uuml;brigen nicht einfach &uuml;bernommen, sondern komplett neu
geschrieben und kr&auml;ftigst optimiert - so l&auml;uft Quake auf einem
68060/50 gleich schnell wie auf einem Cyrix P150. Wer also einen 68060er
besitzt, sollte sich Quake kaufen. Wer keinen 060er hat, sollte zuerst
unseren n&auml;chsten Test lesen, dann Quake und schlie&szlig;lich einen
060er kaufen. Eine Grafikkarte ist kein Mu&szlig;, aber wer schon stolzer
Besitzer einer PicassoIV ist, der darf sich gleich einen eigenen
Screenmode basteln (512x384) und Quake in voller Aufl&ouml;sung (fast
ident zu 640x480, aber um einiges schneller) spielen. Amiga quakes!<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="../images/_box_red.gif" WIDTH=95 HEIGHT=10 ALT="[95]"><IMG SRC="../images/_box_black.gif" WIDTH= 5 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=96 HEIGHT=10 ALT="[96]"><IMG SRC="../images/_box_black.gif" WIDTH= 4 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="../images/_box_red.gif" WIDTH=91 HEIGHT=10 ALT="[91]"><IMG SRC="../images/_box_black.gif" WIDTH= 9 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="../images/_box_red.gif" WIDTH=89 HEIGHT=10 ALT="[89]"><IMG SRC="../images/_box_black.gif" WIDTH=11 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=88 HEIGHT=10 ALT="[88]"><IMG SRC="../images/_box_black.gif" WIDTH=12 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=98 HEIGHT=10 ALT="[98]"><IMG SRC="../images/_box_black.gif" WIDTH= 2 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="../images/_box_red.gif" WIDTH=92 HEIGHT=10 ALT="[92]"><IMG SRC="../images/_box_black.gif" WIDTH= 8 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=95 HEIGHT=10 ALT="[95]"><IMG SRC="../images/_box_black.gif" WIDTH= 5 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#lutz">Bernhard Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x008C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#juergen">J&uuml;rgen Schober</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x008C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="news:comp.sys.amiga.games">comp.sys.amiga.games</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="news:rec.games.computer.quake.misc">r.g.c.quake.misc</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="news:rec.games.computer.quake.announce">r.g.c.quake.announce</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_000.gif">Der Ork</A> (GIF;31K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_001.gif">Die Hallen (1)</A> (GIF;29K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_002.gif">Die Explosion</A> (GIF;36K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_003.gif">Der Schl&uuml;ssel</A> (GIF;33K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_004.gif">Die Granate</A> (GIF;34K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="news:rec.games.computer.quake.editing">r.g.c.quake.editing</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="news:rec.games.computer.quake.servers">r.g.c.quake.servers</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="news:rec.games.computer.quake.playing">r.g.c.quake.playing</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.clickboom.com/">ClickBOOM</A> - Die Homepage<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_005.gif">Die Nailgun</A> (GIF;20K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_006.gif">Die Hallen (2)</A> (GIF;25K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_007.gif">Die Finsternis</A> (GIF;17K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/cg_008.gif">Das Tor</A> (GIF;30K)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x008B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x008D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
