<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x06 - Philips Brilliance</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0085.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0084.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0086.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0085.html">Philips Brilliance</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0081.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0082.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0083.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0084.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0085.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0086.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0089.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x008A.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0090.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0091.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0092.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Philips Brilliance 107</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Von Philips gibt es in der 17 Zoll Klasse derzeit drei
verschiedene Monitormodelle. Der 107S ist das g&uuml;nstigste und technisch
schlechteste Modell. Auch von der Ausstattung bietet es am wenigsten. In
der n&auml;chsten Stufe findet sich der 107MB. Der Brilliance 107 hingegen
ist das Spitzenmodell. Diesen gibt es mit identischen technischen Daten und
Ausstattung auch in einer 19 Zoll Variante als Brilliance 109.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Hinter diesen f&uuml;r den Kunden leicht aufgrund der Aufschrift an der
Vorderseite des Geh&auml;uses erkennbaren Produktbezeichnungen versteckt
sich jedoch bei Philips Monitoren ein gewaltiges Chaos in der
Modellvielfalt. So m&uuml;ssen zwei Monitore, die als Brilliance 107
beschriftet sind, bei weitem nicht gleich sein. Jedoch ist hier
&auml;u&szlig;erste Vorsicht geboten, denn leicht kommt man so zu einem
Modell, das f&uuml;r den Amiga v&ouml;llig unbrauchbar ist.<BR>

<BR>Vom Brilliance 107 sind zumindest zwei verschiedene Modelle bekannt,
welche die Modellnummern 17A8808Q bzw. 17A580BQ tragen. Das erste ist das
&auml;ltere Modell und unterscheidet sich vom zweiten grunds&auml;tzlich in
seiner Ausstattung. So hat dieses weder BNC-Buchsen noch irgendeine
M&ouml;glichkeit, direkt am Monitor Bildparameter, au&szlig;er Helligkeit
und Kontrast, einzustellen. Alle anderen Einstellungen, die die Bildlage
und Bildgeometrie betreffen, k&ouml;nnen bei diesem Modell nur &uuml;ber
den vorhanden USB-Bus verstellt werden. Damit hat man am Amiga also wenig
Gl&uuml;ck, da hier weder ein USB-Bus noch eine passende Einstellsoftware
existieren.<BR>

<BR>Das Modell 17A580BQ hingegen ist, falls man Besitzer einer Grafikkarte
ist f&uuml;r den Amiga ein ausgezeichneter Monitor. Wie erkennt man nun, um
welches Modell es sich handelt? Die Modellnummern sind am Typenschild des
Monitors angef&uuml;hrt, welches sich jedoch nur auf der Unterseite (beim
17A8808Q) bzw. auf der R&uuml;ckseite (beim 17A580BQ, eventuell durch eine
abnehmbare Abdeckung verborgen) befinden. Auch auf der Verpackung sind die
Nummern angef&uuml;hrt.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Da das andere Modell f&uuml;r den Amiga uninteressant ist, wollen wir
uns in weiterer Folge nur mehr mit dem 17A580BQ auseinandersetzen. Er
bietet alles, was man sich heute von einem Monitor dieser Preisklasse
w&uuml;nscht:<BR>

<BR>Ein brilliantes Bild mit hoher Sch&auml;rfe und Kontrast, bei geringen
Konvergenzfehlern. Auch in den Ecken ist die Sch&auml;rfe noch gut. Die
Wiederholfrequenzen k&ouml;nnen sich sehen lassen:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=MIDDLE ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> 30 bis 95 kHz horizontal<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> 50 bis 160 Hz vertikal<BR>
</TD></TR></TABLE>&nbsp;

<BR>Hier sieht man nat&uuml;rlich bei der unteren Grenze der
Horizontalfrequenz, da&szlig; man zumindest einen Flickerfixer
ben&ouml;tigt, wenn man die originalen PAL oder NTSC-Modi des Amiga
verwenden will. Jedoch ist hier auch anzumerken, da&szlig; bei den heutigen
Monitoren mit ihrer kurzen Nachleuchtdauer ein Bild mit einer vertikalen
Wiederholfrequenz von 50 oder 60 Hz als extrem flimmernd erscheint, viel
&auml;rger als z.B. auf einem originalen 1081 oder 1084 Amiga-Monitor und
man deshalb mit solchen Modi nicht dauerhaft arbeiten kann. Die oberen
Grenzen hingegen liegen &uuml;ber den M&ouml;glichkeiten der heute
verf&uuml;gbaren Grafikkarten f&uuml;r den Amiga, welche nur maximal 84 kHz
schaffen. Man hat mit diesem Monitor also noch Reserven. So kann er ein
Bild mit einer Aufl&ouml;sung von 1600&times;1200 Bildpunkten noch mit 75
Hz Bildwiederholfrequenz darstellen. Jedoch ist eine solch hohe
Aufl&ouml;sung eigentlich f&uuml;r einen 17 Zoll Monitor schon fast zu
viel. Interessanter sind hier 1024&times;768 oder 1280&times;1024. Hier
kann man anmerken, da&szlig; der Brilliance 107 auch bei 1280&times;1024
noch ein so gutes und scharfes Bild liefert, da&szlig; man diese
Aufl&ouml;sung ruhig f&uuml;r seine Workbench verwenden kann. Die Grenzen
liegen eher bei den Grafikkarten. Diese schaffen diese Aufl&ouml;sung nur
mit 256 Farben und 76 Hz Bildwiederholfrequenz.<BR>

<BR>Deshalb verwende ich die eher un&uuml;blichere Aufl&ouml;sung von
1280&times;960 Punkten mit einer Bildwiederholfrequenz von 80 Hz. Die
h&ouml;here Wiederholfrequenz macht sich angenehm bemerkbar und
au&szlig;erdem ist das Verh&auml;ltnis von horizontalen zu vertikalen
Pixeln genau 4:3 was auch dem Verh&auml;ltnis der Bildr&ouml;hre
entspricht. Dadurch hat man wie auch bei den Modi 640&times;480,
800&times;600 oder 1024&times;768 quadratische Pixel.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der Monitor bietet zwei getrennte Videoeing&auml;nge. Einer mit dem
herk&ouml;mmlichen 15-poligen VGA-Stecker und der zweite mit 5 BNC-Buchsen
f&uuml;r Rot, Gr&uuml;n, Blau, horizontale und vertikale Synchronisation.
Ein relativ langes Kabel mit jeweils einem 15-poligen VGA-Stecker auf
beiden Enden, wie wir es auch f&uuml;r die Amiga-Grafikkarten brauchen, ist
im Lieferumfang enthalten. Ein Kabel zum Anschlu&szlig; an die BNC-Stecker
mu&szlig; extra erworben werden. Dann kann man jedoch zwei verchiedene
Rechner oder wie in meinem Fall den Amiga und die PC-Grafikkarte f&uuml;r
die A2386 Br&uuml;ckenkarte gleichzeitig anschlie&szlig;en. Zwischen den
beiden Videoeing&auml;ngen kann dann mittels eines Schalters, der jedoch
leider nur auf der R&uuml;ckseite des Monitors angebracht ist,
umschalten.<BR>

<BR>Der Brilliance 107 beherrscht auch Synchronisation auf Gr&uuml;n, wie
es manche Workstations erfordern. Im On Screen Display kann die Anpassung
der Eingangsspannung des Videosignals zwischen 0,7 V und 1 V umgeschalten
werden. Wird der Monitor &uuml;ber den 15-poligen Stecker verbunden, so
kann die Grafikkarte, sofern diese und das zugeh&ouml;rige Programm dies
unterst&uuml;tzen (z.B. Mode TNG und Picasso IV), den g&uuml;ltigen
Synchronisationsbereich direkt vom Monitor auslesen, was auch einwandfrei
funktioniert hat.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Neben den Video-Anschl&uuml;ssen existieren auf der R&uuml;ckseite des
Ger&auml;tes auch noch Audio-Anschl&uuml;sse. Da finden sich drei
Chinc-Buchsen. Zwei davon dienen als Eingang, &uuml;ber die man die
eingebauten Stereo-Lautsprecher betreiben kann. Lautst&auml;rke, H&ouml;hen
und Bass k&ouml;nnen im On Screen Display eingestellt werden. Auf der
Vorderseite des Monitors befindet sich au&szlig;erdem eine eigene Taste zum
Stummschalten der Lautsprecher. Der Klang der eingebauten Lautsprecher ist
jedoch nur durchschnittlich.<BR>

<BR>Der dritte Anschlu&szlig; ist der Ausgang f&uuml;r das eingebaute
Mikrofon. Die &Ouml;ffnung f&uuml;r das Mikrofon befindet sich vorne in der
Mitte unter dem Bildschirm. Zum Anschlu&szlig; von Lautsprecher und
Mikrofon an den Computer werden zwei Kabel mitgeliefert, die auf der eines
Seite die Cinch und auf der anderen jeweils einen 3,5 mm Klinkenstecker
besitzen. Diese sind zum Anschlu&szlig; an eine PC-Soundkarte gedacht. Den
Amiga Audio-Ausgang am Minitor anzuschlie&szlig;en ist jedoch kein Problem,
denn es reicht ein herk&ouml;mmliches Audio-Kabel, mit Cinch-Steckern auf
beiden Enden, wie es bei Stereoanlagen verwendet wird. Die Picasso IV
dagegen besitzt solche 3,5 mm Klinkenstecker f&uuml;r den Audio- Ein- und
-Ausgang.<BR>

<BR>Auf der rechten Seite des Monitors sind noch zwei Buschsen f&uuml;r 3,5
mm Klinkenstecker ausgef&uuml;hrt. Die eine zum Anschlu&szlig; eines
Kopfh&ouml;rers, an der anderen kann ein externes Mikrofon angeschlossen
werden.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Auf der R&uuml;ckseite des Monitors befindet sich auch der sogenannte
USB-Bay. Das ist eine duch eine Abdeckung veschlossene Vertiefung, in die
das optional erh&auml;ltliche USB-Modul gesteckt werden kann. Damit ist es
dann m&ouml;glich, wie beim vorhin angesprochenen Modell, alle
Einstellungen am Rechner &uuml;ber den USB-Bus durchzuf&uuml;hren.<BR>

<BR>Mit einer aufsetzbaren Abdeckung k&ouml;nnen alle Anschl&uuml;sse und
Kabeln auf der R&uuml;ckseite des Monitors verdeckt werden. Interessant ist
auch die Lage des Ein-/Ausschalters. Dieser befindet sich nicht wie sonst
&uuml;blich vorne, sondern auf der Oberseite des Ger&auml;tes.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das On Screen Display wird &uuml;ber eine Taste und einen Drehknopf,
welcher rechts in der Unterseite des Monitors eingelassen ist, schnell und
einfach bedient. Dabei ist das Men&uuml; so aufgebaut, da&szlig; man
einfach zur gew&uuml;nschten Funktion gelangt, ohne da&szlig; man erst
viele Untermen&uuml;punkte aufrufen mu&szlig;. Durch Dr&uuml;cken der Taste
kommt man ins Men&uuml; und dort kann man die verschiedenen Symbole mit dem
Drehknopf anfahren. Dr&uuml;ckt man auf dem markierten Symbol wieder die
Taste, so erscheint ein Balken und man kann den gew&auml;hlten Wert mit dem
Drehknopf ver&auml;ndern.<BR>

<BR>Das Men&uuml; kann in mehreren Sprachen, so auch in Deutsch abgerufen
werden. Eine praktische Eigenschaft ist die M&ouml;glichkeit, eine von den
drei Einstellparametern Lautst&auml;rke, Helligkeit oder Kontrast direkt
auf den Drehknopf zu legen, soda&szlig; dieser Parameter sofort durch
Drehen desselben, ohne da&szlig; man dazu ins Men&uuml; mu&szlig;,
ver&auml;ndert werden kann. So kann man zum Beispiel die Lautst&auml;rke,
wie wenn man daf&uuml;r einen eigenen Drehregler h&auml;tte, sofort
nachstellen.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Im praktischen Betrieb</B></H3>&nbsp;

<BR>Die Darstellungsqualit&auml;t, was Sch&auml;rfe Helligkeit und Kontrast
angehen, sind ausgezeichnet. Auch feine Grauschattierungen, die bei anderen
Monitoren oft schon im Schwarz verschwinden, werden noch gut
aufgel&ouml;st. Besonders auff&auml;llig sind auch die brillianten Farben.
Jedoch hat auch der Brilliance 107 ein Problem, das schon bei anderen
Philips-Monitoren aufgefallen ist: Sie neigen zum Singen bzw. Pfeifen bei
bestimmten Bildwiederholfrequenzen, welches nicht wegzubekommen ist,
au&szlig;er man w&auml;hlt einen anderen Darstellungsmodus. Beim Brilliance
107 hat es auch den Anschein, da&szlig; manche Frequenzen die eingebauten
Lautsprecher zum Mitschwingen anregen. Dies kann auch durch Abdrehen der
Lautst&auml;rke auf 0 nicht beseitigt werden.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Einstellm&ouml;glichkeiten im On Screen Display:</B></H3>&nbsp;

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=MIDDLE ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Hauptmen&uuml;: Helligkeit, Kontrast, Entmagnetisierung, Lautst&auml;rke<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Format und Bildlage: Volles Format, horizontale/vertikale Bildlage, horizontales/vertikales Format<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Farbtemperatur: W&auml;hlbar<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Spezialfunktionen: Sprache des On Screen Display, Abgleich der Bildecken, Vertikale Linearit&auml;t, Moiré, Drehknopf-Vorgabe, Bildschirmschoner (Stromsparfunktion), OSD-Funktionen, Video-Eingang (0,7 V / 1,0 V)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Klangregler: Stummschaltung, Tiefen, H&ouml;hen, Balance<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Geometrie: Kissenverzerrung, symetrische Kissenverzerrung, Trapez, Parallelogramm, Rotation<BR>
</TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Ab Werk eingestellte Aufl&ouml;sungen:</B></H3>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=TOP><TD>Modus</TD><TD>Aufl&ouml;sung</TD><TD>H-Freq.(kHz)</TD><TD>V-Freq.(Hz)</TD><TD>Standard</TD></TR>
<TR VALIGN=TOP><TD>1</TD><TD>640&times;400</TD><TD>31,5</TD><TD>70</TD><TD>VGA</TD></TR>
<TR VALIGN=TOP><TD>2</TD><TD>640&times;480</TD><TD>31,5</TD><TD>60</TD><TD>VGA</TD></TR>
<TR VALIGN=TOP><TD>3</TD><TD>640&times;480</TD><TD>37,5</TD><TD>75</TD><TD>VESA/75</TD></TR>
<TR VALIGN=TOP><TD>4</TD><TD>800&times;600</TD><TD>46,9</TD><TD>75</TD><TD>VESA/75</TD></TR>
<TR VALIGN=TOP><TD>5</TD><TD>800&times;600</TD><TD>53,7</TD><TD>85</TD><TD>VESA/85</TD></TR>
<TR VALIGN=TOP><TD>6</TD><TD>1024&times;768</TD><TD>60</TD><TD>75</TD><TD>VESA/75</TD></TR>
<TR VALIGN=TOP><TD>7</TD><TD>1024&times;768</TD><TD>68,6</TD><TD>85</TD><TD>VESA/85</TD></TR>
<TR VALIGN=TOP><TD>8</TD><TD>1152&times;870</TD><TD>69,0</TD><TD>75</TD><TD>MAC</TD></TR>
<TR VALIGN=TOP><TD>9</TD><TD>1152&times;900</TD><TD>71,8</TD><TD>76</TD><TD>SUN SPARC</TD></TR>
<TR VALIGN=TOP><TD>10</TD><TD>1280&times;1024</TD><TD>80,0</TD><TD>75</TD><TD>VESA/75</TD></TR>
<TR VALIGN=TOP><TD>11</TD><TD>1280&times;1024</TD><TD>91,0</TD><TD>85</TD><TD>VESA/85</TD></TR>
<TR VALIGN=TOP><TD>12</TD><TD>1600&times;1200</TD><TD>93,8</TD><TD>75</TD><TD>VESA/75</TD></TR>
</TABLE>&nbsp;

<BR>Nat&uuml;rlich werden auch alle anderen Aufl&ouml;sungen und Frequenzen
innerhalb der Spezifikation ordnungsgem&auml;&szlig; verarbeitet. Deren
Parameter werden auch gespeichert. Verwendet man jedoch die ab Werk
eingestellten Modi, dann wird daf&uuml;r kein extra Parameterspeicher
ben&ouml;tigt.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Technische Daten:</B></H3>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=TOP><TD COLSPAN=2>Bildr&ouml;hre</TD></TR>
<TR VALIGN=TOP><TD>Bildschirmgr&ouml;&szlig;e</TD><TD>17&quot; (38,6 cm) flach und rechtwinkelig</TD></TR>
<TR VALIGN=TOP><TD>Sichtbare Bildgr&ouml;&szlig;e</TD><TD>(VIS) 15,9&quot;</TD></TR>
<TR VALIGN=TOP><TD>Fokussierungsmethode</TD><TD>Dynamischer Fokus</TD></TR>
<TR VALIGN=TOP><TD>Lochmaskenabstand</TD><TD>0,22 mm (horizontal)</TD></TR>
<TR VALIGN=TOP><TD>Phosphor</TD><TD>P22 oder gleichwertig, mittelkurze Nachleuchtdauer</TD></TR>
<TR VALIGN=TOP><TD>Entspiegelung</TD><TD>Arasc</TD></TR>

<TR VALIGN=TOP><TD COLSPAN=2>Anzeigebereich</TD></TR>
<TR VALIGN=TOP><TD>Werkeinstellung</TD><TD>300 mm (H) &times; 225 mm (V)</TD></TR>
<TR VALIGN=TOP><TD>Maximal nutzbar</TD><TD>327 mm (H) &times; 246 mm (V)</TD></TR>

<TR VALIGN=TOP><TD COLSPAN=2>Abtastfrequenz</TD></TR>
<TR VALIGN=TOP><TD>Horizontal (Zeile)</TD><TD>30-95 kHz (AutoScan)</TD></TR>
<TR VALIGN=TOP><TD>Vertikal (Rahmen)</TD><TD>50-160 Hz (AutoScan)</TD></TR>

<TR VALIGN=TOP><TD>Leistungsaufnahme</TD><TD>Wechselstrom 90-264 V, 47-63 Hz</TD></TR>

<TR VALIGN=TOP><TD>Stromverbrauch</TD><TD>100 W normal, 120 W maximal</TD></TR>

<TR VALIGN=TOP><TD>W&auml;rmeabgabe</TD><TD>341,3 BTU normal, 409,5 BTU maximal</TD></TR>

<TR VALIGN=TOP><TD COLSPAN=2>Eingangssignal</TD></TR>
<TR VALIGN=TOP><TD>Video</TD><TD>0,7 oder 1,0 Vpp, 75 Ohm Impedanz</TD></TR>
<TR VALIGN=TOP><TD>Sync</TD><TD>Getrennt Sync. TTL-Stufe, Zusammengesetzt Sync. TTL-Stufe</TD></TR>

<TR VALIGN=TOP><TD COLSPAN=2>St&auml;nder</TD></TR>
<TR VALIGN=TOP><TD>Kippen</TD><TD>5&deg; nach vorne, 11&deg; nach hinten</TD></TR>
<TR VALIGN=TOP><TD>Schwenken</TD><TD>90&deg; nach links, 90&deg; nach rechts</TD></TR>

<TR VALIGN=TOP><TD COLSPAN=2>Physikalische Daten</TD></TR>
<TR VALIGN=TOP><TD>Abmessungen (B&times;H&times;T)</TD><TD>442 &times; 433 &times; 500 mm</TD></TR>
<TR VALIGN=TOP><TD>Nettogewicht</TD><TD>21,5 kg</TD></TR>

<TR VALIGN=TOP><TD COLSPAN=2>Betriebsumgebung</TD></TR>
<TR VALIGN=TOP><TD>Raumtemperatur</TD><TD>0&deg; C - 40&deg; C</TD></TR>
<TR VALIGN=TOP><TD>Rel. Luftfeuchtigkeit</TD><TD>10% - 90%</TD></TR>

<TR VALIGN=TOP><TD COLSPAN=2>Lagerungsumgebung</TD></TR>
<TR VALIGN=TOP><TD>Raumtemperatur</TD><TD>-40&deg; C - 60&deg; C</TD></TR>
<TR VALIGN=TOP><TD>Rel. Luftfeuchtigkeit</TD><TD>5% - 95%</TD></TR>
</TABLE>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0085.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.monitors.be.philips.com/">Monitore von Philips</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/3ball.gif">Phillips Logo</A> (GIF;3KB)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/pt-b107.jpg">Brilliance 107 Logo</A> (JPEG;4KB)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_06/br107.jpg">Brilliance 107</A> (JPEG;7KB)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0084.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0086.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
