<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Andreas Guldner -->
<TITLE>nach der Wahl</TITLE>
</HEAD>

<BODY background="wolf1.gif" text="#000000" link="#000000" vlink="#0000ff"
alink="#000055">
<BR>

<TABLE width="100%" border="0" cellpadding="10" summary="">
<TR>
<TD>
<H1 align="center"><b>Umsetzungsvorschl&auml;ge</b></H1>

<P>In NC 106 habe ich im Leserbrief die Hoffnung ge&auml;u&szlig;ert,
f&uuml;r "neue" Amigahardware w&uuml;rde es sicher auch Spiele geben die
nicht nur dem 3D-08/15 Einheitsbrei entstammen. Wieso ich gerade
Civilization III, Icewind Dale 1+2 f&uuml;r gute Kandidaten halte will ich
hier etwas genauer darlegen.</P>

<H2><b>Civilization III</b></H2>

<P>Schon Civilization 1 war kein "Effekt"-Programm mit Echtzeit-K&auml;se
sondern verlangte Planung und belohnte die ruhigeren Spieler mit Tiefgang
und sehr ausgefeilten Regeln die zahlreiche Spielvarianten ergaben. Teil 2
kam dann leider nicht mehr zum Amiga, ist aber auch eher eine Erweiterung
des ersten Teils um zus&auml;tzliche Einheiten, Bauwerke, Forschungen,
Kulturen usw. Wirkliche Neuerungen bietet erst der dritte Teil mit den
ge&auml;nderten Spielregeln und der Aufteilung der Siegesbedingungen,
wodurch allerdings manchmal der Zeitpunkt des Spielendes &uuml;berraschend
kommt.</P>

<P><em>Was spricht f&uuml;r Civilization 3?? </em>: zuerst w&uuml;rde ich
mal die gelungene Aufteilung des Fortschritts in mehrere Faktoren sehen; es
ist nicht schwerer oder umst&auml;ndlicher als seine Vorg&auml;nger, aber
die &Auml;nderungen lassen andere "AddOn" Produzierer wie einfallslose
Anf&auml;nger dastehen; mit 5 verschiedenen Siegm&ouml;glichkeiten und
logischen Zusammenh&auml;ngen bietet sich gen&uuml;gend zum T&uuml;fteln
ohne je auf den "einzig wahren" L&ouml;sungsweg zu kommen; die
Anspr&uuml;che an Hardwareleistung sind sicher erf&uuml;llbar; insgesamt
ist es in der derzeitigen Version fehlerfrei und komplett in Deutsch; das
gute Handbuch enth&auml;lt alles zum Spiel und ist nicht
"plattformspezifisch" geschrieben, kann daher bestimmt &uuml;bernommen
werden; nur 1 CD; riesige Variationsfreiheit und damit langer
Spielspa&szlig; ohne st&auml;ndig "AddOns" zu kaufen.<P>

<P><em>Was kann besser werden?</em>: mir fallen da nur die Grafiksets der
Anf&uuml;hrer ein, statt dieser Bl&ouml;dgrinser sollte man entweder
realistische K&ouml;pfe oder gleich Comick&ouml;pfe nehmen. Ein nicht nur
komplexes sondern auch komplettes Spiel mit zwar einfacher 2D-Grafik und
begrenztem Sound kann meiner Meinung nach mit diesem sehr guten
Spielprinzip und der funktionierenden Spielwelt die
Einfachm&ouml;chtegernpseudostrategiespiele leicht auf die hintersten
Pl&auml;tze verweisen.</P>

<H2><b>Icewind Dale 1</b></H2>

<P>Inzwischen als Sammlung im Handel (bestehend aus IWD1 + AddOn +
Extraburg) ist dieses RPG ein Vertreter der D&amp;D-Spiele auf Basis der
Bioware-engine. Nun werden manche fragen warum IWD und nicht Baldurs Gate?
Ganz einfach weil IWD erheblich ausgewogener und fehlerfreier als BG ist!
Statt Herumgeschlumpfe mit einem Charakter plus bis zu 5 hirnlosen NPCs
gibt IWD gleich 6 eigene Figuren her. (BG kann zwar als Multiplayer 6
eigene Figuren enthalten, ist aber oft zickig und vergisst schon mal 1-2
Figuren). Au&szlig;erdem ist der Weg durch IWD nicht so festgelegt und mit
den seltenen Problemstellen auch eher f&uuml;r Anf&auml;nger spielbar.
Fairerweise muss man auch die Einfachheit der IWD-Teile als das sehen was
der Handlungsort hergibt, kalte eisige Nordlande sind nunmal nicht geeignet
f&uuml;r &uuml;ppige St&auml;dte und protzige Au&szlig;enwelten. Dungeons
und Aufgaben hat IWD dagegen mindestens genausoviele wie BG. Im Grunde ist
IWD das bessere BG, doch hat es auch die Nachteile der Spielengine geerbt,
was zu un&uuml;bersichtlichem Gewusel auf kleinstem Raum und Problemen bei
manchen Zaubern (auf Gebiete) f&uuml;hrt da viele Gegner bei Sichtkontakt
direkt losrennen.</P>

<P>Als Sammlung spielt IWD + Herz des Winters-ADDON + R&auml;tselburg-extra
in der Rangliste der RPGs am PC keine Rolle, hier ist die Faszination
f&uuml;r 3D-Effekte und die scheinbare F&uuml;lle von BG 2 das
entscheidende Element, auch wenn die meisten Metzel-3Ds gar keine RPGs sind
und BG 2 eine Ansammlung von Fehlern ist, die fast nur mit Cheats zu
ertragen sein d&uuml;rfte.</P>

<H2><b>Icewind Dale 2</b></H2>

<p>Der Nachfolger von IWD beginnt wieder mit Lvl1 Figuren und erlaubt
keinen Import (au&szlig;er von sich selbst), obwohl man an den
ver&ouml;ffentlichten Cheats erkennen kann dass die Spielengine fast immer
diesselben Gegenst&auml;nde enth&auml;lt. Das System hat sich zu einem
Punkteverteilen ge&auml;ndert auf Werte und Fertigkeiten, genauso wie
Talente. Nach Erstkreation erh&auml;lt man zwar in Abst&auml;nden bei
Levelerh&ouml;hung neue Punkte, aber leider steht nirgends, dass die XP auf
"normal" nur bis LVL 15 reichen, (Packung:Lvl30!), was ein m&ouml;gliches
AddOn vermuten l&auml;sst. Obwohl IWD 2 gut einf&uuml;hrt und zuerst sich
als guter 2.Teil darstellt, kommt durch ein paar Schnitzer bald der Bedarf
nach Cheats auf. <em>Beispiele</em>: ein Teil der Eisengolems ist
unverletzbar, andere nicht! unsichtbare Gegner k&ouml;nnen nicht sichtbar
gemacht werden und sind daher fast unbesiegbar! die alte
"Geldknappheitskrankheit" hat auch hier zugeschlagen und man bekommt am
Anfang kaum Gold, kann dann aber zum Schluss darin baden! Der Endkampf ist
eigentlich nicht zu schaffen und dies liegt an der zu hohen Resistenz der
Hauptgegner selbst gegen die besten Waffen.</p>

<P>Als wichtig w&auml;re also bei einer Umsetzung das Redesign des
Endkampfs, der letzten Pr&uuml;fung bei den M&ouml;nchen, der Golems und
die Abschaltung der "perfekten" ewigen Unsichtbarkeit. Au&szlig;erdem
ertragreichere Schatzkisten (mehr Geld) und die dauerhafte Ansiedelung
aller Figuren in ihrem Zuhause. Des weiteren sollten Aufgabenitems immer
funktionieren und es mehr als nur einen direkten Weg zum Ende geben (auch
wenn ein Spiel mit Einbahnstra&szlig;e kontrollierbarer ist). Die guten
Ans&auml;tze k&ouml;nnten also sicher zu einem passenden Nachfolger
f&uuml;r IWD 1 ge&auml;ndert werden und damit IWD 2 von den Kritikpunkten
befreien.</P>

<H2><b>Zusammengefasst:</b></H2>

<P>Sowohl Civilization 3 als Strategiespiel, wie auch Icewind Dale 1+2 bei
den RPGs w&auml;ren mit mehr oder weniger Aufwand technisch machbar, wenn
die Lizenzen kein Hindernis sind. Diese Spiele laufen alle auf PCs mit
wenig 3D Power und kaum mehr als 1GHz anstandslos und vieleicht eher
umsetzbar als "Effektspiele" die nur auf neueste 3D-Hardware und 2GHz
bauen.</P> <P>Andreas Guldner</P>

</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

