<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
        <P align="center"><IMG src="gt_villa.gif" width="379" height="146" alt=""></P>

        <P>Heute stelle ich einmal ein Spiel vor und das ganz ohne Amiga. Denn man
        kann auch im Familienkreis ganz ohne Monitor viel Spa&szlig; haben.</P>

        <P>Kurzform:<BR> Aus S&auml;ulen und Platten baut man eine
        f&uuml;nfgeschossige Villa, die immer instabiler wird, bis sie
        zusammenf&auml;llt. Villa Paletti - das klingt nach reinem Kinderspiel.
        Doch das t&auml;uscht gr&uuml;ndlich. Der Trick bei dem fintenreichen Bau
        sind die S&auml;ulen, die sich in der Gr&ouml;&szlig;e ganz minimal
        unterscheiden. Mal sind sie tragend, mal nicht -je nachdem, an welcher
        Stelle sie verbaut werden und wie sich die Statik durch neue Ebenen
        &auml;ndert.</P>

        <HR>

        <P><IMG src="gt_villa.jpg" width="340" height="278" alt= "" align="left"
        hspace="6"> Villa Paletti ist ein spielerisches Gipfeltreffen f&uuml;r 2-4
        Wackelkandidaten ab 8 Jahren. Entgegen allen Regeln anerkannter Baukunst
        machen sich die Bauherren an den tragenden S&auml;ulen zu schaffen, um der
        windigen Villa in luftigsten H&ouml;hen weitere Stockwerke zu verpassen. So
        entsteht ein atemberaubende Luftschloss, das nicht nur f&uuml;r verhinderte
        Plattenbauarchitekten Nervenkitzel auf h&ouml;chster Ebene bietet. Die
        Formenvielfalt des nat&uuml;rlichen Baumaterials verwandelt jeden Spielzug
        in ein gestalterisches Erlebnis.<BR> Besonders anschauliche Erfahrungen mit
        Statik und Stabilit&auml;t sammeln Nachwuchsarchitekten bei Palazzo
        Paletti, der griffigen Gro&szlig;version dieses spektakul&auml;ren
        Bauwettstreits.<BR clear="all"> Text und Bild von
        <B>&lt;www.zoch-verlag.com&gt;</B></P>

        <HR>

        <P>Eigentlich will ja jeder gewinnen. Aber es klappt nun mal nicht immer.
        Was aber keiner will, sind komplizierte Anleitungen, durch die man sich
        erst durchbei&szlig;en muss und das ist hier gut gel&ouml;st. Das
        eigentliche Ph&auml;nomen ist hier aber etwas ganz anderes: Der instabile
        Palettibau sieht nach simplem Kinderspiel aus, hat aber unvermutete
        Finessen und entpuppt sich auch bei vielen Erwachsenen als Hit - vor allem
        bei manchen M&auml;nnern, die trickreich immer h&ouml;her stapeln, bevor
        das Ganze dann doch zusammenkracht. Wahrscheinlich gibt es auch viele, die
        jetzt den p&auml;dagogischen Sinn und Zweck dieses Spieles f&uuml;r Kinder
        erkl&auml;ren, ich schenke mir aber eine solche Betrachtung, denn das Spiel
        spricht ganz alleine f&uuml;r sich, denn es f&ouml;rdert Teamgeist,
        Kreativit&auml;t, strategisches Denken und den Umgang mit Erfolg und
        Misserfolg.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

