<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">
    <META name="DESCRIPTION" content=
    "Ein Computer-Magazin von 1984">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY background="wolf1.gif">
    <TABLE border="0" cellpadding="8">
      <TR>
        <TD>
          <CENTER>
            <IMG src="mm_hc04f.gif">
          </CENTER>
          <BR>
           <BR>
           In dieser Reihe m&ouml;chte ich Euch in die Gute Alte
          Zeit entf&uuml;hren. Dem aktuellen Trend folgend, geht es
          auch hier zur&uuml;ck in die 80`er. Dies mit Hilfe eines
          Computer-Magazins, mit dem Titel "Happy Computer". Ich
          besitze die Oktober-Ausgabe aus dem Jahre 1984. F&uuml;r
          mich ist es immer wieder faszinierend, darin zu
          schm&ouml;kern, und auch viele von Euch werden sicher an
          die eigenen Anf&auml;nge mit dem Home-Computer erinnert.
          Dieses Magazin war nicht auf einen bestimmtem Computer
          festgelegt, sondern informierte &uuml;ber alle aktuellen
          Typen. Also von Atari bis ZX81. Er ist in der
          Gegenwartsform gehalten, da er meinerseits aus dem Heft
          abgeschrieben wurde.<BR>
           <BR>
           
          <HR>
          <BR>
           <BR>
           

          <P>Tolles Basic und ein g&uuml;nstiger Preis sind die
          Tr&uuml;mpfe des CPC 464. Ein neuer Anbieter auf dem
          Heimcomputermarkt will den Etablierten das F&uuml;rchten
          lernen.</P>

          <H2 align="center"><B>Das tapfere Schneiderlein</B></H2>

          <CENTER>
            <IMG src="mm_hc04b.gif">
          </CENTER>

          <P>Der neue Computer wurde in England von der Firma
          Amstrad entwickelt. Unter diesem Namen wird er dort auch
          verkauft. In Deutschland tr&auml;gt der Kompaktcomputer
          den Namen Schneider CPC 464. Kompaktcomputer deshalb, da
          er nur komplett mit Monitor und Kassettenrecorder
          angeboten wird. Mit RGB-Farbmonitor mu&szlig; man ca.
          1400 Mark investieren, f&uuml;r knapp 900 Mark wird das
          Ger&auml;t mit einem gr&uuml;nen Bildschirm geliefert.
          F&uuml;r den Anschlu&szlig; eines Farbfernsehger&auml;tes
          ist ein zirka 130 Mark teurer Modulator mit Netzteil
          erh&auml;ltlich. Normalerweise sitzt das Netzteil mit im
          Monitor, eine L&ouml;sung, die l&auml;stiges
          Kabelwirrwarr &uuml;berfl&uuml;ssig macht und die
          unvermeindliche W&auml;rmeentwicklung auf eine Komponente
          beschr&auml;nkt. Gem&auml;&szlig; der Firmenphilosophie
          ist der neue Computer ein sehr kompaktes Ger&auml;t, das
          mit nur einer Steckdose betrieben wird.</P>

          <CENTER>
            <IMG src="mm_hc04e.gif">
          </CENTER>

          <P>Als Massenspeicher ist in das Hauptger&auml;t ein
          einfacher Kassettenrecorder eingebaut. Der Recorder wird
          von dem Computer gesteuert, allerdings nur die
          Start-/Stop-Funktion. Im Herbst dieses Jahres soll ein
          3-Zoll-Diskettenlaufwerk die Aufgaben des
          Kassettenrecorders &uuml;bernehmen. F&uuml;r zirka 850
          Mark soll die Erg&auml;nzung zusammen mit dem
          Betriebssystem CP/M und der Programmiersprache LOGO
          angeboten werden.</P>

          <CENTER>
            <IMG src="mm_hc04d.gif">
          </CENTER>

          <P>Als Eingabemedium verf&uuml;gt der CPC 464 &uuml;ber
          eine dreifach unterteilte Tastatur. Unter den
          kreuzf&ouml;rmig angeordneten Cursortasten befindet sich
          ein Zahlenfeld mit eigener ENTER- Taste. F&uuml;r
          alphanumerische Eingabe gab es am Testger&auml;t noch
          eine angloamerikanische Schreibmaschinentastatur mit
          Sondertasten. Angenehm gro&szlig; ist die ENTER-Taste
          ausgefallen, die - wie alle Sondertasten - farblich von
          den normalen Tasten abgesetzt ist. Die Tasten weisen eine
          bedienerfreundliche Form auf und haben einen deutlich
          sp&uuml;rbaren Druckpunkt. Da jede Taste mit neuen
          Zeichen belegt werden kann, ist es leicht aus der
          englischen QWERTY- eine deutsche QWERTZ-Tastatur zu
          machen. Ein Software-Paket das diese Anpassung vornimmt,
          wird schon angeboten. Als Funktionstasten sind die Tasten
          des Zahlenblocks vorgesehen. Jede Taste kann mittels
          eines einfachen Befehls mit bis zu 32 Zeichen belegt
          werden.</P>

          <CENTER>
            <IMG src="mm_hc04a.gif">
          </CENTER>

          <P>F&uuml;r den Anschlu&szlig; eines Druckers ist eine
          parallele Centronics-Schnittstelle eingebaut. Die meisten
          preiswerten Drucker k&ouml;nnen mit dieser Schnittstelle
          ohne weiteres Interface betrieben werden. F&uuml;r spiele
          ist ein Joystickanschlu&szlig; vorgesehen, der bei
          Verwendung eines Schneider-Joysticks von zwei Spielern
          benutzt werden kann. Der zweite Anschlu&szlig; befindet
          sich am ersten Joystick.</P>

          <P>Nach dem Einschalten meldet sich der
          Schneider-Computer mit einem gelb/blauen Titelbild und
          der Meldung "Schneider 64K Mikrocomputer, Amstrad und
          Locomotive Ltd.". Hinter dem Namen aus dem Eisenbahnwesen
          versteckt sich ein Softwarehaus, das f&uuml;r das Basic
          verantwortlich zeichnet. Ausgehend vom Microsoft-Basic
          wurde ein neuer Basic-Dialekt geschrieben, der fast keine
          W&uuml;nsche offen l&auml;&szlig;t. Mehr als 160 Befehle
          helfen jede Programmieraufgabe schnell und einfach zu
          l&ouml;sen.</P>

          <P>Mit den Befehlen SOUND, ENV und ENT wird der
          Sound-Chip AY-3-8912 angesteuert. Drei verschiedene
          Tonkan&auml;le erm&ouml;glichen eine Ausgabe mit
          Stereo-Effekt. Bis zu 16 Parameter bestimmen die
          komplizierten Tonverl&auml;ufe. Das Betriebssystem ist in
          der Lage, w&auml;hrend der Tonausgabe andere Aufgaben zu
          erledigen. Verschiedene Tonkan&auml;le lassen sich
          mittels der sogenannten Rendezvous-Technik
          synchronisieren. Bei dieser Technik werden in den
          verschiedenen Kan&auml;len Markierungen gesetzt, die das
          gleichzeitige Einsetzen der SOUND-Kommandos erzwingen.
          Die Qualit&auml;t des eingebauten Lautsprechers ist
          allerdings nicht &uuml;berzeugend. Bei einem Durchmesser
          von zirka drei Zentimetern kann man von diesem
          Einfachlautsprecher auch nicht mehr erwarten. &Uuml;ber
          die heimische Stereoanlage klingt das Ergebnis bedeutend
          besser. Nun wird von den Computerfreaks neben dem
          Familieneigenen Fernseher wohl auch noch die Hi-Fi-Anlage
          in Beschlag genommen. Schlechte Zeiten f&uuml;r alle
          Familienmitglieder, die mit Computern nichts im Sinn
          haben.</P>

          <P>F&uuml;r einen bunt schillernden Bildschirm stehen 27
          verschiedene Farben zur Verf&uuml;gung. Im Modus 0 mit
          160 x 200 Bildpunkten kann man 16 dieser Farben
          gleichzeitig benutzen. Im Modus 1 mit 320 x 200
          Bildpunkten bleiben noch 4 Farben, im
          hochaufl&ouml;senden Modus 2 mit 640 x 200 Punkten nur
          noch zwei. In dieser h&ouml;chsten Aufl&ouml;sungsstufe
          arbeitet der Computer eigentlich mit 640 x 400 Punkten.
          Da aber die 16 KByte des Grafikspeichers f&uuml;r 256000
          verschiedene Informationen nicht ausreicht, werden je
          zwei vertikale Punkte zu einem zusammengefa&szlig;t.
          F&uuml;r Textverarbeitungsprogramme lassen sich auf dem
          Monitor 25 Zeilen mir 80 Zeichen pro Zeile darstellen.
          Auf dem monochromen Bildschirm sind diese hervorragend zu
          lesen, auf dem RGB-Monitor etwas verschwommen. Die Farben
          werden vom Basic aus mit vom Spectrum her bekannten
          Befehlen angesprochen. BORDER bewirkt einen Farbwechsel
          des Bildschirmrands, PAPER &auml;ndert die Hintergrund-
          und INK die Vordergrundfarbe. Mit bis zu drei Parametern
          w&auml;hlt man die Farbe, die sogar im Wechsel mit einer
          der anderen 26 Farben blinken kann.</P>

          <P>Zur Grafikausgabe dienen weitere Befehle wie PLOT und
          DRAW. Die Grafikbefehle sind nicht sehr zahlreich,
          f&uuml;r bestimmte Aufgaben, wie zum Beispiel Kreise
          zeichnen, mu&szlig; man sich eine eigene Unterroutine
          schreiben. Als angenehm erweist es sich, da&szlig; die
          Koordinaten immer die gleichen bleiben. Unabh&auml;ngig
          vom Modus werden die Positionen stets so berechnet, als
          ob der hochaufl&ouml;sende Modus genutzt wird. Alle, die
          auf dem Schneider-Computer selbst programmieren wollen,
          werden dieses zu sch&auml;tzen wissen.</P>

          <P>Auch in die Heimcomputer-Klasse hat jetzt die
          Window-Technik Einzug gehalten. Acht Fenster - sieben
          f&uuml;r Text und eins f&uuml;r Grafik - k&ouml;nnen
          definiert werden. Es spielt dabei keine Rolle, ob sich
          die verschiedenen Fenster &uuml;berlappen oder ob sie
          verschiedene Farben haben sollen. Jedes Fenster
          l&auml;&szlig;t sich mit allen Ausgabebefehlen
          ansprechen.</P>

          <CENTER>
            <IMG src="mm_hc04c.gif">
          </CENTER>

          <P>Der Zeichensatz des CPC 464 umfa&szlig;t mehr als 220
          verschiedene Zeichen. Neben den ASCII-Zeichen findet man
          griechische Buchstaben und Grafikzeichen ebenso wie
          lachende und weinende Gesichter. Wie bei fast allen
          neueren Heimcomputern lassen sich auch bei dem
          Schneider-Computer Zeichen in einer 8 x 8-Matrix frei
          definieren.</P>

          <P>Ernorme Leistung bietet der neue Computer allen
          Freunden der Maschinensprache. Mehrere Befehle erlauben
          einen Eingriff in die Interruptsteuerung einmalig oder
          mehrmals in bestimmten Zeitabst&auml;nden. So kann man
          mit dem Befehl AFTER eine Befehlsausf&uuml;hrung nach
          Ablauf einer bestimmten Zeit erreichen. Mit dem Befehl
          EVERY wird eine bestimmte Anweisung immer wieder
          ausgef&uuml;hrt. Die Verkn&uuml;pfung zwischen
          Basic-Programmen und solchen in einer
          Z80-Maschinensprache sind vielf&auml;ltig und leicht. Auf
          alle Befehle des umfangreichen Locomotiv-Basic
          einzugehen, dazu fehlt hier der Platz. Neben den
          erw&auml;hnten Kommandos gibt es noch viele andere, die
          das Programmieren vereinfachen. Sogar die
          &Uuml;bertragungsgeschwindigkeit zwischen
          Kassettenrecorder und Computer kann mit einem einfachen
          Basic-Befehl manipuliert werden. Vermi&szlig; habe ich
          eigentlich nur die vom BBC- Basic her bekannten
          Prozedur-Aufrufe und lokalen Variablen.</P>

          <P>Die Editierm&ouml;glichkeiten des CPC 464 machen einen
          nicht ganz so guten Eindruck. Man verf&uuml;gt &uuml;ber
          keinen bildschirmorientierten Editor, sondern mu&szlig;
          mit dem EDIT-Befehl arbeiten. Eine zweite
          M&ouml;glichkeit findet man in der COPY-Taste, mit der
          man ganze Befehlsfolgen buchstabenweise an einen anderen
          Platz kopieren kann. Nach kurzer Zeit beherrscht man
          diesen Editor und kann dann sehr gut damit arbeiten.</P>

          <P>Vor elf Jahren startete Schneider als "Newcomer" auf
          dem dichtgedr&auml;ngetn Markt der
          Unterhaltungselektronik. Mit einer Jahresproduktion von
          800000 Hi-Fi-Ger&auml;ten z&auml;hlt die Allg&auml;uer
          Firma heute zu den ganz gro&szlig;en der Branche - trotz
          japanischer Konkurrenz. Zur Hi-Fi-Video in
          D&uuml;sseldorf startet das Unternehmen nun das ganz neue
          Projekt. "Unser Engagement auf dem Markt der Heimcomputer
          ist eher einem gl&uuml;cklichen Zufall zu verdanken. Vor
          einigen Monaten bin ich von einem englischen
          Gesch&auml;ftsfreund gefragt worden, ob wir die
          Vermarktung des Computers auf dem Kontinent
          &uuml;bernehmen wollen. Die damalige Antwort
          er&ouml;ffnete einen neuen Produktionszweig, der in der
          zweiten Stufe auch die Entwicklung eines eigenen
          Computers beinhalten soll", sagte Bernhard Schneider
          anl&auml;&szlig;lich der Vorstellung des CPC 464. Vorerst
          beschr&auml;nken sich die Aktivit&auml;ten aber auf das
          Vermarkten des englischen Ger&auml;ts. Hierbei soll
          umfangreiche Software helfen, die in Zusammenarbeit mit
          verschiedenen Software-H&auml;usern entwickelt wurde.</P>

          <P>Mit dem guten Locomotive-Basic k&ouml;nnte sich der
          neue Computer gegen alteingesessene Konkurrenz
          durchsetzen. An Optimismus fehlt es dem Anbieter nicht.
          Er will noch in diesem Jahr &uuml;ber 40000 Ger&auml;te
          absetzen, im n&auml;chsten Jahr sogar &uuml;ber
          100000.<BR>
           (hg)</P>
          <HR>
          <BR>
           In der n&auml;chsten NoCover gibt es einen Bericht
          &uuml;ber "Disketten - eine runde Sache".<BR>
           <BR>
           

          <TABLE align="center" border="3">
            <TR bgcolor="#ffffff">
              <TD><A href="mailto:">Thomas Nawroth</A></TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

