<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Werbemails</TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color=
          "#ffff00"><B>Werbemails</B></FONT></H1>

          <P>"Wie" der Postbote drei mal klingelt....</P>

          <P>In letzter Zeit bekomme ich immer &ouml;fter
          unerw&uuml;nschten Werbem&uuml;ll, originell verpackte
          Links zu teuren 0190-Dialern und sogar Viren im Anhang.
          Ein Problem, dass immer schlimmer zu werden scheint und
          wirklich sehr &auml;rgerlich werden kann, bis dass man
          seine EMailadresse &uuml;berhaupt nicht mehr nutzen kann.
          Zwar lassen sich Filter einsetzen, um bestimmte Adressen
          zu sperren, Dialerblocker und Virenscanner helfen,
          gef&auml;hrliche EMails abzufangen, aber der reibungslose
          Mailverkehr wird irgendwann so sehr gest&ouml;rt, dass
          man sich schlussendlich eine neue EMailadresse
          einrichtet, bis das Spiel wieder von vorne beginnt.</P>

          <P>Doch wie kann es passieren, dass Menschen einem
          einfach eine EMail mit Virus im Anhang schicken? Hierzu
          beleuchten wir die drei g&auml;ngigsten Methoden, um
          EMails zu versenden....</P>

          <DL>
            <DT>1. Der offene Relay SMTP-Server</DT>

            <DD>EMails werden allgemein &uuml;ber einen SMTP-Server
            versendet. Beim offenen Relay, der leider immer noch
            sehr h&auml;ufig verwendet wird ist das ein vollkommen
            freier SMTP-Server. Im Prinzip kann Jeder eine EMail
            &uuml;ber solch einen SMTP-Server verschicken und dabei
            sogar die EMailadresse eines Anderen als Absender
            angeben. Das ist nat&uuml;rlich ziemlich &uuml;bel, da
            somit EMailnutzer in Verdacht geraten k&ouml;nnen,
            Spam, also ungew&uuml;nschten Werbem&uuml;ll zu
            versenden oder sogar Viren. Ich habe in letzter Zeit
            bereits drei mal Viren von einem WEB.DE-Nutzer
            bekommen. Ich habe die WEB.DE-Nutzer dann darauf
            hingewiesen und Ihnen erkl&auml;rt, dass sie diesen
            Missbrauch auch unbedingt bei WEB.DE melden. Ob WEB.DE
            darauf dann &uuml;berhaupt noch reagiert, ist ein
            anderes Thema, - EMails werden jedenfalls kaum
            beantwortet von WEB.DE. Die User waren regelrecht
            schockiert und wussten &uuml;berhaupt nicht, dass jeder
            Mensch &uuml;ber deren EMailadresse EMails versenden
            kann. Der SMTP-Server akzeptiert jedoch EMails von
            Jedem v&ouml;llig ohne Identifizierung und somit ist
            den kleinen Betr&uuml;gereien T&uuml;r und Tor
            ge&ouml;ffnet. Solche Server landen dann gern in
            diversen "black list"&acute;s und so passiert es sogar
            manchmal, dass Nutzer dieser Provider kaum noch EMails
            zuverl&auml;ssig versenden k&ouml;nnen.</DD>

            <DT>2. POP before SMTP</DT>

            <DD>Der EMaileingangsserver ist in den meisten
            F&auml;llen ein sogenannter POP-Server. Dieser Server
            war von Anfang an immer durch eine Authentifizierung
            abgesichert. Er l&auml;sst Zugriffe nur von Menschen
            zu, die sich mit einem Benutzernamen und einem Kennwort
            einloggen k&ouml;nnen. Dadurch wird gew&auml;hrleistet,
            dass nicht fremde Menschen an EMails herankommen
            k&ouml;nnen, die nicht f&uuml;r sie bestimmt sind. Bei
            dem Verfahren "POP before SMTP" l&auml;sst der
            E-Mail-Server eines Providers einen Mailversand nur zu,
            wenn zuvor auch EMails abgeholt wurden. Da man zum
            Abholen der EMails einen Benutzernamen und ein Passwort
            braucht, ist dies eine relativ einfach Variante, um zu
            &uuml;berpr&uuml;fen, ob der Nutzer auch den Mailserver
            benutzen darf. Der Provider merkt sich hier f&uuml;r
            einige Zeit (bis zu einer halben Stunde) die dynamische
            IP-Adresse mit der die Mails abgeholt wurden und diesem
            IP wird dann auch erlaubt, Mails &uuml;ber den
            SMTP-Server zu versenden. GMX bietet beispielsweise
            diesen Dienst an.</DD>

            <DT>3. Mailserver mit Authentifizierung</DT>

            <DD>Der neuste und sicherste Weg, EMails zu versenden
            geht &uuml;ber den SMTP-Server mit Authentifizierung.
            Hier werden die gleichen sicheren Standards verwendet,
            wie es f&uuml;r den Mailempfang eine
            Selbstverst&auml;ndlichkeit ist. Wieder muss zur
            Nutzung des SMTP-Servers ein Benutzername und Kennwort
            &uuml;bermittelt werden. Einige Provider m&ouml;chten
            das sogar &uuml;ber eine SSL-verschl&uuml;sselte
            Verbindung machen. Das hierbei noch jemand unbefugt mit
            dem Mailversand arbeiten kann, ist nahezu
            ausgeschlossen. Alles wird protokolliert und es
            l&auml;sst sich exakt zur&uuml;ck verfolgen, welcher
            Rechner wann welche EMail versendet hat. Das komplette
            Verfahren wird auch mit SMTPAuth bezeichnet.
            L&auml;ngst nicht alle EMailprogramme unterst&uuml;tzen
            schon diese Technik. Zumindest in der Windows- und
            Linuxwelt gibt es aber spezielle Erweiterungstools, die
            keinen anderen Zweck erf&uuml;llen, als dem eigenen
            SMTP-Server die Authentifizierung zu &uuml;bermitteln.
            So werden auch &auml;ltere EMailprogramme mit der
            sicheren Technik wieder nutzbar.</DD>
          </DL>

          <P>Wer also mal &auml;rgerliche EMails gesendet bekommt,
          dass er Viren oder Spam versendet haben soll und dann
          sich ein neues EMailkonto sucht, sollte von Anfang an
          darauf achten, dass er keinen Scheunentor-offenen
          SMTP-Server zum Versand seiner elektronischen Post
          bekommt.</P>

          <P>Euer Higgins<BR>
           Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

