<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat wieder etwas zu sagen</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size= "7"> <B>Erfolgreich bei
          Frauen</B></FONT></P>

          <P>Mal ehrlich, wer w&uuml;rde, nachdem er von der URL
          Erfolgreichbeifrauen.de geh&ouml;rt hat, nicht gleich zur Maus greifen, um
          auf die solcherma&szlig;en Erfolg Versprechende Seite zu surfen? Umso
          gr&ouml;&szlig;er die Entt&auml;uschung: Hier werden nicht etwa sinnvolle
          Verhaltenstipps zur Eroberung der s&uuml;&szlig;en Nachbarin gegeben. Nein,
          hier will einem eine findige Gesch&auml;ftemacherin(!) lockende Duftstoffe
          verscherbeln.</P>

          <h3 align="center"><A href="st_erfolg1.html" target="_top">
          <B>&lt;www.erfolgreichbeifrauen.de&gt;</B></A></h3>
          <HR>

          <H2><B>Das sagt die Presse &uuml;ber Pheromone</B></H2>

          <H3>Fernsehsendung "Welt der Wunder" Pro7 - Schwerpunktthema: Liebe</H3>

          <P>100 Millisekunden reichen aus. Danach wei&szlig; unser K&ouml;rper, ob
          wir den Gegen&uuml;ber m&ouml;gen oder nicht, oder ob wir vielleicht sogar
          unsterblich verliebt sind. Die Liebe auf den ersten Blick ist ein
          Ph&auml;nomen, das viele schon erlebt haben.</P>

          <P>Jetzt haben Psychologen die wissenschaftliche Erkl&auml;rung daf&uuml;r.
          Ausschlaggebend sind nicht nur Aussehen und Charakter, sondern auch Geruch
          des Partners.</P>

          <P>Sind wir verliebt, sch&uuml;ttet die Hypophyse Sexualhormone aus. Im
          Gehirn sind vor allem die Bereiche, die f&uuml;r das Erkennen eigener
          Gef&uuml;hle, f&uuml;r soziale Kontakte und das Mitgef&uuml;hl
          zust&auml;ndig sind, aktiviert. Agressionen, Stress, Angst und Depressionen
          werden unterdr&uuml;ckt. Wir haben die ber&uuml;hmten Schmetterlinge im
          Bauch ...</P>

          <P>(Entnommen der Website &lt;"<B>www.wunder.de</B>"&gt;)</P>
          <HR>

          <P><IMG src="st_erfolg1m.jpg" alt="Stern-Titelbild" hspace="6" align="left"
          width="170" height="235"> <FONT size="+1"><B>DIE BOTENSTOFFE DER
          LIEBE</B></FONT><BR> STERN Ausgabe 18 vom 25.04.1996, Seite 16 <I>von Gerd
          Schuster</I></P>

          <P>Bei Tieren kennt man sie schon l&auml;nger -jetzt wei&szlig; man, dass
          auch das Verhalten des Menschen von kaum wahrnehmbaren Substanzen gesteuert
          wird.</P>

          <P>Wissenschaftler finden immer neue Beweise, dass diese in der Haut
          produzierten, meist geruchlosen Pheromone &uuml;ber Lust und Liebe,
          Sympathie und Sex entscheiden.</P>

          <P>Napoleon Bonaparte fasste sich kurz. 'Ne te lave pas, je reviens',
          schrieb er in einer Depesche aus dem Feldlager an Kaiserin Josephine,
          'Wasch Dich nicht mehr, ich komme bald zur&uuml;ck.' Der geniale
          Schlachtenlenker besa&szlig; offenbar ein untr&uuml;gliches Gesp&uuml;r
          daf&uuml;r, dass bei Liebe und Sex die Nase eine Schl&uuml;sselrolle
          spielt. Jetzt, 200 Jahre sp&auml;ter, k&ouml;nnen Forscher das Verhalten
          des kleinen Korsen wissenschaftlich erkl&auml;ren: Das Riechorgan
          erschn&uuml;ffelt nicht nur bet&ouml;rendes Parf&uuml;m oder
          absto&szlig;enden K&ouml;rpermief, es kann auch geheimnisvolle Lock- und
          Botenstoffe orten, die Pheromone.</P>

          <P>Sie steuern beim Menschen viele Emotionen, sexuelle Anziehung wie
          Partnerwahl. Obwohl sie meist geruchlos sind und nur in winzigsten Spuren
          durch die Luft schweben, bestimmen sie, wer uns sympathisch ist und wer
          nicht. Und sie stekken wie unsichtbare Kuppler hinter der Liebe auf den
          ersten Blick, die strenggenommen '<EM>Liebe auf den ersten Riecher</EM>'
          hei&szlig;en m&uuml;sste. Auch an den sprichw&ouml;rtlichen
          Fr&uuml;hlingsgef&uuml;hlen sind die erst in den letzten Jahren entdeckten
          Botenstoffe beteiligt. Wenn der Winter vorbei ist, Mantel und M&uuml;tze
          eingemottet sind und kein Schnupfen mehr die Nase verstopft, kommt ihre
          gro&szlig;e Zeit. Ungehindert k&ouml;nnen die geheimen Verf&uuml;hrer jetzt
          aus den Dekolletes entweichen. Ihre volle Wirkung entfalten sie, wenn sie
          in eine '<EM>fremde</EM>' Nase wehen und dort auf das 'Vomeronasalorgan'
          treffen. Das nur einen Zentimeter lange und streichholzd&uuml;nne
          Sinneswerkzeug, das ein holl&auml;ndischer Milit&auml;rarzt bereits Anfang
          des 18. Jahrhunderts beschrieb, haben die Forscher erst vor kurzem
          wiederentdeckt. Prof. Werner Langthaler, Psychologe an der Universit&auml;t
          M&uuml;nster: 'Es ist eine Sensation, dass wir jetzt, schon fast im Jahr
          2000, einen neuen menschlichen Sinn aufsp&uuml;ren' (siehe Kasten Seite
          26). Ohne das VNO, so die g&auml;ngige Abk&uuml;rzung f&uuml;r den
          Zungenbrecher, l&auml;uft auch im Tierreich nichts. Seiden&auml;ffchen und
          Graskarpfen, Blaukrabben und Ameisen verstr&ouml;men Pheromone zur
          Markierung von Reviergrenzen, zur Warnung vor Feinden, als chemische
          'Erkennungsmarke', als Liebesverlockung, Rangabzeichen und f&uuml;r viele
          Zwecke mehr. Bienenk&ouml;niginnen hemmen mit Pheromonen die
          Geschlechtsreife der Arbeiterinnen und bringen die Drohnen zum
          Schw&auml;rmen. W&auml;hrend sich ganze Forscherbrigaden mit Tierpheromonen
          besch&auml;ftigen, ist &uuml;ber die menschlichen Lockstoffe bis heute
          wenig bekannt. Man wei&szlig; noch nicht einmal, wie sie produziert werden.
          Viel spricht jedoch daf&uuml;r, dass es in der Haut geschieht, dem
          gr&ouml;&szlig;ten und komplexesten Organ des menschlichen K&ouml;rpers,
          das den Wissenschaftlern noch viele R&auml;tsel aufgibt: Auf einem einzigen
          Quadratzentimeter dr&auml;ngen sich im Durchschnitt sechs Millionen Zellen,
          5000 Sinnesk&ouml;rper, 100 Schwei&szlig;- und 15 Talgdr&uuml;sen, dazu 200
          Schmerzpunkte, zehn bis 25 Druckpunkte, zw&ouml;lf K&auml;lte- und zwei
          W&auml;rmepunkte. Vier Meter Nervenfasern und ein Meter
          Blutgef&auml;&szlig;e stellen Vernetzung und Versorgung sicher. Die
          wichtigsten Pheromon-Fabriken sind die Achselh&ouml;hlen. Ihre
          Schwei&szlig;dr&uuml;sen mischen eine Reihe von Lockstoffen an. Die
          Substanzen werden beim Transpirieren ausgeschieden und auf der erhitzten
          Haut verdampft. Was aber ist daran blo&szlig; attraktiv? Und was hat das
          mit Liebe und Sex zu tun? Schwei&szlig;dr&uuml;sen in der Achselgegend sind
          nur w&auml;hrend der Zeit t&auml;tig, in denen der Mensch
          vermehrungsf&auml;hig ist. Sie nehmen ihre Arbeit erst in der Pubert&auml;t
          auf und stellen sie in den Wechseljahren wieder ein. Und nicht umsonst
          liegt beim '<EM>Kuscheln</EM>' der Kopf und damit die Nase der Frau meist
          in unmittelbarer N&auml;he der m&auml;nnlichen Achselh&ouml;hle.
          'K&ouml;rperlicher Kontakt ist f&uuml;r die &Uuml;bertragung von Pheromonen
          unerl&auml;sslich', sagt der Anatomie-Professor Charles Wysocki,
          renommierter Lockstoff-Forscher der Universit&auml;t Philadelphia. 'Die
          Riech- und Reichweite der Pheromone betr&auml;gt h&ouml;chstens ein paar
          Zentimeter.' Dicke Kleidung blockiert also die fl&uuml;chtigen Liebesboten,
          die als feiner Dunstschleier auf unserer Haut liegen wie
          Fr&uuml;hlingsnebel &uuml;ber einer Blumenwiese. H&auml;ufiges Waschen
          d&uuml;nnt die Pheromone aus oder vertreibt sie ganz. Genau das wollte
          Napoleon verhindern. 'Randvoll mit Pheromonen', so der Neurophysiologe Luis
          Monti-Bloch von der University of Utah in Salt Lake City, ist die vom
          Au&szlig;enrand der Nasenfl&uuml;gel zu den Mundwinkeln verlaufende
          Nasolabialfurche. Und genau in sie sto&szlig;en beim K&uuml;ssen die
          Nasenspitzen der Schmuser hinein. Professor Monti-Bloch: 'Wahrscheinlich
          ist der Kuss ein Ritual, das vor allem dem Erschn&uuml;ffeln von Pheromonen
          dient.' Beim galanten Handkuss sei das 'ganz offensichtlich.' Der Liebesakt
          ist f&uuml;r die Psychologin Winnifred Cutler aus Haverford bei
          Philadelphia ein regelrechtes Pheromon-Bad. Die Forscherin hat
          festgestellt, dass Frauen, die mindestens einmal pro Woche mit einem Mann
          schlafen, eine regelm&auml;&szlig;igere Periode haben als enthaltsame
          Geschlechtsgenossinnen. F&uuml;r diesen Effekt sind aber offenbar weder
          Mann noch Sex verantwortlich, sondern allein die m&auml;nnliche Duftaura:
          Frauen, denen Cutler mehrere Wochen lang t&auml;glich einen alkoholischen
          Auszug aus m&auml;nnlichem Achselschwei&szlig; unter die Nase tupfte,
          bekamen auch ohne Herrenbesuch und Z&auml;rtlichkeit einen
          regelm&auml;&szlig;igeren Zyklus. Ganz spezielle Lockstoffe scheinen den
          Geschlechts-organen zu entstr&ouml;men. 'Die Spitze des Rattenpenis
          produziert ein eigenes Pheromon', sagt Clive Jennings-White von der
          Universit&auml;t von Utah in Salt Lake City, 'warum sollte das beim
          Menschen anders sein?' Bisher habe man bei der Ratte 35 verschiedene
          Pheromone entdeckt. 'Ich glaube kaum, dass wir Menschen weniger besitzen.'
          In f&uuml;nfj&auml;hriger Detektiv-arbeit entdeckte der Forscher 25
          verschiedene Botenstoffe des Homo sapiens und entschl&uuml;sselte ihre
          Chemie. Auch Substanzen, die den Geschlechtstrieb anregen, waren dabei.
          'Aber dar&uuml;ber reden wir nicht!' sagt David Berliner. Der
          66j&auml;hrige, fr&uuml;her Anatomie-Professor an der Universit&auml;t von
          Utah, leitet die Pheromon-Firmen 'Pherin' und 'Realm' in Kalifornien. Bei
          'Pherin' forschen auch die Experten Jennings-White und Monti-Bloch. 'Was
          wir entdeckten', sagt Berliner, 'werden wir nur als Medikamente vermarkten,
          etwa gegen Impotenz oder St&ouml;rungen des Geschlechtstriebes auf keinen
          Fall aber als Aufputschmittel.' Ohnehin sei nicht zu erwarten, dass
          Menschen unter dem Einfluss der Substanzen &uuml;bereinander herfielen wie
          m&auml;nnliche Motten &uuml;ber ein mit weiblichen Lockstoffen
          getr&auml;nktes St&uuml;ck L&ouml;schpapier. Zumal die Pheromon-Palette
          au&szlig;er Aphrodisiaka auch Substanzen umfasst, die unsympathisch machen.
          Wenn man jemanden 'nicht riechen' kann, dann sind Absto&szlig;ungspheromone
          und ein nat&uuml;rlicher Schutzmechanismus schuld. Deutsche wie
          amerikanische Forscher wiesen nach, dass man Menschen instinktiv ablehnt,
          wenn deren Immun-Gene den eigenen sehr &auml;hnlich sind. Die Natur will
          damit nicht nur Inzest verhindern, sondern auch ausschlie&szlig;en, dass
          Nachkommen entstehen, deren Immunschutz gef&auml;hrliche L&uuml;cken
          aufweist. Dieser Mechanismus wirkt unfehlbar, denn obwohl die
          Pheromon-Produktion von Stimmung, Gesundheitszustand und Alter
          abh&auml;ngig ist, besitzt jeder Mensch eine unverwechselbare eigene
          Pheromon-Aura. Diesen 'chemischen Ausweis' machen sich offenbar Suchhunde
          beim Aufsp&uuml;ren von Vermissten ebenso zunutze wie S&auml;uglinge bei
          der Suche nach der Brustwarze ihrer Mutter. Schon am zweiten Lebenstag
          k&ouml;nnen sie die richtige Milchquelle an ihrem Geruch beziehungsweise an
          ihren Pheromonen erkennen. Bereits Spuren von Pheromon f&uuml;hren das Baby
          gesteuert vom Vomeronasalorgan dabei zum Ziel. Das menschliche VNO ist nach
          Meinung von Luis Monti-Bloch &auml;hnlich leistungsf&auml;hig wie das von
          Hund und Katze. Der Professor: 'Unser VNO ist rund tausendmal empfindlicher
          als unser Geruchssinn.' D ie Lockstoffe wirken, so Monti-Bloch, &uuml;ber
          das VNO auf den Hypothalamus. Das ist ein Teil des Zwischenhirns, der die
          wichtigsten Vorg&auml;nge im Organismus regelt K&ouml;rperw&auml;rme,
          Geschlechtstrieb, Fettstoffwechsel, Schlaf, Blutdruck und Atmung. Im Test
          haben die Substanzen bisher 20 verschiedene Stoffwechselvorg&auml;nge
          beeinflusst binnen Sekundenbruchteilen. Die Entdeckung der menschlichen
          Pheromone und ihres Zielorgans ist ein Wissenschafts-Krimi voller
          Zuf&auml;lle, gl&uuml;cklicher F&uuml;gungen und beharrlicher
          Detektivarbeit. Er beginnt im Jahre 1960. Damals hatte sich David Berliner
          als junger Anatomie-Professor in den Kopf gesetzt herauszufinden, welche
          Chemikalien in der Haut steckten. In der Universit&auml;tsklinik von Salt
          Lake City kratzte er Hautzellen aus den abgelegten Gipsverb&auml;nden der
          Skifahrer, die sich an den steilen Bergen rings um die Mormonenstadt die
          Knochen gebrochen hatten. Berliner: 'Wir sto&szlig;en rund 1000 Zellen pro
          Quadratzentimer Haut und Stunde ab. In den Gipsbeinen war viel zu finden.'
          Er laugte die Zellen mit L&ouml;semitteln aus. Den Extrakt lie&szlig; er in
          offenen Flaschen im Labor stehen. 'Ich dachte ja nicht im Traum daran, dass
          das Zeug fl&uuml;chtig sein k&ouml;nnte!' Zur allgemeinen Verbl&uuml;ffung
          machten sich in dem normalerweise von Hader und Hektik erf&uuml;llten Labor
          urpl&ouml;tzlich Ruhe und Frieden breit. Die vorher undenkbare Harmonie
          ging sogar so weit, dass die Forscher nach dem gemeinsamen Lunch Bridge
          spielten. Als Berliner jedoch die Flaschen mit dem Hautextrakt verschloss,
          war die Kollegialit&auml;t wie weggeblasen. 'Von Stund' an redete niemand
          mehr von Bridge!' Die Vermutung, die unbekannte Chemikalienmischung habe
          etwas mit dem Stimmungsumschwung zu tun, erschien Berliner damals
          v&ouml;llig abwegig. Menschliche Pheromone waren noch nicht bekannt, und er
          selbst brachte seinen Studenten bei, Erwachsene bes&auml;&szlig;en kein
          VNO. Der Forscher packte seine Extrakte mit den Hautzellen in die
          K&uuml;hltruhe und konzentrierte sich aufs Geldverdienen. Mitte der 80er
          Jahre entdeckte der Elektronenmikroskopist David Moran von der University
          of Colorado in Denver sein Interesse an der Feinstruktur des Nasengewebes.
          Der Chef der Hals-Nasen-Ohren-Abteilung, Professor Bruce Jafek, mit dem er
          zusammenarbeitete, erz&auml;hlte ihm ganz nebenbei, dass sich einer seiner
          Studenten mit dem VNO beim F&ouml;tus besch&auml;ftigte. Moran und Jafek
          fragten sich, ob sich das Organ tats&auml;chlich zur&uuml;ckbilde, wie es
          bis heute miserabel belegt in den meisten Lehrb&uuml;chern steht.
          Kurzentschlossen machten sie die Probe aufs Exempel, suchten mit Mikroskop
          und viel Licht und fanden bei jedem ihrer mehr als 200 Patienten das VNO.
          Die Gr&ouml;&szlig;e seines Eingangs in der Nasenschleimhaut schwankt
          zwischen zwei Millimetern und mit blo&szlig;em Auge nicht mehr
          wahrnehmbaren 0,2 Millimetern. Von dem Gr&uuml;bchen f&uuml;hrt ein wenige
          Millimeter langer Gang voller Rezeptorzellen in das Organ, das konisch wie
          eine Eist&uuml;te ist. Anfang 1990 erinnerte sich Berliner an seinen seit
          einem Vierteljahrhundert eingefrorenen Hautzellenextrakt. Er hatte alle
          Ver&ouml;ffentlichungen &uuml;ber VNO und Pheromone aufmerksam verfolgt,
          wollte nun wissen, ob seine Substanzen auf dieses Organ wirkten und wandte
          sich an Monti-Bloch. Der war zun&auml;chst &uuml;beraus skeptisch,
          entwickelte aber dann ein Ger&auml;t, das im VNO durch Reize erzeugte
          elektrische Impulse messen und per Computer als eine Art VNO-EKG
          aufzeichnen sollte. Eine haarfeine Silberelektrode f&uuml;hrt direkt in die
          &Ouml;ffnung des VNO. Umgeben ist sie von einem Mantel, durch den eine
          Pheromon-Luft-Mischung in das Organ geleitet werden kann. Monti-Bloch
          testete das Ger&auml;t an der Riechschleimhaut, die in der Nase rund
          f&uuml;nf Zentimeter &uuml;ber dem VNO sitzt. W&uuml;rzte er den Luftstrom
          mit Duftstoffen, gab es einen Ausschlag. Das VNO hingegen machte auch bei
          den st&auml;rksten D&uuml;ften keinen elektronischen Mucks. Erst Berliners
          Hautextrakte erweckten es zum Leben. Seit f&uuml;nf Jahren l&auml;uft nun
          die Forschung der von Berliner gegr&uuml;ndeten Firmen in Kalifornien auf
          Hochtouren. Besonders wenn sie die Wirkung neu entdeckter Botenstoffe
          testen, erleben die Forscher &Uuml;berraschungen. Anstatt bei einer
          Substanz liebestoll zu werden wie Kater, die eine rollige Katze wittern,
          machte sich bei einer Gruppe von Versuchspersonen tiefe Entspannung breit.
          Verwundert registrierte Monti-Bloch, dass sich Herzschlag und Atmung der
          Probanden verlangsamten und sich ihre Muskeln lokkerten. 'Pheromone haben
          bei uns Menschen eben auch andere Aufgaben als zum Sex zu stimulieren',
          sagt Berliner. 'Soziale Pheromone', die zwischenmenschliche Beziehungen
          verbesserten, seien doch 'ein Geschenk des Himmels'. Clive Jennings-White
          hat bereits mehr als 100 k&uuml;nstliche Pheromone hergestellt. Er nennt
          sie Vomeropherine. Sie wirken oft st&auml;rker als die nat&uuml;rlichen
          Stoffe. Der Chemiker: 'Das Potential ist gigantisch! Deshalb lassen wir wie
          verr&uuml;ckt patentieren.' Berliner: 'Ich bin sicher, dass uns diese
          Forschung unglaubliche M&ouml;glichkeiten zur Behandlung von Krankheiten
          er&ouml;ffnet.' K&uuml;nstliche Pheromone k&ouml;nnten als
          Appetitz&uuml;gler, Verh&uuml;tungsmittel und Angstl&ouml;ser eingesetzt
          werden. Als erstes werde man jedoch ein Mittel gegen Prostatakrebs
          entwickeln. Grundlage sei ein Vomeropherin, das die Testosteron-Produktion
          im K&ouml;rper des Kranken stoppe. Sinkt die Menge des Geschlechtshormons
          im Blut, schrumpft der Krebs. Nebenwirkungen seien nicht zu erwarten, da
          der Patient nicht mit Drogen und Hormonen vollgepumpt werden m&uuml;sse,
          sondern lediglich an dem Medikament 'rieche'. Berliner hat bisher f&uuml;nf
          Millionen Dollar in die Forschung gesteckt. Das n&ouml;tige Kleingeld
          verdient er mit seiner Parf&uuml;mkreation 'Realm'. Das mit zwei
          synthetischen menschlichen Pheromonen versetzte Duftwasser soll beim
          Tr&auml;ger eine milde Euphorie erzeugen und so ein Anbandeln mit dem
          anderen Geschlecht ohne Nervosit&auml;t und Stress erm&ouml;glichen. Die
          Essenz, als Herren- und Damenversion im Handel, scheint zu wirken, denn sie
          verkauft sich bestens. Das 'Wall Street Journal' meldete Ende 1995, Realm
          sei in der Kaufhauskette Bloomingdales zum '&Uuml;berraschungs-Hit'
          avanciert. Dem runden Dutzend Konkurrenten auf dem internationalen Markt
          f&uuml;r Pheromon-Parf&uuml;ms wirft der Pherin-Boss vor,
          'Schweine-Pheromone' zu verh&ouml;kern. Und er hat recht: Die meisten
          W&auml;sserchen sind laut Deklaration mit Androstenon verquirlt, einem
          Eber-Pheromon. Und das wirkt beim Menschen nicht. Keine Frage, dass wir
          alle ein Vomeronasalorgan besitzen', sagt Professor Hans Hatt,
          Zellphysiologe der Universit&auml;t Bochum. 'Jeder Hals-Nasen-Ohren-Arzt,
          der genau hinschaut, kann es finden.' Bereits im Jahre 1703 wurde es von
          einem holl&auml;ndischen Milit&auml;rarzt bei einem Soldaten mit einer
          Gesichtswunde entdeckt. Dennoch billigen die meisten
          Anatomie-Lehrb&uuml;cher noch immer nur dem Embryo im Mutterleib ein
          Vomeronasalorgan (VNO) zu. 'Diesen Unsinn haben wir schon vor Jahren
          widerlegt', sagt Professor Luis Monti-Bloch, Neurophysiologe der
          Universit&auml;t of Utah in Salt Lake City. 'Jeder gesunde Mensch hat pro
          Nasenloch ein VNO. Das Organ ist auch beim Erwachsenen voll
          funktionsf&auml;hig und durch Nervenbahnen mit dem Gehirn verbunden.'
          Monti-Bloch konnte zudem nachweisen, dass bislang beim Menschen wenig
          erforschte Lockstoffe, sogenannte Pheromone, durch Stimulierung des VNO
          unter anderem Herzschlag, Atmung, Hauttemperatur und Hormonhaushalt
          beeinflussen. Der Pheromonforscher Clive Jennings-White sieht das VNO als
          'unser am meisten untersch&auml;tztes Organ'. F&uuml;r den Chemiker, wie
          Monti-Bloch an der Universit&auml;t in Salt Lake City t&auml;tig, sind wir
          'Pheromon-Tiere': 'Nicht umsonst haben wir ein gr&ouml;&szlig;eres VNO als
          das Pferd.' David Berliner, einer der Entdekker der geheimen
          Verf&uuml;hrer, stuft das VNO gar als 'unseren drittwichtigsten Sinn' ein.
          'Er kommt direkt nach Sehen und H&ouml;ren noch vor dem Tast- und dem
          Geruchssinn. Denn die chemische Kommunikation spielt auch bei uns Menschen
          eine Schl&uuml;sselrolle.' Das VNO reagiert blitzschnell auf jeden
          Pheromonhauch: Bereits nach einer zehntausendstel Sekunde sind
          physiologische Ver&auml;nderungen messbar. Monti-Bloch: 'Ein Beweis, dass
          vom VNO Nervenbahnen direkt zum Gehirn f&uuml;hren; denn nur sie
          k&ouml;nnen eine derart rasche Reaktion bewirken.' Das best&auml;tigt
          Psychologie-Professor Werner Langthaler von der Universit&auml;t
          M&uuml;nster: Monti-Bloch habe klar 'bewiesen, dass das VNO &uuml;ber
          Reizleitungen mit dem Gehirn verbunden ist'. Der winzige Detektor f&uuml;r
          die Lockstoffe in unserer Nase ist so empfindlich, dass viele hochmoderne
          Analyseger&auml;te M&uuml;he h&auml;tten, mitzuhalten. Die VNO der
          Versuchspersonen von Monti-Bloch sprachen bereits auf 30 Pikogramm Pheromon
          an das sind 30 Millionstel Teile eines Milliardstel Milligramm.</P>
          <HR>

          <P>Aus wissenschaftlicher Sicht:<BR>
          <B>Gibt es menschliche Pheromone?</B><BR>
          M&uuml;nch. med. Wochenschrift 125 Nr. 30 Jahrg. 1983</P>

          <P>Die Befunde waren nicht v&ouml;llig &uuml;berraschend. Dass das
          moschusartig riechende D-16-Steroid 5a-Androst-16-en-3a-ol im Urin des
          Menschen, insbesondere des Mannes, in erheblichen Mengen ausgeschieden
          wird, ist schon l&auml;nger bekannt (Brooksbank u. Haslewood 1950;
          Brooksbank u. Gower 1970; Cleveland u. Savard 1964). Neuere Arbeiten
          zeigten nicht nur, dass die Hoden des Mannes die Produktionsst&auml;tte
          sind, sondern auch, dass weitreichende &Uuml;bereinstimmungen im Ablauf der
          Biosynthese zum Eber bestehen (Ruokonen 1973; Ruokonen u. Vihko 1974; Gower
          1972; Gower u. Bicknell 1972). Messungen der Urinkomponente
          5a-Androst-16-en-3-on im Blutplasma von M&auml;nnern ergaben
          Konzentrationen, die denen des "typischen" Hodensteroids Testosteron kaum
          nachstehen (Claus u. Alsing 1976). Auch im Fettgewebe des Mannes lassen
          sich erhebliche Konzentrationen dieses Steroids nachweisen (Claus u. Alsing
          1976), w&auml;hrend D-16-Steroide im menschlichen Speichel nicht
          vorzukommen scheinen (Brooksbank u. Mitarb. 1974) wie auch (in Mengen bis
          zu fast 100 ng je "Stunde und Achselh&ouml;hle") das schwei&szlig;artig
          riechende Steroid 5a-Adrost-16-en-3-on (Claus u. Alsing 1976).</P>

          <P>Die Gesamtheit solcher Befunde- mit teilweise frappierenden
          &Auml;hnlichkeiten zur Spezies Schwein -stimuliert naturgem&auml;&szlig;
          die Frage nach einer m&ouml;glichen Funktion. Als Hinweis m&ouml;gen
          Befunde gewertet werden, dass z.B. im Theater oder im Zahnatztwartezimmer
          jene Sitze von Frauen bevorzugt eingenommen werden, die mit dem
          Moschussteroid 5a-Androst-16-en-3a-ol impr&auml;gniert waren (Kirk-Smith u.
          Booth 1980). Ob die Tatsache, dass Sellerie in erheblichen Mengen des
          D-16-Steroids 5a-Androst-16-en-3-on enth&auml;lt (Claus u. Hoppen 1979), in
          irgendeinem Zusammenhang zum Ruf des Selleries als Aphrodisiakum steht, ist
          unbekannt. Auch die erheblichen Menfgen des Moschussteroids
          5a-Androst-16-en-3a-ol im Tr&uuml;ffel (Claus u. Mitarb. 1981)
          erkl&auml;ren zwar, warum (besonders weibliche) Schweine diese Delikatesse
          im Boden aufsp&uuml;ren: f&uuml;r diese Spezies ist die Wirkung als
          Pheromon nachgewiesen. Die Meinung des Gourmets Brillat-Savarin jedoch,
          dass Tr&uuml;ffel die Frauen z&auml;rtlicher mache, l&auml;&szlig;t nicht
          ohne weiteres weitergehende Schl&uuml;sse zu. Dass den menschlichen
          Schwei&szlig;dr&uuml;sen, insbesondere im Bereich der Achselh&ouml;hlen,
          sexuelle Signalwirkung zugeschrieben wird (Comfort 1971; Brody 1975), zeigt
          hingegen Paralellen zu Freilandbeobachtungen bei Gorillas; hier soll der
          m&auml;nnliche Gorilla durch Pheromone aus der Achselh&ouml;hle die
          Weibchen stimulieren (Hess 1973). Im Blutplasma eines m&auml;nnlichen
          Gorillas (Claus, unpubl. Ergebnisse) konnte das Steroid 5a-Androst-16
          -en-3-on in&nbsp; Konzentrationen nachgewiesen werden, wie sie denen im
          Blutplasma von Ebern und vom Mann entsprechen.&nbsp;</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

