<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Programmierer gesucht</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="apc0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="apc.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#000080">
        <TR>
            <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <BR>
            <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Programmierer gesucht</FONT></B></H1>
            <BR>

            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#FF00FF" WIDTH="80%">
            <TR>
                <TD>
                <BR>
                <H2 ALIGN="CENTER">WANTED !</H2>

                <P>Wir suchen f&auml;hige Profi- oder Hobby-Programmierer, die mit ihrem
                Hobby nebenbei einen sch&ouml;nen Batzen Geld verdienen wollen. Und das auf
                ganz legale Art und Weise. Vielleicht habt Ihr ja schon mal ein Programm
                oder Game geschrieben. Dann habt Ihr jetzt gar keine Arbeit mehr, sondern
                k&ouml;nnt Euch jetzt in Ruhe zur&uuml;cklehnen und Money scheffeln.<BR>
                <BR>
                Wir suchen st&auml;ndig f&auml;hige Programmierer, deren Programme wir
                auf faire Art und Weise vertreiben k&ouml;nnen. Das besondere an der Sache
                ist, das der Programmierer nicht wie &uuml;blich betrogen wird, sondern
                eine faire Beteiligung je verkauften Produkt erh&auml;lt. Und diese
                Beteiligung betr&auml;gt grunds&auml;tzlich immer 50% des Gewinns. Und noch
                etwas besonderes gibt es bei unserem Vertriebssystem: Der Programmierer
                beh&auml;lt immer das alleinige Urheberrecht. Wir wollen nur ein
                Vertriebsrecht. Der Programmierer gibt also seine Rechte am Programm nicht
                ab!<BR>
                <BR>
                Wir vertreiben jede Art von Programmen, solange sie Qualit&auml;t
                vorweisen k&ouml;nnen. Die Erstellung des Handbuches und der Verpackung
                &uuml;bernehmen nat&uuml;rlich wir. Logisch ist nat&uuml;rlich auch, das
                wir versuchen werden, soviel Gewinn wie nur m&ouml;glich herauszuschlagen.
                An Updates wollen wir kein Geld verdienen, deshalb bieten wir f&uuml;r alle
                registrierte User einen kostenlosen Updateservice und eine Hotline an. Der
                Programmierer erh&auml;lt nat&uuml;rlich auch eine genaue
                Kostenkalkulation.<BR>
                <BR>
                Wollt Ihr nun noch mehr und genauere Informationen erhalten, so schreibt
                uns doch einfach oder ruft doch einfach mal an (t&auml;glich ab ca. 20
                Uhr).<BR>
                <BR>
                Wir suchen nat&uuml;rlich auch Programmierer, Grafiker, Soundfreaks oder
                gleich ganze Programmiererteams f&uuml;r eigene Projekte.<BR>
                <BR>
                Aber auch wenn man sein Urheberrecht verkaufen will, ist man bei uns an
                der richtigen Adresse. Schreibt doch einfach mal. Einen Mark die sich
                lohnt!<BR>
                <BR>
                APC&amp;TCP-Vertrieb, Dorfstra&szlig;e 17, D-83236 &Uuml;bersee,
                08642/899953<BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            <BR>
            </TD>
        </TR>

        <TR>
            <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
