<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Preisliste</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="apc0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="apc.html" ALT="zur&uuml;ck">
        </MAP> 

        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#000080">
        <TR>
            <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="4" SUMMARY="" BGCOLOR="#FF00FF">
            <TR>
                <TD>
                <BR>
                <PRE>
   PREISAENDERUNGEN VORBEHALTEN !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


                           APC&amp;TCP

                        Andreas Magerl

                  Dorfstra&szlig;e 17, D-83236 &Uuml;bersee
                       Tel. 08642/899953
                     Mailbox: 08642/1336
                        (Online 24 h)


     Bankverbindung: Sparkasse &Uuml;bersee, Blz: 71052050 KtNr: 777631


    Versandkosten stehen unter den allgemeinen Gesch&auml;ftsbedingungen.



(Clubmitglieder erhalten auf alle Artikel au&szlig;er die mit # gezeichneten
 Artikel einen fairen Rabatt.Lest Euch dazu bitte den Infotext
 &uuml;ber die Rabatte und die allgemeinen Gesch&auml;ftsbedingungen)


--&gt; = Kn&uuml;llerangebot! (Sehr Kurzfristig!!!) Nur SOLANGE VORRAT REICHT
#   = Kein Rabatt auf diesen Artikel m&ouml;glich!



       Aktuelle Preisliste Nr. 15 vom 23.8.1994 f&uuml;r Endkunden



Alle Preise unverbindlich. Preis&auml;nderungen &amp; Druckfehler vorbehalten.
Alle Preise zzgl. Versandkosten.


EIGENE PRODUKTE:


0001 Databench, die ultimative Datenbank. Viel Leistung  DM 50.00
     f&uuml;r wenig Geld. Inkl. kostenlosen Updateservice.
     Updates kostenlos gegen OriginalDisk &amp; frankierten
     R&uuml;ckumschlag. Demoversion erh&auml;ltlich !

     Hier einige Features in Kurzform:

     - Verwaltet bis zu 500 Millionen Datens&auml;tze.
     - Bis zu 64 Felder (Bald noch mehr)
     - Sieben verschiedene Feldtypen (incl. IFF, BOOL, FORMEL ect.).
     - Einbindung von IFF-Bildern, ASCII-Texten und Programmen.
     - Extrem schnelles Suchen (innerhalb 1sec.).
     - Verschiedene Sortieralgorithmen.
     - Serienbrieffunktion
     - Etikettendruckfunktion
     - Umfangreiche Editierm&ouml;glichkeiten (Einf&uuml;gen,Ausschneiden,Kopieren ect)
     - Komplexe Filterfunktionen (Mit Jokerzeichen und Verkn&uuml;pfungen).
     - Bis zu f&uuml;nf Dateien gleichzeitig im Speicher (bald mehr).
     - Kleine Realition zwischen den Dateien.
     - ARexx-Port.
     - Umfangreiche Voreinstellungen.
     - Import/Export aus anderen Datenbanken.
     - Passwortschutz und Nur-Lese-Zugriff.
     - Zahlreiche M&ouml;glichkeiten zur Ausgabe auf Drucker,Bildschirm oder Datei.
     - Zahlreiche vorgefertigte Masken.
     - Zahlreiche Hilfsprogramme(Texteditor,Leseprogramm,Maskeneditor uvm.).
     - Kostenlose Hotline
     - Kostenlose Updates gegen DM 3,00 (inkl. Disks &amp; Porto).
     - Und nat&uuml;rlich vieles, vieles mehr.
     - Mit dem Erweiterungspaket f&uuml;r Databench wird es eine Datenbank mit
       richtiger Relation.





0003 Games Tips &amp; Tricks Datenbank auf Disk f&uuml;r Amiga.   DM 15.00
     &Uuml;ber 10.000 Cheats, Tips&amp;Tricks f&uuml;r &uuml;ber 1.000 Games.
     inklusive kostenlosen Updateservice. Updates gegen
     OriginalDisks &amp; frankierten R&uuml;ckumschlag.
     Demoversion mit alten Tips&amp;Tricks(!!) auf der InfoDisk!





0004 Intromaker von Eric Hambuch                         DM 15.00
     Eindlich selbst eigene Intros erzeugen k&ouml;nnen.
     Wurde sogar im Amiga-Magazin getestet! Und die fanden
     ihn sehr brauchbar !!


0005 NoCover das Club-Diskettenmagazin Einzelausgabe     DM  5.00#
     auf dem Amiga. Inklusive  Inlandsversandkosten
     (2 Disks!!)

     Hei&szlig;e Tests, Workshops, Diskussionen und vieles mehr sind in diesem
     DiskMag vereint. Es ist keines der &uuml;blichen "Szene-Mags".
     Nein hier werden KEINE Raubkopien getestet, sondern nur Originale.
     Aber auch PD-Soft wird hier nicht vernachl&auml;&szlig;igt. Im Gegenteil!
     Soviel Informationen &uuml;ber PD-Soft findet man in fast keinen anderen
     Magazin. Selbst komerzielle Zeitschriften k&ouml;nnen hier von der
     aktualit&auml;t nicht mithalten! Wie sollten sie auch. Schlie&szlig;lich haben
     wir als einer der ersten die PD-Software in der Hand.
     Mit DF&Uuml; besch&auml;ftigt sich die NoCover nat&uuml;rlich auch regelm&auml;&szlig;ig.

     Hier kann jeder mal seinen Frust lo&szlig;lassen, wenn er sich mal wieder
     &uuml;ber irgendeine Firma oder H&auml;ndler aufgeregt hat.
     Jeder kann mitschreiben!
     Einfach einen Text auf DISKETTE an uns schicken oder in unserer
     Mailbox uploaden!
     Dabei ist v&ouml;llig egal, um was es in diesen Text geht, solange er
     einfach gut ist.

     Na, was ist? Schon einen Text an uns abgeschickt?
     Na dann wirds aber Zeit!

     Die NoCover erscheint regelm&auml;&szlig;ig jeden 1. des Monats.





0006 NoCover Jahresabo (= 12 Ausgaben je 2 Disks
     inklusive Inlandsversandkosten)                     DM 50.00





0007 Info&amp;InhaltsDisks APC&amp;TCP Computerlub &amp;
     APC&amp;TCP-Vertrieb, System Amiga.Inkl.InlandPorto     DM  5.00
     Oder gegen  3 LeerDisk &amp; frankierten R&uuml;ckumschlag



     Auf unserer InfoDisks findet Ihr immer alle aktuellen Informationen
     &uuml;ber unserem Club sowie alle aktuellen Angebote, Informationen,
     PD-Listen und vieles mehr.
     Au&szlig;erdem noch die privaten Kleinanzeigen unserer Mitglieder sowie
     unsere aktuelle KontakteDatenbank.
     Diese Disks wird t&auml;glich erg&auml;nzt, ge&auml;ndert und erweitert. Also immer
     mitbestellen !





0008 PD-Soft EinzelDisks. Jede PD-Disk f&uuml;r Amiga nur     DM  1.50#


     Wir f&uuml;hren neben den bekannten Serien wie z.B. Fish, Spielekiste,
     nat&uuml;rlich auch Exclusivserien, wie die APC&amp;TCP-Computerclub-Serien.

     Aber nat&uuml;rlich f&uuml;hren wir noch eine Anzahl weiterer Exclusivserien,
     wie z.B. :

     - APC&amp;TCP-FD
     - APC&amp;TCP-Shareware
     - Soundmodule
     - PD-Games
     - DigiBilder
     - Digi-Bilder (ab 18)
     und vieles mehr.

     Eine genaue Inhaltsliste unserer PD-Serien ist auf unseren InfoDisks
     vorhande.


0009 Digi-Serie SAM.Amiga.(Ab 18, gegen Altersnachweis)  DM  1.50#

0010 1990-93er Edition. Ben&ouml;tigt 1 MB RAM                DM 45.00
     Das tolle Polit-Strategiespiel, das von der
     Amiga-Joker mit "HOCHPROZENTIG" gek&uuml;hrt wurde.
     Ben&ouml;tigt 1 MB RAM. Demoversion erh&auml;ltlich !

     NEU !1990-93`er Edition ist ein faszinierendes Strategiespiel, bei dem
     Sie versuchen m&uuml;ssen vom Parteigr&uuml;nder zum Bundeskanzler aufzusteigen.
     Doch Vorsicht! Schneller als man denkt, ist das Parteileben auch schon
     wieder beendet, der Pleitegeier droht. Stellen Sie sich ein eigenes
     Parteiprogramm zusammen, halten Sie Reden, besuchen Sie Talkshows,
     versuchen Sie die Presse zu beeinflu&szlig;en.
     Wollen Sie sich von der Industrie unterst&uuml;tzen lassen oder setzen Sie
     auf das Agieren in diversen &Auml;mtern, z.B. als nationaler
     Greenpeace-Vorsitzender, als Innenminister eines Landes oder als
     Bundesbankpr&auml;sident. Doch auch Wahlkampfveranstaltungen wollen
     abgehalten werden- und wehe Sie passen Ihre Rede nicht den
     Gegebenheiten vor Ort (Umweltsch&auml;den, Arbeitslosigkeit ect.) an.
     1990-Die 93`er Edition enth&auml;lt realistische Daten von allen 16
     Bundesl&auml;ndern sowie die derzeitigen politischen konstellationen.
     Auch alle Namen sind authentisch.
     1990-93`er Edition ist ein w&uuml;rdiger Nachfolger von der 92`er Edition.
     Nat&uuml;rlich wurden viele Verbesserungen vorgenommen.!
     Die Grafik wurde gewaltig aufpoliert und einige sehr gute Sounds sind
     auch noch neu dabei!
     Und nat&uuml;rlich ist 1990-93`er Edition auch auf den Amiga 1200
     lauff&auml;hig, was nat&uuml;rlich f&uuml;r alle anderen Amigamodelle auch gilt&uuml;g
     1990-93`er Edition ist f&uuml;r Amiga &amp; PC erh&auml;ltlich!
     Die Amiga-Version ben&ouml;tigt mind. 1 MB Ram und
     unterst&uuml;tzt 2 Laufwerke ebenso wie eine Festplatte.

     In der Amiga Joker 5/93 wurde 1990-93`er Edition wie folgt beurteilt:

     Grafik:    41 %
     Musik:     54 %
     Sound-FX   29 %
     Handhabung:        68 %
     Dauerspa&szlig;: 74 %
     Variabel:  5 Stufen
     Gesamtnote:        69 %  Hochprozentig !

     Ein Update von der 1990-92er Edition auf 1990-93er Edition ist
     f&uuml;r DM 20.00 + OriginalDisk 92er bei uns erh&auml;ltlich.
     Bitte nur Vorkasse!
0011 Tautrix, das tolle Denkspiel im Tetrisstiel         DM 19.00
     Demoversion erh&auml;ltlich.
     Es kann ganz sch&ouml;n s&uuml;chtig machen !
     Aber was soll ich hier lange erkl&auml;ren?
     Schaut Euch am besten einmal die Demoversion an.
     Die gibts nat&uuml;rlich gegen LeerDisk &amp; R&uuml;ckporto bei uns!





0012 Adressenmanager (Eine Databench-Light-Version)      DM 19.00
     Hier k&ouml;nnen Sie in einer vorgegebenen Maske
     Ihre Adressen komfortabel verwalten, ausdrucken,
     sortieren, filtern usw.
     Bei dieser Adressenverwaltung handelt es sich um 
     nichts anderes als um eine eingeschr&auml;nkte
     Databench-light-Version.
     Hier k&ouml;nnen Sie in einer festen Maske Ihre Adressen eingeben und
     speichern, sortieren, filtern, suchen, drucken, tabellieren usw.

     Ein gigantisches Programm, f&uuml;r jemanden, der nur ein Programm zum
     Adressen verwalten ben&ouml;tigt.

     Databench-Oberfl&auml;che mit (fast) allen Vorz&uuml;gen und Features der
     Spitzen Datenbank.
0013 Databench Erweiterungspaket.                        DM 19.00
     Mit diesem Programm wird die Databench zur
     Relations-Datenbank
     Und das zu einem Spitzenpreis.
     Kinderleichte Installation!
     Mit DEUTSCHER ANLEITUNG! Die gesamte Software in DEUTSCH !





0014 1990 - Das Spiel zum Superwahljahr 94 (PC-Version)  DM 69.00
0015 Markt &amp; Technik Amiga Magazin Disks Abo. je Disk    DM  1.50#
     Automatisch immer die neusten Disks ins Haus.
     zzgl. Versandkosten.
     Endlich kann man auch bei uns die Amiga-Magazin-PD-Disks von
     Markt &amp; Technik bei uns im Abo haben.
     Man bekommt dann immer automatisch alle neuen Disks zugeschickt!
     Auf dieser Disk befindet sich &uuml;brigends auch eine Gesamtliste der Serie.
     Einfach an uns schreiben und schon habt Ihr Euer Abo.
     Aber unbedingt angeben, ab wann Ihr es haben wollt !

0016 SaarAG-Abo je Disk zzgl. Versandkosten              DM  1.50#
     Immer die Neusten SaarAG-Disks automatisch
     zum Superg&uuml;nstigen Preis ins Haus.
     Die PD-Serie Saar-AG kann man mit der Fish-Serie
     vergleichen, nur das meist etwas aktueller ist, da
     sie innerhalb Deutschlands zusammengestellt wird!

     Im Ausland Preis auf Anfrage! Was ist ein SaarAG-Abo? Die SaarAG-Serie
     ist die bekannteste und aktuellste PD-Serie die es momentan aus
     Deutschland gibt.
     Sie ist bis jetzt noch nicht von einer anderen Serie &uuml;bertroffen worden.
     Einen Nachteil hat sie allerdings! Die Disketten erscheinen nicht
     regelm&auml;&szlig;ig! Mal alle 4 Wochen, dann wieder alle 6 oder 8 Wochen.
     Mal gibts 10 neue Disks, mal gibts 20 neue Disketten. Ein weiterer
     Nachteil ist, das alle komerziellen Zeitschriften meist 20bis30
     Disks hinten dran sind.
     Das gilt auch f&uuml;r die meisten H&auml;ndler. Bei uns ist das anders. Bei einem
     Abo bei uns bekommt man bis auf Widerruf automatisch immer die
     aktuellsten SaarAG-Disks zugeschickt und man bezahlt per Rechnung.

0017 FishAbo je Disk zzgl. Versandkosten                  DM 1.50#
     Diese PD-Serie mu&szlig; eigentlich nicht mehr erkl&auml;rt
     werden, da sie ja schon eine Legende ist.
     Im Ausland Preis auf Anfrage! Was ist ein Fish-Abo? Die Fish-PD-Serie
     ist die bekannteste und aktuellste PD-Serie die es momentan gibt.
     Sie ist bis jetzt noch nicht von vielen Serien &uuml;bertroffen worden.
     Einen Nachteil hat sie allerdings! Die Disketten erscheinen nicht
     regelm&auml;&szlig;ig! Mal alle 4 Wochen, dann wieder alle 3-4 Monate.
     Mal gibts 20 neue Disks, mal gibts 30 neue Disketten. Ein weiterer
     Nachteil ist, das alle komerziellen Zeitschriften meist 20bis30
     Disks hinten dran sind.
     Das gilt auch f&uuml;r die meisten H&auml;ndler. Bei uns ist das anders. Bei einem
     Abo bei uns bekommt man bis auf Widerruf automatisch immer die
     aktuellsten Fish-Disks zugeschickt.
0018 Spielekiste Abo (Immer die aktuellen Disks) Je Disk  DM  1.50#
     zzgl. Versandkosten. Es erscheinen monatlich
     ca. 20 bis 30 Disks. Die ultimative Serie f&uuml;r
     Spielefreaks. Vollgestopft mit Top-Games !
     Die Spielekiste ist eine PD-Serie aus Berlin, die nur Spiele beinhaltet.
     Dabei schaut der Willi sehr darauf, das wirklich nur Qualit&auml;t auf diese
     bereits schon legend&auml;re Serie kommt.
     Das tolle dabei finde ich, das der "einfache User" endlich EINE (!) Serie
     hat, wo er alles an Spielen findet, was sein Herz begehrt!
     Wir haben jetzt die Spielekiste auch in unserem Angebot und bekommen sie
     auch recht aktuell.
     Nat&uuml;rlich bieten wir diese Serie ebenso wie andere Serien im Abo an!
     Auf dieser Disk befindet sich &uuml;brigends auch eine Gesamtliste der
     Spielekiste und der Spielekiste Extra.
     Schaut sie Euch an und Ihr seid davon &uuml;berzeugt!
0019 Virenkiller-Abo. Ca. alle 4 Wochen bekommt man       DM 40.00#
     eine aktuelle Disk mit den neusten Virenkillern.
     Dadurch ist man immer optimal gesch&uuml;tzt.
     Das Abo dauert 12 Disks inkl. Inlandsversandkosten !
     SCHUETZEN SIE SICH IMMER VOR VIREN. VIREN KOENNEN IHR
     GESAMTES SYSTEM unwiederbringlich ZERSTOEREN!!!!!!!!!
     MIT ALTEN VIRENKILLERN KOENNEN SIE SICH NICHT SCHUETZEN,
     DA DIESE NICHT DIE NEUSTEN VIREN, DIE FAST TAEGLICH
     ERSCHEINEN, ERKENNEN KOENNEN !!!!!!!!!!!!!!!!!!!!!!

     Das Virenkiller Abo, das wir anbieten, ist einfach sensationell!
     Das wir eine eigene VirenkillerDisk mit den aktuellsten Virenkillern
     haben ist ja bekannt. Aber jetzt haben wir diese Disk auch als Abo
     und jetzt auch noch aktueller.

     Die besten Virenkiller/Checker auf einer Disk, die z.Z. ca. monatlich
     aktualisiert wird. Dadurch ist man erst optimal gesch&uuml;tzt.
     Ein alter Virenkiller hilft ja einem recht wenig. T&auml;glich entstehen
     neue und t&auml;glich enstehen neue Virenkiller.

     Gegen einen Virus sollte man sich immer sch&uuml;tzen.
     Jeder, der schon einmal einen Virus in seinem System hatte, wird
     nie wieder ohne Virenkiller arbeiten. Und er WEI&szlig; warum!!!!

     Vertrauen ist gut!  Kontrolle ist besser ! Viruskiller sind die besten !
0020 INFOX, das gigantische Computermagazin im            DM  6.00#
     DinA 4 Format. Hier findet man brandaktuelle Infos
     und alles was man in den &uuml;blichen Zeitschriften nicht
     findet. Preis inklusive Inlands-Versandkosten !!!

     ----------------------------------------------------------------------
     INFOXINFOXINFOXINFOXINFOXINFOXINFOXINFOXINFOXINFOXINFOXINFOXINFOXINFOX
     ----------------------------------------------------------------------

     Ja  Leute, die InfoX ist ein NICHTkommerzielles DIN-A4 "Papermag", das
     schon  (oh Wunder) fast 3 Jahre ueberlebt hat!  Gut fuers Scheisshaus,
     falls  das Papier ausgehen sollte, ueberregional, als Hobby von vielen
     Szene-Freaks  und  Clubs  gemacht!  Wir bieten gute Stories, Berichte,
     Interessante    Szene-News,    einen    riesen   Anzeigen   Pool   mit
     Kommunikationsrubriken!   Jeder  kann  mitmachen  und uns Zeichnungen,
     Berichte  und  Anzeigen  schicken!   Macht  Euch auf was gefasst, denn
     gerade  weil  die  Beitraege  von  den  Lesern  kommen,  wird  nie ein
     Kommerzielles  Magazin an unserem verrueckten Schreibstiel herankommen
     ;-)  Hier  kann  jeder  Computer  Freak  seinen  Frust  von  der Seele
     schreiben,  neue  Kontakte  schliessen,  Hilfe  bei  Problemen suchen,
     Sachen Tauschen oder Verkaufen, Geschichten lesen oder einfach nur mal
     ein  bischen  "Fun"  haben!  (Lachkrampf wird mitgeliefert) Zweimal im
     Jahr  treffen  wir  uns dann zum Kennenlernen auf Computer-Messen oder
     Feten.
0021 INFOX Abo = 5 Ausgaben inkl. Inlandsversandkosten    DM 30.00#



Amiga Laufwerke:

   Laufwerk 3,5" f&uuml;r Amiga 2000 intern                  DM 119.00
   Laufwerk 3.5" f&uuml;r Amiga 500/+ intern                 DM 119.00
   Laufwerk 3.5" f&uuml;r Amiga 600/1200 intern              DM 129.00
   Laufwerk 3.5" f&uuml;r alle Amiga, extern                 DM 129.00
   HD-Doppellaufwerk extern 3.5",                       DM 529.00
   CD ROM-DRIVE A570 f&uuml;r A500/+(ben.1MBChipRAM)         DM 199.00





Amiga Ram Karten:

   RAM Board 512 KB f&uuml;r Amiga 500 intern            DM  59.00
   RAM Board 2 MB f&uuml;r Amiga 500                     DM 239.33
--&gt;RAM Board 1 MB f&uuml;r Amiga 500+                    DM  65.00#
   RAM Board 1 MB f&uuml;r Amiga 600 (ChipRam)           DM  99.99
   RAM Board max. 4 MB mit 0 MB f&uuml;r Amiga 1200      DM 199.00
   RAM Board 4 MB f&uuml;r Amiga 1200                    DM 559.00

Amiga-M&auml;use &amp; Joysticks:

   Vector Maus+,Mauspad,Maushalter,290 DPI Microschalter  DM  46.00
   Opto-Maus Volloptische Maus ohne Kugel, dadurch
   kein mechanischer Verschlei&szlig;, incl. Mauspad            DM  79.00
--&gt;Maus-Pad, f&uuml;r alle mechanischen M&auml;use                  DM   2.00#





Sonstiges:

--&gt;Kickstart ROM 1.3                                       DM  15.00#
   Kickstart ROM 2.0x                                      DM  55.00#
--&gt;Vector Kickstart UmschaltplatineROM/ROM A500/+/2000     DM  29.00#
   Vector Kickstart UmschaltplatineROM/ROM/ROM A500/+/2000 DM  39.00
   Vector Kickstart UmschaltplatineROM/ROM Amiga600/600HD  DM  39.00
--&gt;Nullmodemkabel                                          DM  15.00#

--&gt;QUANTUM 170 MB Festplatte                               DM 329.00#
Amiga-Software:

--&gt;Steinbergers Hotelmanager (nur 1 LW m&ouml;glich!!!)          DM  15.00#
--&gt;Eye of the Behoulder                                     DM  15.00#
--&gt;Indiana Jones last Cruscade                              DM  20.00#
--&gt;The Return of Medusa, Deutsch                            DM  15.00#
--&gt;Knights of the Crystilion                                DM  15.00#
--&gt;Super Scramble                                           DM  10.00#
--&gt;Ooops up                                                 DM  10.00#
--&gt;Atomino                                                  DM  10.00#
--&gt;The Game of life                                         DM  10.00#
--&gt;TV Sports Football                                       DM  10.00#
--&gt;Blade Warrior                                            DM  10.00#
--&gt;Microprose Soccer                                        DM  10.00#
--&gt;Maniac Mansion                                           DM  10.00#
--&gt;Night Shift                                              DM  10.00#
--&gt;MUDS (gebraucht)                                         DM  10.00#
--&gt;Hunt for red October                                     DM   5.00#
--&gt;Hyperforce (gebraucht)                                   DM   5.00#
--&gt;Galaxy 89 (gebraucht)                                    DM   5.00#
--&gt;Anarchy (gebraucht)                                      DM   5.00#
--&gt;Data Becker Datamat Datenbank (gebraucht)                DM  15.00#
--&gt;Data Becker Textomat (only Kick 1.3) (gebraucht)         DM  10.00#
--&gt;PageSetterII (gebraucht)                                 DM  15.00#
--&gt;The Publisher (Artists Choice, ClaeFonts, LaserScript,
   Kind Words 2.0,) (gebraucht)                             DM  15.00#
Allgemeine Gesch&auml;ftsbedingungen:


Lieferbedingungen:

Lieferung und Verkauf erfolgt solange Vorrat reicht. Der
Zwischenverkauf bleibt vorbehalten. Bei Lieferungen im Versand
behalten wir uns die M&ouml;glichkeit der Teillieferung vor.



Zahlungsbedingungen.

Wir liefern im Versand an Erstkunden grunds&auml;tzlich per Nachnahme.
Ansonsten ist der Rechnungsausgleich unmittelbar und ohne jeden
Abzug zu erfolgen. Eine Abnahmepflicht f&uuml;r Schecks besteht
grunds&auml;tzlich nicht.
Zahlungen per Scheck gelten erst vier Wochen nach deren Gutschrift
als erf&uuml;llt.



Zahlungsverzug und Mahnungen.

F&uuml;r Anschreiben anl&auml;&szlig;lich mangels Deckung retournierender Schecks
oder offener Rechnungen erheben wir eine Aufwandspauschale von
DM 10.00. Bei fruchtloser Verstreichung einer darin gesetzten
Frist erfolgt ohne weitere Mahnung Abgabe an ein
Inkasso-Institut.
Eigentumsvorbehalt:

Die Ware bleibt bis zur vollst&auml;ndigen Bezahlung unser Eigentum, die
Lieferungen erfolgen unter verl&auml;ngertem Eigentumsvorbehalt.



Versand:

Der Innlandsversand erfolgt mit der Deutschen Bundespost.
Die Versand-, Versicherungs- und Verpackungskosten werden beim
Endkunden generell Pauschall abgerechnet. Diese betragen beim
Versand mit der Deutschen Bundespost innerhalb Deutschland bei 
Bezahlung per Vorkasse DM 5.00, per Einzugserm&auml;chtigung DM 5.00,
per Rechnung DM 5.00, per Nachnahme DM 7.00.
Versand ins Ausland ist generell nur per Vorkasse DM 15.00
m&ouml;glich. Versand per USP ist gegen Kostenaufschlag m&ouml;glich.
Der Versand bei Wiederverk&auml;ufern erfolgt gegen die tats&auml;chlichen
Versandkosten zzgl. eine Pauschale f&uuml;r Verpackung wahlweise
durch die Deutsche Bundespost oder UPS.
Gesch&auml;fte mit Wiederverk&auml;ufern:

Als Grundlage f&uuml;r solche Gesch&auml;fte ist ein Nachweis als H&auml;ndler
in der Computerbranche zu erbringen.
Alle im Verkehr mit Wiederverk&auml;ufern gemachten Preise verstehen
sich in DM zzgl. der jeweils g&uuml;ltigen gesetzlichen Mehrwertsteuer
je St&uuml;ck.



Garantiebestimmungen:

Wir gew&auml;hren auf alle Produkte 6 Monate Gew&auml;hrleistungsdauer.
Ausgenommen davon sind Verbrauchsartikel wie Disketten,
Farbb&auml;nder usw. sowie elektronische Bauteile.
Bei einem Fremeingriff, unsachgem&auml;&szlig;er Handhabung sowie
Besch&auml;digung unserer Garantiesiegel oder &auml;hnlicher Siegel erlischt
jeglicher Garantianspruch. An Wiederverk&auml;ufern k&ouml;nnen wir
lediglich die zehnt&auml;gige Auspackgarantie der Hersteller weitergeben.
Gebrauchte Artikel sind von allen Garantieanspr&uuml;chen ausgenommen!
PD-Software sind von allen Garantieanspr&uuml;chen ausgenommen!
F&uuml;r Sch&auml;den die durch Benutzung von Hardware oder Software entstehen,
k&ouml;nnen wir nicht Haftbar gemacht werden.
Reklamationen:

Bei Defekt senden Sie die beanstandete Ware mit einer Rechnungskopie
sowie einer Fehlerbeschreibung bitte FREI-HAUS. Nachnahmen oder
unfreie Sendenungen werden von uns verweigert.
Berechtigte Reklamationen verpflichten uns nach unserer Wahl zur 
Nachbesserung oder zur Ersatzlieferung. Bei Fehlschlagen der 
Nachbesserung erh&auml;lt der K&auml;ufer Anspruch auf Minderung des Kaufpreises
oder Wandelung. Eine weitergehende Haftung ist ausgeschlossen.
Bei unberechtigter Reklamation berechnen wir eine einmalige
Pauschalgeb&uuml;hr von DM 30.00. Die R&uuml;cksendekosten gehen dann
ebenfalls zu Lasten des Einsenders.

Preisgestaltung:

Wir behalten uns da Recht vor, das je nach Abnahmemenge Sonderpreise
kalkuliert werden.





Komissionsverk&auml;ufe:
 
Bei einem Verkauf per Kommission gelten unsere allgemeinen
Gesch&auml;ftsbedingungen. Die Ware bleibt bis zur vollst&auml;ndigen
Bezahlung unser Eigentum. Besch&auml;digte Ware wird nicht mehr
zur&uuml;ckgenommen und mu&szlig; bezahlt werden. Wird der R&uuml;cksendetermin
nicht eingehalten ist die gesamte gelieferte Ware zu bezahlen.
Die R&uuml;cksendekosten gehen zu Lasten des Kunden.

Erf&uuml;llungsort und Gerichtsstand:

Erf&uuml;llungsort und Gerichtsstand f&uuml;r alle Streitigkeiten aus
Vertr&auml;gen ist Traunstein. Es gilt ausschlie&szlig;lich deutsches Recht.




Rabatte f&uuml;r Computerclubmitglieder des APC&amp;TCP-Computerclubs:

Rabatte werden grunds&auml;tzlich nur f&uuml;r Mitglieder des APC&amp;TCP-
Computerclubs, Dorfstra&szlig;e 17, D-83236 &Uuml;bersee gew&auml;hrt.
Dabei mu&szlig; die Mitgliedsnummer immer angegeben werden.
Von den Rabatten sind grunds&auml;tzlich alle Artikel ausgeschlossen,
die irgendwie mit den #-Zeichen gekennzeichnet worden sind.
Die Rabattstaffelung kann jederzeit von uns ge&auml;ndert und
sogar wieder ganz aufgel&ouml;st werden.





Ratenverkauf:
Ist zur Zeit leider noch nicht m&ouml;glich.
Allgemeines:

Wir behalten uns jederzeit das Recht vor, Preis&auml;nderungen
vorzunehmen. Druckfehler und Irrt&uuml;mer vorbehalten, solange nicht
fahrl&auml;ssig gehandelt wurde.
Das Zeichen --&gt; bedeutet, das dieser Artikel nur bedingt lieferbar
ist und nur kurzfristig f&uuml;r diesen Preis erh&auml;ltlich ist.
M&uuml;ndliche Vetr&auml;ge und Abmachungen sind nicht verbindlich.
Verbindliche Abmachungen bed&uuml;rfen der Schriftform.
Zum Zwecke der Gesch&auml;ftsabwicklung haben wir Ihre Daten gespeichert.
Druckfehler &amp; Irrt&uuml;mer vorbehalten.


        HAENDLERANFRAGEN &amp; COMPUTERCLUBLEITERANFRAGEN ERW&Uuml;NSCHT !
                </PRE>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    <BR>
    </BODY>
</HTML>
