<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>DF&Uuml; f&uuml;r Einsteiger</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="dfu0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="dfu.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#803000">
        <TR>
            <TD><IMG SRC="dfu.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dfu0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#90C0C0" WIDTH="80%">
            <TR>
                <TD>
                <BR>
                <H2 ALIGN="CENTER"><B>DF&Uuml; f&uuml;r Einsteiger</B></H2>
                <BR>
                <P ALIGN="CENTER"><B>~~~~~~(Teil 1)~~~~~~<BR></B></P>
                <BR>
                <P>1.0 Einleitung<BR>
                <BR>
                Die Bedeutung der Software hat im Zeitalter der Computer, sei es
                AMIGA oder IBM-Kompatible, die Hardwar f&uuml;r viele Anwender
                in den Hintergrund treten lassen. Auf dem Gebiet der
                Telekommunikation ist es jedoch unbedingt erforderlich
                aureichende Kenntnisse &uuml;ber die Hardware zu besitzen, um
                die Software &uuml;berhaupt verstehen zu k&ouml;nnen. Daher wird
                hier die Hardware bewu&szlig;t vor der Software behandelt.<BR>
                <BR>

                2.0 Modems<BR>
                <BR>
                Das Wort Modem entstand aus der Zusammensetzung MODulator und
                DEModulator. Als Modulator wird hier eine Einrichtung
                bezeichnet, die digitale elektrische Signale in T&ouml;ne
                umwandelt. Hiermit wird bereits der Zeck von Modems
                angesprochen, die Verbindung von Computern &uuml;ber das
                Telefonnetz. Auf den ersten Blick erscheint die Verwendung von
                Modems als technischer Umweg, was auch begrenzt stimmt. Als
                Alternative zu Modems w&auml;re noch ein ISDN Anschlu&szlig;,
                mit dem extrem hohe &Uuml;bertragungsraten erziehlt werden
                k&ouml;nnen. Allerdings ist hiermit derzeit auch noch ein
                h&ouml;herer Kostenaufwand verbunden.<BR>
                <BR>

                Die Kommunikation von Computern und anderen Computern
                untereinander erfolgt fast immer &uuml;ber die seriellen
                Schnittstellen, die meist unter der Bezeichnung RS232 jedem
                Computernutzer mehr oder weniger bekannt sind. An diese
                Schnittstelle wird das Modem angeschlossen, welches seinerseits
                mit dem Telefonnetz verbunden ist.<BR>
                </P>
                <BR>
                <PRE>
    +-----------------------------------------------------------------+
    |     ________                                                    |
    |    | ______ |                                                   |
    |    ||      ||                                                   |
    |    ||______||                                                   |
    |   _|________|_                                                  |
    |  |-     == == |          _______              __                |
    |  |____________|=========|_______|-------------||                |
    |     Computer              Modem        Telefonsteckdose         |
    +-----------------------------------------------------------------+
                </PRE>

                <P>
                Ein direkter Anschlu&szlig; der seriellen Schnittstelle an
                die telefonleitung ist nicht m&ouml;glich, da die Signalformen
                und der Pegel nicht kompatibel sind. Auch bei ISDN
                Anschlu&szlig; ist eine ISDN-Card n&ouml;tig, die in den
                Computer eingebaut wird.<BR>
                Die umwnadlung der Signale zwischen Telefonleitung und serieller
                Schnittstelleerfolgt bei Modems auf direktem elektrischen Wg,
                daher spricht man auch von galvanischer Kopplung. Lediglich bei
                den veralteten Akustikkoplern erfolgt die Umwandlung nicht
                direkt, sondern durch akustische oder induktive &Uuml;bertragung
                zwischen Telefonh&ouml;rer und dem Koppler. Diese Ger&auml;te
                hatten in Europa aufgrund restriktiver Bestimmungen der
                Fernmeldeunternehmen zeitweise eine gewisse Verbreitung
                erfahren, seit der Zulassung privater Modems ist Ihre Bedeutung
                gleich Null. Von Spezialf&auml;llen abgesehen wird den Anwendern
                von so einer Anschaffung ernsthaft abgeraten.<BR>
                <BR>

                2.0.1 Eigenschaften<BR>
                <BR>
                Alle Modems sind durch zwei wesentliche Eigenschaften
                gekennzeichnet, die &Uuml;bertragungsgeschwindigkeit und den
                Befehlssatz. Diese beiden Eigenschaften werden weitgehend durch
                Normen festgelegt, um die Kommunikation der Modems untereinander
                und den Einsatz von Standardsoftware mit einheitlichen Befehlen
                zu erm&ouml;glichen.<BR>
                <BR>
                Befehlsatz<BR>
                <BR>
                Vor ein paar Jahren war es nicht selbstverst&auml;ndlich,
                da&szlig; ein Modem vollst&auml;ndig durch den Computer
                gesteuert werden kann. Das W&auml;hlen mu&szlig;te
                beispielsweise manuell durch ein Telefon oder durch eine
                Bedienhandlung am Modem erfolgen. Zur Automatisierung von
                Datenverbingungen werden jedoch Modems ben&ouml;tigt, die nach
                dem Erhalt entsprechender Befehle duch den angeschlossenen
                Computer selbst&auml;ndig Verbindungen auf- und abbauen
                k&ouml;nnen.<BR>
                <BR>
                Derartige Modems werden als intelligente Modems bezeichnet.
                Der Befehlssatz ist in zwei unterschiedlichen, nichtkompatiblen
                Normen definiert. Die eine Norm, als V.25bis bezeichnet, wurde
                durch die CCITT definiert. Die CCITT ist eine Unterorganisation
                der Vereinten Nationen, in der die meist staatlichen
                Fernmeldeunternehmen der UN-Mitgliedschaften vertreten sind. Die
                Abk&uuml;rzung CCITT steht f&uuml;r &quot;Consultative Commitiee
                on International Telegraphy and Telephony&quot;. Die von der
                CCITT beschlossene Norm V.25bis f&uuml;r die automatische Wahl
                konnte sich gegen&uuml;ber dem von der amerikanischen Firma
                HAYES eingef&uuml;hrten Befehlssatz nicht durchsetzen. Dieser
                Befehlssatz wurde in seinen Grundz&uuml;gen von praktisch allen
                anderen Firmen &uuml;bernommen, auch die staatlichen
                Fernmeldeunternehmen bieten heutzutage ihre Modems mit diesem
                Befehls satz an.<BR>
                <BR>

                &Uuml;bertragungsgeschwindigkeit<BR>
                <BR>
                Den Engpa&szlig; der Daten&uuml;bertragung stellt die
                &Uuml;bertragungsstrecke &uuml;ber das Telefonnetz dar. Durch
                neue und verbesserte Technik wurde im Laufe der Jahre die
                m&ouml;gliche &Uuml;bertragungsgeschwindikeit um mehr als das
                Achthundertfache (von 75bps bis 64000bps ISDN) gesteigert. Die
                Ma&szlig;einheit f&uuml;r die &Uuml;bertragung ist die Anzahl
                der &uuml;bertragenen Bits pro Sekunde, sie wird meist mit
                &quot;bps&quot; abgek&uuml;rzt. F&uuml;r die &Uuml;bertragung
                eines Zeichens, beispielsweise des Buchstaben &quot;Z&quot;,
                m&uuml;ssen im Normalfall 8 Bit sowie ein Start- und ein Stopbit
                &uuml;bertragen werden. Ein Bit kennt nur die Zust&auml;nde 0
                und 1, f&uuml;r den Buchstaben &quot;Z&quot; lautet die Bitfolge
                1011010. Ein Zeichen wird auch als Byte bezeichnet. F&uuml;r die
                &Uuml;bertragung eines Bytes werden in diesem Fall also 10 Bit
                ben&ouml;tigt, 8 f&uuml;r den Buchstaben &quot;Z&quot; sowie je
                ein Bit als Start- und Stopbit. Schlie&szlig;t man ein
                Oszilloskop an die serielle Schnittstelle des Computers an, so
                erh&auml;lt man bei der &Uuml;bertragung des Buchstaben
                &quot;Z&quot; folgendes Bild:<BR>
                </P>
                <BR>
                <PRE>
             +----------------------------------------+
             |                                        |
             |      ___     ___|___     ___           |
             |     |   |   |   |   |   |   |          |
             |  ___|   |___|       |___|   |____|     |
             |     Start 0   1   1   0   1  Stop|     |
             |      Bit                      Bit      |
             +----------------------------------------+
                </PRE>

                <P>
                Die Bits werden hierbei in umgekehrter Reihenfolge
                &uuml;bertragen. Die elektrischen Signalpegel liegen zwischen +3
                Volt und +15 Volt f&uuml;r 1 sowie zwischen -3Volt und -15 Volt
                f&uuml;r eine 0.<BR>
                <BR>
                F&uuml;r die &Uuml;bertragung auf der Telefonleitung m&uuml;ssen
                diese Bits in analoge Signale umgewandelt werden. Damit Modems
                untereinander kompatibel sind, wurden Signalformen international
                durch die CCITT genormt. Diese Normungen konnten sich
                erfreulicherweise weitestgehend durchsetzen, lediglich einige
                wenige Modemhersteller (ZyXEL oder USRobotics High Speed Modems)
                sind eigene Wege gegangen und implementierten in ihre Modems
                firmenspezifische L&ouml;sungen. Dar&uuml;ber hinaus existieren
                f&uuml;r niedrige &Uuml;bertragungsgeschwindigkeiten in den USA
                zwei Bell-Normen, die von den CCITT-Normen abweichen.<BR>
                <BR>
                Eine zweite M&ouml;glichkeit, die &Uuml;bertragungsrate zu
                erh&ouml;hen, ist die Komprimierung der Daten. Gelingt es
                beispielsweise, das Start- und Stopbit der einzelnen Bytes vor
                der &Uuml;bertragung auszuschlie&szlig;en, so kann der
                Datendurchsatz um mehr als 20% erh&ouml;ht werden. Diese
                Datenkompriemierung entstand bei der Einf&uuml;hrung von
                Ma&szlig;nahmen zur Sicherung der Datenverbindung gegen
                Leitungsst&ouml;rungen. Auch in diesem Fall f&uuml;hrte die
                Entwicklung einer amerikanischen Firma (Microcom) zu einem
                weltweiten Durchbruch. Durch die CCITT wurde nachtr&auml;glich
                eine Normung durchgef&uuml;hrt, welche auf den Standards der
                Firma Microcom aufbaut und mit diesem kompatibel ist.<BR>
                <BR>
                2.1.2 Internes oder externes Modem?<BR>
                <BR>
                Grunds&auml;tzlich bestehen 2 M&ouml;glichkeiten, einen
                Computer mit einem Modem auszustatten. Entweder wird ein
                externes Modem &uuml;ber ein Kabel an eine serielle
                Schnittstelle des Computers angeschlossen, oder es wird eine
                Steckkarte in den Computer eingebaut. Einbaumodems sind
                besonders bei tragbaren Computern (Laptop, Notebook) sowie bei
                IBM-kompatiblen (einfach: PCs) mit dem IBM XT/ AT Bus
                eingebaut.<BR>
                <BR>
                Ein Modem f&uuml;r diesen Bus befindet sich zusammen mit der
                seriellen Schnittstelle auf einer gemeinsamen Steckkarte.<BR>
                <BR>
                Zur erleichterung der Entschiedung zwischen internen und
                externen Modems sind nachfolgend die wesentlichen Vor- und
                Nachteile zusammengefa&szlig;t. Die Bewertungen m&uuml;ssen
                jedoch f&uuml;r jeden Anwendungsfall individuell
                durchgef&uuml;hrt werden.<BR>
                </P>
                <BR>
                <P>INTERNE MODEMs</P>

                <PRE>

            Vorteile                                Nachteile
+---------------------------------+--------------------------------------+
| Preiswerter als externe Modems  | Keine Kontrollanzeigen vorhanden     |
| Serielle Schnittstelle im Modem | Bei Computerwechsel Weiterverwendung |
| bereits enthalten               | nur bei gleichem Bus m&ouml;glich         |
| Verbindungskabel entf&auml;llt       | Schwieriges Austauschen bei Defekt   |
| Stromversorgung durch den PC    |                                      |
| Kein zus&auml;tzlicher Platzbedarf   |                                      |
+---------------------------------+--------------------------------------+
</PRE>

                <P>EXTERNE MODEMs</P>

<PRE>

           Vorteile                                Nachteile
+---------------------------------+--------------------------------------+
| Universell f&uuml;r alle Computer    | Stellfl&auml;che erforderlich             |
| einsetzbar                      | Kabel erforderlich (Computer &lt;-&gt; Mo- |
| bereits enthalten               | dem                                  |
| Gro&szlig;es Marktangebot             |                                      |
| Schnelle Austauschbarkeit bei   |                                      |
| Defekt                          |                                      |
+---------------------------------+--------------------------------------+

                </PRE>
                <BR>
                <P>
                FAZIT: Man ist mit einem externen Modem allemal besser dran,
                als mit einem internen. Das Interne w&uuml;rde sowieso nur
                f&uuml;r PC-User in Frage kommen, da es - meines Wissens nach -
                f&uuml;r den AMIGA keine Modemkarten gibt. Au&szlig;erdem kann
                man bei einem externen Modem leichter Feststellen, ob ein Defekt
                vorliegt oder nicht, durch die meist &uuml;bersichtliche Front
                mit Kontrollanzeigen.<BR>
                <BR>

                <P>Ende Teil 1.</P>

                <P ALIGN="RIGHT"><B>Costel Mincea.&nbsp;&nbsp;&nbsp;&nbsp;</B></P>
                <BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="dfu.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dfu0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

