<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Stopt den Rechnerkrieg!</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="dis0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="dis.html" ALT="zur&uuml;ck">
        </MAP>
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#D09090">
        <TR>
            <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
<!Innere Tabelle>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#D0F0C0" WIDTH="85%">
            <TR>
                <TD>
                <BR>
                <H3 ALIGN="CENTER">Stopt den Rechnerkrieg!</H3>
                <BR>
                <P>
                Hallo Leute !<BR>
                <BR>
                Ich m&ouml;chte mich heute mal zu dem leidigen Thema "Diskussion
                Amiga &lt;-&gt; PC" auslassen, welches ja bekanntlich auch in
                der NC seit Ausgabe 5 (leider ?) angeleiert wurde.<BR>
                Einleitend m&ouml;chte ich erw&auml;hnen, da&szlig; ich selbst
                seit &uuml;ber 5 Jahren begeisterter Amiga-Besitzer bin (A 500
                und seit ein paar Tagen A 2000), w&auml;hrend der Bundeswehrzeit
                an einem UNIX-Netzwerk gearbeitet habe und auch dienstlich ab
                und zu mit PCs (unter MS-DOS und Windows) zu tun habe. Ich
                glaube also, gen&uuml;gend Kenntnisse zu haben, um "mitreden" zu
                k&ouml;nnen.<BR>
                Ich verfolge die Diskussionen im Computer-Flohmarkt, in
                DF&Uuml;-Netzen unter Freunden und Bekannten und nat&uuml;rlich
                jetzt auch in der NC.<BR>
                <BR>
                Als Fazit m&ouml;chte ich sagen, da&szlig; sich das Ganze
                bereits l&auml;ngst totgelaufen hat und nichts mehr bringt. Die
                "&auml;lteren" Amiganer unter uns k&ouml;nnen sich sicherlich
                noch an die alten "Amiga ist besser als Atari"-Schlachten
                erinnern, welche auch &uuml;ber Jahre hinweg und ohne konkretes
                Ergebnis gef&uuml;hrt wurden. Vielmehr sollte man meines
                Erachtens die Diskussion auf ein bestimmtes Thema lenken,
                welches auch mit beiden Systemen zu tun hat. Aber dazu
                sp&auml;ter mehr. Erstmal m&ouml;chte ich Euch mit den Thesen
                konfrontieren, die mich zu o. g. Fazit bringen.<BR>
                </P>

                <TABLE BORDER="0" CELLPADDING="5" SUMMARY="" WIDTH="600" ALIGN="CENTER">
                <TR>
                    <TD VALIGN="TOP">1.:</TD>
                    <TD>Ein &uuml;berzeugter Amiga/PC-User l&auml;&szlig;t sich
                    wohl kaum dadurch zum Systemwechsel umstimmen. Oder glaubt
                    Ihr, da&szlig; sich ein &uuml;berzeugter BMW-Fahrer durch
                    Diskussionen zum Mercedes-Freak umbiegen l&auml;&szlig;t ?
                    Wohl kaum. Auch aus einem L&ouml;wen-Fan wird auf diese
                    Weise wohl nie ein FC-Bayern-Anh&auml;nger.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">2.:</TD>
                    <TD>Die f&uuml;r Mi&szlig;st&auml;nde verantwortlichen
                    Stellen werden sich durch die Diskussionen kaum ber&uuml;hrt
                    f&uuml;hlen. Commo wird seine Marktstrategien kaum
                    &auml;ndern, weil der Amiga bei PClern als Spielekiste
                    verschrien ist. Ebenso wird es Bill Gates einen Dreck
                    scheren, das Amiganer sein Betriebssystem bescheuert
                    finden.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">3.:</TD>
                    <TD>Die Diskussionen geraten ins L&auml;cherliche, weil sie
                    oft unsachlich, unfair und mit Halbwissen und Ger&uuml;chten
                    ausgetragen werden. Das Z-Netz ist hierf&uuml;r ein
                    (negatives) Beispiel. Dessen teilweise extrem niedriges
                    Niveau ist unter vielen DF&Uuml;lern bekannt.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">4.:</TD>
                     <TD>Durch die Diskussionen wird Platz (z. B. auf den
                     NC-Disx), Zeit (z. B. zum Schreiben der Beitr&auml;ge),
                     Geld (z. B. die Telefonrechnung der DF&Uuml;ler, die den
                     ganzen Nonsens downloaden &lt;m&uuml;ssen&gt;) sinnlos
                     verpulvert.</TD>
                </TR>
                </TABLE>
                <P>
                Dazu kommt noch, das mittlerweile wohl alle (Pseudo-) Vor- und
                Nachteile beider Systeme durchexerziert, x-mal Kaufpreise
                gegeneinander aufgerechnet, die h&ouml;here Anzahl vorhandener
                Spiele, Anwenderprogramme und Systemhacks ermittelt und die
                versteckten Fehler in den Betriebssystemen enttarnt wurden,
                soda&szlig; eigentlich fast jedem Computerfan das Ganze zum Hals
                und zu den Ohren wieder raush&auml;ngen m&uuml;&szlig;te.<BR>
                <BR>
                Au&szlig;erdem ist mir aufgefallen, das sich wohl kaum User
                irgendwelcher Systemeso leidenschaftlich "bekriegen", wie Amiga-
                und PC-User. Komischerweise k&ouml;nnen Archimedes-, Atari-,
                Sinclair-, C64 &amp; und andere CBM-User usw. ganz gut miteinander
                leben. Sicherlich kommt es auch hier zu Diskussionen und
                Reibereien, aber doch bei weitem nicht in dem Umfang, wie er
                hier praktiziert wird.<BR>
                <BR>
                Nun m&ouml;chte ich auf meine obengenannte Anregung, die
                Diskussion weg vom AMIGA&lt;-&gt;PC Hickhack hin zum konkreten
                Diskutieren eines BESTIMMTEN Bereiches zu lenken,
                zur&uuml;ckkommen.<BR>
                <BR>

                Es ist auffallend, da&szlig; auffallend viel vom Begriff
                MULTIMEDIA reden, aber auffallend wenig wissen, was das
                eigentlich bedeutet. Dieses Thema zu diskutieren, k&ouml;nnte
                wirklich vielen was bringen; z. B.:<BR>
                </P>

                <TABLE BORDER="0" CELLPADDING="5" SUMMARY="" WIDTH="600" ALIGN="CENTER">
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>neue Erfahrungen, was mit dem eigenen System machbar ist
                    (und was nicht)</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>neue Ideen f&uuml;r das eigene Arbeiten</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>evtl. Anregungen f&uuml;r Programmierer und Entwickler</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>einfach mehr "Miteinander" unter Computerfans</TD>
                </TR>
                </TABLE>

                <P>
                Wer sollte an einer solchen Diskussion beteiligt sein ?<BR>
                <BR>
                Zuerst br&auml;uchte man Leute, die MULTIMEDIA in ihrer Praxis
                anwenden und einsetzen (beruflich). Diese k&ouml;nnten dann z.
                B. klarstellen, was MULTIMEDIA eigentlich bedeutet.<BR>
                Dann nat&uuml;rlich Interessierte, die wissen wollen, worum es
                bei MULTIMEDIA geht.<BR>
                Und nat&uuml;rlich "Zaung&auml;ste", die mit ihren Meinungen,
                Anregungen und Ideen die Diskussion in Schwung bringen und am
                Laufen halten.<BR>
                <BR>

                An dieser Stelle m&ouml;chte ich nebenbei bemerken, da&szlig;
                mir der Begriff MULTIMEDIA auch nicht viel sagt und ich auch
                gern w&uuml;&szlig;te, "wo der Hase l&auml;uft".<BR>
                <BR>
                Nat&uuml;rlich soll dies nur ein Vorschlag sein, es gibt auch
                noch andere Themen, die system&uuml;bergreifend sind und eine
                wirklich interessante Diskussion ausl&ouml;sen k&ouml;nnten. Als
                Beispiele m&ouml;chte ich nur Stichpunkte wie Computerviren, die
                Zukunft in der Computer-Entwicklung oder Sinn und Unsinn der
                DF&Uuml; nennen.<BR>
                <BR>
                Also Leute - gebt Euch nen Ruck und macht Schlu&szlig; mit
                diesem Kleinkrieg. Wenden wir uns hin zu Diskussionen, die man
                wirklich als solche bezeichnen kann und die uns allen was
                bringen !<BR>
                </P>
                <BR>
                </TD>
            </TR>
            </TABLE>
<!Innere Tabelle>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

