<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Amiga-Sound - reichen 8-Bit denn nicht???</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="dis0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="dis.html" ALT="zur&uuml;ck">
        </MAP>

        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#007050">
        <TR>
            <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>

<!Innere Tabelle>

            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#60F0A0" WIDTH="85%">
            <TR>
                <TD>
                <BR>
                <H3 ALIGN="CENTER">Amiga-Sound - reichen 8-Bit denn nicht???<BR>
                """""""""""""""""""""""""""""""""""""""""</H3>
                <BR>
                <P>
                Von DOSEN-PC-Besitzern h&ouml;rt man heute ja immer wieder, da&szlig; sie
                ja so tollen 16-Bit Sound haben. Nun, das 16-Bit ja wohl
                besser ist als 8-Bit, da&szlig; wissen wir ja.<BR>
                <BR>
                Aber was n&uuml;tzt einem eine 16-Bit Soundkarte, wenn er keine
                Soundst&uuml;cke zum abspielen drauf hat??? Nichts. Da hat der Amiga
                seinen Vorteil: Da es in jedem Ger&auml;t die gleichen
                Soundf&auml;higkeiten gibt, ist es f&uuml;r die User viel leichter
                Musikst&uuml;cke zu erstellen und zu verbreiten, weil sie auf jedem
                Amiga Rechner lauff&auml;hig sind.<BR>
                <BR>
                Und wie gut die Soundst&uuml;cke sind, das wissen wir ja wohl alle.
                Die DOSEN-User sind ja so gierig auf unsere MODs. Also, wenn
                ein DOSEN-User von mir MOD-Soundst&uuml;cke will, ich w&uuml;rde ihm keine
                geben.<BR>
                <BR>

                Anders bei der DOSE: Da es f&uuml;r diesen Rechner eine vielzahl an
                Soundkarten gibt, und jeder Soundkartenhersteller sein eigenes
                S&uuml;ppchen kocht, ist es meistens ein Problem ein Soundmodul auf
                jeder Soundkarte laufen zu lassen.<BR>
                <BR>
                Beispiel: User1 ist musikalisch begabt, hat eine DOSE und kauft
                sich eine 16-Bit Soundkarte und macht gerade ein Musikst&uuml;ck. Er
                m&ouml;chte es User2 geben, der auch eine 16-Bit Soundkarte hat, aber
                von einem ganz anderen Hersteller. Nichts gewesen. User1 gibt
                nicht auf und gibt das Musikst&uuml;ck User3. Der hat aber nur eine
                8-Bit Soundkarte, also auch nichts. Was macht jetzt User1???
                Bringt er sich um oder wandert er aus? Nichts dergleichen...<BR>
                <BR>
                Er kauft sich einen Amiga, weil er auf diesem System jedem
                anderen User seine selbstkomponierten Musikst&uuml;cke geben kann.<BR>
                <BR>
                Auf dem Amiga kommt sicher einmal 16-Bit Sound. Aber dieser ist
                dann kompatibel zum 8-Bit Sound, d. h. das 8-Bit Soundmodule
                auch auf einem neuen Amiga-Rechner mit 16-Bit Sound laufen.<BR>
                <BR>

                Da mu&szlig; ich Commodore ein ganz dickes Lob aussprechen. Commodore
                versucht IMMER die Kompatibilit&auml;t zu halten. Im Gegensatz zu den
                DOSEN-Herstellern.<BR>
                <BR>
                Beispiel2: User 1 kauft sich eine 16-Bit Soundkarte und macht
                Soundst&uuml;cke. Der Hersteller dieser Soundkarte bringt die
                Erweiterte Version der Soundkarte raus, auch mit 16-Bit.
                User 1 kauft sich die neue Karte und will seine Soundst&uuml;cke, die
                er mit der alten Soundkarte vom gleichen Hersteller gemacht hat,
                abspielen. Und??? Nichts gewesen. Der Hersteller hat einfach
                "vergessen" die Karte kompatibel zu Vorg&auml;ngermodellen zu machen.<BR>
                <BR>
                Mal wieder ein Beispiel, wie veraltet das MS-DOS/Windows
                Computersystem ist. Wieder ein weiterer Grund (neben den anderen
                10.000 Gr&uuml;nde) sich KEINE DOSE zu kaufen (Was ich ja sowieso nie
                mache w&uuml;rde).<BR>
                <BR>
                Das ganze zeigt mal wieder, wie r&uuml;ckst&auml;ndig so eine DOSE ist.<BR>
                <BR>
                </P>
                <P ALIGN="RIGHT">Stefan Wunner&nbsp;&nbsp;&nbsp;&nbsp;</P>
                <BR>
                </TD>
            </TR>
            </TABLE>

<!Innere Tabelle>

            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
