<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>AMIGA &amp; KEIN PC</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="dis0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="dis.html" ALT="zur&uuml;ck">
        </MAP>

        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#007050">
        <TR>
            <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
        </TR>
        <TR>
        <TD>
        <BR>

<!Innere Tabelle>

        <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#60F0A0" WIDTH="85%">
            <TR>
                <TD>
                <BR>
                    <H3 ALIGN="CENTER">AMIGA &amp; KEIN PC</H3>
                    <H4 ALIGN="CENTER">[Udo Kastilan]</H4>
                    <BR>
                    <P>
                    Betrifft: "AMIGA &amp; PC", Axel Melzener, NoCover 5<BR>
                    <BR>
                    Tja, Axel, mit Deinem Textchen hatte ich ziemlich viel Spa&szlig;! Klar, er
                    war provokativ gedacht, aber so schlechte Argumente w&auml;ren doch
                    wirklich nicht n&ouml;tig gewesen!<BR>
                    <BR>
                    1. (Preisvergleich). Ich kann auch auf Mark &amp; Pfennig rechnen: Die
                    Zweitfloppy gibt`s schon lange f&uuml;r einen Blauen, und die Uhr kann
                    gestohlen bleiben! Macht summa sumarum 140 Mark weniger - der PC ist
                    damit nicht 112 Eier billiger, sondern 38 teurer. Eingesehen? Nein?
                    Okay, weiter! Der PC besitzt also doppelt soviel RAM und mehr als
                    doppelt soviel Festplattenkapazit&auml;t! Du hast beide Systeme. Dann schau
                    mal nach, was WINDOWS und MS-DOS so an Festplatte brauchen. Bestimmt
                    auch weniger als 5 MB, wie AMIGA-DOS? Die Software f&uuml;r die
                    IBM-Doch-So-Kompatiblen verschlingt absolut keinen Speicherplatz, ist
                    klein und bescheiden programmiert. Deine doppelt so gro&szlig;e Festplatte
                    wird ewig gen&uuml;gen. Bis da&szlig; der Tod Euch scheidet. Wozu mehr auf die
                    Platte packen als DOS, WINDOWS, Corel Draw und ein Spielchen? Reicht
                    doch v&ouml;llig. Eben.<BR>
                    <BR>

                    A propos doppelt soviel RAM. Saubere Einteilung in Chip- und Fastmem
                    ade! Wie w&auml;re es statt dessen mit etwas Base-Memory (640 kB), ein
                    bi&szlig;chen High Memory Area und ein wenig Extended Memory? Davon sind
                    unter MS-DOS im Prinzip nur die XT-haften 640 kB nutzbar. Toll, nicht?
                    Das erh&ouml;ht den Spiel- und Programmspa&szlig; auf den PCs erheblich, wenn mal
                    wieder die CONFIG.SYS ge&auml;ndert werden darf. Und die AUTOEXEC.BAT. Und
                    komm mir nicht mit anderen Betriebssystemen, die haben immer noch die
                    wenigsten! HIER ist "R&uuml;ckst&auml;ndigkeit pur" anwendbar. Viel Spa&szlig;
                    auch...<BR>
                    <BR>
                    2. (VOBIS). Richtig. Alle meine PC-Freunde sind von VOBIS unheimlich
                    begeistert. Tastatur defekt. Monitor defekt. Maus fehlt. Handbuch
                    doppelt, daf&uuml;r fehlt ein anderes. 4 Meg bestellt, 2 vorgefunden.
                    Unversch&auml;mte Bedienung beim Diskettenkauf...<BR>
                    Die haben wohl alle einen schlechten Tag erwischt? Nein, auf keinen
                    Fall, denn das sind alles nur Erfindungen von mir, dem "gefrusteten
                    Amigianer", der seine ganze Freizeit pers&ouml;nlichen Rachefeldz&uuml;gen gegen
                    VOBIS widmet. Ich hab` ja sonst nichts besseres vor. Auch die frische
                    SPIEGELMeldung &uuml;ber eine von VOBIS ausgetauschte Firmenfestplatte, die
                    kurze Zeit sp&auml;ter in einem angeblich fabrikneuen HIGHSCREEN auftauchte
                    (inklusive Gehaltslisten, Personaldaten, Insiderberichten,...),
                    entstammt meiner kranken Phantasie. Mannomann, sind wir AMIGA-User
                    fies...<BR>
                    <BR>

                    3. (Einsteigereignung). Na da haben wir`s doch! Ich wu&szlig;te es schon
                    immer. Mein System ist so verdammt umst&auml;ndlich und untersupported.
                    Arme Einsteiger, kauft Euch lieber einen PC. Was ich anfangs f&uuml;r
                    Probleme hatte, den Netzschalter zu finden! Oh jeh, tut Euch das nicht
                    an. Kauft keinen AMIGA. Es ist unzumutbar, wenn Programme gestartet
                    werden k&ouml;nnen, indem die Diskette beim Einschalten zuf&auml;llig im
                    Laufwerk liegt! Das verlangt viel zu viel Einarbeitungszeit. Naja, die
                    Disk mu&szlig; auch noch in der richtigen Richtung eingelegt werden!
                    Frechheit pur. Oder die Workbench! Unglaublich, mu&szlig; ein ahnungsloser
                    Einsteiger auch noch lernen, wie man per Maus einen Pfeil auf kleine
                    Bildchen f&auml;hrt. Und dann dieser Doppelklick! Das nervt. Schlu&szlig; mit dem
                    Stre&szlig;, her mit dem Kompatiblen!<BR>
                    Klar, ist doch viel einfacher. Einschalten und los geht`s! Wirklich
                    h&uuml;bsch, dieser Prompter mit dem "C". Sofort weiter, kein Schwei&szlig;, wa!
                    Per "CD" mal eben ins entsprechende Verzeichnis geh&uuml;pft, mit "DIR" die
                    Sache in Augenschein genommen, das File mit dem "EXE" herausgepickt
                    und eingetippt. Nicht gen&uuml;gen BASE MEMORY? Macht nichts, ran an die
                    CONFIG.SYS! Einfach nur mit HIMEMSYS das DOS in den oberen Speicher
                    gezogen, ein paar Treiber gel&ouml;scht. Billig ohne Ende! Neustart,
                    Maustreiber vergessen? Na und, einfach nochmal &auml;ndern. Wenn der
                    Speicher trotzdem nicht reicht? Nicht verzagen, ist ganz easy. Steht
                    alles in dem Doppelpfund-Buch "MS-DOS". Ausf&uuml;hrlich und gut
                    strukturiert. Wenn sich die Kiste aufh&auml;ngt? Mein Gott, dann wird halt
                    das DOS neu installiert. Ob das alles nicht etwas umst&auml;ndlich ist? Auf
                    keinen Fall, das ist POFESSIONELL! Das ist IN! Denn das ist kein
                    Spielecomputer wie der AMIGA...<BR>
                    <BR>

                    Wer jetzt noch fragt, woher der ganze Support der PC-Branche kommt,
                    mu&szlig; vom Dauerfernsehen v&ouml;llig verbl&ouml;det sein. Erstens sind das eine
                    ganze Menge Arbeitspl&auml;tze (die bei einer Macht&uuml;bernahme duch den AMIGA
                    pl&ouml;tzlich wegfielen, weil &uuml;berfl&uuml;ssig) und zweitens bewahrt er
                    unz&auml;hlige PC-User vor dem verzweifelten Freitod per Strang.<BR>
                    So weit zum Thema "Der PC als idealer Einsteigercomputer" (und AMIGAs
                    f&uuml;r den Aufsteiger?), nur eine Frage noch: Wieso sind fette PC-B&uuml;cher
                    gut, aber fette AMIGA-B&uuml;cher "dicke und teure W&auml;lzer"? Hat sich hier
                    ein kleiner Widerspruch in Deine Argumentation geschlichen?? Hah,
                    erwischt! Du Schelm! Thema Reparatur: Es ist einfach, seine eigene
                    Meinung, vermengt mit etwas grober Verallgemeinerung, als Argumente
                    vorzubringen. Aber zu diesem Vorgehen bilde ich mir auch wieder eine
                    Meinung, Axel...<BR>
                    <BR>

                    "Ich glaube, jeder Verk&auml;ufer, der die Wahl h&auml;tte, [...] einen Amiga
                    oder PC anzudrehen, w&uuml;rde zum PC raten..."<BR>
                    Erstens: Was Du glaubst (oder nicht glaubst) interessiert hier leider
                    keinen. Dies ist kein Kirchenblatt.<BR>
                    Zweitens: Ein KARSTADT-Verk&auml;ufer, der den AMIGA noch nie an einen
                    Monitor angeschlossen, geschweige denn eingeschaltet hat, noch nie
                    etwas &uuml;ber ihn gelesen hat und bei dem zu Hause ein PC auf dem
                    Schreibtisch dahinvegetiert, w&uuml;rde selbstverst&auml;ndlich nie zu einem
                    AMIGA raten. Au&szlig;er bei geistiger Umnachtung, unter Drogen oder durch
                    Schu&szlig;waffen bedroht. Er w&uuml;rde diesen daher auch nie zu den anderen
                    Computern stellen, sondern verpackt irgendwo in ein verstaubtes Regal.
                    Das CD32, falls &uuml;berhaupt vorhanden, befindet sich auch niemals neben
                    NINTENDO und SEGA, sondern bei den Telefonen als Anrufbeantworter.<BR>
                    Drittens: Bei HERTIE ist es genauso.<BR>
                    Viertens: Ein echter AMIGA- UND PC-H&auml;ndler w&uuml;rde das System nach den
                    Bed&uuml;rfnissen des Kunden empfehlen. Wer zum Beispiel f&uuml;r DTV einen PC
                    vorschl&auml;gt, geh&ouml;rt erschossen.<BR>
                    F&uuml;nftens: Der Rest hat keine Wahl.<BR>
                    <BR>

                    4. (Multitasking bzw. Betriebssysteme). OS/2, ein Betriebsystem, das
                    sich in den letzten 5 Jahren nicht durchsetzen konnte... Klar ist das
                    toll. UNIX, verbreitet vor allem auf Netzwerken. F&uuml;r den Heimanwender
                    h&ouml;chst interessant. Auch die anderen kennt jeder PC-User. Prima Sache,
                    das. Was am AMIGA-DOS so toll sein soll? Hm, wei&szlig; nicht. Vielleicht
                    die Kompatibilit&auml;t des Systems unter sich? Da&szlig; die meisten alten
                    Programme immer noch unter der neuesten Version funktionieren? Da&szlig; der
                    AMIGA-Bereich in dieser Hinsicht vereinheitlicht und vereinfacht ist?
                    Da&szlig; es zu den besten Betriebssystemen &uuml;berhaupt z&auml;hlt? Nein, wohl
                    nicht. Es ist tats&auml;chlich besser, wenn jeder User sein eigenes, zum
                    Rest h&ouml;chst unkompatibles System f&auml;hrt. Damit w&auml;re der AMIGA-Welt
                    wirklich besser gedient. Wie gut, da&szlig; es mit LINUX auf dem PC
                    Hintergrundbildschirme in 24bit gibt. Genau das hat der EDV-Welt seit
                    Jahrzehnten gefehlt. Ich bin &uuml;berzeugt. Jetzt kaufe ich mir einen PC
                    und LINUX.<BR>
                    Netzwerkf&auml;higkeit auf der Workbench fehlt. Stimmt. Wie verbinde ich
                    jetzt nur meine 42 AMIGAs? R&auml;tsel &uuml;ber R&auml;tsel. Noch ein R&auml;tsel:
                    Schreibt man "Embeding" nicht mit zwei "d"? Aber lassen wir das...
                    Unter Workbench st&uuml;rzt ein Programm die anderen mit ins Verderben. Mal
                    abgesehen davon, da&szlig; ich seit Kick 2 immerhin ein paar Mal statt eines
                    roten, blinkenden Kastens die Auswahl "SUSPEND/REBOOT" erhielt, k&ouml;nnen
                    die 99% der PC-User, die LINUX nicht haben, ihr ganzes System schon
                    mit einem einzigen laufenden Programm unheimlich in die Schei&szlig;e
                    reiten. Nicht auszudenken, was w&auml;re, wenn MS-DOS und WINDOWS echtes
                    Multitasking h&auml;tten...<BR>
                    <BR>

                    5. (Dominanz im Unterhaltungssektor). Es d&uuml;rfte schon seit l&auml;ngerem
                    bekannt sein, da&szlig; PCs den AMIGA in dieser Hinsicht &uuml;berholt haben,
                    sp&auml;testens mit Einf&uuml;hrung der CD-ROMs. Seitdem lache ich jeden PC-User
                    wegen seines "Spielecomputers" aus.<BR>
                    Allerdings hat LUCASFILM weniger vor der weltweiten Szene kapituliert,
                    als vor der geringen AMIGA-Verbreitung vor der Haust&uuml;r (USA). Warum
                    sollten sie auch ausschlie&szlig;lich f&uuml;r den Export arbeiten?<BR>
                    Thema CD-Auswahl: Sieh Dir selber mal die Listen an. Ich kann schon
                    bis 60 z&auml;hlen. Tut mir leid, da&szlig; Du noch nicht &uuml;ber die 20
                    hinauskommst... Thema TFX: Seltsam zwiesp&auml;ltig, die Leutchen von
                    Ocean. Zuerst t&ouml;nen sie, die CD32-Version solle besser werden als die
                    PC-Ausgabe. Inzwischen haben sie erstere ganz in Frage gestellt.<BR>
                    <BR>

                    6. (Grafik &amp; Sound). "Selten so gelacht"? Du hast mit deinem PC
                    wohl nicht viel zu lachen, was? Schrecklich, da&szlig; der AMIGA f&uuml;r 24bit
                    eine extra Karte braucht. Sonst hat er nur 18bit. Wirklich tragisch.
                    Man zeige mir die F&auml;higkeiten eines PCs ohne jegliche Karte (1bit?).
                    Und da&szlig; sich 32bitGrafikkarten durchsetzen, ist sch&ouml;n. Sch&ouml;n, da&szlig; das
                    menschliche Auge schon ab 24bit keine Farbunterschiede mehr sehen
                    kann. Noch sch&ouml;ner, da&szlig; man nun weniger als keine Unterschiede mehr
                    sieht. Ziemlich n&uuml;tzlich, sowas. Am sch&ouml;nsten jedoch, da&szlig; "fast alle
                    heute verkauften PCs bereits eine 24 Bit-Grafikkarte" haben sollen.
                    Wieviel ist "fast alle"? Drei&szlig;ig Prozent? Gar vierzig? Oder sogar
                    f&uuml;nfzig? Da war sogar mein PC-H&auml;ndler &uuml;berfragt. Standard sei bisher
                    immer noch S-VGA. Und das noch einige Zeit lang...<BR>
                    <BR>
                    Da&szlig; nur 10% der "Filme und TV-FX" mit AMIGAs bearbeitet werden, hat
                    mich geschockt. Dann werden mit PCs ja nur 0% bearbeitet, denn zu 90%
                    sollen SUN-Workstations beteiligt sein (100-100=0), und die haben mit
                    Normal-PCs soviel zu tun, wie der Osterhase mit dem Weihnachtsmann!
                    Dieser Schu&szlig; ging nicht vielleicht ein bi&szlig;chen nach hinten los?<BR>
                    <BR>

                    Das Angebot an 16bit-Soundkarten mit "riesig viel Software" und
                    "Mikrofon" in den Preisklassen von 200-300 DM begutachtete ich neulich
                    in der CHIP. Ich war ungelogen &uuml;berrascht. Die beste Klangbewertung
                    lag bei "befriedigend", das W&ouml;rtchen "mangelhaft" &uuml;berzeugte durch
                    zahlreiches Vorkommen. Immerhin ist es nicht schlecht, da&szlig; der Wandler
                    bei 16bit-Sound pro Sekunde 172 Kilobyte Sounddaten fri&szlig;t. Ist das ein
                    Wunder, da&szlig; PC-SpieleFirmen so versessen auf die &uuml;ber 600 MB
                    k&uuml;nstlerischer Freiheit der CD-ROM sind. &Uuml;brigens, hast Du bei der
                    Preisrechnung unter 1.) nicht 200-300 Deutsche Mark f&uuml;r eine
                    Soundkarte unterschlagen? Oder willst Du tats&auml;chlich den
                    Original-Pieper drinlassen? Das grenzt allerdings an
                    Selbstverst&uuml;mmelung...<BR>
                    <BR>
                    Die Kartenmanie im PC-Sektor verdeutlicht lediglich, da&szlig; das
                    eigentliche Ger&auml;t nichts kann. Wen &uuml;berraschen da die vielen
                    Towergeh&auml;use...<BR>
                    <BR>

                    7. (Motorola/Intel). Der schnellste AMIGA war nicht der A4000/040 mit
                    seinen 25 MHz, sondern ein A2000 mit der GVP040/33. Soviel zum Anfang.
                    Inzwischen mangelt es nicht mehr an 040/40-Turbokarten f&uuml;r A3000/4000,
                    eine 50-MHz-Version k&uuml;ndigt sich an und der 68060 mit 50 MHz ist
                    endlich verf&uuml;gbar. Stichwort: Pentium? Stichwort: Vergi&szlig; es! Er hat
                    sich bisher nicht durchsetzen k&ouml;nnen, er sollte in fl&uuml;ssigem
                    Stickstoff gelagert werden, er entt&auml;uschte durch weniger Leistung als
                    erwartet, er ist verd&auml;chtig unkompatibel zu den &auml;lteren Intels (vor
                    allem wegen seiner 64 Bit) und l&auml;uft mit seinem Tempo der Peripherie
                    davon. Und warum Du so abartig auf diese 64 Bit fixiert bist, w&uuml;rde
                    mich eigentlich auch mal interessieren. RISC-Prozessoren haben
                    folgenden Nachteil: Sie sind v&ouml;llig inkompatibel. Damit die etablierte
                    Software l&auml;uft, mu&szlig; die alte Struktur emuliert werden. Und wie schnell
                    Emulationen sind, wei&szlig; jeder VORTEX-Kunde. RISC bringt, solange es
                    noch keine Native-Software gibt, relativ wenig.<BR>
                    <BR>

                    8. (AMIGA im B&uuml;ro). Da&szlig; AMIGAs als B&uuml;rocomputer kaum konzipiert sind,
                    ist bekannt. Hat inzwischen auch keinen Zweck mehr. Firmen kaufen ihre
                    Rechner in den seltensten F&auml;llen nach wirklicher Leistung, sondern
                    nach Werbung, Beziehungen und Vertr&auml;glichkeit mit dem bisherigen
                    System. Warum sollte also ein Firmenchef nach 10 Jahren IBM pl&ouml;tzlich
                    auf COMMODORE umsteigen.<BR>
                    <BR>
                    Netzwerkf&auml;higkeit (das hatten wir doch schon mal?) - der PC kann`s,
                    die Workbench nicht! Was ist das denn f&uuml;r ein Vergleich zwischen einem
                    Computer und einem Betriebssystem? Vergleiche mal Hardware mit
                    Software. Und &Auml;pfel mit Birnen. F&auml;llt Dir irgendwas auf?<BR>
                    <BR>
                    Corel Draw. Ich habe es schon mal gesehen. Und daraus gelernt.
                    Gelernt, da&szlig; es auf 386ern zur Qual wird und die Festplatte besetzt.
                    Auch von der CD-ROM-Version mu&szlig; sich einiges auf HD befinden. Ach ist
                    das sch&ouml;n...<BR>
                    <BR>

                    DpaintIV. Ist nicht nur 100 DM billiger. Au&szlig;erdem nicht mehr ganz
                    Elite. Statt dessen bietet PPaint, inzwischen sogar Version 6, mehr
                    Funktionen. Und dieses Programm unterst&uuml;tzt nicht nur IFF, GIF und
                    PCX, sondern auch C-Sourcecode und verschl&uuml;sselte Daten. Sogar in
                    Version 2.1 . Und die hat mich 9,90 DM gekostet (AMIGAplus 4/94).
                    Au&szlig;erdem sind DpaintIV und PPaint V6.0 nicht nur Mal-, sondern auch
                    Animationsprogramme.<BR>
                    Wenn andere Programme diese Formatvielfalt nicht zur Verf&uuml;gung
                    stellen, ist dann wirklich der AMIGA schuldig? Oder vielleicht die
                    Software? Und schon wieder ertappt!<BR>
                    "Noch nichtmal GIF [...] kann heute auf jedem Amiga angezeigt werden..."<BR>
                    Is` ja `n Ding.<BR>
                    Und warum kann der AMIGA mit entsprechender Hard- und Software zum
                    Z80, C64, ATARI, PC und APPLE werden, ein PC aber noch nicht einmal
                    AMIGA-Disketten lesen. Das hat wohl weniger mit angeblich geringerer
                    Qualit&auml;t des AMIGAs zu tun. Ein ASCII-Text ist nicht besser, wenn er
                    mit einem PC verfa&szlig;t wurde. Aber es zeugt von der Ignoranz und
                    Sturheit, mit der der IBMKompatible Standard zur EDV-Religion erhoben
                    werden soll, bis zum absoluten Microsoftmonopol, bis in alle Ewigkeit,
                    Amen. Sch&ouml;ne neue Computer-Welt...<BR>
                    <BR>

                    Auch dieser Text war zu einem gewissen Anteil subjektiv untermauert.
                    Ich wollte lediglich zeigen, da&szlig; sich so ziemlich jedes "Argument" im
                    offenbar unvermeidlichen Statuskrieg zwischen "DOSEN" und
                    "Spielekisten" widerlegen l&auml;&szlig;t. Obwohl sich jeder sein System nach
                    pers&ouml;nlichen Bed&uuml;rfnissen aussuchen sollte (oder gibt es den perfekten
                    Computer? Cray? Oder was?), lassen sich die wenigsten davon abhalten,
                    ihre privaten, systempatriotischen Neigungen oder schlicht ihre
                    Ignoranz gegen&uuml;ber dem Fremden, Unbekannten, in wahren
                    Schlammschlachten zu ver&auml;u&szlig;ern. Mit dieser Propaganda ist niemandem
                    geholfen, schon gar nicht Neueinsteigern. Jedes System hat seine Vor-
                    und Nachteile. Hinter dem PC, der in einigen Bereichen immer noch
                    nicht den fast 10 Jahre alten Stand des AMIGAs erreicht hat, zumindest
                    was Anwenderfreundlichkeit und Videotauglichkeit betrifft, steht die
                    Masse an Hardund Software, Support und Dokumentation, die es
                    versierten und engagierten Anwendern leicht macht, ihren Computer zu
                    einem sehr leistungsf&auml;higen Werkzeug zu machen. Trotzdem h&auml;tte sich
                    die innere Struktur und das Hauptbetriebssystems der PCs schon vor
                    Jahren entscheidend verbessern k&ouml;nnen und m&uuml;ssen. Doch offenbar
                    f&uuml;rchtete man keine Konkurrenz. Es scheint auch nicht m&ouml;glich, aus der
                    Masse an Angeboten und Produkten einen gewissen Standard
                    herauszubilden. Commodore hat lange Zeit geschlafen. Der A3000 h&auml;tte
                    fr&uuml;her kommen m&uuml;ssen, dementsprechend auch die neuen AGA-Computer. In
                    einer Zeit,<BR>
                    <BR>

                    die nach echten 24 Bit Grafik, 16 Bit Sound und trotzdem hohen
                    Geschwindigkeiten schreit, scheinen die echten 8 Bit und etwas
                    "gemogelten" 18 Bit der A1200 und A4000 doch etwas schwachbr&uuml;stig.
                    Auch die Treue zur Paula, welche die halb so schnellen HD-Laufwerke
                    auf dem Gewissen hat, ist nicht mehr zeitgem&auml;&szlig;. Andererseits handelt
                    es sich bei AGA wohl um einen Kompromi&szlig; zwischen Low-End und
                    "Dream-End". Au&szlig;erdem ist zu bedenken, da&szlig; sich die innere Struktur
                    der AMIGAs -verglichen mit PCs- bisher st&auml;rker ver&auml;ndert hat, bei
                    erheblich besserer Aufw&auml;rtskompatibilit&auml;t. Commodore kann jedoch nur
                    an Masse gewinnen, wenn erstens eine verst&auml;rkte Werbekampagne
                    gestartet und zweitens noch dieses Jahr der sagenumwobene "A5000"
                    vorgestellt wird. Weiteres Z&ouml;gern bedeutet den Tod dieses
                    hervorragenden Systems.<BR>
                    Axel, nichts f&uuml;r ungut.<BR>
                    </P>
                    <BR>
                </TD>
            </TR>
            </TABLE>

<!Innere Tabelle>

            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

