<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE></TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="inh0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="inh.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#FFFFF0">
        <TR>
            <TD><IMG SRC="inh.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#inh0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <CENTER>
                <IMG SRC="edi.gif" WIDTH="279" HEIGHT="147" ALT="Titelbild">
            </CENTER>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="80%">
            <TR>
                <TD>
                <BR>
                <P>Hallo beinander !<BR>
                <BR>
                Es ist mal wieder soweit. Die NoCover 7 ist mal wieder brechend voll
                mit interessanten Texten endlich in eurer Floppy.<BR>
                <BR>
                P&uuml;nklich wie immer, aber das haben wir nur unseren flei&szlig;igen
                Schreiberlingen zu verdanken, die uns auch dieses mal nicht im Stich
                gelassen haben. Wir haben wirklich verdammt viele Artikel bekommen.
                Soviele, das sogar 1 Artikel leider nicht mehr Platz auf dieser NoCover
                hatte. Aber keine Angst, in der NoCover 8 k&ouml;nnt ihr ihn lesen. Sie
                kommt &uuml;brigends am 1.10.94 raus; p&uuml;nklich wie immer :-))<BR>
                <BR>
                In den letzten Tagen war ich mal wieder mehr als gew&ouml;hnlich im
                Stre&szlig;. Deshalb haben einige User nen verdammt kurzen Antwortsbrief
                oder teilweise gar keinen von mir bekommen. Der Grund daf&uuml;r war, das
                ich einiges planen mu&szlig;te. Wir suchen z.B. momentan eine neue Firma
                die uns die Verpackungen f&uuml;r unsere eigene (c)-Soft m&ouml;glichst
                billig herstellt. Naja, nach ca. 50 Telefongespr&auml;chen habe ich jetzt
                hoffentlich eine gefunden. Aber das wirds sich erst in ca. einer Woche
                rausstellen.<BR>
                <BR>
                Dann arbeiten wir ab sofort mit dem ICP-Verlag (Amiga+) zusammen. Da
                mu&szlig;te ja auch einiges gekl&auml;rt werden, da der ICP-verlag unter
                anderem auch die Messeveranstalter von der Computer 94 sind.<BR>
                <BR>
                Also Mitglieder bekommen zu einem Amiga+-Abo ein Programm kostenlos
                dazu. Wie das ganze abl&auml;uft k&ouml;nnt ihr im SmallTalk
                nachlesen.<BR>
                <BR>
                Dann haben wir jetzt auch einen Stand auf dere Computer94. Hier nochmal
                die Frage:<BR>
                <BR>
                Wer kann uns helfen. Vom Donnerstag 3.11.94 ca. 10 Uhr bis Sonntag 5.11.94
                ca. 20 Uhr. Nat&uuml;rlich mehr oder weniger durchgehend. Klar sollte
                einem auch sein, das die arbeit an so einem Stand zwar bestimmt lustig und
                interessant ist, aber es ist ARBEIT !!<BR>
                Jemand der uns nur 1 Stunde oder so helfen kann hilft uns leichter nichts.
                Aber ich hoffe trotzdem das viele Mitglieder mal bei uns am Stand
                vorbeischaun.<BR>
                <BR>
                DER STAND IST KEIN WARENLAGER! Ihr k&ouml;nnt dieses Jahr nicht mal
                schnell die gekaufte Festplatte oder so bei uns abstellen! Das ist einfach
                aus Platzgr&uuml;nden nicht machbar. Ausgenommen nat&uuml;rlich die User
                die uns am Stand helfen!<BR>
                <BR>
                Achja, f&uuml;r Mitglieder gibts die Eintrittskarten zum Sonderpreis. Ich
                hoffe das wir einige Karten verkaufen k&ouml;nnen. Genauere Infos sind
                auch wieder im SmallTalk.<BR>
                Also dann bestellt mal flei&szlig;ig :-))<BR>
                <BR>
                Ab Mitte September g&ouml;nne ich mir ein paar Tage Urlaub. Nur f&uuml;r
                den Fall das Briefe und Bestellungen etwas sp&auml;ter als gew&ouml;hnlich
                bei euch ankommen.<BR>
                <BR>
                Eine nette kleine Sammbestellung f&uuml;r CDs haben wir auch in dieser
                Ausgabe der NoCover. Ich hoffe das was f&uuml;r Euch dabei ist. Wenn ja,
                dann bitte so schnell wie m&ouml;glich bei mir melden!!<BR>
                <BR>
                
                Auf vielfachen Wunsch k&ouml;nnt ihr jetzt noch schnell 2 Pics von mir
                anschaun. Auf dem einen bin ich und auf dem anderen meine meine
                Computeranlage.<BR>
                <BR>

                <P>
                Also dann mal viel Spa&szlig; mit der neuen NoCover,<BR>
                <BR>
                Euer<BR>
                <BR></P>

                <P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Andreas.</P>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="inh.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#inh0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
</BODY>
</HTML>
