<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht zum Spiel HIRED GUNS</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="gam0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="gam.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#0020AC">
        <TR>
            <TD><IMG SRC="gam.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#gam0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#CACACA" WIDTH="80%">
            <TR>
                <TD>
                <H3 ALIGN="CENTER"><B>Testbericht zum Spiel HIRED GUNS</B></H3>
                <P ALIGN="CENTER"><B>Geschrieben von Norman Schlegel</B></P>

                <P>
                Wer auf moderne Rollenspiele steht sollte sich unbedingt mal Hired Guns
                von DMA Design und Psycnosis ansehen.<BR>
                <BR>
                Ich habe das Spiel am A1200 und am A500 mit jeweils 2 Zusatzlaufwerken
                gespielt und bis auf mehr Soundeffekte am A1200(durch 2MB) keine
                gro&szlig;en Unterschiede festgestellt!Dieser Test gilt also f&uuml;r beide
                Systeme!<BR>
                <BR>
                Im Hauptmen&uuml;schirm kann man zwischen `Neues Game` oder `Gespeichertem
                Spiel` w&auml;hlen.Ich w&auml;hle Neues Game an und kann sogleich zwischen
                `Training`,`Vollst&auml;ndige Operation` oder `Kurz-action-spiel`
                entscheiden.Beim erstmaligen Spielen ist ein Training nur zu empfehlen, da
                man sich kurz mit den Waffen vertraut machen sollte! Nimmt man ein Kurz
                Action Spiel kann man zwischen mehreren Missionen w&auml;hlen.Da man dieses
                Spiel mit bis zu 4 Spielern zocken kann gibt es auch Missionen f&uuml;r 1
                Spieler Games bis zu 4 Spieler Missionen die dann halt um einiges
                schwieriger sind!Wenn man &uuml;brigends mit 4 Spielern auf Gegner Hatz
                gehen will mu&szlig; man einen 4 Spieler Adapter anschliesen. Meine
                Wenigkeit entscheidet sich aber mal f&uuml;r eine Vollst&auml;ndige
                Operation...<BR>
                <BR>
                ...Zuerst kann man zwischen einigen Charakteren w&auml;hlen die alle ihre
                Vor-und Nachteile haben.So k&ouml;nnen zB Humanoiden nicht so lange unter
                Wasser bleiben wie Cyborgs.Jeder Charakter hat andere Waffen und wird mit
                anderen Bildern dargestellt.Hat man 4 S&ouml;ldner gew&auml;hlt geht es zu
                einer Karte in der man sich eine Mission aussuchen kann.(Dieser Schritt
                f&auml;llt beim Training und Kurz-action-spiel weg,da man da die Missionen
                schon vorher aussuchen mu&szlig;!) Hat man sich entschieden bekommt man ein
                nettes Bildchen sowie die Auftragsumschreibung zu sehen. Nach einer
                Ladepause gehts dann aber los!<BR>
                <BR>
                Auf dem Bildschirm erscheinen 4 Screens f&uuml;r jeweils einen
                S&ouml;ldner. Spielt man alleine mu&szlig; man alle S&ouml;ldner
                &uuml;bernehmen,spielt man zu viert &uuml;bernimmt halt jeder Spieler einen
                Charakter. Jeder Screen ist wie folgt aufgebaut:Oben rechts befindet sich
                die Energieleiste und links daneben kann man 3 K&auml;stchen ersp&auml;hen.
                Das erste schimpft sich Store.Hier kann man Waffen umstellen,wegwerfen,
                aufnehmen oder Essen einstellen. Das zweite K&auml;stchen nennt sich
                DTS.Wenn der S&ouml;ldner einen Radarkasten besitz kann man hier &uuml;ber
                diesen Radar verf&uuml;gen. Im dritten K&auml;stchen kann man Informationen
                &uuml;ber den S&ouml;ldner abrufen. 90% stehen allerdings auf jedem der 4
                Screens als Sichtfenster zur Verf&uuml;gung!<BR>
                <BR>
                Zur Steuerung.Man kann die Richtung des S&ouml;ldners ver&auml;ndern indem
                man den Pfeil an die Bildr&auml;nder bringt und die linke Maustaste
                dr&uuml;ckt.Mit der linken Maustaste kann man aber auch schiesen sobald man
                den Coursor in die Screenmitte bewegt hat!Ist die Magazin leer und Munition
                im Gep&auml;ck vorhanden kann man mit einfachem Klick auf die rechte
                Maustaste nachladen und weiterballern.Will man einen Partner folgen lassen
                braucht man nur zwei Klicks und schon folgt uns der gew&uuml;nschte
                S&ouml;ldner &uuml;berallhin!Die Steuerung ist also ziemlich leicht zu
                lernen!<BR>
                <BR>
                Zur Grafik.Die Grafik &uuml;berascht bei jeder Mission aufs neue.Vom
                Reaktor &uuml;bers Tiergehege bis hin zu Unterwasser Einlagen ist alles
                dabei!Auch bei den Gegnern wurde nicht gespart.So gibt es
                Eichh&ouml;rnchen,Lemminge!, aber auch Massen an Aliens oder Haien!Also die
                Grafik ist wirklich gut gelungen!<BR>
                <BR>
                Zum Sound.Wenn man auf einem normalen A500 spiel mu&szlig; man mit den
                normalen Soundefekten auskommen,die allerdings auch gut sind und eigentlich
                auch ausreichen.Wer aber &uuml;ber 2MB Ram (zB A1200)verf&uuml;gt bekommt
                noch die 410KB an Sound FX geboten die auf einer extra Diskette
                mitgeliefert werden! Die Musiken in den Men&uuml;s und Zwischenbildschirmen
                ist auch nicht von schlechten Eltern!<BR>
                <BR>
                Zu den Mankos.Leider sind die Gegner teilweise ziemlich schwer im Gegensatz
                zu ihrer K&ouml;rpergr&ouml;se,wie zB die wirklich m&ouml;rderischen
                Eichh&ouml;rnchen :-) Was mich auch gest&ouml;rt hat ist die Missionsuhr
                die mitl&auml;uft wenn man ein Kurz-action-spiel macht! Also f&uuml;r
                absolute Anf&auml;nger kann ich dieses SApiel wirklich nicht empfehlen,
                allerdings sind hier Hartgesottene bestens bedient!<BR>
                <BR>
                Ok,ich komme mal zum Schlu&szlig;!Mir pers&ouml;nlich gef&auml;llt dieses
                Spiel wirklich gut und ich kann es f&uuml;r harte Rollenspieler nur
                empfehlen! Wenn man wie ich mit zwei Zusatzlaufwerken spielt sollte man
                keine Probs mit Disxwechseln bekommen,da Hired Guns alle Zusatzlaufwerke
                unterst&uuml;tzt! Die 5te Diskette braucht man nur einmalig einstecken wenn
                man &uuml;ber 2MB Ram verf&uuml;gt,da dann die ganzen ZusatzFX ins Ram
                geladen werden!Bei 5 Disxs wurde nat&uuml;rlich auch an die
                Festplattenbesitzer gedacht!!! Also wer auf der Suche nach einem geilen
                Rollenspiel ist,gerne zusammen mit bis zu 3 Freunden in Echtzeit Aliens
                bek&auml;mpft und nicht gerade &uuml;ber einen Amiga mit 1 Laufwerk und
                ohne Festplatte verf&uuml;gt sollte hier unbedingt mal Probe spielen!!!<BR>
                </P>
                <BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="gam.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#gam0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

