<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Formula One Grand Prix</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="gam0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="gam.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#0020AC">
        <TR>
            <TD><IMG SRC="gam.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#gam0"></TD>
        </TR>

        <TR>
            <TD>
            <BR>

            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#CACACA" WIDTH="80%">
            <TR>
                <TD>
                <H3 ALIGN="CENTER"><B>Formula One Grand Prix</B></H3>

                <P>
                Als gro&szlig;er Fan der Formel-1 schreibe ich einen ausf&uuml;hrlichen
                Test &uuml;ber die Formel-1 Simula tion von Microprose's &quot;Formula One
                Grand Prix&quot;. Eigentlich hat dieses Spiel schon einige Jahre auf dem
                Buckel, doch es ist und bleibt die Nummer eins. In Sachen
                realit&auml;tsn&auml;he und detailgenauigkeit kommt kein Spiel an den
                &quot;Grand Prix&quot; heran. Die wichtigen Features:
                </P>

                <TABLE ALIGN="CENTER" SUMMARY="" CELLPADDING="5" WIDTH="500" BORDER="0">
                <TR>
                    <TD WIDTH="20" VALIGN="TOP">-</TD>
                    <TD WIDTH="480">Alle 16 internationalen Grand Prix-Kurse sind original
                    in 3-D nachgebaut.
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Jeder Formel-1 Wagen ist original und kann beliebig eingestellt
                    werden.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>F&uuml;nf Schwierigkeitsstufen und sechs Fahrhilfen sorgen
                    f&uuml;r Abwechslung.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Trainings- und Qualifikatsionsl&auml;ufe und die Rennen.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Eine richtige Meisterschaftssaison kann gespielt werden. Die sechs
                    Fahrhilfen k&ouml;nnen nur in den Anfangsstufen beliebig ein und
                    ausgestellt werden:</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>ist man beim Fahren sicher genug, so kann man die Bremsen selbst
                    steuern.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>die n&auml;chste Hilfe ist die atomatische Schaltung, wer will
                    kann das Getriebe selbst steuern, was enorm schwierig am Anfang
                    ist.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>wenn man die Kurse gut genug kennt, kann man auch die
                    Unzerst&ouml;rbarkeit der Wagen bei Karambolagen abstellen</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>es gibt auch noch eine Ganganzeige f&uuml;r den idealen Gang in
                    den Kurven.</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>und auch eine Ideallinie auf der Fahrbahn kann hilfreich sein
                    f&uuml;r unsichere Fahrer.</TD>
                </TR>
                </TABLE>

                <P>
                Im Cockpit des Wagens findet man einen Schwierigkeitanzeiger und die
                Leistungsverteilung der anderen Fahrer. Zwischen dem Lenker befindet sich
                der Drehzahlmesser und darunter die Fahrhilfen-Tafel. Auf dem Cockpitbild
                auf der n&auml;chsten Seite kann man dies besser sehen.Am unteren Teil des
                Bildschirmes sieht man die Geschwindigkeit, die beste Rundenzeit, die
                aktuelle Rundenzeit, die Anzahl der fahrenden Wagen und die eigene
                Platzierung w&auml;hrend des Rennens. Rechts befindet sich der
                Statusanzeiger &uuml;ber den Zustand des Fahrers und die Ganganzeige.
                Darunter der Scahdensanzeiger des Wagens und die Boxenanzeige.<BR>
                <BR>

                Die Vorbereitung eines Rennens: Zu Begin des Spiels kann man im
                Hauptmen&uuml; die Fahrer aussuchen. Es besteht auch die M&ouml;glichkeit
                die Fahrer und die Firmennamen zu &auml;ndern. Das Spiel kann mit beliebig
                vielen Spielern gespielt werden. Beim Mehrspielermodus wird w&auml;hrend
                des Rennens gewechselt, der Computer steuert dann die Wagen der anderen
                Spieler weiter. Nun kann man noch einige Einstellungen ver&auml;ndern,
                z.B. Rennl&auml;nge, Anzahl der wechsel beim Mehrspielermodus,
                Schwierigkeitsgrad, usw. Jetzt kanns losgehen.<BR>
                <BR>

                Jeder Trainingslauf oder Qualifikation beginnt in der Boxengasse. Da jeder
                der 16 Kurse verschieden ist, kann man einiges am Wagen ver&auml;ndern,
                z.B. Spoiler, &Uuml;bersetzungsverh&auml;ltnis des Motore, Bremsbalance
                und die Reifenart. Es gibt 6 verschiedene Reifen, darunter sind auch die
                Regenreifen, denn es findet ab und zu mal ein Regenrennen statt(macht
                sauviel Spa&szlig;). Hat man die erste Trainingseinheit hinter sich und
                findet die Einstellungen des Wagens richtig kanns an die Qualifikation.
                Man kann innerhalb der vorgegebenen Zeit einige Runden fahren. Geh&ouml;rt
                die eigene beste Rundenzeit zu den 26 besten, ist man f&uuml;rs Rennen
                qualifiziert.<BR>
                <BR>

                Nun startet das Rennen, die Ampel springt auf rot, die Motoren heulen.
                Dann springt die Ampel auf gr&uuml;n, das Rennen ist gestartet, die Reifen
                quietschen und die ersten Karambolagen enstehen, einige Scheiden schon in
                den ersten Runden aus und Du nimmst die Verfolgung auf den ersten auf.
                Doch dann ein kleiner Fehler und dein Wagen dreht sich viermal, die Chance
                verpa&szlig;t, denn Du f&auml;llst zur&uuml;ck und mu&szlig;t an die Box.
                Dein Wagen wird repariert und Du hast keine Chance mehr unter die ersten 6
                und damit in die Punkter&auml;nge zu fahren. Dann halt beim n&auml;chsten
                mal. Jeder Kurs ist einzigartig, so siehst Du z.B. in Monte Carlo die
                Yachten im Hafen liegen und Du d&uuml;st durch den Tunnel.<BR>
                <BR>

                In Mexico City siehst Du die Kuppeln und auf dem Hocken heim Ring braust
                Du durch das Waldgebiet und in Belgien mu&szlig;t Du die Haarnadel
                durchfahren. In Ph&ouml;nix d&uuml;st Du durch die Stadt und streifst die
                Mauern. Zus&auml;tze: Super sind auch die Kameraeinstellungen von oben,
                vorne, innen, hinten oder von der Trib&uuml;ne kann das Rennen verfolgt
                und sogar gefahren werden. Die Zeitlupen sind Klasse und die Auto mit den
                drinsitzenden Fahrern sind toll animiert. Das Handbuch ist auf alle
                F&auml;lle eine Bereicherung und ist leicht zu verstehen, dadurch
                k&ouml;nnen auch Formel-1 Laien das komplexe Spiel gut spielen.<BR>
                <BR>

                Die 16 Rennstrecken sind im Handbuch klasse gezeichnet. Auf der
                n&auml;chsten Seite siehst Du eine Abbildung aus dem Handbuch der
                Rennstrecke vom Hockenheim-Ring. Danch noch einige Rennbilder, die auf den
                nachfolgenden Seiten zu sehen sind. Wer sich das Spiel kaufen will, aber
                noch einige Fragen hat, kann mir ja mal schreiben(R&uuml;ckporto nicht
                vergessen)!<BR>
                </P>

                <P><FONT SIZE="+1">Wertung:</FONT></P>
                <TABLE ALIGN="CENTER" SUMMARY="Bewertung!" WIDTH="300" BORDER="0" BGCOLOR="#909090">
                <TR>
                    <TD WIDTH="200" ALIGN="CENTER">Grafik:</TD>
                    <TD WIDTH="50" ALIGN="CENTER">74%</TD>
                </TR>
                <TR>
                    <TD ALIGN="CENTER">Sound</TD>
                    <TD ALIGN="CENTER">78%</TD>
                </TR>
                <TR>
                    <TD ALIGN="CENTER">Spielbarkeit:</TD>
                    <TD ALIGN="CENTER">91%</TD>
                </TR>
                <TR>
                    <TD ALIGN="CENTER">Motivation:</TD>
                    <TD ALIGN="CENTER">94%</TD>
                </TR>
                <TR>
                    <TD ALIGN="CENTER">Gesamt:</TD>
                    <TD ALIGN="CENTER">85%</TD>
                </TR>
                </TABLE>

                <UL>
                    <LI> Fazit: F&uuml;r jeden Formel-1 Fan empfehlenswert und auch f&uuml;r Laien geeignet!
                    <LI> Preis: ca. 50-80 DM
                    <LI> Hersteller: Microprose
                </UL>

                <P ALIGN="RIGHT">Getestet von Andre Martini!!!!&nbsp;&nbsp;&nbsp;&nbsp;</P>
                <BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="gam.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#gam0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

