<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>UChess - DAS Schachprogramm</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="gam0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="gam.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#0020AC">
        <TR>
            <TD><IMG SRC="gam.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#gam0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#CACACA" WIDTH="80%">
            <TR>
                <TD>
                <BR>
                <H3 ALIGN="CENTER"><B>UChess - DAS Schachprogramm</B></H3>

                <P>
                Bevor Ihr diesen Artikel weiterlest, sollt Ihr wissen, da&szlig; man
                f&uuml;r UChess einen Amiga mit mindestens 68030er Prozessor und 5MB Ram
                ben&ouml;tigt!<BR>
                <BR>
                So, nun wi&szlig;t Ihr was UChess von Euch verlangt, doch was d&uuml;rft
                Ihr von diesem Programm erwarten? Nun zun&auml;chst mal eine erstaunlich
                sch&ouml;ne Oberfl&auml;che (Zumindest f&uuml;r ein PD - Proggi). Als
                n&auml;chstes w&auml;re da die St&auml;rke des Computer-Gegenspielers.
                Diese kann man in Denkzeit und Rechentiefe einstellen. Aber selbst in der
                kleinsten Einstellung d&uuml;rften die meisten Leute groooo&szlig;e
                Probleme kriegen, den Compi zu schlagen!<BR>
                <BR>
                Aber nicht nur den Schwierigkeitsgrad kann man einstellen, man darf z. B.
                auch die Seiten frei w&auml;hlen, den Denkweg seines Compis anzeigen
                lassen und, und, und!<BR>
                <BR>
                Das Speichern und Laden von Spielst&auml;nden wurde auch integriert,
                genauso wie die M&ouml;glichkeit gegen einen menschlichen Konkurrenten
                anzutreten. Sogar eine Editierm&ouml;glichkeit wurde nicht vergessen. Mit
                dieser kann man diverse Schachpositionen z. B. aus Zeitschriften eingeben
                - wenn auch etwas umst&auml;ndlich.<BR>
                <BR>
                Wohl unn&ouml;tig noch zu erw&auml;hnen, da&szlig; sich UChess Penibelst
                an die Schachregeln h&auml;lt...<BR>
                <BR>
                Kurz und gut - UChess ist zweifellos DAS Schachprogramm f&uuml;r den
                Amiga! Zumindest hab` ich noch kein besseres (PD-) Schachprogramm gesehen!<BR>
                <BR>
                Yeah, jetz` stellt sich dem begeisterten Schachfreak nur noch die Frage wo
                man das Teil denn herkriegt -<BR>
                <BR>
                UChess befindet sich z. B. auf der Spielekiste Extra #19<BR>
                <BR>
                und die bekommt - na beim APC &amp; TCP nat&uuml;rlich :-)<BR>
                <BR>
                Hey, Andreas was krieg ich eigentlich f&uuml;r diese x. Schleichwerbung
                :-) ?<BR></P>

                <P ALIGN="RIGHT">Michael Hilscher&nbsp;&nbsp;&nbsp;&nbsp;</P>
                <BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="gam.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#gam0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

