<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht CD-1200 Controller</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="hdw0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="hdw.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#00FFBA">
        <TR>
            <TD><IMG SRC="hdw.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#hdw0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#CADBFF" WIDTH="80%">
            <TR>
                <TD>
                <BR>
                <H2 ALIGN="CENTER">Testbericht</H2>
                <P ALIGN="CENTER">CD-1200 Controller<BR>------------------</P>

                <P>
                Beim CD12OO Controller, sp&auml;ter nur noch CD12OO genannt, handelt sich
                es um einen " external PCMCIA CD-ROM Controller for A6OO/A12OO ".
                MMMhhhhh, ineressant gel ! Naja, wer sich schon mal mit dem "Problem"
                CD-Rom am Amiga besch&auml;ftigt hat, wird wohl festgestellt haben, das es
                nur ziehmlich wenige M&ouml;glichkeiten gibt ein CD Rom am Amiga
                anzuschlie&szlig;en. Die einfachste und billigste ist wohl das A57O. Es
                kostet jetzt so um die 15O,- DM und wird am Expansionsport
                angeschlo&szlig;en. Einen Testbericht findet man in der NC 6. Was machen
                aber nun die Leute die keinen A5OO haben ? Die kaufen sich halt einen !
                Naja okay, wer das nicht will und einen A2OOO,A3OOO oder A4OOO hat, kann
                auf ein SCSI CD-Rom Laufwerk zur&uuml;ckgreifen, was dann intern an den
                SCSI "Anschlu&szlig;" angeschlo&szlig;en wird. So nun h&auml;tten wir
                f&uuml;r alle Amiga eine L&ouml;sung und k&ouml;nnen eigentliche
                aufh&ouml;ren.<BR>
                <BR>

                EEEHH - was ist mit dem A12OO oder dem A6OO ? B&auml;&auml;&auml;hhh,
                mu&szlig; ich halt weitermachen. F&uuml;r den A12OO gibt es noch eine
                M&ouml;glichkeit. Man kann jetzt Speicherkarten und Turbokarten mit SCSI
                Anschlu&szlig; erwerben und dann ein SCSI CD-Rom anschlie&szlig;en. Dies
                ist aber, wenn man alles mal so zusammenrechnet recht kostspielig, denn
                eine Karte ohne Ram und mit derartigem SCSI Controller kostet um die 3OO,-
                bis 5OO,- DM, ein Laufwerk dazu auchnochmal ca. 45O,- DM. Wer eine
                preiswertere L&ouml;sung sucht f&uuml;r den hat jetzt "ALFA DATA" den CD
                12OO Controller herausgebracht. Und wo wir gerade bei Preisen w&auml;ren
                k&ouml;nnen wir sie auch gleich mal f&uuml;r dieses Teil bekannt geben.
                Das CD12OO kostet 189,- DM . Die jedoch in Verbindung mit nem Mitsumi CD
                Rom was dann nochmal so um die 35O,- DM kostet.<BR>
                <BR>
                <BR>
                <IMG SRC="ht-cd1200.png" ALT="Alpha Data CD-1200 Controller" BORDER="2">
                <BR>
                <BR>
                Das CD 12OO unterst&uuml;tzt also nur Mitsumi Laufwerke vom Typ LU-OO5S,
                FX-OO1S und FX-OO1D. Angeschlo&szlig;en wird es am PCMCIA Slot der bei
                jedem A12OO oder A6OO an der linken Seite angebracht ist. Der
                Anschlu&szlig; ist in 5 Minuten vollbracht, da man nur den Controller und
                das CD ROm mittels eines Kabels verbinden mu&szlig;. So nun kann es
                eigentlich schon lo&szlig;gehen . Die Installation der Software sowie der
                Anschlu&szlig; sind gut in der Deutsch/Englischen Anleitung beschrieben so
                das es eigentlich keine Probleme damit geben sollte.<BR>
                <BR></P>

                <DL>
                    <DT><FONT SIZE="+1"> FAZIT :</FONT>
                    <DD>Zur Zeit die billigste und komfortabelste L&ouml;sung ein CD-Rom
                        an einen A12OO oder A6OO anzuschlie&szlig;en.
                </DL>

                <P ALIGN="RIGHT">Jens Neubauer&nbsp;&nbsp;&nbsp;&nbsp;</P>
                <BR>
                <BR>
                </TD>
                </TR>
                </TABLE>
                <BR>
                </TD>
            </TR>
            <TR>
                <TD><IMG SRC="hdw.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#hdw0"></TD>
            </TR>
            </TABLE>
            </TD>
        </TR>
        </TABLE>
    </BODY>
</HTML>
