<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Interview</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="apc0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="inh.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#0070A0">
        <TR>
            <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <BR>
            <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Interview</FONT></B></H1>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#50C0E0">
            <TR>
                <TD>
                <BR>
                <P ALIGN="CENTER">
                Interview mit dem APC+TCP Clubgr&uuml;nder Andreas Magerl<BR>
                ----------------------------------------------------<BR>
                <BR>
                gef&uuml;hrt von<BR>
                -----------<BR>
                <BR>
                Stefan Wunner, APC+TCP St&uuml;tzpunkt Bamberg<BR>
                -----------------------------------------<BR>
                </P>
                <P>
                Da der Andreas ja bekanntlich immer nach Interviews f&uuml;r die NoCover
                sucht, wollte ich auch mal eines machen. Und zwar mit dem Andreas selbst.
                Was dabei rausgekommen ist, kann man jetzt nachlesen.<BR>
                <BR>
                APC+TCP St&uuml;tzpunkt Bamberg (APC+TCP St. B.): Andreas, erz&auml;hle
                uns bitte als erstes mal wie alt du bist und wie du eigentlich zum Amiga
                gekommen bist und ob du dem Amiga auch weiterhin treu sein wirst.<BR>
                <BR>
                Andreas Magerl: Hmm, also ich bin Baujahr 1971 und zum Amiga bin ich wie
                die meisten &uuml;ber den C64 gekommen. Naja, das was ich auf dem C64
                gemacht habe, konnte man nicht unbedingt als PD-Club bezeichnen, aber was
                solls.<BR>
                <BR>
                APC+TCP St. B.: Welche Amigas hast du zur Zeit? Welche
                Zusatzausr&uuml;stung?<BR>
                <BR>
                Andreas Magerl: Wenn man meine Anlage so anschaut, schaut es zwar
                vielleicht ganz impossant aus, aber ich br&auml;uchte eigentlich eine
                bessere :-(<BR>
                <BR>
                <BR>
                Meine Anlagen:<BR>
                Amiga 2000, 2630 Turbokarte, 8 MB Ram, 1.23 GB Festplatte, 4 Laufwerke,
                ISDN-Karte, Zyxel Modem (Mailbox).<BR>
                Amiga 2000, 3 MB Ram, 50 MB, 105 MB und 170 MB Festplatten 2 Laufwerke
                (den haben momentan meine Eltern :-)) )<BR>
                Amiga 4000 LC 40, 10 MB Ram, 420 MB HD, 1 internes HD-Laufwerk, 1 externes
                3.5" Laufwerk was komischerweise nicht funktioniert, 1 5.25" Laufwerk
                extern, 1 internes CD-ROM Laufwerk, 486 Golden Gate DOSEN-PC Karte &amp;
                VGA-DOSEN Karte, 2400er Supra Modem.<BR>
                <BR>
                Dazu nat&uuml;rlich noch 2 Monitore, diverse M&auml;use, Tastaturen,
                Lautsprecher, CDs, Disk usw.<BR>
                <BR>
                APC+TCP St. B.: Wie bist du auf die Idee gekommen, einen Computerclub zu
                gr&uuml;nden. Einfach aus Jux, oder sollte das Ganze etwas professioneller
                werden?<BR>
                <BR>
                Andreas Magerl: Der Grund einen Club zu gr&uuml;nden war nat&uuml;rlich
                das Machtgef&uuml;hl, viele treue Amiga-Untertahnen zu haben ;-) Ne im
                Ernst: Im Grunde war es eigentlich mehr ein Jux und am Anfang habe ich die
                Sache auch ziemlich chaotisch aufgezogen (Ganz alte Mitglieder wissen von
                was ich spreche.) Aber mittlereile wurde aus Jux Ernst (und Ernst ist 3
                Monate alt ;-))  ) und was aufs dem Club inzwischen geworden ist, das kann
                ja jetzt jeder bewundern.<BR>
                <BR>
                APC+TCP St. B.: Seit wann gibt es den APC+TCP Amiga Computerclub denn
                jetzt und wieviele Mitglieder geh&ouml;ren ihm an?<BR>
                <BR>
                Andreas Magerl: Hmm, also der Club ist ja mehrmals umstrukturiert und
                umbenannt worden. Das Original hie&szlig; damals vor ca. 5 Jahren nur TCP.
                Richtig funkt es erst seit er wieder "nur" APC+TCP hei&szlig;t und ich die
                alleinige Kontrolle &uuml;ber den Club habe. So seit ca. 18 Monaten.
                Momentan eben seit diesen 18 Monaten haben wir genau 222 Mitglieder
                (Stand: 18.08.94) und der Trend schaut recht positiv aus. Ha, wir schaffen
                noch die vollen 1000 :-)<BR>
                <BR>
                APC+TCP St. B.: Wieviele St&uuml;tzpunkte, Clubs... die dem APC+TCP
                Computerclub angeh&ouml;ren gibt es insgesamt? Und wieviele
                St&uuml;tzpunkte, Clubs... willst du Bundesweit noch einrichten?<BR>
                <BR>
                Andreas Magerl: Momentan gibt es genau 4 St&uuml;tzpunkte (inkl. mir) und
                Ziel ist es, soviele St&uuml;tzpunkte wie m&ouml;glich zu haben.
                Nat&uuml;rlich arbeite ich mit mehreren Clubs oder DiskMags zusammen wie
                z. B. Amiga Gadget, Powerbrei, Amiga Energy, Ehmalige TUC, A&amp;M, Infox
                usw.<BR>
                <BR>
                APC+TCP St. B.: Welche Aktionen planst du zur Zeit mit dem Club. Wann gibt
                es einmal eine &uuml;berregionale Party oder &auml;hnliches?<BR>
                <BR>
                Andreas Magerl: Ach du Schande. Eine &uuml;berregionale Party? Noch so ein
                Flop wie in Traunstein?? Ne, also dieses Jahr auf gar keinen Fall mehr.
                Aber irgendwann, wenn der Club gr&ouml;&szlig;er ist und ich mehr
                Einflu&szlig; zur Presse habe und ein paar Sponsoeren finde, machen wir da
                auf jeden Fall wieder etwas!<BR>
                <BR>
                Planen tun wir f&uuml;r die Zukunft verdammt viel. Hier m&ouml;chte ich
                aber auf einen Artikel in der NC7 (SmallTalk) hinweisen, weil das ein
                l&auml;ngerer Text ist und hier den Rahmen sprengen w&uuml;rde.<BR>
                <BR>
                APC+TCP St. B.: Wird es in Zukunft noch mehr Leistungen f&uuml;r
                Clubmitglieder geben, wie z. B. mehr Rabatt....?<BR>
                <BR>
                Andreas Magerl: Jo, es wird bestimmt immer mehr Leistungen f&uuml;r
                Clubmitglieder geben. Die Methode "Mitglieder helfen Mitglieder" hat ja
                bis jetzt verdammt gut funktioniert. Und einige neue Sachen werden auch
                dazukommen, da wir in Zukunft sehr eng mit dem ICP-Verlag (AmigaPlus)
                Zusammenarbeiten werden. Aber dazu steht auch was im SmallTalk. Mehr
                Rabatt wird es erstmal nicht bei mir genben. Billiger geht es halt nicht
                mehr. Aber wenn wir mal mehr Mitglieder haben (&uuml;ber 500) werde ich
                mal wieder anfangen diverse H&auml;ndler zu Rabatten zu &uuml;berreden.
                Das kann ich aber erst machen, wenn der Club um einiges gr&ouml;&szlig;er
                ist!<BR>
                <BR>
                Hm, ein Rabatt kann ich mal verraten: Die Eintrittskarten zur Messe gibt
                es bei uns billiger!<BR>
                <BR>
                APC+TCP St. B.: Machst du Werbung f&uuml;r den Club? Wenn ja, wo und
                wieviel Werbung? Falls nein, warum?<BR>
                <BR>
                Andreas Magerl: Ob ich Werbung f&uuml;r den Club mache?? Schon fast eine
                bl&ouml;de Frage ;-))))))<BR>
                Chlor, also ich schalte nach M&ouml;glichkeit kostenlose Anzeigen und die
                Aktionen in diversen Zeitschriften (Virenkiller gegen Leerdisk und
                R&uuml;ckporto) ist ja auch Werbung, da jeder so ein kleines InfoHeft von
                uns bekommt.<BR>
                <BR>
                Und nat&uuml;rlich der Kontakt zur Presse selbst ist auch wieder Werbung.
                Immerhin wird die NoCover &ouml;fters mal erw&auml;hnt.<BR>
                <BR>
                APC+TCP St. B.: Verkauft sich die NoCover so wie du es erwartest? Wieviele
                ABOs hast du jetzt von der NoCover verkauft? Wieviele Leute lesen die
                NoCover jetzt?<BR>
                <BR>
                Andreas Magerl: Man kann nie zuviel verkaufen :-)<BR>
                Nein, die NoCover ist DER ERFOLG &uuml;berhaupt. Ich h&auml;tte nie
                gedacht, das soooo viele Mitglieder bereit sind, Texte f&uuml;r
                ein Diskettenmagazin zu schreiben. Und vielen User gef&auml;llt das
                Magazin. Wenn man bedenkt, das die erste Ausgabe innerhalb von 2 Wochen
                erstellt worden ist. Die NoCover erscheint p&uuml;nktlich und jetzt sogar
                schon auf 2 Disketten.<BR>
                Ich selbst schicke ca. 200-250 pro Ausgabe raus. Da sind aber viele dabei
                die sie gegen Leerdisk und R&uuml;ckporto bekommen. Abos haben wir ca. so
                um die 70 rum. Bin jetzt ehrlich gesagt um da nachzuschauen. Aber im
                Impressum stehts ja eh. (Ein paar Abos mehr w&auml;ren nicht schlecht :-)
                ) Wenn man mal die Verbreitung durch weiterkopieren und DF&Uuml; mit
                einrechnet, sch&auml;tze ich mal das so um die 1000 Amiga-Freaks die
                NoCover durchschm&ouml;kern.<BR>
                Texte daf&uuml;r kann ich nat&uuml;rlich immer brauchen!<BR>
                <BR>
                APC+TCP St. B.: L&auml;uft alles mit dem Club zu deiner Zufriedenheit,
                oder gibt es Dinge die du &auml;ndern m&ouml;chtest?<BR>
                <BR>
                Andreas Magerl: Jaaa, ich m&ouml;chte damit so viel Geld verdienen, damit
                ich davon Leben kann und nicht mehr arbeiten mu&szlig;. Dann h&auml;tte
                ich endlich gen&uuml;gend Zeit um noch mehr f&uuml;r den Club zu machen
                und nciht immer draufzahlen.<BR>
                (Hmm, br&auml;uchte dazu eigentlich nur 400 PD-Abos und die Sache
                w&auml;re geritzt :-) )<BR>
                <BR>
                Mehr Mitglieder w&auml;re nat&uuml;rlich noch sch&ouml;ner. Ansonsten
                mu&szlig; ich echt sagen das ich mit der Entwicklung absolut zufrieden bin
                und wenn es so weitergeht mit dem Club, kann man sich eigentlich nichts
                besseres w&uuml;nschen (Au&szlig;er einen 6er im Lotto, diese Woche. Mann
                da sind diesmal 27 Millionen drinn.) Von der Messe erwarte (erhoffe) ich
                mir ja einiges.<BR>
                <BR>
                Naja und Kontakt zu H&auml;ndlern, Gro&szlig;h&auml;ndler suchen wir halt
                noch ganz gewaltig!<BR>
                <BR>
                
                APC+TCP St. B.: Zum Amiga: Wird sich der Amiga auch in Zukunft gegen
                DOSEN behaupten k&ouml;nnen, speziell auf den Sektoren, in denen der Amiga
                der Standard ist (Video, Fernsehen, Grafik...)?<BR>
                <BR>
                Andreas Magerl: Kommt echt darauf an, wer jetzt Commo kauft und was die
                aus dem Amiga machen. Der Amiga ist bestimmt nicht in jedem Bereich der
                beste Computer, aber er ist verdammt gut. Wie gesagt, ich habe eine 486
                (DOSEN)-Karte und nach meinen ersten Gehversuchen auf dieser kann ich nur
                sagen: Ich liebe meinen
                Amiga!<BR>
                <BR>
                APC+TCP St. B.: Was ist dein pers&ouml;nliches Ziel mit dem Club?<BR>
                <BR>
                Andreas Magerl: Einen Bruttoumsatz von 1.5 Mio DM im Monat, eine Villa auf
                den Malediven, einen Ferrari, einen Amiga 5000 :-))<BR>
                <BR>
                Alsoooo, ich m&ouml;chte die NoCover zum besten und gr&ouml;&szlig;ten,
                meistgelesenen DiskMag auf dem Amiga machen.<BR>
                Und der Club soll nat&uuml;rlich auch so gro&szlig; wie m&ouml;glich sein.
                Denn um so gr&ouml;&szlig;er der Club ist, um so mehr kann er
                Einflu&szlig; auf die Entwicklung auf dem Amiga-Markt nehmen und das
                w&auml;re mal dringend n&ouml;tig.<BR>
                <BR>
                APC+TCP St. B.: W&uuml;rdest du auf einen anderen Rechner umsteigen, falls
                die Sache mit dem Amiga nicht so l&auml;uft? (he, he: eine gemeine
                Frage)<BR>
                <BR>
                Andreas Magerl: Hmm, auf welchen????? Sicher irgenwann werde ich auch mal
                was auf der DOSE aufziehen. Aber umsteigen????? Ein klipp und klares
                NEIN!!!!!<BR>
                <BR>
                APC+TCP St. B.: Hast du eigentlich einen Job, oder machst du den Club
                hauptberuflich?<BR>
                <BR>
                Andreas Magerl: Sch&ouml;n w&auml;rs. Will nicht jemand ncoh ein paar
                PDAbos haben??? Spielekisten, Saar, NoCover oder so????<BR>
                <BR>
                Also ich war mal Gesch&auml;ftsf&uuml;hrer bei der Firma Rewe (ist
                &uuml;brigens eine Sch*** Firma!) und habe dann mal nach ein paar Jahren
                den Job wegen dem Amiga geschmissen. Jetzt arbeite ich halt nur noch 3
                Tage als "normaler Verk&auml;ufer" bei denen. Wenn die mich nicht so gut
                zahlen w&uuml;rden (Der Vorteil des EX-Chefs :-))  ) k&ouml;nnte ich mi
                rden Luxus vermutlich gar nicht leisten.<BR>
                <BR>
                Und wir entwickeln ja noch eigene (C)-Software. Das geht bis jetzt auch
                einigerma&szlig;en gut. Wir brauchn nur noch H&auml;ndler und die Sache
                w&auml;re gelaufen.<BR>
                <BR>
                Wenn man mal die Zeit so rechnet, kann man eigentlich sagen, das ich den
                Club mehr oder weniger hauptberuflich mache, auch wenn ich vom anderen Job
                lebe.<BR>
                <BR>
                APC+TCP St. B.: Der Club hat ja auch eine Mailbox. Was machst du sonst so
                per DF&Uuml;? Wieviele Modems und welche hast du?<BR>
                <BR>
                Andreas Magerl: Also ich bin haupts&auml;chlich &uuml;ber die Netze
                unterwegs. In anderen Mailboxen bin ich recht selten. Ich habe ein Zyxel
                Modem und eine ISDN-Karte die ich meist bentutze weil es halt billiger
                ist. In den Netzen schreibe ich unter dem Namen
                ANDREASHighvolt.gun.de.<BR>
                <BR>
                APC+TCP St. B.: So, das war jetzt ein ziemlich langes Interview und wir
                kommen jetzt einmal zum Schlu&szlig;. Hast du noch eine Message an die
                NoCover-Leser?<BR>
                <BR>
                Andreas Magerl: Jaaa! Kauft die NoCover :-) und schreibt weiterhin soviele
                gute Texte.<BR>
                <BR>
                APC+TCP St. B.: Gut, dann bedanke ich mich jetzt einmal bei dir f&uuml;r
                das (aufschlu&szlig;reiche) Interview mit dir.<BR>
                <BR>
                Andreas Magerl: Hmmm, ob meine Antworten aufschlu&szlig;reich waren?????
                :-)))<BR>
                <BR>
                Also bis dann, see you later.<BR>
                <BR>
                <BR>
                <BR>
                So, das war jetzt das Interview mit dem Andreas. Vielen Dank nochmal
                daf&uuml;r, Andreas! :-)<BR>
                <BR>
                <BR>
                Stefan Wunner<BR>
                <BR></P>
                </TD>
            </TR>
            </TABLE>
            <BR>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
