<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Inhalt Spielekiste E X T R A</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="pdl0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="pdl.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" SUMMARY="" BGCOLOR="#C0C0C0">
        <TR>
            <TD><IMG SRC="pdl.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#pdl0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <BR>
            <TABLE ALIGN="CENTER" WIDTH="90%" BORDER="0" CELLPADDING="10" SUMMARY="">
            <TR>
                <TD>
                <PRE>

 ------------------------------------------------------------------------
                       SPIELEKISTE  E X T R A
 ------------------------------------------------------------------------



                     SK   E x t r a   # 01

Operation Lemming:Etwas makaberes Ballerspiel. Alle Lemminge die sich &uuml;ber
                  den Bildschirm trauen, m&uuml;&szlig;en "erledigt" werden. Lemminge
                  gibt es viele -aber die Munition ist rationalisiert.
                  Charityware.
                  Hersteller: Chris Foote / Infinity



                     SK   E x t r a   # 02 A+B

Emerald Tools   : ---&gt; Jetzt auf SK-EC 01!!



                     SK   E x t r a   # 03

Kopf Ab         : Auch unter dem Namen GUILLOTINE bekannt; HangMan-Variante
                  vor etwas makabrem Hintergrund... - Shareware.
                  Autor: G&uuml;nter Meister

Target          : Schon der Untertitel "The Game of Killing" deutet es an -
                  hier geht es gnadenlos "zur Sache". Mit dem Fadenkreuz
                  wird auf alles geballert, was sich bewegt.
                  Autor: Juha K&auml;ki



                     SK   E x t r a   # 04

Emerald-Tutorial: ---&gt; Jetzt auf SK-EC 04!!



                     SK   E x t r a   # 05

Helpline #1     : Tips-Tricks-L&ouml;sungen zu vielen Spielen, die sich auf den
                  SPIELEKISTEN-Disks befinden. Wird ca. 3 monatlich auf den
                  neuesten Stand gebracht. Mit Update-Service!
             ---&gt; Weitere Tips-Tricks-L&ouml;sungen direkt an das NORDLICHT-
                  Team oder an BERLIN-PD. Alles klaro?


                     SK   E x t r a   # 06

Amiga Tetris Special: Ein schickes Tetrisspiel mit diversen neckischen
                  Hintergrundbildern. Macht m&uuml;de M&auml;nner munter...
                  Ideenlieferant: Sky-Devils



                     SK   E x t r a   # 07

CrimeAttack     : Terroristenjagd im Hinterhaus. Pl&ouml;tzlich im Fenster auf-
                  tauchende Gangster sind zu eliminieren. Aber den Geiseln
                  darf nichts geschehen! Hartes Baller- und Reaktionsspiel.
                  Autor: Harald Wagner

Assault         : Baller- und Reaktionsspiel der gnadenlosen Art! Hinter
                  einer Fensterfassade zuf&auml;llig auftauchende Objekte m&uuml;s-
                  sen blitzschnell 'erlegt' werden.
                  Autor: Arno 'Sigh' Jellema



                     SK   E x t r a   # 08 A+B

X-Poker         : Eine Super-Poker-Simulation. Das X steht f&uuml;r SeX - also
                  Strip-Poker...
                  F&uuml;r alle Zocker mit min. 1.5 MB.



                     SK   E x t r a   # 09 A+B

Roll Or Die     : Harte Arbeit f&uuml;r Joystick-R&uuml;ttler. Gute Grafik, toller
                  Sound - aber die Spielidee ist Geschmackssache.
                  Hersteller: Animators



                     SK   E x t r a   # 10

T.A.C.L.        : "The Adventure Construction Language" ist ein umfassen-
                  des Entwicklungspaket f&uuml;r Text- und Grafik-Adventure.
                  Auf dieser Disk sind neben dem Player PADV (Play ADVen-
                  ture) auch zwei mit T.A.C.L. erstellte Abenteuerspiele
                  namens JUNGLE und RESCUE sowie Dokumentationen.
                  Achtung: mit dieser Disk ist es nicht m&ouml;glich, eigene
                  Adventures zu erstellen, da dazu MADV erforderlich ist.
                  Dieser Adventure-Creator befindet sich nur auf dem kom-
                  pletten Entwicklungssystem, das aber im Handel erh&auml;lt-
                  lich ist.
                  Hersteller: Micro Momentum Inc.



                     SK   E x t r a   # 11

Pussy Quest I   : A Weekend in the Bush; erotisches Textadventure mit
                  recht eindeutigen Fragen und Antworten. Gute Englisch-
                  Kenntnisse sind vonn&ouml;ten.
                  Autor: Sick Minds Software

MiddleEast Madness: Klassische S.E.U.C.K.-Ballerei vor dem Hintergrund des
                  Kuwait-Krieges. In der W&uuml;ste geht es Auge um Auge zur
                  Sache. Deine Aufgabe: die gef&auml;hrlichen chemischen Waf-
                  fen zerst&ouml;ren, gefangene Geisel befreien und den in-
                  famen Hussain besiegen.



                     SK   E x t r a   # 12

Eduard v1.8     : Umfangreiches deutsches Adventure-Programmentwicklungs-
                 system in einer neuen Version (damit wurden z.B. das
                 Textadventure 'In Seenot' geschrieben). Mit ausf&uuml;hr-
                 licher Dokumentation.
                 Autor: Dirk 'Bakcm' Weber


                     SK   E x t r a   # 13

A.C.K. V1.10    : Hier kommt die "ultimative" Hilfe f&uuml;r alle Rollenspiel-
                  fans, die sich lieber ihre eigenen Dungeons und Parties
                  kreieren will...
                  Mit ausf&uuml;hrlicher (nat&uuml;rlich deutscher!) Dokumentation
                  und zwei fertigen Adventures: Schattenforst sowie
                  Ork-Angriff.
                  Autor: Robert M&uuml;ller



                     SK   E x t r a   # 14

DenMine         : ---&gt; Jetzt auf SK-EC 14!!



                     SK   E x t r a   # 15 A+B

Spacegods       : Auf zum Duell! Zwei Spieler versuchen sich gegenseitig
                  in 4 harten Leveln mit sch&ouml;nen Hintergrundgrafiken den
                  Garaus zu machen.
                  Das eigentliche Spiel befindet sich auf der zweiten
                  Disk; auf der ersten ist als Motivation ein sehens-
                  wertes Demo.
                  Autoren: Garry Ferguson &amp; Thomas Robinson


                     SK   E x t r a   # 16

Chess-Tutor     : Diese Disk beinhaltet mehrere spielbare Demoversionen
                  von Schachprogrammen. Freeware.
                  Autor: Bill Jordan



                     SK   E x t r a   # 17

FreakMine       : ---&gt; Jetzt auf SK-EC 17!!



                     SK   E x t r a   # 18

TexasChainsawMassacre: Hartes Kettens&auml;gen-Spiel nach einem "authentischen
                  Fall". Unter Zeitdruck mu&szlig; man mit seiner Kettens&auml;ge
                  Menschen zerkleinern. Die Ger&auml;uschkulisse ist schon
                  schaurig genug, aber auch die grafischen Darstellun-
                  gen k&ouml;nnen eine leichte G&auml;nsehaut erzeugen.
                  Autor: BSY

Mad_Bomber      : Von oben herunterfallende Bomben m&uuml;ssen rasend schnell
                  aufgefangen werden - doch dieses hektische Spiel ist oft
                  schneller zu Ende, als man sich versieht...
                  Autor: Jeffrey D. Panici



                     SK   E x t r a   # 19

UChess          : UChess (GnuChess) ist das wohl spielst&auml;rkste Schachpro-
                  gramm f&uuml;r den Amiga. Allerdings "kostet" das auch so
                  einiges: ein 68030-Prozessor mit 5 MB RAM mu&szlig; es schon
                  sein; in der st&auml;rkeren L-Version werden sogar 10 MB
                  Fast-RAM und 040-Prozessor ben&ouml;tigt... - V2.28.
             ---&gt; Nur ab OS 2.0x und h&ouml;her sowie 68030/040 Prozessor!
                  Autor: Roger Uzun



                     SK   E x t r a   # 20

E.M.-Tester     : ---&gt; Jetzt auf SK-EC 20!!


                     SK   E x t r a   # 21

Cross 5.1       : Knobeln und Raten mit den kleinen quadratischen K&auml;stchen:
                  Cross ist ein Programm zur computerunterst&uuml;tzten Er-
                  zeugung von Gitterkreuzwortr&auml;tseln. Freeware.
                  Mit ausf&uuml;hrlicher Dokumentation.
             ---&gt; Nur ab OS 2.0x und h&ouml;her!
                  Autor: J&uuml;rgen Weinelt

Balder'sGrove   : Neue H&ouml;hlen und Labyrinthe erwarten in diesem Boulder-
                  Clone den unentwegten Emerald-Fan. Mit Leveleditor.
             ---&gt; Nur ab OS 2.0x und h&ouml;her!
                  Autor: Morgan Antonsson



                     SK   E x t r a   # 22

Kreuzwortr&auml;tsel : Urspr&uuml;nglich als monatliche Disk-R&auml;tselzeitung geplant
                  ist dies die erste und leider auch letzte Ausgabe...
                  F&uuml;r unterhaltsame R&auml;tselstunden.
                  Autor: W. Heinemann



                     SK   E x t r a   # 23

IceMines        : ---&gt; Jetzt auf SK-EC 23!!



                     SK   E x t r a   # 24

LamerExterminator:Das einzige Ziel besteht darin, soviel "Lamer" wie nur
                  m&ouml;glich zu erledigen. Diese tauchen unregelm&auml;&szlig;ig hinter
                  einer Fensterfassade auf. Action!
                  Autor: Plasticbrain/BLi

Smash-Telly     : S.E.U.C.K.-Ballerei mit wildgewordenen Zombies. Als Ein-
                  zelk&auml;mpfer" mu&szlig;t Du die weitl&auml;ufigen Flure "s&auml;ubern" -
                  ein ziemlich blutiges Unternehmen.
                  OS 1.2 - 3.0.
                  Autor: Jolyon Oberman



                     SK   E x t r a   # 25

Patiencen       : F&uuml;r "einsame Stunden" warten 12 fesselnde Patiencen da-
                  rauf gel&ouml;st zu werden. Ausf&uuml;hrliche deutsche Anleitun-
                  gen dazu sind auf der Extra #05 (HELPLINE 1) zu finden.
                  Autor: D. A. Lorner



                     SK   E x t r a   # 26A-C

Klondike Deluxe : Dies ist die wohl beste und grafisch anspruchvollste
                  Umsetzung des bekannten Klondike. Mit Editor f&uuml;r eigene
                  Karten (Card Set).
             ---&gt; Nur ab OS 2.0x und h&ouml;her!
                  Hersteller: REKO-Productions



                     SK   E x t r a   # 27

IntoTheHinstoryHoles: ---&gt; Jetzt auf SK-EC 21!!



                     SK   E x t r a   # 28A+B

MotorolaInvaders: Ist es ein Spiel? Ist es ein Demo?? Nach dem booten der
                  zwei Disks bekommt man zun&auml;chst ein Spitzen-Musikst&uuml;ck
                  zu h&ouml;ren. Des weiteren kann man per Joystick und Feuer-
                  taste den Bildschirm von Viren befreien.
                  Ist es nun ein Ballerspiel mit Supermusik?
                  Oder ist es ein Musik-Demo mit Spieleinlage??
            ---&gt;  Nur f&uuml;r AGA-Rechner!
                  Autor : Martinsoft



                     SK   E x t r a   # 29

Sonic-The Hedgehog: Gelungene Parodie auf den gleichnamigen SEGA-Hit.
                  Autoren: DCS



                     SK   E x t r a   # 30

Scene-Gamedisk  : Logic - Zarcan - KidPool
                  Drei tolle Spiele aus der Szene! Logic - eine "4 Ge-
                  winnt"-Variante (auf 4 Ebenen) f&uuml;r 1 oder 2 Spieler.
                  Zarcan - Strategie/Knobelspiel mit 39 Leveln (The
                  Real Atomania). Und KidPool - Pool-Billard per Maus.
                  Spiel gegen unterschiedlich starke Computergegner.
            ---&gt;  KidPool l&auml;uft nicht einwandfrei unter OS 2.0!
                  Autoren: Black Legend



                     SK   E x t r a   # 31A-C

TubeWarriors    : Superspiel f&uuml;r alle Freunde des Kampfsports. Per Joy-
                  stick wird der K&auml;mpfer im gelben Anzug gesteuert, die
                  Gegner &uuml;bernimmt der Computer. Es kann geboxt und ge-
                  treten werden, anscheinend sind alle Mittel erlaubt um
                  den Partner auf die Matten zu schicken.
                  Die K&auml;mpfe finden an acht verschiedenen Schaupl&auml;tzen
                  statt und die Gegner werden immer st&auml;rker und hinter-
                  h&auml;ltiger...
            ---&gt;  Nur f&uuml;r AGA-Rechner!



                     SK   E x t r a   # 32

Yatzooie II     : Exzellente Yathzee-Umsetzung f&uuml;r 1 oder 2 Spieler!
                  Freeware. Ben&ouml;tigt 2 MB FastRam!
            ---&gt;  Nur f&uuml;r AGA-Rechner!
                  Autor: Ken Winfield



                     SK   E x t r a   # 33

Kreuzwort v2.0  : Neue Version des (elektronischen) Zeitvertreibs mit
                  45 Kreuzwortr&auml;tseln &agrave; 54 Fragen. Ist eine Antwort ge-
                  funden, so verschwindet die Frage und die n&auml;chste Frage
                  r&uuml;ckt nach. Ist die Antwort falsch, erscheint kurzzei-
                  tig die richtige Antwort auf dem Bildschirm. Deutsch.
                  Gegen Zahlung der Shareware sind beim Autor weitere
                  R&auml;tsel erh&auml;tlich. - OS 1.3-3.0.
                  Bearbeitung: Henry K&ouml;nig

Crossword       : Kreuzwortpuzzle f&uuml;r knobelige Stunden. Leider sind
                  sehr gute Englisch-Kenntnisse vonn&ouml;ten... - OS 1.3-2.0.
                  Autor: Mike Epting

FireBall 2000   : Shareware-Version eines bunten Arkanoid-Verschnitts.
                  Start ist in einem U-Boot unter Wasser vor vorbeischwim-
                  menden Fischen... Ein paar Level probespielen macht Lust
                  auf mehr (Vollversion auf 2 Disks ist beim Autor erh&auml;lt-
                  lich). - OS 1.3-3.0.
                  Autor: Jayhawk/Steve Williams


                     SK   E x t r a   # 34

Banshee PV      : Spielbares Demo eines neuen hervorragenden technisch
                  perfekten Ballergames in AGA-Qualit&auml;t. Der Spieler &uuml;ber-
                  nimmt die Rolle des tapferen Sven, der in seinem Banshee
                  Flugzeug eine heldenhafte Mission gegen die Macht von
                  Blardax Maldrear &uuml;berstehen mu&szlig;.
            ---&gt;  Nur f&uuml;r AGA-Rechner!
                  Hersteller: Core Design



                     SK   E x t r a   # 35

Hoi-AGA-Remix   : F&uuml;nf Spezial-Level des bekannten Hoi-Games erwarten
                  hier die Besitzer eines AGA-Amigas. Ein niedliches Jump
                  &amp;Run-Spiel der Spitzenklasse! Zu Beginn kann in einem
                  Menu ausgew&auml;hlt werden, welcher Level besucht werden
                  soll:  1. back to nature
                         2. construction site
                         3. shoot'em-up
                         4. water
                         5. epileptic finale
                  Au&szlig;erdem kann man die Anzahl der Bildschirmleben (1-9)
                  des kleinen, gr&uuml;nen Dinos vorgeben, wem neun zu wenig
                  sind, der klickt einfach auf Trainer und hat nun unend-
                  lich viele davon. Toller Sound, tolle Grafik... it's
                  not a trick...it`s AGA.
            ---&gt;  Nur f&uuml;r AGA-Rechner!



                     SK   E x t r a   # 36

Ack-Ack         : Luftkampf &uuml;ber England! Die Deutschen greifen nicht nur
                  mit allem m&ouml;glichen Flugger&auml;t an sondern setzen auch
                  ihre neueste Erfindung, die V2 ein. Es ist nun Deine
                  Aufgabe alles vom Himmel herunterzuholen, damit die
                  deutsche Luftwaffe nicht den Sieg davontr&auml;gt.
                  Guinnessware (die Autoren m&ouml;chten auf ein Glas Bier
                  eingeladen werden). - OS 1.3-3.0.
                  Autoren: Paul Hardy &amp; David Graham/SpireSift

Parattack       : Auf einem einsamen Posten an vorderster Front wirst
                  Du pl&ouml;tzlich von feindlichen Fallschirmspringer ange-
                  griffen. Wenn Sie den Boden erreichen, dann bist Du
                  bald dran... Also wehre Dich Deiner Haut und hole al-
                  les vom Himmel, was da sich nur bewegt. Mit Highscore-
                  liste (Disk darf dann nicht schreibgesch&uuml;tzt sein).
                  Shareware. - OS 1.3-3.0.
                  Autor: Andrew Kreibich



                     SK   E x t r a   # 37A-C

Klondike II     : Die mit Abstand beste Solitaire-Version!
            ---&gt;  Nur ab OS 3.0 und AGA-Chips! Programm mu&szlig; auf HD instal-
                  liert werden; dazu nur Icon anklicken und Disks wech-
                  seln. (Disks haben keinen Bootblock.) - Shareware.
                  Hersteller: REKO-Productions



                     SK   E x t r a   # 38

AmosAlley       : Die Anleitung ist kurz und b&uuml;ndig: 'Shoot the bad guys'.
                  Damit ist auch schon alles gesagt... Hinter einer Fen-
                  sterwand tauchen Gesichter auf und dann m&uuml;ssen alle
                  &Uuml;belt&auml;ter blitzschnell mit der Maus erledigt werden.
                  (Wenn nur alles im Leben so einfach w&auml;re...)
                  Shareware. - OS 1.3-3.0.
                  Autor: Dean Prunier

Op.Desertstorm  : Nicht allzu anspruchsvolle Ballerei vor dem Hintergrund
                  des Golfkrieges. Ben&ouml;tigt 2 MB Ram (davon 1 MB Chip).
                  OS 1.3-3.0.



                     SK   E x t r a   # 39

LED-Clones      : Ballern pur! Vor einer Hauskulisse mit parkenden Autos
                  tauchen wild um sich ballernde Gangster auf und m&uuml;ssen
                  mit dem Phazer (oder wahlweise der Maus) abgeknallt
                  werden. - OS 1.3-3.0.
                  Autor: David Green (Marksman)

Marksman        : Kleines Magazin f&uuml;r Benutzer des 'Trojan Light Phasers'
                  mit n&uuml;tzlichen Informationen.
                  Autor: David Green (Marksman)



                              *     *
                                 *

                </PRE>
                </TD>
            </TR>
            </TABLE>
            <BR>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="pdl.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#pdl0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

