<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Inhalt Spielekiste 301-350</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="pdl0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="pdl.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" SUMMARY="" BGCOLOR="#C0C0C0">
        <TR>
            <TD><IMG SRC="pdl.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#pdl0"></TD>
        </TR>
        <TR>
            <TD>
            <TABLE ALIGN="CENTER" WIDTH="90%" BORDER="0" CELLPADDING="10" SUMMARY="">
            <TR>
                <TD>
                <BR>
                <BR>
                <PRE>

                     S p i e l e k i s t e   # 301

X-Balls         : Ausgekl&uuml;geltes Denk- und Gr&uuml;belspiel. Laufende Kugeln
                  m&uuml;ssen durch geschicktes Setzen der Hindernisse so um-
                  geleitet werden, das sie in den Auffangbeh&auml;lter ge-
                  langen. Nach jedem gel&ouml;sten Level erh&auml;lt der Spieler
                  ein Passwort.
                  Autor: Marcus Oblak

Entropy         : Hartes S.E.U.C.K.-Kampfspiel nach altbekannter Art und
                  Weise. Hier ist wieder ballern pur angesagt. F&uuml;r 1 oder
                  2 Spieler.
                  Autor: Paul Shepherd



                     S p i e l e k i s t e   # 302

The Right Way - : Rechtzeitig zu Ostern 1993 kommt nun ein weiterer Teil
  Easter Edtion   der PD-linge auf der Suche nach ihrem "richtigen Weg"
                  heraus. Ein Mu&szlig; nicht nur f&uuml;r alle Lemmings-Fans!
                  Shareware.
                  Autor: Michael Taupitz



                     S p i e l e k i s t e   # 303

Mostares II     : Jetzt findet die Geschichte aus MOSTARES (SK #177) ihre
                  Fortsetzung und auch ihren Abschlu&szlig;. Der Spieler jagt in
                  einem Gleiter mit 30 Bildern/sec &uuml;ber eine Gitterland-
                  schaft und mu&szlig; 13 Missionen erf&uuml;llen.
                  Autor: Markus P&ouml;llmann



                     S p i e l e k i s t e   # 304

FeedingFrenzy   : Aus mehreren defekten Rohren tropft Blut in ein gro&szlig;es
                  Aquarium. Wenn es Dir nicht gelingt, das Blut mit einem
                  Eimer aufzufangen, dann ger&auml;t die Situation au&szlig;er Kon-
                  trolle: denn noch ist der Hai im Becken ruhig und zieht
                  langsam seine Kreise... - Version 2.1.
            ---&gt;  Steuerung &uuml;ber Cursortasten; bitte nicht Maus benutzen!
                  Autor: Peter Gage / Breakaway Software



                     S p i e l e k i s t e   # 305

Wastelands      : Mit dem 3D-Construction-Kit erstelltes 3D Graphik-Adven-
                  ture. Durch einen tragischen, technischen St&ouml;rfall wurde
                  in der U.S. Nuclear Base "Europe" der Kriegszustand ein-
                  geleitet. Nun bist Du die letzte Hoffnung: Suche den Se-
                  curity-Cardkey, um in den Access Rooms den Hauptcomputer
                  zu deaktivieren. Wenn es Dir nicht gelingt, dann l&auml;uft
                  das Abwehrprogramm JOSHUA bis zum bitteren Ende...
                  Hersteller: Artworx Design

Aztec Challenge : Spie&szlig;rutenlaufen bei den alten Azteken - so beginnt
                  diese herrliche Umsetzung eines alten 64er Klassikers.
                  Doch wenn Du die Pyramide lebend erreichst, dann gehen
                  die Abenteuer erst richtig los... Neben Geschick und
                  Taktik sind auch schnelle Reaktionen vonn&ouml;ten...
                  Autoren: Bignonia/Bitboy



                     S p i e l e k i s t e   # 306

5. Kolonne      : Stimmungsvolle SEUCK-Ballerei; mit dem Gleiter geht es
                  &uuml;ber gef&auml;hrliche Planetenoberfl&auml;chen. Nur wer zuerst
                  schie&szlig;t... - Erstver&ouml;ffentlichung.
                  Autor: Mirko Gebhardt

Nebula          : Vor einer stimmungsvollen Hintergrundgeschichte (The
                  Wars of Uropa - nach dem gro&szlig;en galaktischen Krieg...)
                  geht es nun mit einem Panzer durch eine hervorragend 
                  dargestellte 3D-Landschaft auf der Suche nach feindli-
                  chen Fahrzeugen. Dann tritt die Laserkanone in Aktion.
                  Freeware.
                  Autoren: Paul Goulding &amp; Stephen Smith

Cardory         : Nettes Memory mit den 32 Skatkarten f&uuml;r ein schnelles
                  Spielchen zwischendurch. V1.0a. Freeware.
                  Autor: Hanns Holger Rutz

Siege of the Beast: Kleines Strategical in der Art des recht bekannten
                  Kinderspiels "Fuchs und Gans". Nur ist diesmal der Fuchs
                  auf dem 9x9 gro&szlig;en Feld eine "biestige" Schlange...
                  Autor: Nick Torkos



                     S p i e l e k i s t e   # 307

Brainy          : Unterhaltsames Wissensspiel in der Art von "Trivial Pur-
                  suit" f&uuml;r bis zu 6 Spieler. Ziel des Spiels ist es, die
                  6 "Wissensecken" (z.B. Sport &amp; Vergn&uuml;gen, Kunst &amp; Lite-
                  ratur, Unterhalt, u.a.) zu vervollst&auml;ndigen und schlie&szlig;-
                  lich auf dem linken oberen Startfeld zu landen.
                  Im Finale m&uuml;ssen dann noch von 6 gestellten Fragen mind-
                  destens 3 richtig beantwortet werden. Mit Frageneditor.
                  Freeware.
                  Autor: Michael Flad



                     S p i e l e k i s t e   # 308

Das schmutzige Erbe: Die Fortsetzung eines der besten frei kopierbaren
                  Spiele auf dem Amiga (DAS ERBE I - SK #51)! Diesmal er-
                  h&auml;lt der Spieler eine Bankvollmacht und kann &uuml;ber drei
                  Millionen Mark verf&uuml;gen. Aber es w&auml;re ja kein Umwelt-
                  spiel, wenn das Geld nicht sinnvoll ausgegeben werden
                  m&uuml;&szlig;te... So sollte man den flotten Sportwagen beim H&auml;nd-
                  ler lassen - wenn es das Fahrrad auch tut (Seufz!).
                  Plastikt&uuml;ten sind tabe, wenn man frisches Obst und Ge-
                  m&uuml;se auch in Mehrzwecktaschen transportieren kann...
                  Unterhaltsame Stunden sind bei diesem neuen Umwelt-
                  spiel (nat&uuml;rlich komplett in deutsch) garantiert. -
                  Weitere Hinweise zu Erbe II sind auf der Helpline I
                  (SK Extra #05) zu finden.
             ---&gt; Das Erbe I ist auf der SPIELEKISTE #51.
                  Herausgeber: Umweltbundesamt



                     S p i e l e k i s t e   # 309

Atishoo         : Denk- und Taktikspiel; verschiedene Steine m&uuml;ssen so auf
                  einem Spielbrett plaziert werden, da&szlig; Steine mit glei-
                  cher Farbe oder gleichem Symbol immer nebeneinander
                  liegen.
                  Autor: Colin Naylar

Cow Wars        : Krieg der K&uuml;he - nettes 2-Spieler-Shoot'em up! Aber
                  dabei spielt auch die Taktik (und Technik) eine wichtige
                  Rolle...
                  Autor: Chris Richards



                     S p i e l e k i s t e   # 310

Kid'sFun XIII   : Wieder ein sch&ouml;nes Game, das speziell f&uuml;r die KIDsFUN-
                  Reihe geschrieben wurde:
              
                   P u z z l e   M e
                  Vier verschiedene Bilder stehen zur Wahl. Sie k&ouml;nnen in
                  20, 25, 40 oder sogar 80 Teile zerlegt werden.
                  Deine Aufgabe ist es nun, die Teile mit der Maus so zu
                  ordnen, das wieder ein komplettes Bild entsteht...
                  Ab 7 Jahre.
                  Autor: Delf Schl&uuml;ter



                     S p i e l e k i s t e   # 311

SuperKniffel V2.0:Umfangreiches Super-Kniffel in einer Normal- und einer
                  speziellen Version mit 3 Kniffelreihen. Leicht einge-
                  schr&auml;nkte Demoversion; die Vollversion ist bei den Au-
                  toren erh&auml;ltlich.
                  Hersteller: Flashlight-Star-Software

5 mal 5         : Schnelles Ratespiel um Worte mit f&uuml;nf Buchstaben (nach
                  der gleichnamigen SAT-1 Sendung). Der Anfangsbuchstaben
                  wird jeweils vorgegeben und dann mu&szlig; in max. f&uuml;nf Ver-
                  suchen der Begriff erraten werden. Das knappe Zeitlimit
                  sorgt f&uuml;r zus&auml;tzliche Hektik.
                  Autor: Michael Taupitz



                     S p i e l e k i s t e   # 312

KrillianIncident: Die Federation hat sich &uuml;ber die ganze bekannte Galaxis
                  ausgebreitet und erforscht nun unbekanntes Territorium.
                  Aber nicht alle Zivilisationen haben sich der Federation
                  angeschlossen; insbesondere die Krills wollen in ihrer
                  Isolation verbleiben. Wer beh&auml;lt die Oberhand? Die Fede-
                  ration? Oder die Krills?
                  Spannendes Weltraum-Strategiegame. V1.1.
                  Autor: John Wilson
              --&gt; Dieses Games ist leider ein "&uuml;bler ChipMem-Fresser";
                  deshalb wird empfohlen, das Spiel direkt durch booten
                  zu starten.

MindChaos       : Denk- und Strategiespiel mit recht einfachen Regeln. Auf
                  einem 10x10 gro&szlig;en Spielfeld m&uuml;ssen vorgegebene Zahlen-
                  muster erstellt werden; dabei wird jedes angeklickte
                  Feld sowie alle Nachbarfelder jeweils um den Wert 1 er-
                  h&ouml;ht (bei '9' verschwindet es dann wieder vom Spiel-
                  feld). Tja - einfach mal ausprobieren...
              --&gt; Start &uuml;ber Workbench.
                  Autor: Volker Stepprath



                     S p i e l e k i s t e   # 313

Leaping Larry   : Kniffliges Plattformspiel nach einem alten 64er Game.
                  Larry mu&szlig; &uuml;ber laufende Plattformen, die sich entgegen-
                  gesetzt bewegen und sehr l&ouml;chrig sind, den oberen Bild-
                  schirmrand erreichen. Aber leichter gesagt, als getan.
                  Eingeschr&auml;nkte Demoversion.
                  Autor: C. Priestley



                     S p i e l e k i s t e   # 314

Battle Cars II  : Hartes Auto-Actionspiel f&uuml;r 1 oder 2 Spieler. Dabei ist
                  dein Auto neben einer 30mm Kanone auch mit Fernlenkge-
                  schossen ausgestattet. Auf da&szlig; die Fetzen fliegen...
                  Autor: David Jameson



                     S p i e l e k i s t e   # 315 A+B

Crack Does Pay  : &Uuml;beraus spannende Wirtschaftssimulation.
                  Erstver&ouml;ffentlichung!
             --&gt;  Eine ausf&uuml;hrliche Besprechung ist auf der Helpline #1
                  (SK Extra #05).
                  Crack Does Pay ist Shareware; jeder, der Gefallen an 
                  diesem Game findet, sollte die Geb&uuml;hr von DM 15,- an
                  die Autoren entrichten. Eine &Uuml;bernahme auf andere PD-
                  Serien ist ohne schriftliche Genehmigung verboten!
                  Autoren: Manuel Gaudnek &amp; Frank Stiller/Zeus Software



                     S p i e l e k i s t e   # 316

Extreme Violence: Zwei-Spieler-Game bei dem es sehr auf Schnelligkeit an-
                  kommt. In 10 harten Leveln geht es einfach nur darum, 
                  den Gegner zuerst "zu erwischen". Durch Einsatz von Zu-
                  satzhilfen ist dies das richtige Spiel f&uuml;r alle Duellan-
                  ten. Version 6.92.
                  Autor: Simon Green

UniversalConquest: Man mag es kaum glauben - dies ist das Produkt von 5
                  Jahren intensiver Arbeit! Dabei klingt die Aufgabe in
                  diesem Weltraumgame ganz einfach: Versuche so viele Wel-
                  ten wie nur m&ouml;glich zu gewinnen... Viel Spa&szlig; dabei!
                  Autor: Randy Wing

SolitaireSampler: F&uuml;nf verschiedene Varianten stehen bei dieser sch&ouml;nen So-
                  litaireumsetzung zur Auswahl; dabei sorgen 4 Schwierig-
                  keitsgrade f&uuml;r langanhaltende Motivation.
                  Hersteller: Tower Software



                     S p i e l e k i s t e   # 317

Giddy!          : Wibble Mania mit WIBBLE WORLD GIDDY! Klassisches Action-
                  Adventure in der Art der bekannten "Dizzy"-Spiele; ein
                  unbedingtes MUSS f&uuml;r alle Fans dieses Spielegenres. -
                  Aber merke: mit Wasser kann man Feuer l&ouml;schen, Korken
                  kann man als Dichtung benutzen - mehr mu&szlig;t Du selbst
                  bei den vielen Aufgaben herausfinden... - Shareware.
                  Autor: Phil



                     S p i e l e k i s t e   # 318

SnackZone       : Action-Adventure deutscher Produktion mit sehr sch&ouml;ner
                  Grafik, witziger Animation und entsprechender Soundun-
                  termalung. Helft Lukas, das Produktionsgeheimnis f&uuml;r
                  die beliebten Bi-Fi Rolls wiederzufinden - sonst wird
                  es bald keine mehr geben...
                  Kleiner Tip: immer sch&ouml;n hilfsbereit sein, dann l&ouml;st Du
                  die Aufgaben bestimmt!
                  Hersteller: The Art Department



                     S p i e l e k i s t e   # 319

TotalFire (Raid III): Ballern, ballern, ballern - was das Zeug h&auml;lt! Jede
                  Menge Gegner erschweren dem Spieler das Bildschirmleben.
                  Und auch die pl&ouml;tzlich auftauchenden Panzer, Hubschrau-
                  ber und Soldaten sind nicht 'ohne'. Darf in keiner
                  Shoot'em Up-Sammlung fehlen.
                  Autor: Sector One

SonOfBlagger    : Geschicklichkeitsspiel &agrave; la Loderunner; Schl&uuml;ssel einsam-
                  meln und dabei den Gegnern nicht in die Arme laufen.
                  Neuerung: statt Leitern gibt es jetzt Rolltreppen.
                  Autor: Jonas Fulstrand

Zerberk         : Remake auf den Spielhallenklassiker "Berzerk". In vielen
                  Leveln warten Hunderte von Robotern nur darauf, dem 
                  Spieler sein Bildschirmleben auszublasen. Mit 1- und 
                  Mehrspielermodus (bis zu 4 Player). - Update-Version 1.3
                  Autor: Matthias Bock



                     S p i e l e k i s t e   # 320

Kid'sFun XIV    : Hier pr&auml;sentieren wir - wieder exklusiv - :
              
                   W o    i s t    d e r    M o g ?
                  Wer kennt nicht den Gr&uuml;belklassiker "Superhirn" (oder
                  auch "Mastermind")? Hier ist nun f&uuml;r die j&uuml;ngeren Amiga-
                  fans eine gelungene Umsetzung - DER MOG. Du mu&szlig;t den
                  "Mann ohne Gesicht", den Magier der Verkleidungen m&ouml;g-
                  lichst schnell finden. Bekannt ist nur, da&szlig; er immer
                  drei von acht Verkleidungen benutzt (schwarze Brille,
                  schwarzer Bart, karierte Hose, wei&szlig;e Jacke, rotes Tuch,
                  schwarzer Schuh, schwarzer Hut und Koffer).
                  Nur wer die richtigen Gegenst&auml;nde in der richtigen Rei-
                  henfolge gefunden hat, entlarvt diesen Ganoven.
                  Ab 7 Jahre.
                  Autor: Delf Schl&uuml;ter



                     S p i e l e k i s t e   # 321

Mr. Brownstone  : Hier ist das ultimative Spiel f&uuml;r alle Emerald-
                  Mine-Freunde und nat&uuml;rlich auch f&uuml;r diejenigen, die es
                  noch werden wollen... "Mr. Brownstone" fordert Geschick
                  und Schnelligkeit, denn eine bestimmte Anzahl Diamanten
                  mu&szlig; unter Zeitdruck gesammelt werden. Aber Vorsicht!!
                  Von Level zu Level wird es immer kniffliger!
                  Daf&uuml;r gibt es nach jedem gel&ouml;sten Level einen Levelcode.
                  Autoren: Delight



                     S p i e l e k i s t e   # 322

Hacker II       : Nach dem CONNECT hei&szlig;t es nur lapidar: LOGON PLEASE:...
                  Und bei einem richtigen Anmeldenamen ist man dann im
                  ACTISOURCE (der International Computer Hotline). Doch
                  jetzt beginnen erst die Schwierigkeiten. Als Fachmann
                  f&uuml;r Computersicherheit sollst Du den internationalen
                  Computerterrorismus bek&auml;mpfen. Spannende Knobelstunden
                  sind am Computer garantiert.
                  Autor: ???

AdvLaserChess   : Dieses Strategiespiel hat nicht mehr viel mit dem "ordi-
                  n&auml;ren" - nach Meinung des Autors - langweiligen Schach
                  zu tun; hier sind Denkstrategen gefragt! So hat jede Fi-
                  gur eine eigene Charakteristik. Und dann m&uuml;ssen auch
                  noch die Laserstrahlen richtig reflektiert werden...
                  F&uuml;r zwei 2 Spieler.
              --&gt; Auf der Helpline #1 (Extra #05) ist eine ausf&uuml;hrliche
                  Vorstellung dieser Schachvariante.
                  Autor: Mike M. Duppong

Damned          : T&uuml;ftel-Knobel-Memory-Spiel f&uuml;r besonders ge&uuml;bte Hirn-
                  akrobaten. Zuerst bekommt der Spieler eine 10 x 10 Fel-
                  der gro&szlig;e Tafel gezeigt. Von den gezeigten 100 kleinen
                  T&auml;felchen fehlen z.B. 4 St&uuml;ck. Nun verschwindet das
                  erste Bild und es erscheinen die kompletten 100 T&auml;fel-
                  chen. Jetzt mu&szlig; der Spieler die Positionen finden, an
                  denen im Vorbild die St&uuml;cke fehlten. Alles klaro?
                  Wieder ein Spiel gegen die Uhr; aber 10mal kann man um
                  Hilfe bitten.
                  Nach jedem Level gibt es ein Levelpasswort.
                  Autor: Volker Stepprath/Testaware



                     S p i e l e k i s t e   # 323

V L - Das Spiel : Ein weiteres "Promotion"-Game der Spitzenklasse in der
                  Art der guten, alten Lucas-Games. Als Privatdetektiv
                  Victor Loomes mu&szlig;t Du einen Diamantenraub aufkl&auml;ren.
                  Dabei f&uuml;hrt die Suche nach Tatverd&auml;chtigenh zun&auml;chst
                  zum Gangsterbo&szlig; Wild Bill...
                  Im B&uuml;ro findest Du alles, was ein guter Detektiv - &agrave;
                  la Magnum -  so braucht. Viel Erfolg!
                  Herausgeber: LBS



                     S p i e l e k i s t e   # 324 A+B

Olempiad        : Die Lemminge bitten zur Olympiade! Der Spieler f&uuml;hrt
                  "seinen" Lemming mittels der zwei Maustasten durch das
                  sportliche Geschehen. Auf die Pl&auml;tze - Fertig - Los!
                  Die einzelnen Wettbewerbe: 100m-Lauf  *  Speerwurf * 
                  Skateboard * Weitsprung * Rudern *  Schwimmen *.
                  Autor: Richard Evans



                     S p i e l e k i s t e   # 325

KaramalzCup     : Ein Super Eishockey-Simulation gesponsort vom Hersteller
                  des bekannten gleichnamigen Malzbieres nach der WM '93
                  in M&uuml;nchen.
                  Mit vielen Optionen, ausf&uuml;hrlicher (nat&uuml;rlich deutscher)
                  Anleitung und gelungenen Animationen; kurz: f&uuml;r Sport-
                  Simulations-Freaks ein absoluter Leckerbissen!
                  Autoren: H. Akbiyik, I. Mesche, R. Stember
                  Copyright: The Art Department 
                     


                     S p i e l e k i s t e   # 326

RoachMotel      : Jump'n'Run der Spitzenklasse! In einem Hotel m&uuml;ssen
                  Spraydosen im Kampf gegen l&auml;stige K&uuml;chenschaben einge-
                  sammelt werden. 
                  Autor: Ryan Scott

ShaNaNa         : Putziges Geschicklichkeitsspiel mit 20 Leveln, einem
                  farbenpr&auml;chtigen Smily und f&uuml;nf wahnsinnigen Toten-
                  k&ouml;pfen (??). Deine Aufgabe: eine Wand mit nur einer
                  Farbe einzuf&auml;rben. Doch die f&uuml;nf Deadheads versuchen
                  dies zu verhindern.
                  Autor: Volker Stepprath/Testaware



                     S p i e l e k i s t e   # 327

Serene I        : In der bekannten Art von RAID geht es hier wieder gleich
                  zur Sache; SEUCK-Ballerei pur.
                  Autor: Andrew Jereday

VR Duel         : VR steht f&uuml;r "Virtual Reality" und dieser Schwertkampf
                  ist auch von der besonderen Art! Blitzsaubere Grafik
                  und Animation sowie passender Sound machen dieses Ac-
                  tiongame zu einem Hochgenu&szlig;. L&auml;uft leider nicht unter
                  OS2.0.
                  Autor: Christopher Jennings



                     S p i e l e k i s t e   # 328

Conquest&amp;Dominion: Umfangreiches Strategiespiel mit dem Ziel, die bekannte
                  Welt zu erobern und zu beherrschen. Aber dies ist nicht
                  nur einfach eine x-beliebige Simulation, sondern hier
                  geht es echt ums &ouml;konomische &Uuml;berleben. - Ein Spiel f&uuml;r
                  lange Spielabende. 
                  Unregistrierte Version; registrierte Updates von Gyrus
                  Software.
                  Hersteller: Gyrus Software Group

Korn V1.0       : Ziel dieser kleinen Handelssimulation "f&uuml;r Zwischendurch"
                  ist es, in 20 Jahren soviel Geld wie m&ouml;glich zu schef-
                  feln. Dabei kann man mit Getreide bzw. Korn, Sklaven
                  oder Grundbesitz handeln. Shareware.
                  Autor: Michael W&auml;sch



                     S p i e l e k i s t e   # 329

A Night At The Top: Krimi-Textadventure im Stile der alten Infocom-Games.
                  Diesmal haben Terroristen Dein B&uuml;rogeb&auml;ude besetzt und
                  Du mu&szlig;t ihnen "nur" entkommen.
                  Autor: Trygve Jensen

ArmyMiner V1.1  : Dies ist wohl das ultimative XMines-Spiel auf dem Amiga!
                  Mit vielen Optionen, 3 Schwierigkeitsgraden und lauff&auml;-
                  hig auf allen Amigas. Freeware.
                  Autor: Alain Laferriere

Rox             : Ballern was das Zeug h&auml;lt... Mit 5 Raumschiffen durch
                  gef&auml;hrliche Galaxien.
                  Autor: ???

Luffar          : Der merkw&uuml;rdige Name kommt aus dem schwedischen und be-
                  deutet so viel wie "Vagabundenschach". Bei uns besser
                  bekannt unter dem Namen "Kringel und Kreuze". Kleines
                  WB-Spiel. Freeware.
                  Autor: Magnus Enarsson



                     S p i e l e k i s t e   # 330

Kid'sFun XV     : Zwei neue Strategie- bzw. Actionspiele sowie zwei &auml;ltere
                  Brettspiele sind auf der 15. Ausgabe der Kid'sFun-Reihe
                  zu finden:
              
                   F i r e  F i g h t e r
                  Bei diesem Actionspiel wird nicht geballert sondern 
                  "gew&auml;ssert"! Der kleine Feuerwehrmann hat die Aufgabe,
                  alle Br&auml;nde zu l&ouml;schen und Menschen zu retten. Autos
                  stehen in Flammen, Buschfeuer brechen aus und Werks-
                  hallen sind in Gefahr. An die Schl&auml;uche! Ab 7 Jahre.
                  Autor: Jonathan West

                   D i e    M i s s i o n
                  Auf dem Spielfeld tauchen Inseln auf, die miteinander
                  verbunden werden m&uuml;ssen. Das geht bei zwei Inseln ziem-
                  lich schnell und einfach. Aber mit jeder Stufe werden
                  es mehr! Dabei darf man aber nicht den Rand und nicht
                  seine eigene Spur ber&uuml;hren! Theoretisch ist das Spiel
                  bei 20 Inseln zu Ende - aber das ist (fast) nicht zu
                  schaffen!! Oder??? - Ab 8 Jahre. Shareware.
                  Autoren: Aimo und Reik Winkelmann

                   D a m e   V 1.0
                  Sch&ouml;ne Umsetzung des bekannten Dame-Spieles nach den
                  Originalregeln. - Ab 6 Jahre.
                  Autor: Marc Fischlin

                   M &uuml; h l e   V 1.1
                  Strategiespiel f&uuml;r 1 oder 2 Spieler. Auf dem Spielfeld
                  werden abwechselnd 9 Steine auf freie Pl&auml;tze gesetzt.
                  Ziel dabei ist eine M&uuml;hle (drei Steine in einer Reihe)
                  zu bekommen; dann darf vom Gegenspieler ein Stein vom
                  Brett entfernt werden. Wer zuletzt mindestens 3 Steine
                  &uuml;brig hat, der hat gewonnen. - Ab 6 Jahre.
                  Eingeschr&auml;nkte Sharewareversion.
                  Autor: Michael Goedecke



                     S p i e l e k i s t e   # 331

AlienBash       : Dein Kampfauftrag: Befreie Deine gefangenene Freunde!
                  Baller- und Actionorgie mit exzellenter Grafik. Doch
                  Vorsicht - sonst hei&szlig;t es schnell GAME OVER. Pr&auml;dikat:
                  empfehlenswert!
                  Autoren: Stuart Law + Glen Cumming

Colorix         : Buntes Strategiespiel; auf einem Spielfeld m&uuml;ssen farbige
                  Kugeln richtig zusammengeschoben werden - nat&uuml;rlich
                  l&auml;uft im Hintergrund die Zeit gnadenlos ab...
                  Mit Leveleditor.
                  Autor: Volker Stepprath/Testaware

Fire&amp;Ice_XMasLevel: Ein richtiger s&uuml;&szlig;er Zusatz-Schnupperlevel zu dem kom-
                  merziellen Hit Fire and Ice. 
                  Hersteller: Graftgold Ltd.



                     S p i e l e k i s t e   # 332

Weedie          : Weedie ist ein Geizhals und spart wo er nur kann. Des-
                  halb sieht sein Garten auch wie Kraut &amp; R&uuml;ben aus...
                  Aber er hat ja Dich - und es ist nun Deine Aufgabe, da
                  f&uuml;r Ordnung zu sorgen. Im Klartext: das Unkraut mu&szlig;
                  mit allen Mitteln bek&auml;mpft werden!
                  Autor: Luke Miller

TigerTanks V1.0 : Panzerkampfspiel mit verschiedenen Szenarien, passendem
                  sound, viel Action, vielen Ideen und guter Grafik. Kurz:
                  ein Game f&uuml;r zwei Spieler, die sich mit Panzern auf ei-
                  nem mit Fallen best&uuml;ckten Schlachtfeld bek&auml;mpfen.
                  Autor: Michael Taupitz



                     S p i e l e k i s t e   # 333

Blaster         : Dies ist mit Sicherheit eines der besten Shoot'em'Ups im
                  PD-/Sharewarebereich! Mit dem Alpha-72 Fighter mu&szlig;t Du
                  schwierigste Missionen in verschiedenen Sonnensystemen
                  bestehen. F&uuml;r stundenlangen Ballerspa&szlig;.
                  Autor: J. R. Evans

SmurfHunt       : Jage und t&ouml;te die Schl&uuml;mpfe, wo immer Du ihnen auch be-
                  gegnest. Zuerst geht es durch den Schlumpfwald, dann
                  mu&szlig;t Du das Schlumpfdorf r&auml;umen und als Endfeind war-
                  tet Papa Schlumpf auf Dich. Wer wird da wohl siegen?
                  Freeware.
                  Autor: Pat Carson



                     S p i e l e k i s t e   # 334

GlobalGladiators PV: Dies k&ouml;nnte die Nr. 1 in den Hit-Charts der n&auml;chsten
                  Wochen werden! Mick &amp; Mack sind als Global Gladiators
                  in Sachen Umwelt "in Action". Ein Spitzen Jump'n'Run!
                  Schnupperlevel mit 2 Schwierigkeitsgraden.
                  Hersteller: Virgin Games

Baldy           : Baldy auf der Suche nach fehlenden Disketten! 20 Level
                  voll Chaos und Spa&szlig; (so der Autor) in diesem hektischen
                  Jump'n'Run. Auf denn zur Disksuche!!
                  Autor: P. Jenkinson

Atoms           : Fesselnde Amiga-Umsetzung einer &auml;lteren Spielidee (ST-
                  Atoms, Critical Mass) f&uuml;r bis zu 6 Spieler. Auf dem
                  Spielfeld kann der Spieler Atome auf freien Pl&auml;tzen
                  plazieren... bis die Kettenreaktion beginnt!
                  Autor: John Girvin / Malibut Software



                     S p i e l e k i s t e   # 335

FWUFF           : Klassisches Brettspiel. Alle FWUFF's m&uuml;ssen durch &Uuml;ber-
                  springen vom Spielfeld entfernt werden. Dabei kann immer
                  nur ein FWUFF &uuml;bersprungen werden (horizontal, vertikal
                  oder diagonal) - wenn das entsprechende Feld frei ist.
                  Ein Level ist gel&ouml;st, wenn die vorgegebene Zugzahl er-
                  f&uuml;llt wurde. Weiter gibt es sowohl Bonuspunkte (Fr&uuml;chte)
                  als auch Minuspunkte (+/- Zeichen). 40 knobelige Level
                  warten darauf gel&ouml;st zu werden...
                  Autoren: B. Elms, S. Piper, M. Piper (DYNATRAX)

FWUFF II Demo   : 3 Probelevel von einer geplanten Fortsetzung.



                     S p i e l e k i s t e   # 336

Alliance II     : Strategiespiel f&uuml;r ein oder zwei Spieler. Dabei kannst
                  Du einfach nur Deine Mission erf&uuml;llen oder auch gegen
                  Deinen Gegenspieler k&auml;mpfen. Mit Leveleditor.
                  F&uuml;r lange Taktikabende am Kaminfeuer.
                  Autor: Mark Potter



                     S p i e l e k i s t e   # 337

Escape from a Large Cave: Dies sind die Abenteuer des Edd Schiester...
                  Leicht verr&uuml;cktes Adventure in der Art des klassischen
                  Zak McKracken. - Shareware.
                  Autoren: T. S. Kong, D. Harvey/Zen Software



                     S p i e l e k i s t e   # 338

Das PUNICA Spiel: Eines Tages erh&auml;lt der Abenteurer Harry Hopp einen ge-
                  heimnisvollen Brief... So beginnt dieses neueste Promo-
                  tiongame im Auftrag eines bekannten Getr&auml;nkeherstellers.
                  Auf den - finde die Punica Oase!!!
                  Hersteller: Bondy Productions
                     


                     S p i e l e k i s t e   # 339

StockMarket     : Dies ist die wohl beste Wirtschaftssimulation im nicht-
                  kommerziellen Bereich. F&uuml;r alle (M&ouml;chtegern-)B&ouml;rsianer
                  und solche, die es noch werden wollen. 
                  Mit ausf&uuml;hrlicher (engl.) Dokumentation. - Shareware.
                  Autor: Colin J. Edwards



                     S p i e l e k i s t e   # 340

Kid'sFun XVI    : Das Grauen geht weiter - ein neuer Gierhals macht uns
                  das Leben schwer... Die Betonmafia versucht wieder ein-
                  mal die Oberhand zu gewinnen. Diesmal schickt sie Dr. F.
                  Grau ins Rennen. Wo? Nat&uuml;rlich in
              
                   G r a u   O d e r   G r &uuml; n   I I
                  Aber Goga und Gogi nehmen den Kampf auf und versuchen
                  die Natur wieder in Ordnung zu bringen... aber das geht
                  nur mit Deiner Hilfe. - Ab 8 Jahre.
                  In dieser Demoversion sind alle Funktionen ausf&uuml;hrbar;
                  das Spiel wird aber nach einer bestimmten Zeit abge-
                  brochen. Die Vollversion ist beim Autor erh&auml;ltlich.
                  Update-Version 2.1 (Nov. 93).
                  Autor: Rudi Thiele



                     S p i e l e k i s t e   # 341

Blastar         : 6 Level Probespielen - in dem neuen Actionknaller von
                  Core. Blastar ist ein multidirektionale Shoot'emUp mit
                  8-fach Scrolling und vollst&auml;ndig animierter Hintergrund-
                  darstellung. Die Vollversion sollte im Herbst '93 in den
                  Softwareregalen stehen.
                  Hersteller: Core Design



                     S p i e l e k i s t e   # 342

Robouldix       : Geschicklichkeits-/Knobelspiel f&uuml;r alle BoulderDash-Fans
                  (und all jene, die es noch werden wollen). Diese ein-
                  geschr&auml;nkte Demoversion beinhaltet 6 Level, die &uuml;ber
                  die ESC-Taste angew&auml;hlt werden k&ouml;nnen. Einfache Auf-
                  gabe: alle Diamanten einsammeln; wenn da nur nicht
                  diese verd... Gegner w&auml;ren. Die Vollversion (bei den
                  Autoren erh&auml;ltlich) besteht aus 200 Leveln.
                  Autoren: The Terminus Team 

Illicans        : Reaktionsschnelles Ballerspielchen. Hier gilt ganz be-
                  sonders: Klein - aber oho! Ein paar Runden probespielen
                  ist "Pflicht".
                  Autor: ??? (Erstver&ouml;ffentlichung auf AmigaNews)



                     S p i e l e k i s t e   # 343

Willy Worm      : ... and his Bunny Assault. Putziges Wurm-Spiel (Willy
                  fri&szlig;t sich so durch und wird dabei immer l&auml;nger) mit
                  verschiedenen Optionen f&uuml;r langanhaltenden Spielspa&szlig;.
             --&gt;  Programm l&auml;dt etwas l&auml;nger.
                  Autoren: Animators 

Insectoids 2    : Invader-Spiel der besonderen Art. Einfach "nur so" die
                  wild angreifenden Alienwellen abschie&szlig;en...
                  Vorsicht: Joystick l&auml;uft hei&szlig;!
                  Autor: Mark Sibly

Search 2.0      : Stundenlang fesselndes Labyrinthspiel ohne Zeitdruck,
                  ohne Punktehatz, ohne Verfolgungsjagden. Nicht nur f&uuml;r
                  Leute, die auch mal &uuml;ber Puzzles etwas l&auml;nger nachden-
                  ken. Mit Editor. - Shareware.
                  Autor: Alan Farrell (Growling Dragon Software) 



                     S p i e l e k i s t e   # 344

SilverBlade     : Im Jahre 2076 wird die Welt mal wieder von Au&szlig;erirdi-
                  schen beherrscht. Du lebst im Untergrund und willst etwas
                  f&uuml;r die Freiheit der Erde tun... Zwar sind die Aliens
                  allgegenw&auml;rtig - doch Du hast einen verdammt guten
                  Fighter zur Verf&uuml;gung: SilverBlade. Auf ins Get&uuml;mmel!
             --&gt;  Programm l&auml;dt etwas l&auml;nger.
                  Autor: Mirrorman



                     S p i e l e k i s t e   # 345

SpaceWalker     : Auf einem alten, verlassenen Raumschiff tief im Weltraum
                  untersuchst Du mit einer kleinen Robotsonde die G&auml;nge.
                  Doch in diesem riesigen Labyrinth verlierst Du leicht
                  die Orientierung. Unter Zeitdruck mu&szlig;t Du auf den ein-
                  zelnen Decks Schl&uuml;ssel und andere Utensilien einsam-
                  meln. Doch &uuml;berall lauern Fallen...
                  Update-Version Oktober 93. - Freeware.
                  Autoren: Roy Schneider &amp; Sven Schr&ouml;der



                     S p i e l e k i s t e   # 346A+B

GeorgGlaxo      : Wundersch&ouml;n animiertes Jump&amp;Run der Extraklasse. Der
                  Comic-Held GG mu&szlig; in verschiedenen Leveln "aufr&auml;umen".
                  Egal, ob man diese Art Games mag - ein paar Runden pro-
                  be"jumpen" kann nur w&auml;rmstens empfohlen werden...
                  Autoren: M. Hansen &amp; L. K. Mortensen (Silverrock Prod.)



                     S p i e l e k i s t e   # 347

Shanghai '93    : Klassiker in Neuauflage. 100 (Camel) bzw. 144 Teile
                  (Dragon) m&uuml;ssen von dem Spielfeld immer paarweise ent-
                  fernt werden. Mit Zugr&uuml;cknahme.
                  Autor: James Gwinnett

Squigs          : Tetris-Variante mit Suchtgefahr! Von oben herunterfal-
                  lende Squigs, Bl&ouml;cke und Extras m&uuml;ssen geschickt gesta-
                  pelt werden. Klingt zwar ganz einfach - aber nach einem
                  Probespielchen... - 4 Schwierigkeitsgrade, 1 oder 2 
                  Spieler und 2 unterschiedliche Spielarten.
                  Autor: Jon. A. Hibbins

XAtoms          : Kleines Logik-Spiel f&uuml;r 2 Spieler; auf einem 64er Feld
                  mu&szlig;t Du die gegnerischen Atome zerst&ouml;ren und Deine ei-
                  genen sch&uuml;tzen.
                  Autoren: Pavel Ruzicka, u.a. 

King'sKorner    : Sch&ouml;nes Solitaire mit 52 Karten und einfachen Regeln.
                  Verschiedene Schwierigkeitsgrade.
                  Autor: David F. Downing



                     S p i e l e k i s t e   # 348

Ethos           : ... ein abenteuerliches Spiel aus der G&ouml;tterwelt des
                  alten Griechenland. Du mu&szlig;t &uuml;ber Land und Meer um Deine
                  Aufgaben erfolgreich zu bestehen. Doch hast Du Dein Ziel
                  endlich erreicht, dann geht das Abenteuer erst richtig 
                  los... 6 Schwierigkeitsgrade. - Sharewareversion.
                  Autor: W. Jordan



                     S p i e l e k i s t e   # 349

StarCommander   : Wieder mal mu&szlig; die Erde vor Feindangriff gesch&uuml;tzt wer-
                  den; Dein Kampfauftrag: vernichte und verjage die Ein-
                  dringlinge!
                  10 Level eines neuen Shareware-Ballergames; Vollversion
                  ist beim Autor erh&auml;ltlich (DM 10,-).
                  Autor: Michael Mazur

Blue Moon       : Kleine Sortier-Patience mit 52 Karten.
                  Autor: Tim Lister


                     S p i e l e k i s t e   # 350

Kid'sFun XVII   : 2 Rate- und Geschicklichkeitsspiele der Spitzenklasse!
              
                   N a u t i l u s
                  Mit dem U-Boot hilfst Du diesmal den Arch&auml;ologen beim
                  Suchen und Einsammeln von T&ouml;pfen und Trinkgef&auml;&szlig;en (Am-
                  phoren) auf dem Meeresgrund. Wenn es nicht mehr weiter
                  geht, dann kannst Du auch schon mal einen Felsen weg-
                  sprengen. Aber Du hast nur eine begrenzte Anzahl Tor-
                  pedos! Und dann sind da auch noch gef&auml;hrliche Raubfi-
                  sche, denen Du ausweichen mu&szlig;t! - Ab 7 Jahre.
                  Shareware.
                  Autor: MVT-Man

                   A c h   j a a . . .
                  Wort mit 5 Buchstaben: . A C H S. Aber was ist nur der
                  erste?? Du hast nur noch wenige Sekunden und nur noch
                  einen Versuch! Etwa  W A C H S ? Vorbei. Falsch geraten.
                  Und dann greifst Du Dir an den Kopf -  D A C H S. Wie
                  konntest Du da nicht drauf kommen??? Ach ja....
                  Hier ist die wohl beste Umsetzung des spannenden Wort-
                  ratequizes aus SAT-1: F&uuml;nf mal F&uuml;nf. In zw&ouml;lf verschie-
                  denen Spielarten! F&uuml;r alt und jung.
                  Leicht eingeschr&auml;nkte Sharewareversion (mit begrenzter
                  Wortdatei, ohne Editor und abspeicherbaren Highscores);
                  die Vollversion ist f&uuml;r DM 10,- beim Autor erh&auml;ltlich.
                  Ab 8 Jahre.
                  Autor: Peter H&auml;ndel

                </PRE>
                </TD>
            </TR>
            </TABLE>
            <BR>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="pdl.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#pdl0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

