<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Betriebssysteme im Test</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="smt0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="smt.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#80A080">
        <TR>
            <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">"Betriebssysteme im Test"<BR> - Wieso WISO ?</FONT></B></H1>
            <BR>
<!Innere Tabelle>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY=""BGCOLOR="#C0C090" WIDTH="80%">
            <TR>
                <TD>           
                <P>
                Es ist Donnerstag, der 26.Mai 1994, 21.35 Uhr. Gerade habe ich
                ver&auml;rgert meinen Flimmerkasten abgeschaltet. Der Grund ist eine
                Sendung namens "WISO" im Zweiten Deutschen Fernsehen. Im
                heutigen sogenannten WISO-Tip drehte sich alles (zumindest nach
                der Aussage meiner Fernsehzeitschrift und der Ansage des
                Moderators) um Betriebssysteme.<BR>
                Gespannt, ob die Nachricht, da&szlig; sich au&szlig;er MS-DOSen auch noch
                andere Computersysteme auf unserem sch&ouml;nen Planeten tummeln, bis
                in die Redaktionsebenen des ZDF vorgedrungen ist, schaute ich
                mal `rein. Schon nach wenigen Augenblicken hatte ich die
                Hoffnung, ein kleines System mit Namen Amiga w&uuml;rde irgendeine
                Beachtung finden, aufgegeben. Da&szlig; auch Apple, Archimedes usw.
                nicht erw&auml;hnt wurden, verwunderte auch nicht weiter.<BR>
                <BR>
                Staunen trat jedoch ein ob der bewundernswerten Naivit&auml;t und
                Leichtgl&auml;ubigkeit des angeblichen "Fachmannes". Gepaart mit
                seiner offensichtlichen fachlichen Unkenntis, war er bestens
                daf&uuml;r geeignet, Unsinn in die Wohnzimmer tausender unschuldiger
                Zuschauer zu verbreiten.<BR>
                Nachdem er grinsend und vor ergebener Faszination geradezu
                bebend erkl&auml;rt hatte, Multitasking sei die F&auml;higkeit eines
                Betriebssystems, zwischen einzelnen Programmen HINund
                HERZUSCHALTEN (was jeden Amiga-User zuh&ouml;chst erstaunen mu&szlig;),
                stellte er ein passendes Produkt namens Red DOS (oder so)
                vor.<BR>
                <BR>
                Die seiner Meinung n&auml;chste erw&auml;hnenswerte technische Revolution
                war ein anderes Betriebssystem, das mit PCMCIA -Karten (bekannt
                von A600 und A1200) umgehen konnte.<BR>
                Dann jedoch kam der absolute Hammer, der mich dann wirklich zum
                W&uuml;rgekissen greifen lie&szlig;. Hatte der doch die Frechheit, als die
                Grenze des technisch Machbaren ein Programm namens OS/2 for
                WINDOWS 2.11 vorzustellen. Was soll das sein, "OS/2 for WINDOWS"
                ? Hat schon einmal jemand daran gedacht, Klopapier for WINDOWS
                `rauszubringen ? Ich w&uuml;&szlig;te wirklich viele Abnehmer ! Doch Scherz
                beiseite. Freudig erregt erl&auml;uterte er die Vorteile dieser
                softwaretechnischen Meisterleistung. Es handelt sich dabei um
                ein FENSTERORIENTIERTES Betriebssystem, DAS NICHT DAUERND
                ABST&Uuml;RZT ! Dieser unerh&ouml;rte Komfort mu&szlig; aber damit bezahlt
                werden, da&szlig; das Programm auf 35 (!) Disketten daherkommt und
                sich auf der Festplatte mit 40 MB breit macht (wohlgemerkt, nur
                das Betriebssystem).<BR>
                <BR>
                Sicherlich ist man als mehr oder weniger &uuml;berzeugter Amiga User
                parteiisch, aber irgendwie sprechen die Tatsachen doch f&uuml;r die
                Workbench. Ist sie doch ein OS, das die Vorteile aller drei
                obengenannten zu gro&szlig;en Teilen auf sich vereinigt. Was fehlt,
                ist nur die Netzwerkunterst&uuml;tzung und das Antivirenprogramm,
                aber das gibts alles in der PD. Ansonsten habe ich mit meiner
                Workbench 3.0 doch wahrlich alles : Eine grafische Oberfl&auml;che,
                die leicht und schnell zu installieren und konfigurieren ist und
                NIE abst&uuml;rzt.Die PCMCIA-Karten werden von Haus aus unterst&uuml;tzt.
                Und Multitasking geh&ouml;rt von je her dazu und ist wesentlich
                leichter zu bedienen als das am PC, wo immer noch Rumgefummle an
                diversen Tabellen und Werten dazu n&ouml;tig ist, um ein neues
                Programm zu starten. So ganz nebenbei kostet sie auch keine
                150,- DM, sondern man bekommt sie umsonst dazu. Und sie macht
                sich auf satten 5 unkomprimierten DD-Disketten breit. Auf der
                Platte belegt sie auch nur ca. 4-5 MB.</P>

                <P ALIGN="CENTER">
                Und die Moral von der Geschicht` : Traue ja dem Fernsehen nicht !</P>

                <P>Ein immer noch ver&auml;rgerter</P>


                <P ALIGN="RIGHT">Jan Fischer&nbsp;&nbsp;&nbsp;&nbsp;</P>
                <BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
<!Innere Tabelle>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

