<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META name="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Zur aktuellen Commodore Lage</TITLE>
    </HEAD>

    <BODY TEXT="#B02010" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="smt0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="smt.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#70A000">
        <TR>
            <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
<!Innere Tabelle>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#80D080" WIDTH="90%">
            <TR>
                <TD>
                <BR>
                <CENTER><H3>Zur aktuellen Commodore Lage<BR>----------------------------</H3></CENTER>

                <P>
                Wie wir ja alle wissen, hat die Commodore Holding auf den
                Bahamas am 30.04. Konkurs wegen Zahlungsunf&auml;higkeit angemeldet.<BR>
                <BR>
                In den kommenden Wochen und Monaten wurde viel Spekuliert
                dar&uuml;ber, wie es mit Commodore weitergeht. Ger&uuml;chte aller Art
                kursierten in den DF&Uuml;-Netzen herum.<BR>
                <BR>
                Manche glaubten sogar, da&szlig; es den Amiga nicht mehr geben wird.
                Es sind auch ein paar vom Amiga abgesprungen, die sich leicht
                durch die ganze Sache haben verr&uuml;ckt machen lassen.<BR>
                <BR>
                Es wurde geglaubt, das Samsung, NEC, Nintendo, Sega, Amstrad
                und noch viele andere Firmen Commodore kaufen wollten.<BR>
                <BR>
                Es gab aber auch viele schwarze Schafe, die nicht daran
                interessiert waren, den Amiga weiterzuf&uuml;hren und nur die
                AmigaTechnologie in die eigenen Produkte einzubauen.<BR>
                <BR>
                <BR>
                Nun ist es soweit, die Verhandlungen stehen kurz vor dem
                Abschlu&szlig; oder wurden schon abgeschlossen. Bis allerdings eine
                offizielle Pressemeldung herauskommt, das dauert noch ein
                bi&szlig;chen.<BR>
                <BR>
                Die Informationen die ich bekommen habe, sind wirklich zu
                ann&auml;hernd 100% wahr und von einer seri&ouml;sen Quelle.<BR>
                <BR>
                Also: Commodore UK (Gro&szlig;britannien) und alte Manager von
                Commodore kaufen die Commodore Holding auf.<BR>
                <BR>
                Fremdfirmen sind daran nicht beteiligt, weil sie den Amiga
                nicht weiterf&uuml;hren wollten und die Technologie in eigenen
                Produkten einsetzen wollten.<BR>
                <BR>
                Der Amiga wird in Zukunft in Schottland produziert werden. Also
                echte europ&auml;ische Markenware. Die Produktion der Amigas soll in
                diesen Tagen anlaufen (Ein Indiz daf&uuml;r, das die Verhandlungen
                wohl schon gelaufen sind).<BR>
                <BR>
                <BR>
                Das Management wurde teilweise international schon
                ausgetauscht. So in Deutschland wurde Marketing-Chefin Karola
                Bode entlassen und Commodore-Deutschland Chef Alwin Stumpf
                gegen einen neuen Gesch&auml;ftsf&uuml;hrer ausgewechselt. Das ist ein
                weiteres Indiz daf&uuml;r, das die Verhandlungen bereits gelaufen
                sind.<BR>
                <BR>
                Weiter im Text: Das NEUE!!! Management hat versprochen, das zu
                Weihnachten mindestens 1 neues Amiga-Modell herauskommen wird.<BR>
                <BR>
                Also, Amigas mit echter 24-Bit Farbtiefe, 16-Bit DSP Sound,
                besseres Betreibssystem, schnellere Prozessoren usw.<BR>
                <BR>
                Die Lieferengp&auml;sse der Amigas werden voraussichtlich im Herbst
                behoben sein.<BR>
                <BR>
                Also es geht weiter mit dem Amiga. Besser als je zuvor. Das
                alte, unflexible Management, das eigentlich nur Sch*** gebaut
                hat, wurde rausgeschmissen.<BR>
                <BR>
                <BR>
                Hoffen wir also auf bessere Zeiten f&uuml;r unsere "Freundin".<BR>
                <BR>
                &Uuml;brigens: IBM hat auch finanzielle Probleme, Apple geht es auch
                nicht viel besser. Microsoft hat erbliche finanzielle Verluste
                durch Lizensverletzungen und bei Intel genauso. Nur: Bei diesen
                Firmen wird alles nur abgewiegelt und totgeschwiegen!!!<BR>
                <BR>
                Wir k&ouml;nnen also ganz bewu&szlig;t darauf setzen, das der Amiga in den
                n&auml;chsten Jahren eine noch bedeutendere Rolle spielen wird als
                bisher. Die DOSE wird mit Sicherheit in den n&auml;chsten Jahren dem
                Untergang geweiht sein. Das haben mir viele Leute, die mit der
                DOSE zu tun haben, garantiert.<BR>
                <BR>
                <BR>
                Bleiben Sie also dem Amiga treu, denn diese Technologie ist den
                anderen um ein vielfaches voraus.<BR>
                <BR>
                 Auf viele lange und erfolgreiche Amiga-Jahre...</P>
                <BR>
                <P ALIGN="RIGHT">Stefan Wunner Leiter des APC+TCP St&uuml;tzpunktes Bamberg &nbsp;&nbsp;&nbsp;&nbsp;</P>
                <BR>
                </TD>
            </TR>
            </TABLE>
<!Innere Tabelle>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

