<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META name="generator" content="Handmade">
    <TITLE>Schlechte Erfahrung mit BSC</TITLE>
    </HEAD>

    <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary="" bgcolor="#000000">
    <TR>
        <TD>
        <MAP name="smt0">
        <AREA shape="rect" coords="460,1,550,22" href="smt.html" alt="zur&uuml;ck">
        </MAP>

        <TABLE ALIGN="CENTER" width="640" border="2" cellpadding="0" summary="" bgcolor="#F00000">
        <TR>
            <TD><IMG src="smt.gif" alt="" width="640" height="22" border="0" usemap="#smt0"> </TD>
        </TR>
        <TR>
            <TD>
            <BR>

<!Innere Tabelle>

            <TABLE border="0" cellpadding="15" summary="" bgcolor="#A000F0" width="90%" align="center">
            <TR>
                <TD>
                <BR>
                <H2 ALIGN="CENTER">Schlechte Erfahrung mit BSC<BR>~~~~~~~~~~~~~~~~~~~~~~~~~</H2>

                <P>
                Anno 1993. Ein kleiner, noch unbedeutende DF&Uuml;-Freak hat genug von seinem
                A2091 SCSI-Controler und erkundigt sich nach einem guten und vor allem
                g&uuml;nstigen SCSI-Controler.<BR>
                <BR>
                Ich bekam den Oktagon 2008 von BSC als sehr lobenswert und zuverl&auml;ssig
                empfohlen.Also rief ich sofort dort an und bestellte mir diesen Controler, mit
                4 MB RAM. Nach 3 langen Tagen klingelte endlich der Postbote an der Haust&uuml;r und
                hielt ein P&auml;ckchen unter dem Arm, f&uuml;r das er 650,-- verlangte. Freudig nahm ich
                das P&auml;ckchen entgegen und l&ouml;hnte die 650,-- Deutschmark.<BR>
                <BR>

                Ich fetzte gleich zu meinem Amiga, ri&szlig; das P&auml;ckchen auf und fing mit dem Einbau
                des Controlers an. Doch was war das? Statt den 4MB hatten sie mir nur 2MB
                geschickt.... "Naja", dachte ich, "rufst halt an und l&auml;&szlig;t es nachschicken...",
                und fuhr mit dem Einbau fort.<BR>
                <BR>

                Als ich fertig war, schaltete ich voller Erwartung meinen Compi an, und lud die
                Installationsdiskette. Also die Workbenchoberfl&auml;che erschien suchte ich nach
                dem Festplatten Icon. Als ich nichts fand, versuchte ich, das Programm so zu
                starten. Doch das Programm beendete sich sofort wieder mit der Meldung, da&szlig;
                schon eine Festplatte vorhanden sein m&uuml;&szlig;te um dieses Programm zu starten. Jetzt
                kontrolierte ich nochmals alle Jumper und Einstellungsm&ouml;glichkeiten, ohne
                Erfolg.<BR>
                <BR>

                Kurzer Hand rief ich dann bei BSC an und erkundigte mich &uuml;ber diesen Fehler.
                Der Herr am andern Ende der Leitung sagte mir dann, da&szlig; es an allem M&ouml;glichem
                liegen k&ouml;nnte und er sich den Controler anschauen m&uuml;&szlig;te um genaueres sagen zu
                k&ouml;nnen.<BR>
                Also habe ich den Controler wieder ausgebaut, verpackt und an BSC
                zur&uuml;ckgeschickt.<BR>
                <BR>
                Nach langen 3 Wochen kam endlich ein P&auml;ckchen. In diesem lag ein Oktagon 2008
                und ein Brief, indem stand: "Der Controler unterlag einem schwerwiegenden
                Defekt und wurde gegen einen neuen getausch." "Gut", dachte ich, "warum nicht?"
                und baute ihn ein 2. Mal ein.<BR>
                <BR>
                Als ich den Computer anschaltete machte es einen leisen Knall und dann h&ouml;rte
                man nichts mehr von der Festplatte... Auch etliche Behebungsversuche brachten
                da auch nicht - die Festplatte war durchgebrannt. Ja, durchgebrannt! Das wei&szlig;
                ich, weil ich den Controler genau untersuchte, zwecks einer Fehlerbeschreibung.
                Der Grund war, da&szlig; die Stromversorgungskabel vom Controler zur Platte nicht,
                wie &uuml;blich 5 Volt, negativ, negativ, 12 Volt gepolt waren, sondern 12 Volt,
                negativ, negativ, 5 Volt.<BR>
                Also hat es mir durch die &uuml;berlastung die Elektronik der Platte zerhaut.<BR>
                <BR>

                Ich wieder den Controler UND die Platte ausgebaut, verpackt und weggeschickt.<BR>
                <BR>
                Als dann, nach etlichen Anfragen und 7 (!) Monaten Wartezeit, meine Platte plus
                Controler wiederkamen und ich sie eingebaut hatte, gingen sie wieder nicht!!!
                <BR>
                Nach diesem Streich, wurde es mir dann zu bunt, ich ging in den n&auml;chsten Laden
                und besorgte mir den GVP Serie II SCSI-Controler, der jetzt seit gut 8 Monaten
                ohne Probleme bei mir l&auml;uft... Den SCSI-Controler habe ich immer noch hier
                herumliegen !<BR>
                <BR>

                <DL>
                   <DT>Fazit:
                   <DD>Au&szlig;er den MULTIFACE-Cards (Multiserielle Karten) stellt BSC genau wie
                       HARMS nur Schrott her, ich w&uuml;rde einen Oktagon nicht mal geschenkt
                       nehmen (bis auf den Speicher und die Platte :-) )...
                </DL>
                <P ALIGN="RIGHT">Costel Mincea</P>
                <BR>
                </TD>
            </TR>
            </TABLE>

<!Innere Tabelle>

            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG src="smt.gif" alt="" width="640" height="22" border="0" usemap="#smt0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
