<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Erfahrungen mit Seagate</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="smt0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="smt.html" ALT="zur&uuml;ck">
        </MAP>
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#804040">
        <TR>
            <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
<!Innere Tabelle>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="15" SUMMARY="" BGCOLOR="#F00000" WIDTH="90%">
            <TR>
                <TD>
                <BR>
                <H2 ALIGN="CENTER">Erfahrungen mit Seagate</H2>

                <P>
                Hallo Leute !<BR>
                <BR>
                Ich m&ouml;chte Euch heute mal meine Erfahrungen (die
                &uuml;brigens sehr positiv waren) mit der Firma Imprimis (eine
                Tochter von Seagate) mitteilen.<BR>
                <BR>
                Ich habe hier eine RLL-Platte des Typs Imprimis ST 1150r
                herumliegen. Ich wei&szlig; zwar die physikalischen Daten,
                suchte aber nach weitergehenden Infos zu der HD. Nachdem mir die
                &ouml;rtlichen "Fachh&auml;ndler" nicht weiterhelfen wollten
                oder konnten (f&uuml;r Insider: Computer****** D****** in
                Traunstein und Computer &amp; Tauchsport (!!) D**** sowie
                Computer**** Ch****** in Traunreut) (wer mal arrogant und
                kundenfeindlich behandelt werden will, dem kann ich o. g.
                L&auml;den nur empfehlen !) bekam ich bei Elektronik Z***** in
                Traunstein zumindest die taiwanesische Addi der Fa. Imprimis.
                Also nen sch&ouml;nen Brief geschrieben und hoffnungsvoll per
                Luftpost ab nach Taiwan. Etwa 2 Wochen sp&auml;ter erhielt ich
                nen Anruf von Seagate Deutschland. Leider hatte ich an dem Tag
                Nachmittagsdienst und so konnte die freundliche Dame mir nur auf
                den Anrufbeantworter plaudern, da&szlig; sie es einige Tage
                sp&auml;ter nochmal probieren werde. Und tats&auml;chlich nach 4
                Tagen ein weiterer Anruf von derselben Dame. Sie erz&auml;hlte
                mir, da&szlig; Seagate Taiwan meine Anfrage nach Deutschland
                gefaxt habe. Dann wollte sie noch wissen, wo ich denn die HD
                herhabe (schlie&szlig;lich sei es ein altes Modell und werde
                schon lange nicht mehr gebaut), an welchem Rechner das Teil
                laufe und ob ich zufrieden sei. Auch nachdem ich mich als
                Commodore Amiga Besitzer zu erkennen gegeben hatte, wurde ich
                komptetent und freundlich weiter "bedient". (Nicht lachen - das
                ist leider leider keine Selbstverst&auml;ndlichkeit !!). Im
                Verlauf des Gespr&auml;chs, in dem sich herausstellte, das die
                Frau ziemlich Ahnung von HDs und Computern hat, erfuhr sie auch
                das bei mir noch einge Seagate-HDs uralten Datums laufen.
                Daraufhin fragte sie, ob ich auch Interesse an Unterlagen zu
                diesen Ger&auml;ten h&auml;tte. Im Archiv w&uuml;rden sich noch
                Serviceunterlagen, Anleitungen, Prospekte etc. zu den
                RLL/MFM-Produkten stapeln, die eigentlich nur sinnlos
                heruml&auml;gen. Es seien Sachen dabei, die man einst teuer
                verkauft habe. Sie k&ouml;nnte mir was zusammensuchen und
                kostenlos (!!!!) zuschicken. Daraufhin gab ich mir meine
                Adresse, bat sie, das Zeug unfrei an meine Arbeitsstelle
                zuschicken, damit es kein Porto kostet, und beendete das fast
                halbst&uuml;ndige Gespr&auml;ch. Vorgestern ist nun das Paket
                eingetroffen. Es war etwa 8 kg schwer und enthielt folgende
                Unterlagen:<BR>
                </P>
                <TABLE ALIGN="CENTER" SUMMARY="" BORDER="0" CELLPADDING="1" CELLSPACING="1" WIDTH="520">
                <TR>
                    <TD VALIGN="TOP" WIDTH="20">-</TD>
                    <TD WIDTH="500">Datenbl&auml;tter zu fast allen Seagate MFM und RLL-HDs</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>desgleichen von Imprimis</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>einiges an Prospekten (auch zu Controllern und einer MFM-Wechselplatte)</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Bedienungs- und Einbauanleitungen</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Ringmappe mit Serviceunterlagen zu Seagate- und Imprimis HDs</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                   <TD>Ersatzteillisten mit Bezugsquellen (!), letztere aber
                   eher f&uuml;r Gro&szlig;h&auml;ndler interessant (Chips im
                   100er-Pack, Flachbandkabel in 100-m-Rollen etc.)</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>2seitiges Begleitschreiben von o. g. Dame mit einigen
                    Adressen und Hotline-Nummern von Seagate/Imprimis</TD>
                </TR>
                </TABLE>
                <P>
                Also ich mu&szlig; sagen, da kann ich der Firma Seagate nur ein
                dickes Lob aussprechen. Einen solchen Service habe ich noch
                NIRGENDS erlebt. Wenn man sich nur mal ausrechnet, wieviel
                Arbeit man sich gemacht hat, ohne was dabei zu verdienen:<BR>
                </P>
                <TABLE SUMMARY="" ALIGN="CENTER" BORDER="0" CELLPADDING="1" CELLSPACING="1" WIDTH="520">
                <TR>
                    <TD VALIGN="TOP" WIDTH="20">-</TD>
                    <TD WIDTH="500">Fax von Taiwan nach Deutschland</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Telefongespr&auml;che (1 x vergeblich 1 x ca. 30 Minuten Fernzone)</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Material zusammenstellen und verpacken</TD>
                </TR>
                <TR>
                    <TD VALIGN="TOP">-</TD>
                    <TD>Versand (das Porto haben sie &uuml;brigens trotzdem &uuml;bernommen)</TD>
                </TR>
                </TABLE>
                <P>
                 Da soll mir einer ne Firma zeigen, die da mithalten kann !<BR>
                <BR>
                <BR>
                Joachim Schwanter</P>
                <BR>
                </TD>
            </TR>
            </TABLE>
<!Innere Tabelle>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
