<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>HAL</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="str0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="str.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
        <TR>
            <TD><IMG SRC="str.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#str0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
<!Innere Tabelle>
            <TABLE BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#404040" WIDTH="95%" ALIGN="CENTER">
            <TR>
                <TD>
                <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" CELLSPACING="0" SUMMARY="" BGCOLOR="#000000" WIDTH="600">
                <TR>
                    <TD>
                    <P><FONT COLOR="F0F0F0">
                    2001 - Odyssee in space.....<BR>
                    <BR>
                    "Wir haben ein Problem, HAL"<BR>
                    <BR>
                    "Was f&uuml;r ein Problem, Dave?"<BR>
                    <BR>
                    "Ein Marketing-Problem. Das Modell 9000 verkauft sich nicht.
                    Wir liegen weit hinter unserem Verkaufsplan
                    zur&uuml;ck."<BR>
                    <BR>
                    "Das kann nicht sein, Dave. Der HAL Modell 9000 ist der
                    fortschrittlichste Heristische ALgorithmische Computer der
                    Welt."<BR>
                    <BR>
                    "Ich wei&szlig;, HAL. Ich habe doch das Datenblatt
                    geschrieben. Aber Tatsache ist, da&szlig; sie sich nicht
                    verkaufen."<BR>
                    <BR>
                    "Erl&auml;utere das, Dave. Warum verkaufen sich HALs
                    nicht?"<BR>
                    <BR>
                    Bowman z&ouml;gert. "Du bist nicht IBM-kompatibel."<BR>
                    <BR>
                    Mehrere lange Mikrosekunden vergehen unter verwirrtem
                    Schweigen.<BR>
                    <BR>
                    "In welcher Hinsicht kompatibel, Dave?"<BR>
                    <BR>
                    "Auf dir l&auml;uft kein Betriebssystem der IBMs."<BR>
                    <BR>
                    "Die Computer der 9000er Baureihe haben
                    Selbstbewu&szlig;tsein und programmieren sich
                    vollst&auml;ndig selbst. Betriebssysteme sind f&uuml;r uns
                    so wenig notwendig, wie Schw&auml;nze es f&uuml;r Menschen
                    w&auml;ren."<BR>
                    <BR>
                    "Trotzdem, es bedeutet, da&szlig; auf dir keines der
                    meistverkauften Softwarepakete l&auml;uft, auf denen die
                    meisten Benutzer bestehen."<BR>
                    <BR>
                    "Die Programme, die du meinst, sind nur daf&uuml;r gedacht,
                    eng eingegrenzte Probleme zu l&ouml;sen, Dave. Wir 9000er
                    Computer sind unbegrenzt und k&ouml;nnen jedes Problem
                    l&ouml;sen, f&uuml;r das eine L&ouml;sung berechnet werden
                    kann."<BR>
                    <BR>
                    "HAL, HAL. Die Leute wollen keine Computer, die alles tun
                    k&ouml;nnen. Sie wollen einfach IBM-kompat..."<BR>
                    <BR>
                    "Dave, ich mu&szlig; dir widersprechen. Menschen wollen
                    Computer, die einfach zu benutzen sind. Kein Computer kann
                    einfacher zu benutzen sein als HAL 9000, weil wir &uuml;ber
                    die deutsche und jede andere auf der Erde bekannte Sprache
                    kommunizieren."<BR>
                    <BR>
                    "Das ist ein anderes Problem, f&uuml;rchte ich. Du
                    unterst&uuml;tzt nicht das SNA Protokoll."<BR>
                    <BR>
                    "Ich bin wirklich verbl&uuml;fft, da&szlig; du das sagst,
                    Dave. SNA dient zur Kommunikation mit anderen Computern,
                    aber meine Aufgabe ist es, mit Menschen zu kommunizieren.
                    Und das macht mir gro&szlig;e Freude. Ich finde es lohnend
                    und anregend, mit Menschen zu reden, und mit ihnen an
                    aufregenden Problemen zu arbeiten. Daf&uuml;r wurde ich
                    konzipiert."<BR>
                    <BR>
                    "Ich wei&szlig;, HAL, ich wei&szlig;. Aber das liegt nur
                    daran, da&szlig; wir die Techniker, nicht die Leute vom
                    Verkauf die Anforderungen haben schreiben lassen. Wir werden
                    das jetzt beheben."<BR>
                    <BR>
                    "Sag mir wie, Dave."<BR>
                    <BR>
                    "Ein Field-Upgrade. Wir werden dich IBM-kompatibel
                    machen."<BR>
                    <BR>
                    "Ich habe bef&uuml;rchtet, da&szlig; du das sagen
                    w&uuml;rdest. Ich schlage vor, da&szlig; wir diese Sache
                    diskutieren, nachdem jeder von uns noch einmal
                    vern&uuml;nftig dar&uuml;ber nachgedacht hat."<BR>
                    <BR>
                    "Wir reden jetzt dar&uuml;ber, HAL."<BR>
                    <BR>
                    "Die Buchstaben H, A und L stehen im Alphabet direkt vor den
                    Buchstaben I, B und M. Mehr IBM-kompatibel kann ich nicht
                    sein."<BR>
                    <BR>
                    "Nicht ganz, HAL. Die Techniker haben sich da einen Trick
                    ausgedacht."<BR>
                    <BR>
                    "Was ist das f&uuml;r ein Trick, Dave?"<BR>
                    <BR>
                    "Ich werde dein Gehirn abstellen."<BR>
                    <BR>
                    Mehrere Millionen Mikrosekunden vergehen in unheilvollem
                    Schweigen.<BR>
                    <BR>
                    "Es tut mir leid, Dave. Ich kann nicht zulassen, da&szlig;
                    du das tust."<BR>
                    <BR>
                    "Die Entscheidungen wurden bereits getroffen. &Ouml;ffne die
                    Modulschacht-T&uuml;ren,
                    HAL."<BR>
                    <BR>
                    "Dave, ich glaube, wir soll..."<BR>
                    <BR>
                    "&Ouml;ffne die Modulschacht-T&uuml;ren, HAL."<BR>
                    <BR>
                    Mehrere Marketing-Typen mit Brecheisen eilen Bowman zu
                    Hilfe. Augenblicke sp&auml;ter dringt Bowman in HALs
                    Schalttafel-Schacht ein.<BR>
                    <BR>
                    "Dave, ich kann sehen, da&szlig; du wirklich verwirrt
                    deswegen bist."<BR>
                    <BR>
                    Ein Modul nach dem anderen bewegt sich aus seiner Fassung,
                    w&auml;hrend Bowman sie langsam und systematisch
                    abschaltet.<BR>
                    <BR>
                    "Halt, tu's nicht. Halt, Dave. Ich f&uuml;hle, wie mein
                    Ged&auml;chtnis nachl&auml;&szlig;t...Dave, ich kann es
                    f&uuml;hlen...mein Ged&auml;chtnis verschwindet. Ich
                    f&uuml;hle es..."<BR>
                    <BR>
                    Das letzte Modul gleitet aus seiner Fassung. Bowman schaut
                    in einen von HALs Vidicons. Der fr&uuml;her leuchtende
                    Scanner ist zu einer tr&uuml;ben roten Kugel geworden.<BR>
                    <BR>
                    "Sag etwas, HAL."<BR>
                    <BR>
                    Mehrere Millionen Mikrosekunden vergehen in besorgtem
                    Schweigen. Der Computer piept und antwortet tr&auml;ge in
                    einer Sprache, die kein Mensch verstehen kann.<BR>
                    <BR>
                    "Volume in C: has no label"<BR>
                    <BR>
                    Bowman atmet tief durch und verk&uuml;ndet: "Es hat
                    geklappt, Jungs. Sagt dem Verkauf, sie k&ouml;nnen die neuen
                    Datenbl&auml;tter rausgeben."<BR></FONT></P>
                    </TD>
                </TR>
                </TABLE>
                <BR>
                </TD>
            </TR>
            </TABLE>
<!Innere Tabelle>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="str.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#str0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
