<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="tls0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tls.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#F0D0B0">
        <TR>
            <TD><IMG SRC="tls.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
        </TR>
        <TR>
           <TD>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="80%">
            <TR>
                <TD>
                <H2 align="center"><B>Testbericht</B></H2>
                <BR>
                <P align="CENTER"><B>LYAPUNOVIA<BR>
                -----------<BR></B></P>

                <P>
                Okay, wollen wir erstmal kl&auml;ren was der wundersch&ouml;n
                unverst&auml;ndliche Name Lyapunovia bedeutet. &Auml;hhhm, ich
                nenn das Ding in Zunkunft mal Ly., weil man das Ding genauso
                schwer schreiben kann wie man&#180;s ausspricht. Ly. ist ein
                Programm &auml;hnlich den Mandelbrotprogrammen. Mit dem Proggi
                kann man Grafiken erzeugen die dem &quot;Apfelm&auml;nchen&quot;
                oder den Julia Mengen gleichen. Diese Grafiken kommen, genau wie
                beim Mandelbrotproggi, nur in bestimmten Zahlenbereichen vor und
                werden aufgrund der ver&auml;nderten Zahlen beinflu&szlig;t.</P>

                <P>
                So, aber nun zum Programm. Als erstes kommt Ly. auf der Fish 877
                vor. &Ouml;ffnet man nun das Fenster, so kommen einem erstmal 3
                Versionen von Ly. vor die Linse und danach ein paar Texticons
                und Schubladen. Die 3 Versionen von Ly. sind alle in Version 1.5
                &quot;abgefa&szlig;t&quot;, aber jedoch f&uuml;r andere
                Prozessoren. Eine f&uuml;r den 68000, die zweite f&uuml;r den
                68020+ und eine dritte f&uuml;r Computer mit einer FPU. Unter
                den Textdatein findet man (wie immer) eine Readme Datei, die
                History und die Anleitung im Amiga Guide Format und einmal als
                normalen Text. Aber nun mal zu den Schubladen. Die w&auml;ren
                wie folgt : Pics, Coordinates, Palettes und Reqtools. Alle
                erkl&auml;ren sich eigentlich von selbst. Im Verzeichniss Pics
                ist 1 Bild f&uuml;r &quot;Non-AGA-Amigas&quot; und ein Lha
                Verzeichniss mit 4 AGA Grafiken zu finden. Wer es lieber selber
                berechnen will, findet im Verzeichniss Coordinates ca. 100
                verschiedene Coordinaten die im Programm geladen werden
                k&ouml;nnen. Ebenfalls findet man ca. 80 &quot;Paletten&quot; in
                16, 32 oder 256 Farben in der Schublade Palettes.</P>

                <IMG SRC="tt-lyapunovia1.png" ALT="Lyapunovia1" BORDER="2">


                <P>
                So nun aber mal zum eigentlichen Programm. Nach dem Doppelklick
                aufs Icon &ouml;ffnet sich ein neuer Screen. Gleich darauf
                erscheint die &quot;Grundgrafik&quot;, d.h die gesamt Grafik in
                diesem Zahlenbereich. Ein neugieriger User testet erstmal die
                Menus bevor er sich die Grafik genau anschaut - und was stellt
                er fest ? Er findet 3 Menupunkte, n&auml;mlich Programm, Screen
                und Image. Im Menu Programm kann man Graiken die z.Z in
                Berechnung sind abbrechen, ein IFF Bild laden bzw. die Grafik
                als dieses speichern, ebenfalls kann man die Voreinstellungen
                laden und speichern. Im 2.Menu, also im Screen-Menu, gibt es net
                viel zu erkl&auml;ren. Hier kann man die Palette ver&auml;ndern,
                eine Titelzeile einblenden und die Screenmodi und die Farben
                (2-256) &uuml;ber ein Requester einstellen. Nun w&auml;ren wir
                schon mal beim 3.Menupunkt angekommen und dieser ist der
                komplexeste der ganzen 3. Hier findet man Coordinates, Zoom in
                und Zoom out, Load und Save (hier f&uuml;r die Koordinaten)
                sowie die Precision die sich in 3 Stufen unterteilt. Zoomen kann
                man mittels einer gezogenen Box um den gew&uuml;nschten Bereich
                der vergr&ouml;&szlig;ert werden soll. Danach wird das alte Bild
                gel&ouml;scht und das neue aufgebaut bzw. berechnet.</P>

                <IMG SRC="tt-lyapunovia2.png" ALT="Lyapunovia2" BORDER="2">

                <P>
                So das wars zum Programm, manche werden sich fragen was man
                damit anfangen kann . Naja, man kann es einerseits als kleine
                grafische Spielerei (die &uuml;brigens sehr interesant sein
                kann) ansehen, oder andererseits die ganze Sache
                wissenschaftlich (aber davon hab ich null,null Ahnung) oder
                wiederum andererseits die entstandenen Bilder als Backgrounds
                usw benutzen.</P>

                <P ALIGN="RIGHT">Jens Neubauer</P>
                <BR><BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="tls.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
