<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="tls0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tls.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#404040">
        <TR>
            <TD><IMG SRC="tls.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#C0B0B0" WIDTH="80%">
            <TR>
                <TD>
                <H2 ALIGN="CENTER"><B>Testbericht</B></H2>
                <BR>
                <CENTER><P><B>
                VIDEOMAXE<BR>
                -----------</B>
                </P></CENTER>

                <P>
                Videomaxe liegt zur Zeit in der Version 4.2 vor. Der Autor ist
                Stephan S&uuml;rken. Wie ihr Euch sicherlich schon denken
                k&ouml;nnt, hat das Proggi was mit Video zu tun. RICHTIG , es
                hat was mit Video zu tun und zwar mit der w&uuml;sten Sammlung
                an Videokasetten der Sp&auml;tfilme. Wenn ich mir meinen Haufen
                so angucke bin ich froh das Disketten nicht so gro&szlig; wie
                Videokassetten sind, sonst m&uuml;&szlig;t ich ja anbauen. Naja,
                aber erstmal weiter im Text. Videomaxe kann man bequem mit klick
                aufs Icon starten, aber halt - wasn noch im Verzeichniss drin ?
                Also au&szlig;er dem eigentlichen Programm sind noch enthalten :
                Readme, Serer.readma, Assignvm, Installvm und die Verzeichnisse
                Docs,Projects,Config,Prtprefs und Videorecorder. So na denn
                wollen wir euch das mal erkl&auml;ren - heeee, wieso wir - ich
                sitz hier bei (moment mal zum Termomeeeder gucken ...) 32&deg;
                und schreib den Test alleine w&auml;hrend alle anderen im Bad
                sind - aber naja - f&uuml;r Euch mach ichs doch gerne !?!?!?.
                Die Installation erfolgt &uuml;ber den Installer von Commodore
                also bereitet keine gr&ouml;&szlig;eren Schwierigkeiten. Der
                Rest erkl&auml;rt sich ja fast von selbst, bis auf
                Videorekorder. Im Verzeichniss Videorekorder findet man 2
                verschiedene Rekorder, einmal den Schneider_svc und zum zweiten
                den Nordmende_spectra.
                </P>

                <IMG SRC="tt-videomax1.png" ALT="Videomax1" BORDER="2">

                <P>
                Aber nun zum eigentlichen Programm. Nach dem Doppelklick aufs
                Videomaxe Icon wird ein neuer Bildschirm ge&ouml;ffnet und darin
                ein Fenster. Nun kann man im Menu diverse Einstellungen (siehe
                Screenshot) oder aber das Programm verlassen oder ein Projekt
                speichern oder &ouml;ffen. Nachdem man ein Projekt ge&ouml;ffnet
                hat erscheint ein neuer Screen indem man folgendes finden kann :
                ganz oben steht der Name des Projektes, dirket darunter kann man
                die Anzeigemodule f&uuml;r das darunter gelegene Anzeigewindow
                ausw&auml;hlen. Ganz rechts an der Seite befinden sich Gadgets
                indem man per Eingabe mit Tastatur oder per anklicken durch die
                Maus Rubrik und Kassettennummer ausw&auml;hlen kann. Ganz unten
                befindet sich die Spulinfo. Nochmal zu den Anzeigemodusen
                (klingt bl&ouml;d aber was anderes is mir net eingefallen). Man
                kann w&auml;hlen zwischen: Alle Titel (alphabetisch), Titel der
                Kassette, Titel der Rubrik und Alle Titel nach Datum . Wird hier
                z.b alle Titel der Rubrik angeklickt so erscheinen die Titel die
                zu der vorher ausgew&auml;hlten Rubrik geh&ouml;ren. Mit einem
                Doppelklick auf den Namen des Filmes erscheint ein neues
                Fenster, indem man die verschiedenen Infos wie z.B Kassetten
                Nummer,Rubrik, Name, L&auml;nge, Kompressionsfaktor, Datum,
                Zeit,
                </P>

                <IMG SRC="tt-videomax2.png" ALT="Videomax2" BORDER="2">


                <P>
                Maskeneintr&auml;ge usw. abrufen kann. Das editieren der
                Kassetten erfolgt recht einfach - einfach das Projekt und die
                Rubrik ausw&auml;hlen bzw. laden und dann mit Hilfe das
                Men&uuml;punktes "Kassette Neu" einfach die Daten der Kassette
                eintragen. Also VideoMaxe hat einfach alles was man zu einer
                Verwaltung seiner Kassetten braucht, dar&uuml;berhinaus bietet
                VM noch einige Schmankerln die dem Benutzer das Leben
                erleichtern bzw. versch&ouml;nern. Zum Beispiel gibt es eine
                Statistikfunktion f&uuml;r alle Kassetten, dei Einstellungen
                f&uuml;r die Pfade, den Drucker usw. sind alle bequem zu
                erledigen, das Programm ist StyleGuide konform programmiert und
                es lassen sich mittels Requester die Fonts f&uuml;r Gadgets oder
                Men&uuml;s, die Farbenanzahl oder die Aufl&ouml;sung einstellen.
                </P>

                <IMG SRC="tt-videomax3.png" ALT="Videomax3" BORDER="2">

                <DL>
                    <DT> FAZIT :
                    <DD> Jeder der noch keine Videoveerwaltung hat und eine sucht f&uuml;r die
                    <DD>man nicht erst "studieren" mu&szlig;, ist bei VideoMaxe richtig
                    <DD>aufgehoben. VideoMaxe findet Ihr auf der Fish Disk 940 oder Ihr
                    <DD>k&ouml;nnts gegen eine PD-Disk (keine Fish) und R&uuml;ckporto bei mir bestellen.
                </DL>
         
                <P ALIGN="RIGHT">Jens Neubauer</P>
                <BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="tls.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

