<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="tls0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tls.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#000060">
        <TR>
            <TD><IMG SRC="tls.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="80%">
            <TR>
                <TD>
                <H2 align="center"><B>Testbericht</B></H2>
                <BR>
                <CENTER><P><B>
                CD-12OO Controller Software<BR>
                ---------------------------</B>
                </P></CENTER>

                <P>
                Nun zur Software des CD12OO. Diese befindet sich auf einer Disk
                mit dem Namen &quot;TandemCDInstall&quot; - b&auml;&auml;hhh,
                was hat der Tandem Controller mit dem CD 12OO Controller zu tun?<BR>
                Ich mu&szlig; mal gestehen - das wei&szlig; ich feil ah net ....
                Entweder sind die beiden Produkte kompadiebell ( was ich stark
                vermute ) oder es ist das selbe. Naja, nach dieser kleinen
                &quot;Selbstentb&ouml;sung Insachen Unkenntniss&quot; machen wir
                mal weiter im Text.</P>

                <P>
                Auf der Disk sind 95% belegt. Die kleine Scheibe belegen
                Programme zur CD, der Installer und die Docs. Zu den Docs gibts
                halt net viel zu Sagen, sind halt die Anleitungen zu den ganzen
                Programmen und Tools. Okay, &quot;die ganzen Programme&quot;
                sind eigentlich nur 4 und nennen sich PlayCD, EjectCD, KillDev
                und FindCD. Wobei CD und Dev die Nachnamen sind - haaaahaaa, ich
                lach mich tot - aber keine Angst - der Text verliert sich nicht
                in sinnlosen, unverst&auml;ndlichen, verwirrenden Jokes die nur
                der Autor versteht - ABER wer &uuml;bersteht schon 35&deg; im
                Schatten ? Machen wir halt weiter. Die Programme die der
                Anwender wohl am h&auml;ufigsten gebrauchen wird sind wohl
                PlayCD und EjectCD.
                </P>

                <IMG SRC="tt-cd1200.png" ALT="PlayCD" BORDER="2">

                <P>
                EjectCD l&auml;&szlig;t sich schnell erl&auml;utern. Am besten
                kommt man, wenn man dieses kleine, 4kByte gro&szlig;e Programm,
                in die WBStartup kopiert. Nach dem starten erscheint dann rechts
                oben in der Ecke ein Window mit einem Gadget. Beim klick aufs
                Gadget wird das Rom Laufwerk automatisch ge&ouml;ffnet. Dies
                kann manchmal &auml;u&szlig;erst praktisch sein, wenn man nicht
                dauernd den Finger zum &quot;Open-Kn&ouml;pfchen&quot; am CD-Rom
                Laufwerk bewegen will. Naja, aber auch bei einem sooo kleinen
                Programm gibt es 2 Nachteile - der 1. ist, es tut nichts gegen
                meine schlechte Finanzlage und der 2. ist, das sich das Programm
                seinen Platz immer in der oberen rechten Ecke &quot;frei
                macht&quot;. Aber naja, ist ja net so wild - nun aber zum
                n&auml;chsten Programm. PlayCD dient, wie man sicherlich schon
                am Namen erkennt, ein Programm um die handels&uuml;blichen
                AudioCDs auf dem CD-Rom abschpielen zu k&ouml;nnen. Nach dem
                anklicken erscheint ein Fenster das mit vielen kleinen Gadgets
                best&uuml;ckt ist. Die meisten davon sind die Titel Nummern von
                1-20. Ganz links beindet sich ein kleines Fenster indem nam
                &uuml;ber die aktuelle Titelnummer und die bisherige Laufzeit
                des Titels informiert wird. Gleich darunter kann man die
                CD-Player &uuml;blichen Bedienelemente wie Vorlauf, Play, Stop,
                Pause usw. finden. Ganz rechts befindet sich ein Gadget indem
                man per Mausklick die Lautst&auml;rke Software m&auml;&szlig;ig
                regeln kann. Wiederum gleich darunter befindet sich nochmal das
                gleiche Gadget wie bei Eject-CD - nat&uuml;rlich mit der selben
                Funktion.</P>

                <P>
                Nach der Installation, die bequem mit dem Commodore Installer,
                erfolgt findet man im ausgew&auml;hltne Verzeichniss auch noch
                das bekannte Shareware Programm Juke Box. Der Funktionsumfang
                ist nat&uuml;rlich gr&ouml;&szlig;er als der des Programmes
                PlayCD. Doch abschlie&szlig;end l&auml;&szlig;t sich sagen, das
                die mitgelieferte Software sehr gut gelungen ist und eigentlich
                noch keine Probleme (zumindest bei mir) gemacht hat.</P>

                <P ALIGN="RIGHT">Jens Neubauer</P>
                <BR>
                <BR>
                </TD>
            </TR>
            </TABLE>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="tls.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
