<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>INDIANA JONES AND THE FATE OF ATLANTIS</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="tut0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tut.html" ALT="zur&uuml;ck">
        </MAP> 
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#F0F0F0">
        <TR>
            <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
<!Innere Tabelle>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="15" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="90%">
            <TR>
                <TD>
                <H2 ALIGN="CENTER">INDIANA JONES</H2>
                <H4 ALIGN="CENTER">AND THE FATE OF ATLANTIS</H4>

                <P>
                In einer dunklen Seitenstra&szlig;e findet er auch schon das
                Theater, in dem Sophia just an diesen Abend auftreten soll. Die
                Show ist aber wider Erwarten restlos ausverkauft. Der gewiefte
                Arch&auml;ologe besinnt sich aber gl&uuml;cklicherweise des
                B&uuml;hneneingangs. Auf dem Weg dorthin l&auml;&szlig;t er die
                Zeitung mitgehen. Alles l&auml;uft wie am Schn&uuml;rchen, bis
                der muskelbepackte T&uuml;rsteher auftaucht. Indy kann ihn
                geschickt in ein Gespr&auml;ch &uuml;ber Sophia verwickeln,
                indem er immer wieder auf ihren unbeschreiblichen Intiligent
                anspielt. Selbst wenn er den Weg nicht freigibt, hat Dr. Jones
                die passende L&ouml;sung parat. Er schiebt kurzerhand die Kisten
                im Hinterhof beiseite und klettert &uuml;ber die Feuerleiter ins
                Theater. er gelangt zur B&uuml;hne. Mit Sophia kann er
                allerdings immer noch nicht sprechen, denn ein alter Giftzwerg
                hindert ihm permament daran, die Show zu unterbrechen. Indy kann
                ihn schlie&szlig;lich nur durch das Aush&auml;ndigen der Zeitung
                ablenken, denn f&uuml;r seine favorisierte Baseballmanschaft,
                den Dodgers, l&auml;&szlig;t der kleine Mann alles stehen und
                liegen. Jetzt kann unser Held die beiden &auml;u&szlig;eren
                Hebel nach hinten dr&uuml;cken (ein gr&uuml;nes Licht sollte
                erscheinen) und anschlie&szlig;end den roten Knopf
                bet&auml;tigen.<BR>
                <BR>

                <FONT SIZE="+1">Island</FONT>
                <BR>
                In der ehemaligen Ausgrabungst&auml;tte treffen die beiden
                Arch&auml;ologen auf Dr. Bj&ouml;rn Heimdall, den sie &uuml;ber
                jede Kleinigkeit peibelst ausfragen.<BR>
                <BR>
                <FONT SIZE="+1">Tikal</FONT>
                <BR>
                Im Dschungel l&auml;&szlig;t Indy zum ersten Mal seine
                gef&uuml;rchtete Peitsche knallen und treibt den Ameisenb&auml;r
                durch den dritten Eingang. Die Schlange krallt sich nun den
                willkommenen Imbi&szlig; und beide Tiere verschwinden in der
                benachbarten Schlucht. Jetzt knickt Dr. Jones den br&uuml;chigen
                Baum um und gelangt auf diese Weise &uuml;ber den Abgrund. Hier
                wartet bereits Sophia. Sobald sich einer der beiden an den
                Souverinw&auml;gelchen zu schaffen macht, taucht Dr. Sternhart
                auf. Er gew&auml;hrt nur demjenigen Zutritt zu heiligen Tempel,
                der den Namen eines ber&uuml;hmten griechischen Philisophen
                nennen kann. Der Papagei leistet in diesem Fall hervorragende
                Dienste. Im Inneren des Tempels wendet sich Indy an seine
                Begleiterin Sophia. Sie soll mit ihrem weiblichen Charme
                Sternhart ablenken, damit er sich in Ruhe die Petroleumlampe vom
                Wagen holen kann. Zur&uuml;ck in der alten Kultst&auml;tte
                &ouml;ffnet er die Lampe und benutzt sie mit der linken Seite
                des Grabmals. Eine Spirale erscheint, die der studierte
                Arch&auml;ologe anschlie&szlig;end auf den Tierkopf anwendet.
                Wenn er daran zieht, &ouml;ffnet sich die Geheimt&uuml;r und das
                Orichalcum tritt ans Tageslicht.<BR>
                <BR>

                <FONT SIZE="+1">Island</FONT>
                <BR>
                Im hohen Norden ist Heimdall der permanenten und unmenschlichen
                K&auml;lte zum Opfer gefallen. Als schlauer Fuchs setzt Dr.
                Henry Jones das Orchalcum nat&uuml;rlich ohne gro&szlig;e
                Bedenkzeit zu verschwenden in die seltsame Figur ein, die
                daraufhin unter -freigabe starker Energie aus dem ewigen Eis
                herausschmelzt.<BR>
                <BR>
                <FONT SIZE="+1">Die Azoren</FONT>
                <BR>
                Sophia versucht als erstes ihr Gl&uuml;ck beim schrulligen Mr.
                Costa. Er verlangt ihr Necklace, doch ist sie auch durch
                flehendes Bitten davon nicht zu &uuml;berzeugen, f&uuml;r eine
                Information ihr gesch&auml;tztes Talismann herzugeben. Jetzt ist
                Indy an der Reihe. Er bietet den gerissenen
                Antiquit&auml;tenh&auml;ndler die El Figurine an. Damit ist er
                einverstanden und verr&auml;t dem gegens&auml;tzlichen Paar den
                Standort von Platos Lost Dialogue.<BR>
                <BR>

                <FONT SIZE="+1">Barnett College</FONT>
                <BR>
                Im Erdegscho&szlig; l&auml;&szlig;t Indy erst einmal alle
                Gegenst&auml;nde mitgehen, die nicht niet-und nagelfest sind.
                Anschlie&szlig;end geht er hinauf in den ersten Stock, entfernt
                hier den klebrigen Kaugummi vom Stuhl und steckt ihn in die
                Hosentasche. Im zweiten Stock (nur &uuml;ber das Seil zu
                erreichen) findet Dr. Jones die Pfeilspitze, die er mit dem
                roten Tuch verbindet. Jetzt k&ouml;nnen die Schrauben aus dem
                ungefallenen Schrank gezogen werden. Der unsch&auml;tzbare
                wertvolle Brief ist gefunden.<BR>
                <BR>
                <FONT SIZE="+1">Algier</FONT>
                <BR>
                In dieser tubulenten Stadt biegen die beiden Streith&auml;hne
                zun&auml;chst in die Back Alley ein. Omars Laden beherbergt eine
                ganze Menge seltsamer Gegenst&auml;nde. Unter anderem auch eine
                Monstermaske, die sofort im Rucksack verschwindet. Gehandelt
                wird auf gar keinen Fall!!! Auf dem Marktplatz sucht ein
                ge&uuml;bter Messerwerfer verzweifelt eine Freiwillige. Indy
                versucht Sophia zu &uuml;berreden. Sie sieht sich nun die
                Angelegenheit aus der N&auml;he an und Henry Jones Jr. rempelt
                die rotharige Sch&ouml;nheit vor das Brett (dr&uuml;cke Sophia).
                Aus Dankbarkeit erhalten die beiden ein kleines Messer.<BR>
                <BR>

                <FONT SIZE="+1">Monte Carlo</FONT>
                <BR>
                Nachdem Mr. Trottier (brauner Anzug, graue Haare) gefunden
                wurde, spicht ihn Indy an un erz&auml;hlt ihm nichts als die
                reine Wahrheit. Er schickt den Abendteurer fort und Dr. Jones
                kann erneut mit Sophia in Kontakt treten. Danach versucht er
                wieder sein Gl&uuml;ck beim franz&ouml;sischen Gentelman und
                tischt ihm diesmal eine tolle Story &uuml;ber den Geist des
                Nur-Ab-Sals auf. Der begeisterte Spiritist stellt nun eine
                Frage, die mit Hilfe von Plato`s Lost Dialogue leicht
                beantwortet werden kann. Sophia soll wieder einmal ein
                Ablenkungsman&ouml;ver unternehmen, um Indy frei Hand zu geben.
                Trottier ist von ihren Auff&uuml;hrungen begeistert und Indy
                kann sich seelenruhig dem Cabinet widmen. Er nimmt die
                Taschenlampe, &ouml;ffnet den Sicherungskasten und schaltet den
                Strom aus. Danach zieht er sich das Bettlaken &uuml;ber, setzt
                die furchteregende Maske auf und schaltet die Taschenlampe ein.
                Mr. Trottier ist entsetzt und verl&auml;&szlig;t panikartig das
                Hotelzimmer. Den Sunstone l&auml;&szlig;t er allerdings
                liegen.<BR>
                <BR>

                <FONT SIZE="+1">Algier</FONT>
                <BR>
                Nachdem der seltene Sunstone wahre Begeisterungsst&uuml;rme bei
                Omar hervorruft, bekunden die beiden ungleichen
                Pers&ouml;nlichkeiten ihr enormens Interesse am versunkenen
                Kontinent Atlantis. Daraufhin r&uuml;ckt er eine
                &auml;u&szlig;erst vage Karte heraus. Danach tauscht Indy die
                gestohlene Maske und geht zum einzigen GEm&uuml;seh&auml;ndler
                der Stadt. Hier verhandelt er mit dem kompromi&szlig;losen
                Einzelh&auml;ndler (immer wieder mit Omar tauschen), bis dieser
                schlie&szlig;lich den Squab-On-A-Stick her&uuml;berschiebt.
                Diesen persischen Leckerbissen kann Dr. Jones beim mittelosen
                Bettler gegen die Ballontickets wechseln. Sobald sich die beiden
                an Bord befinden, kappen sie auch die Halteleine (Benutze Messer
                mit Seil) und die Reise kann beginnen,<BR>
                <BR>

                <FONT SIZE="+1">In der Luft</FONT>
                <BR>
                Indy mu&szlig; mindestens zwei Nomaden-Camps ausfindig machen,
                um die exakten Koordinaten des X zu bestimmen und dort zu
                landen.<BR>
                <BR>
                <FONT SIZE="+1">Die verlassene Ausgrabungsst&auml;tte</FONT>
                <BR>
                Indy klettert zun&auml;chst die Leiter herunter. In diesem
                finsteren Raum steckt er alles ein, was nicht niet-und nagelfest
                ist. Dann geht er zur&uuml;ck zum LKW. Den Schlauch verbindet er
                mit dem Krug und diese Konstruktion wiederum mit dem
                Gasbeh&auml;lter des Fahrzeugs. Wieder zur&uuml;ck in der
                H&ouml;hle f&uuml;llt er das Gas in den protablen Generator
                (metal thing) und dr&uuml;ckt den Knopf. Mit der Ship Rib ist er
                in der Lage, die br&uuml;chige Wand im Osten zum Einsturtz zu
                bringen. Den Holzd&uuml;bel (wooden peg) schl&auml;gt er in die
                erscheinende Mauer und steckt anschlie&szlig;end den Sunstone
                darauf. Die richtige Ausrichtung findet er wieder einmal in
                Platos Lost Dialogue. Sophia ist damit befreit und h&auml;ndigt
                unserem Held einen seltsamen Fisch (Orichalcum-Dektor) und eine
                Verteilerkappe aus. Der Generator ausgeschaltet, die
                Z&uuml;ndkerze herausgenommen und mit beiden Gegenst&auml;nden
                wird der Motor des LKWs repariert.<BR>
                <BR>

                <FONT SIZE="+1">Kreta</FONT>
                <BR>
                Voller Tatendrang untersuchen die beiden Arch&auml;ologen zuerst
                die Ruinen. Das Vermessungsinstrument wird wie gew&ouml;hnlich
                eingesackt und danach werden alle Steine in Augenschein genommen
                bzw. abgeklopft. Zwei Statuen sind zum Vorschein gekommen.
                Nachdem auf die rechte Statue das Instrument abgestellt wurde,
                kann Indy seine Beobachtungen fortsetzen. Das Fadenkreuz und das
                rechte Horn m&uuml;ssen sich &uuml;berschneiden. Die gleiche
                Prozedur veranstaltet er mit der linken Statue. Es erscheint ein
                Kreuz, bei dem Indy fanatisch mit der Ship Rib gr&auml;bt. Der
                Moonstone ist gefunden. Diesmal legt er beide Steine auf die
                Spindel und richtet sie ganz nach Plato aus.<BR>
                <BR>

                <FONT SIZE="+1">Der Weg nach Atlantis</FONT>
                <BR>
                Zwei K&ouml;pfe werden vom Regal heruntergenommen, bevor beide
                Akteure durch die T&uuml;r verschwinden. Den letzten Kopf wird
                durch einen geschickten Peitschenhieb ins Innere des Labyrinths
                geholt. Jetzt mu&szlig; die Minotaurstatue gefunden werden. Der
                Kopf dieses griechischen Relikts wird vom Meister
                pers&ouml;nlich ebenfalls mit der Peitsche bearbeitet. Der
                Fahrstuhl f&uuml;hrt direkt zum verstorbenen Dr. Sternhart. Von
                ihm erh&auml;lt Indy einen Stab und den letzen Stein. Hinter dem
                Wasserfall befindet sich eine Kette, die der kr&auml;ftige
                Abenteurer problemlos emporklettern kann. Die Suche geht weiter.
                Diesmal mu&szlig; eine zweite T&uuml;r mit Regal gefunden
                werden. Hier legt Indy alle drei K&ouml;pfe ab und geht durch
                das nun ge&ouml;ffnete tor. Nach einiger Zeit gelangt er in
                einen Raum, in dem er mit Hilfe des stabs ein Gegengewicht
                l&ouml;sen kann. Danach konzentriert sich Indy auf die Suche
                nach einem gro&szlig;en Statuenkopf mit offenem Mund. Hier
                steckt er den Stab hinein, um nach oben zu gelangen. Die
                Goldkiste nimmt Indy selbstverst&auml;ndlich wieder mit. Im
                Norden trifft er auf Sophia. Sie mu&szlig; nun davon
                &uuml;berzeugt werden, durch das Loch zu steigen, um die
                Fallt&uuml;r von der aderen Seite &ouml;ffnen zu k&ouml;nnen.
                Unter einem Wasserfall machen die beiden Halt. Sophia legt ihr
                Necklace in die goldene Kiste, woraufhin Indy den Fisch zappeln
                l&auml;&szlig;t. Dieser Meerbewohner weist auf einen geheimen
                Durchgang hin, der zun&auml;chst mit der Ship Rib freigelegt
                werden mu&szlig;. Im folgenden Raum, werden wieder alle drei
                Steine mit der Spindel benutzt und nach Plato ausgerichtet.<BR>
                <BR>

                Eine T&uuml;r &ouml;ffnet sich. Die Freude ist allerdings nur
                von kurzer Dauer, denn wenige Sekunden sp&auml;ter bedroht
                Kerner Indy mit einem unegm&uuml;tlichen St&uuml;ck Metal. Einer
                Pistole. Er sperrt den tapferen Recken ein und die Wand stellt
                den einzigen Fluchtweg dar (Ship Rib).<BR>
                <BR>

                <FONT SIZE="+1">Das U-Boot</FONT>
                <BR>
                Zun&auml;chst wird der pflichtbewu&szlig;te Kapit&auml;n von
                Indy niedergestreckt. Kein Problem. Dann benutzt er die
                SPrechanlage, um die Mannschaft in den hinteren Teil des Bootes
                zu schicken. Jetzt kann die Treppe gefahrtlos betreten werden.
                Auf dem Weg in den vorderen Teil des Schiffes nimmt der
                ge&uuml;bte Dieb das Brot, den Cold Cut und den Bierkrug (Mug)
                mit. Im unteren Stockwerk l&auml;&szlig;t er Batteries&auml;ure
                in den Krug laufen, schleicht sich danach an Sophia heran
                (einfach nach rechts laufen) und teilt ihr mit, da&szlig; sie
                den W&auml;chter f&uuml;r l&auml;ngere Zeit ablenken soll.
                Schlie&szlig;lich wird noch der Kolben (Plunger) im
                Handgep&auml;ck verstaut, bevor Indy den Weg nach oben antritt.
                Hier legt er den Schalter auf der linken Seite um und benutzt
                den Kolben mit dem gro&szlig;en Hebel (Big Lever). AUf der
                rechten Seite des Schiffs befindet sich der Kapit&auml;ntresor
                (neben Kerner), der mit der aufgefangenen Batteries&auml;ure
                leicht ge&ouml;ffnetwerden kann. Die Steine sind wieder in der
                Hand der guten Seite. Anschlie&szlig;end ist der W&auml;chter an
                der Reihe. Er wird sofort auf den &uuml;berraschenden Besuch
                Indys aufmerksam. Davon l&auml;&szlig;t sich allerdings Indy
                nicht besonders beeindrucken, sondern teilt Sophia
                verschl&uuml;sselt mit, da&szlig; sie den W&auml;chter mit dem
                Eimer niederstrecken soll (Bucket Head!). Nun kann mit dem
                Schl&uuml;ssel die Notfallsteuerung aufgeschlossen werden. Das
                U-Boot mu&szlig; in das Air-Lock eingeparkt werden.<BR>
                <BR>

                <FONT SIZE="+1">Atlantis</FONT>
                <BR>
                Nachdem sich Indy der Leiter bem&auml;chtigt hat, wird Sophia
                ein zweites Mal gekidnapped. Er legt die Leiter an das Rocky
                Inclide und &ouml;ffnet die Stone Box. Hier befindet sich ein
                kleiner, metallischer Gegenstand, den er unbedingt mit dem
                Orichalcum benutzen mu&szlig;. Danach verbindet er die drei
                Steine mit der Spindel an der Statue und dreht solange, bis sich
                der Mund &ouml;ffnet. Hier wirft er wieder einmal ein Orchalcum
                ein.<BR>
                <BR>

                <FONT SIZE="+1">Das Labyrinth</FONT>
                <BR>

                Es k&ouml;nnen von Indy nur die R&auml;ume betreten werden, die
                mit einem Fragezeichen gekennzeichnet sind. Befindet sich etwas
                besonderes in diesem Zimmer, so wird das auf der Karte
                eingetragen. Auch hier gilt, da&szlig; sich Dr. Jones jeden
                Gegenstand unter den Nagel rei&szlig;en mu&szlig;. Im
                Statuenraum l&auml;&szlig;t sich die Leiter zu einer astreiner
                Br&uuml;cke umfunktionieren, um &uuml;ber die Schlucht zu
                gelangen. Nachdem Indy den Steinbecher an sich genommen hat,
                macht er sich auf den Weg zu den Relikten der einst hochmodernen
                U-Bahn im &auml;u&szlig;eren Kreis. Hier greift Henry Jones den
                Brustkasten des Skeletts ab. Im Krabbenraum wird das Sandwich
                (Brot und Cold Cut) mit den Brustrippen verbunden. Diese Falle
                wird danach in der winzigen Pf&uuml;tze plaziert. Sobald eine
                Krabbe hineingetappst ist, nimmt Indy die Knochen wieder an
                sich. Jetzt beginnt die hei&szlig;e Suche nach der
                Fischkopfstatue, deren Kopf mitgenommen werden mu&szlig;. Im
                Lavaraum benutzt Indy den Steinbecher mit dem Podest und den
                Fischkopf mit der Plaque. Die Lava f&uuml;llt nun den leeren
                Becher und Dr. Jones packt alles wieder sorgsam ein. In den
                beiden Roboterr&auml;umen gilt es eine Radspeiche und ein Piece
                of Gear mitzunehmen. Diese beiden<BR>
                <BR>

                Gegenst&auml;nde werden unbedingt in den Maschinenraum
                ben&ouml;tigt. Zun&auml;chst benutzt Indy die Radspeiche mit dem
                St&ouml;psel (peg) und den Steinbecher mit dem Tricher (Funnel).
                Es werden nun Orichalcum-Beads produziert, die sich ein findiger
                Forscher wie Indiana Jones nat&uuml;rlich nicht entgehen
                l&auml;&szlig;t. Die Radspeiche wieder mitnehmen. Um Sophia aus
                den H&auml;nden der Nazis zu befreien, mu&szlig; Indy
                zun&auml;chst einen Schacht suchen, der sowohl zu ihrem
                Gef&auml;ngnis f&uuml;hrt, als auch Zugang zu einer Statue
                bietet. In diese Statue wirft er wieder ein Orichalchum ein.
                Sophia zeigt sich zwar dankbar, verweilt aber lieber noch ein
                wenig an diesem garstigen Ort. Im Sentry Room benutzt Jones
                wieder ein Orichalcum. Diesmal mit der Fischmund-Statue. Danach
                investiert er noch ein Orichalcum in die bis dahin gefundene Eel
                Figurine. Ein weiteres Orichalcum im Fischmund &ouml;ffnet
                schlie&szlig;lich das Tor zum ...<BR>
                <BR>

                <FONT SIZE="+1">Kanal</FONT>
                <BR>
                Die gefangene Krabbe spendiert Indy gro&szlig;z&uuml;gig der
                Krake. Sie verschwindet daraufhin und der Kanal kann gefahrlos
                &uuml;berquert werden. Eine Bead aktiviert das
                Amphibienfahrzeug. Der Weg f&uuml;hrt Indy nach links, wobei er
                sich von verschlossenen T&uuml;ren nicht aufhalten
                l&auml;&szlig;t, denn diese lassen sich mit den verschiedenen
                Steinen leicht &ouml;ffnen. Er folgt solange dem Kanal, bis eine
                Treppe nach oben f&uuml;hrt. Im folgenden Raum nimmt der
                studierte Arch&auml;ologe das Getriebe aus dem Schrank und
                schlie&szlig;t diesen wieder. Es kommt eine Zeitung zum
                Vorschein, die er sorgf&auml;ltig abzeichnet. Hinter dem Archway
                befindet sich eine Statue, deren rechter Arm mit der Kette
                verbunden wird. Indy lehnt nun die Leiter an die Statue und
                &ouml;ffnet den Brustkasten. Es pr&auml;sentiert sich ein
                komplexer Mechanismus, der mit der angefertigten Zeichnung
                jedoch relativ einfach zu verstehen ist. Die Strichm&auml;nnchen
                stellen die Statue dar und auch die anderen Motorteile sind sehr
                leicht zuzuordnen. Dr. Jones versucht also nun den Arm nach
                vorne zu bewegen. Ist dies geschehen, so befestigt er das andere
                Ende der Kette mit dem goldenen Tor. Jetzt l&auml;&szlig;t er
                den Arm wieder nach hinten schnellen. Den T&uuml;rangelbolzen
                steckt Indy wieder ein. Wenn indy dem Gang folgt, so befindet
                sich auf der linken Seite eine T&uuml;r. hier sind einige
                Bewohner der einst strahlenden insel begraben, doch das
                st&ouml;rt den abgebr&uuml;hten Abenteurer nicht im geringsten.
                Er nimmt das Zepter mit und betritt die n&auml;chste T&uuml;r
                auf der rechten Seite. Die klobige Maschine entwickelt sich zu
                einem waschechten Bulldozer, sobald er ihr ein Bead
                g&ouml;nnt.<BR>
                <BR>

                Indy steckt nun das Zepter und den T&uuml;rbolzen in die beiden
                &auml;u&szlig;erden Schlitze. Die Maschine sollte nun laufen
                (wenn nicht, Zepter herausnehmen und im dritten Schlitz
                versuchen), sobald Indy die Hebel nach oben dr&uuml;ckt. Um zum
                Stillstand zu kommen, macht er die ganze Prozedur einfach wieder
                r&uuml;ckg&auml;ngig. Jetzt holt Indy Sophia, indem er den
                T&uuml;rbolzen unter das schwere Holztor legt. Auf dem
                R&uuml;ckweg zum Bulldozer passiert etwas seltsames. Nur-Ab-Sal
                meldet sich zur&uuml;ck. Er bringt Sophia in seine Gewalt und
                m&ouml;chte durch sie wieder Gestalt annehmen. Dr. Jones kann
                diesen D&auml;monen zur&uuml;ckschlagen, indem er ein Orichalcum
                mit ihrem Necklace benutzt und es dann in die Goldbox fallen
                l&auml;&szlig;t. Zur&uuml;ck beim Bulldozer entedeckt er,
                da&szlig; hier die Lava in Str&ouml;men flie&szlig;t. Durch ein
                gro&szlig;es T&uuml;renlabyrinth versucht er nun die Lava zu
                erreichen, um dann vorsichtig auf die andere Seite zu kommen.
                Die gro&szlig;e Wandmalerei (Sonne, Mond und Vulkan) gibt
                Auskunft &uuml;ber die richtige Kombination bei den letzten
                Spindel. Die &Uuml;berraschung ist gro&szlig;, als
                pl&ouml;tzlich die Nazis wieder auf der Bildfl&auml;che
                erscheinen. Indy redet wie besessen auf den verr&uuml;ckten
                Professor ein, um ihn von seinem Vorhaben abzubringen. Mit etwas
                Gesp&uuml;r und Beharrlichkeit (Forget the Beads) kann auch
                dieses letzte Problem aus der Welt geschafft werden.<BR>
                <BR>

                Ist das Buch Plato Dialog nicht in der Truhe und nicht im
                ungekippten B&uuml;cherregal, dann entferne man den Kaugummi vom
                Schreibtisch im ersten Stock. Im Keller benutzt Indy das Zeug um
                die Kohlenrutsche hinaufzuklettern. Oben angekommen untersucht
                er die Katzen auf dem Tisch. Dabei stellt sich heraus, da&szlig;
                eine Wachsfigur dabei ist. Zur&uuml;ck im Keller schmilzt er
                diese im Feuer und erh&auml;lt das vermi&szlig;te Buch.<BR>
                </P>
                
                </TD>
            </TR>
            </TABLE>
<!Innere Tabelle>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
