<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>CLI Workshop Teil 2</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
        <TD>
        <MAP NAME="wks0">
        <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="wks.html" ALT="zur&uuml;ck">
        </MAP>
        <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#800000">
        <TR>
            <TD><IMG SRC="wks.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#wks0"></TD>
        </TR>
        <TR>
            <TD>
            <BR>
            <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">CLI Workshop<BR>
            2. Teil</FONT></B></H1>
            <BR>
            <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#00FFFF" WIDTH="80%">
            <TR>
                <TD>

                <P>
                Also da bin ich nun wieder. Frisch aus dem Urlaub zur&uuml;ck
                und die NoCover 6 gelesen. Also komme ich jetzt zum zweiten Teil
                dieses Workshops.
                </P>

                <P>
                Ab diesem Teil werde ich die wichtigsten Verzeichnisse der
                Workbench vorstellen. Dabei werde ich dazugeh&ouml;rige
                Programme aus dem C-Verzeichnis erkl&auml;ren. Falls jemand
                Anregungen oder Fragen zu bestimmten Themen oder Verzeichnissen
                hat soll er mir sie stellen, meine Addresse steht am Ende dieses
                Workshops.
                </P>

                <P>
                Auf Verzeichnisse, die ihre Existenzberechtigung durch die
                Workbench erlangen, werde ich nicht eingehen (dazu z&auml;hlen :
                WBStartup, Utilities). Aber auch auf die Prefs werde ich nicht
                eingehen, sie geh&ouml;rt ja nicht direkt zur Shell.
                </P>

                <P>
                Weil ja nicht jeder ein Fanatiker ist, der unbedingt jeden
                Begriff ausgeschrieben haben m&ouml;chte, sind die meisten
                Verzeichnisnamen Abk&uuml;rzungen die das
                &quot;Themengebiet&quot; des Verzeichnisses beschreiben. So
                steht &quot;C&quot; f&uuml;r Commands (Kommandos/Befehle). Ich
                werde deshalb immer die ausgeschriebene Form einmal angeben und
                falls sinnvoll auch eine &Uuml;bersetzung. Die Abk&uuml;rzungen
                sind deshalb sinnvoll, weil sonst ein Mensch verr&uuml;ckt
                werden k&ouml;nnte, wenn er t&auml;glich ca. 20 Befehle aus
                einem Verzeichnis Namens &quot;Commands&quot; und nicht Namens
                &quot;c&quot; aufrufen m&uuml;&szlig;te.
                </P>

                <P>
                Ich beginne mit einem Verzeichnis, das einem immer wieder
                &quot;&uuml;ber den Weg laufen&quot; wird. Das Verzeichnis
                &quot;libs&quot; (Libraries=Bibliotheken) ist eins der
                interressantesten. Es enth&auml;lt sog. Bibliotheken, die
                eigentlich nur f&uuml;r den Programmierer etwas zu bedeuten
                haben. F&uuml;r den Normalanwender ist wahrscheinlich folgender
                Vergleich am besten zu verstehen: In einer Bibliothek stehen
                B&uuml;cher, die Anleitungen f&uuml;r komplizierte Vorg&auml;nge
                enthalten. Also greift der Programmierer auf eine solche Library
                zur&uuml;ck.
                </P>

                <P>
                Aber was hat das ganze jetzt mit der Shell zu tun? Nun es gibt
                ein paar Shell-Programme die auf diese Libraries
                zur&uuml;ckgreifen. Soviel erst einmal zur Theorie. Das Programm
                Say aus dem Utilities Verzeichnis dient zur ausgabe englischer
                Texte. Man gibt einen Text in Buchstaben ein. Dieser Text wird
                dann vom Programm an die &quot;translator.library&quot;
                &uuml;bergeben, die eine Bestimmte Lautschrift
                zur&uuml;ckliefert. Diese Lautschrift kann dann vom Amiga in
                T&ouml;ne umgesetzt werden.
                </P>

                <P>
                Eigentlich doch ganz einfach, oder? Aber wenn man jetzt die
                translator.library aus dem libs-Verzeichnis l&ouml;schen
                w&uuml;rde, w&uuml;rde say nicht mehr funktionieren. Das ist
                eine Sache, die im Grunde kein Problem darstellt, aber wenn man
                nicht wei&szlig; was los ist... Ein wichtiger Befehl in diesem
                Zusammenhang ist &quot;version&quot;. Er gibt die aktuelle
                Version eines Programms aus, soweit ein Text in folgender Form
                enthalten ist: &quot;$VER: &lt;Programmname&gt;
                V&lt;Release&gt;.&lt;Version&gt; (&lt;Datum&gt;)&quot;. Das
                praktisch, wenn ein Programm die Meldung &quot;Konnte Library
                xxx in Version y.z nicht &ouml;ffnen&quot; und man doch die
                Library im Libs Verzeichnis hat. Man gibt einfach ein:
                </P>

                <PRE>
 1.Workbench&gt; version libs/translator.library

 libs/translator.library version 33.2
                </PRE>

                <P>
                Nat&uuml;rlich kann man den Version-Befehl nicht nur an
                Libraries anwenden, sondern auch an allen anderen Dateien. Wenn
                aber ein Sting dieses Formates nicht gefunden wurde, wird eine
                Fehlermeldung ausgegeben.
                </P>

                <P>
                Damit w&auml;hre das zweite Verzeichnis gekl&auml;rt. Und nach
                so viel Theorie kommen wir zu noch mehr Theorie. Wir nehmen uns
                das Verzeichnis &quot;devs&quot; (Devices=Ger&auml;te) vor. Wie
                schon der Name erahnen l&auml;&szlig;t, stehen in diesem
                Verzeichnis alle Daten um ein Ger&auml;t ansprechen zu
                k&ouml;nnen. Aber schauen wir es uns erst einmal an:
                </P>

                <PRE>
 1.Workbench&gt; dir devs
     keymaps (dir)
     printers (dir)
     clipboards (dir)
  clipboard.device                 MountList
  narrator.device                  parallel.device
  printer.device                   ramdrive.device
  serial.device                    system-configuration
                </PRE>

                <P>
                So sieht das Ganze unter WB 1.3 aus. Ab WB 2.04 wird die Liste
                etwas k&uuml;rzer und ab WB 2.1 verschwindet die Mountlist und
                es erscheint das Verzeichnis &quot;DOSDRIVERS&quot;. Ich hab`
                zwar keine WB 2.1 aber so ungef&auml;hr sollte das aussehen. Auf
                jeden Fall stehen dann in dem Verzeichnis alle eintr&auml;ge,
                die sonst in der Mountlist gestanden h&auml;tten.
                </P>

                <P>
                Aber fangen wir mal an. Im Verzeichnis Keymaps stehen die
                verschiedenen Tastaturbelegungen. In der Regel sollte hier nur
                die Datei &quot;D&quot; stehen. Ab Kick 2.04 wird man damit
                sofort konfrontiert, weil man automatisch in ein Auswahlmenu
                kommt, um sich die richtige Belegung auszuchen. Aber allein
                damit, da&szlig; die Datei in dem Verzeichnis steht ist es nicht
                getan. Man ben&ouml;tigt den Befehl &quot;SetMap&quot; aus dem
                System-Verzeichnis:
                </P>

                <PRE>
 1.Workbench&gt; system/setmap d
                </PRE>

                <P>
                Aber da zu unserem Zeitpunkt bereits die deutsche
                Tastaturbelegung schon aktiviert ist, wird sich nicht viel
                &auml;ndern, aber ich komme in einem sp&auml;teren Kursteil
                wieder darauf zur&uuml;ck.<BR>
                <BR>
                Im Verzeichnis (richtiger w&auml;hre eigentlich
                Unterverzeichnis) befinden sich die Verschiedenen
                Druckertreiber. Bei mir sieht das folgenderma&szlig;en aus:
                </P>

                <PRE>
 1.Workbench 1.3&gt; dir devs/printers

  EpsonX[CBM_MPS-1250]             generic
                </PRE>

                <P>
                Ein paar Leute werden sich wahrscheinlich fragen, wieso ich hier
                jetzt &quot;Workbench 1.3&quot; schreibe, da&szlig; ist aber
                ganz einfach, weil es sich hier um meine ArbeitsWB handelt und
                nich um meine WorkshopWB. Aber auch diese Druckertreiber sind
                nur Dateien und m&uuml;&szlig;en aufgerufen werden. Dazu
                mu&szlig; man in die Prefs und kann dort einen entsprechenden
                aussuchen. Aber das hilft uns auch noch nicht weiter. Also
                schauen wir uns noch einmal das Verzeichnis Devs an (bitte nicht
                zu&uuml;ckbl&auml;ttern). Und stellen voller Freude fest,
                da&szlig; es da noch die Datei &quot;printer.device&quot; gibt.
                Also was passiert jetzt, wenn wir jetzt einfach einen Text
                ausdrucken lassen (bis jetzt wahrscheinlich noch mit einer
                dicken Textverarbeitung aber es geht auch einfacher)? Das
                Programm &uuml;bergibt die Daten mit Hilfe der Datei
                &quot;printer.device&quot; in richtung Drucker und das
                &quot;printer.device&quot; sucht sich den richtigen
                Druckertreiber. Jetzt gibt es dabei blo&szlig; noch ein Problem.
                Woher wei&szlig; man welcher Druckertreiber der richtige ist?
                Die L&ouml;sung steht auch im devs Verzeichnis (Toll nich?).
                Sieh hei&szlig; &quot;system-configuration&quot;. Bis Kick 1.3
                speichert sie alle Daten, wie z.B Farben und den Mauszeiger. Ab
                Kick 2.04 w&auml;hre das zu umst&auml;ndlich und man hat sich
                ein neues Sytem ausgedacht, das uns aber nicht weiter angeht.
                </P>

                <P>
                Bleiben noch das &quot;Ramdrive.Device&quot;, das wie der Name
                schon sagt, daf&uuml;r zust&auml;ndig ist, wenn man das Ram also
                den Speicher als Laufwerk benutzen m&ouml;chte. Eine
                M&ouml;glichkeit kennt jeder: Die &quot;Ram Disk&quot; und von
                der zweiten haben mit Sicherheit viele schon mal etwas
                geh&ouml;rt: Die Rad (resetfeste Ram Disk). Die resetfeste Ram
                Disk wird relativ oft erw&auml;hnt, aber nirgenswo habe ich
                wirklich verstanden, wie man an sie rankommt. Aber dazu
                sp&auml;ter in diesem Teil.
                </P>

                <P>
                Es gibt dann noch das clipboard.device, das f&uuml;r uns
                vollkommen uninter ressant ist. Dann noch das
                &quot;Serial.device&quot;, das die direkte verbindung zur
                seriellen Schittstelle und das &quot;parallel.device&quot;, das
                die direkte Verbindung zur parallelen Schnittstelle ist. Wenn
                man nur Texte im Standartfont drucken m&ouml;chte, mu&szlig; man
                nicht das printer.device benutzen. Dazu gen&uuml;gt voll und
                ganz direkt die Schnittstelle anzusprechen.
                </P>

                <P>
                Als letztes bleibt dann noch die &quot;mounlist&quot;, die ich
                am Beispiel der &quot;Rad&quot; erkl&auml;ren m&ouml;chte. Es
                ist eine Textdatei. Das hei&szlig;t, da&szlig; man sie also mit
                jedem Texteditor ansehen und ver&auml;ndern kann. Hier einen
                Ausschitt:
                </P>

                <PRE>
 /* This is an example of a mount list entry for using the recoverable
    ram disk.  Depending on the amount of memory you wish to devote to
    it, you may want to change the HighCyl value.
 */

 RAD:       Device = ramdrive.device
            Unit   = 0
            Flags  = 0
            Surfaces  = 2
            BlocksPerTrack = 11
            Reserved = 2
            Interleave = 0
            LowCyl = 0  ;  HighCyl = 79
            Buffers = 5
            BufMemType = 1
 #
                </PRE>

                <P>
                Hier stehen alle Daten, die man f&uuml;r die resetfeste Ram Disk
                braucht. (WB 2.1 User m&uuml;&szlig;ten im Verzeichnis
                &quot;dosdrivers&quot; eine Datei Namens &quot;Rad&quot; haben,
                in der dann etwas &auml;hnliches oder gleiches stehen sollte).
                Will man in der Datei etwas einf&uuml;gen, was nicht direkt
                dazugeh&ouml;rt (z.B Bemerkungen). M&uuml;ssen sie mit
                &quot;/*&quot; anfangen und mit &quot;*/&quot; enden. Als erstes
                kommt dann der Ger&auml;tename (RAD: entspricht df0:, df1:...).
                Dann das Device, das daf&uuml;r zust&auml;ndig ist. Die
                Unitnummer eine 0 entspricht, ist die erste Rad (entspricht df0:
                bei den Laufwerken). Flags werden auf Null gesetzt, was
                bedeutet, das die Rad immer beschreibbar ist, bei
                Diskkettenlaufwerken ist das ja anders. Die n&auml;chsten vier
                Eintr&auml;ge d&uuml;rfen nicht ge&auml;ndert werden. Das
                hei&szlig;t d&uuml;rfen schon, aber dadurch kann die Rad
                funktionunt&uuml;chtig werden. LowCyl steht f&uuml;r erster
                Zylinder und sollte ebenfalls so stehen bleiben. HighCyl ist der
                letzte Zylinder (hier ist er 79, das entspricht also 80 Zylinder
                also 880 KB) und kann ge&auml;ndert werden, sollte aber die 79
                nicht &uuml;berschreiten. Buffers ist der Cachespeicher, um es
                mal so zu nennen, er ist ein entscheidender Bestandteil von
                Laufwerken, ein gro&szlig;er Diskbuffer erspart einem viel
                Ladezeit. Gro&szlig;e werte bei der Rad haben allerdings keinen
                Sinn weil sich die Daten ja ohnehin schon im Speicher befinden.
                Und in buffmemtype wird die Art des Speichers f&uuml;r den
                Bufferspeicher angegeben. Und jeder Eintrag zu einem Device wird
                mit einem &quot;#&quot; abgeschlossen.
                </P>

                <P>
                Jetzt kommen wir zum wichtigsten Teil wie starte ich sie, bzw.
                wie mache ich dem System klar, da&szlig; ich jetzt eine Rad
                (nicht ein Rad) haben m&ouml;chte. Wir m&uuml;ssen sie anmelden
                (mounten) und wenn man sich das Verzeichnis C anschaut sieht man
                die L&ouml;sung &quot;mount&quot;:
                </P>

                <PRE>
 1.Workbench&gt; ed devs/mountlist
                </PRE>

                <P>
                Ach ja. wer bis jetzt noch keinen Editor benutzt hat, kann Ed
                benutzten. Man kann die mountlist dann editieren und dann den
                Editor mit der Tastenfolge Escape-Taste, &quot;x&quot;, RETURN
                verlassen, wobei auch die Datei abgespeichert wird. Also weiter:
                </P>

                <PRE>
 1.Workbench&gt; mount rad:
 1.Workbench&gt; info

 Mounted disks:
 Unit      Size    Used    Free Full Errs   Status   Name
 DF1:      880K    1660      98  94%   0  Read/Write Workbench
 RAM:        5K      10       0 100%   0  Read/Write RAM DISK
 DF0:      No disk present

 Volumes available:
 Workbench [Mounted]
 RAM DISK [Mounted]
                </PRE>

                <P>
                AAAAAAAAH! Wo ist jetzt die Rad? Nich da ich wei&szlig;. Aber
                ich bin ja ein Optimist und lasse mir einfach mal das
                Inhaltsverzeichnis der Rad anzeigen:
                </P>

                <PRE>
 1.Workbench&gt; dir Rad:
 1.Workbench&gt;
                </PRE>

                <P>
                WAS?!? Keine Fehlermeldung? Schauen wir mal lieber noch mal
                nach:
                </P>

                <PRE>
 1.Workbench&gt; info

 Mounted disks:
 Unit      Size    Used    Free Full Errs   Status   Name
 RAD:      880K       2    1756   0%   0  Read/Write RAMB0
 DF1:      880K    1660      98  94%   0  Read/Write Workbench
 RAM:        5K      10       0 100%   0  Read/Write RAM DISK
 DF0:      No Disk present

 Volumes available:
 RAMB0 [Mounted]
 RAM DISK [Mounted]
 Workbench [Mounted]
                </PRE>

                <P>JAAAAAA! Ich hab` sie. Ich hab` es nat&uuml;rlich schon
                vorher gewu&szlig;t, aber darauf mu&szlig; man erst einmal
                kommen. Aber warum das alles? Nun der Amiga ist bekanntlich ein
                multitasking Computer, wo viele Tasks noch mehr Speicher
                ben&ouml;tigen. Also wozu Speicher f&uuml;r ein Laufwerk wie die
                Rad verschwenden, wenn sie noch nie ben&ouml;tigt wurde?<BR>
                <BR>
                Jetzt noch ein Kurztest ob alles auch so funktioniert hat wie
                wir es wollten:
                </P>

                <PRE>
 1.Workbench&gt; copy df0: rad: all
                </PRE>

                <P>
                Nun f&uuml;hren wir einen Reset durch und schieben keine Disk
                in ein Laufwerk. Wer jetzt nicht gerade eine Festplatte hat,
                sollte sehen wie die Workbench viel schneller hochgefahren wird
                und dazu noch lautlos. Jetzt kann man mit der Rad so arbeiten
                wie vorher mit der Workbenchdiskette, blos da&szlig; man eben
                nicht die Speicherchips auswechseln kann, wenn man andere Daten
                darauf haben m&ouml;chte.
                </P>

                <P>
                So falls jetzt aber nicht die Workbench erschienen ist, sondern
                der Bootbildschirm, sollte man von Diskette starten und
                nachschauen ob die Rad noch da ist. Wenn nicht. Nocheinmal alles
                wiederholen, was ich weiter oben beschrieben habe. Wenn es immer
                noch nicht funktioniert, hat man wahrscheinlich einen Special
                Agnus (wie ich).
                </P>

                <P>
                Anmerkung zum Agnus:<BR>
                Der Agnus ist ein Chip, der f&uuml;r die Speicherverwaltung
                zust&auml;ndig ist und einem vor allem sagt, wieviel Chipmem man
                hat und wieviel man haben darf. Es gibt aber auch die
                M&ouml;glichkeit, das der Agnus bei jedem Reset einen Kaltstart
                durchf&uuml;hrt. Ist dies der Fall ist nach jedem Reset der
                Speicher leer, absolut leer. Das hat zwar seine Vorteile, z.B.
                ist nach jedem Reset kein Virus mehr im Speicher, auf gleiche
                weise werden dann aber auch resetfeste Programme (z.B.
                Virenkiller) gekillt. Aber man kann auch sicher sein, das einem
                nach jedem Reset wirklich der ganze Speicher zur Verf&uuml;gung
                steht.
                </P>

                <P>
                Nehmen wir noch ein Verzeichnis mit in diesen Teil. Das
                fonts-Verzeichnis. In im sind die Verschiedenen
                Zeichens&auml;tze des Amiga enthalten. Es gibt noch eine ganze
                Reihe mehr als auf den WB Disketten mitgeliefert sind. In diesem
                Zusammenhang ist ein Programm zu erw&auml;hnen, das nich von C=
                geschrieben wurde &quot;ff&quot; (FastFonts). Es beschleunigt
                die Schriftausgabe des Amiga:
                </P>

                <PRE>
 1.Workbench&gt; ff topaz.font
 FastFonts V1.31 Copyright &#169; 1987 by C.Heath of Microsmiths, Inc
 Trying to replace the system font
 Replaced TOPAZ80 font
 Replaced TOPAZ60 font
 Turning on FastText
                </PRE>

                <P>
                Auch hier wird sich nichts &auml;ndern, weil das auch bei jedem
                start der Workbench gemacht wird. Dieses Programm arbeitet zwar
                mit vielen Fonts nicht zusammen, man kann es aber auch dazu
                mi&szlig;brauchen, um mal etwas Abwechslung in die Workbench zu
                bringen und mal einen anderen Fontsatz zu benutzten als den
                Systemfont. Kick 2.x und 3.x User werden sich jetzt fragen was
                labert der da? Ist doch ganz einfach mit den Preferences. Aber
                das ist noch f&uuml;r Kick 1.x User ganz anders. Aber soviel
                dazu, ist ja eigentlich auch nicht ganz so wichtig. Ein font
                besteht aus zwei Teilen: einmal einer Datei XXX.font (XXX steht
                f&uuml;r einen belibiegen Namen) und einem Verzeichnis XXX, in
                dem verschiedene Dateien stehen, deren Namen nur aus Zahlen
                bestehen. Die .font Datei enth&auml;lt allgemeine Daten. Die
                Nummerdateien enthalten jeweils die genauen Daten f&uuml;r die
                jeweilige Gr&ouml;&szlig;e des fonts (also die Buchstaben).
                </P>

                <P>
                Auch wenn das Fonts Verzeichnis f&uuml;r die Shell relativ
                uninterressant ist, ist es f&uuml;r grafisch Oberfl&auml;chen
                unverzichtbar.
                </P>

                <P>
                Nun ich h&auml;tte nicht gedacht so viele Verzeichnisse in einem
                Teil abhandeln zu k&ouml;nnen, aber ich habe es ja geschafft.
                Schlu&szlig; mit der Theorie.Im n&auml;chsten Kursteil werde ich
                dann auf ein paar Besonderheiten der Shell eingehen und mir das
                &quot;L&quot;- und das &quot;s&quot;-Verzeichnis
                vorkn&ouml;pfen. Und das wird ein Haufen Arbeit. Wem dieser
                Workshop gef&auml;llt und m&ouml;chte, da&szlig; er noch etwas
                l&auml;nger dauert, soll mir schreiben, wer Fragen, Lob oder/und
                Kritik hat, soll mir ebenfalls schreiben und wer sonst noch
                etwas zum Workshop, zur Shell etc. loswerden will, soll mir
                ebenfalls schreiben.
                </P>

                <P>
                Also Tsch&uuml;&szlig;, auf wiederschreiben/lesen, und was es
                sonst noch gibt
                <BR>
                <BR>
                Dennis M&uuml;ller<BR>
                Bruchwiesenweg 27<BR>
                <BR>
                45891 Gelsenkirchen<BR>
                <BR>
                </P>

                </TD>
            </TR>
            </TABLE>
            <BR>
            <BR>
            </TD>
        </TR>
        <TR>
            <TD><IMG SRC="wks.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#wks0"></TD>
        </TR>
        </TABLE>
        </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
