<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Ajankohtaiset &gt; Uutiset &gt; Uutisia Amiga-maailmasta</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="#000066" vlink="#000066" alink="red" topmargin="0" marginheight="0">
		<center>
			<a name="TOP"></a><font size="1"><br>
			</font><font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="3"><b>Uutisia Amiga-maailmasta</b></font></td>
				</tr>
			</table>
			<br>
			[ <a href="uutiset.html" target="_self">Amiga nyt</a> ] [ </font><font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1" color="red">Uutisia Amiga-maailmasta</font><font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1"> ] [ <a href="laiteuutiset.html" target="_self">Laiteuutiset</a> ] [ <a href="ohjelmistouutiset.html" target="_self">Ohjelmistouutiset</a> ] [ <a href="paivitykset.html" target="_self">P&auml;ivitykset</a> ]<br>
			<br>
			<a name="Anchor-9690"></a></font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. kokoontui pitk&auml;st&auml; aikaa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="192" width="256" src="../toimitukselliset/kuvat/pieni_vuosi2000_09.jpg" border="0" alt=" "></center>
						<div align="left">
							<p><br>
							Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. j&auml;rjesti s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;isen vuosikokouksensa 30. syyskuuta. Edellisest&auml; kokoontumisesta, pikkujouluista, olikin ehtinyt vier&auml;ht&auml;&auml; melkein vuosi. Uusi hallitus on kuitenkin ottanut ahkerasti askeleita eteenp&auml;in ja kokous ker&auml;sikin enn&auml;tyksellisen osanoton. Lis&auml;v&auml;ri&auml; virallisen kokouksen yhteyteen toivat Gentle Eye Ky:n myyntip&ouml;yt&auml; ja yhdistyksen esittelyss&auml; ollut seuraavan sukupolven Amigan kehitysymp&auml;rist&ouml; Amiga Software Development Kit. Lis&auml;&auml; <a href="../toimitukselliset/vuosikokous.html" target="_self">vuosikokouksesta</a> ja <a href="../testit/sdk.html" target="_self">Amiga Software Development Kitist&auml;</a> voit lukea toisaalta lehdest&auml;.</div>
					</td>
				</tr>
			</table>
			<font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1"><br>
			<a name="Anchor-18633"></a>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Amiga Inc. solmi useita strategisia yhteisty&ouml;sopimuksia</b></font></center>
					</td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">Amiga Inc. on viime aikoina solminut useita yhteisty&ouml;sopimuksia monenlaisten ATK-alan yritysten kanssa. Trendi on selke&auml;sti luomassa Amigalle aivan uudenlaista ilmett&auml;, ja kuten tunnettua, kokonaisuus on enemm&auml;n kuin osiensa summa. Ennen kaikkea yhteisty&ouml;sopimukset ovat t&auml;rkeit&auml; juuri Amigalle, koska niiden avulla voidaan tehd&auml; nopeassa ajassa valmista, suurin osa yhteisty&ouml;st&auml; tuo Amigan leiriin paljon arvokasta tietotaitoa. Sit&auml; kautta voidaan suunnitella selke&auml; tavoite - Amigan tapauksessa AmigaOne ja Amiverse-k&auml;ytt&ouml;ymp&auml;rist&ouml; - ja my&ouml;s vied&auml; projekti mallikkaasti loppuun.<br>
						<br>
						Seuraavassa t&auml;rkeimm&auml;t uusista yhteisty&ouml;kumppaneista:<br>
						<br>
						<table border="0" cellpadding="2" cellspacing="0" width="100%">
							<tr>
								<td bgcolor="#f0f8ff">
									<center>
										<font face="Times New Roman,Georgia,Times" size="3"><b>MeterNet Corporation</b></font></center>
								</td>
							</tr>
						</table>
						MeterNet kehitt&auml;&auml; yhteisty&ouml;ss&auml; Amigan kanssa uudenlaisia laajakaistayhteyksi&auml; hy&ouml;dynt&auml;vi&auml; Internet-laitteita. Ensimm&auml;inen markkinoille julkaistava tuote on SimpleBox Java Internet-laite, joka sis&auml;lt&auml;&auml; 16 Mb Flash-Rom piirille asennettuna kaikki tarvittavat ohjelmistot, kovalevy&auml; laitteessa ei ole. Toisin kuin kilpailevien valmistajien Internet-laitteissa, Simple Box sis&auml;lt&auml;&auml; Sun Microsystemsin hyv&auml;ksym&auml;n Java-tuen. Lis&auml;ksi Simple Box tukee streamaavaa &auml;&auml;nt&auml; ja videokuvaa, Internet-viestityst&auml;, uusimpia HTML-standardeja jne.<br>
						</font><br>
						<font size="3" face="Times New Roman,Georgia,Times"><b>SimpleBoxin speksej&auml;:</b><br>
						- NS Geode GXLV 233 MHz<br>
						- Integroitu NS 5530 Chipset<br>
						- 16 Mt Flash / 32 Mt RAM<br>
						- 10/100 Fast Ethernet<br>
						- VGA- ja TV-tuki (PAL/NTSC/S-video)<br>
						- 2 x USB-porttia / 1 PS-2-portti / 1 rinnakkaisportti<br>
						- Optiot: MPEG2-dekoodauskortti, sis&auml;inen DSL-modeemi, 15&quot; aktiivimatriisi-TFT-paneelin&auml;ytt&ouml;<br>
						- Hinta: $399<br>
						</font><font face="Times New Roman,Georgia,Times" size="2"><br>
						<b>Kotisivut:<br>
						</b><a href="http://www.meternet.com" target="_blank"><b>www.meternet.com</b></a><br>
						<br>
						</font><font face="Times New Roman,Georgia,Times" size="3">
						<table border="0" cellpadding="2" cellspacing="0" width="100%">
							<tr>
								<td bgcolor="#f0f8ff">
									<center>
										<font face="Times New Roman,Georgia,Times" size="3"><b>Infomedia Network, Inc.</b></font></center>
								</td>
							</tr>
						</table>
						Amigan ja Infomedia Networkin v&auml;lisen yhteisty&ouml;n tarkoituksena on, ett&auml; Amigan prosessoririippumaton multimediak&auml;ytt&ouml;j&auml;rjestelm&auml; asennetaan erityisiin set-top-box-Internet-yksik&ouml;ihin, jotka k&auml;ytt&auml;v&auml;t hy&ouml;dyksi laajakaistayhteyksi&auml;. Ensimm&auml;isen&auml; julkaistava malli on nimelt&auml; TVision, jonka tarkoituksena on tarjota kuluttajille edullinen ja helppo yhteys internetiin ja viihteeseen.<br>
						</font>
						<center>
							<p><a href="http://www.infomedia-network.com" target="_blank"><img src="kuvat/webshots/infomedia.jpg" width="298" height="225" border="0"></a></p>
						</center>
						<p><font face="Times New Roman,Georgia,Times" size="3">Infomedia Network on t&auml;ll&auml; hetkell&auml; ainoa yritys maailmassa, joka valmistaa kehittyneit&auml; set-top-boxeja. Ne voidaan liitt&auml;&auml; erilaisiin laajakaistaverkkoihin, kuten l&auml;hi-, DSL- ja kaapeliverkkoihin. TVisioniin on tarkoituksena liitt&auml;&auml; mukaan laajat lis&auml;palvelut, kuten mm. reaaliaikainen videoneuvottelu, interaktiiviset videopelit, kotipankit ja kauppapaikat ilman ett&auml; tarvitsisi hankkia n&auml;it&auml; varten PC-tietokonetta. Amigan julkaisema SDK (Software Development Kit) mahdollistaa ohjelmien kehitt&auml;misen TVision-laitteeseen.<br>
						</font><font face="Times New Roman,Georgia,Times" size="2"><br>
						<b>Kotisivut:<br>
						</b><a href="http://www.infomedia-network.com" target="_blank"><b>www.infomedia-network.com</b></a><br>
						<br>
						</font></p>
						<p><font face="Times New Roman,Georgia,Times" size="3">
						<table border="0" cellpadding="2" cellspacing="0" width="100%">
							<tr>
								<td bgcolor="#f0f8ff">
									<center>
										<font face="Times New Roman,Georgia,Times" size="3"><b>Matrox Graphics Inc.</b></font></center>
								</td>
							</tr>
						</table>
						Matrox on ainoa grafiikkapiirej&auml; suunnitteleva ja grafiikkakortteja valmistava yritys, jolla on 24 vuoden teollinen kokemus laadukkaiden 2D-, 3D-ja digitaalivideon-kiihdytt&auml;misest&auml;, kuvan laadun parantamisesta ja toimivuudesta. Matrox on saanut 900 palkintoa maailmanlaajuisesti Millennium-, Marvel-, Productiva- ja Mystique-tuotelinjoistaan. Matrox avustaa Amigaa ilmeisesti l&auml;hinn&auml; teknisell&auml; neuvonannolla. Lis&auml;ksi Amiga voi valmistaa natiiveja ajureita Matroxin nykyisille ja tuleville grafiikkakorteille. T&auml;st&auml; on esimerkkin&auml; esim. kehityskoneen Matrox G400 -n&auml;ytt&ouml;kortti, jolle Amiga kehitt&auml;&auml; natiivia 2D/3D-ajuria.<br>
						</font></p>
						<center>
							<p><a href="http://www.matrox.com" target="_blank"><img src="kuvat/webshots/matrox.gif" width="298" height="222" border="0"></a></p>
						</center>
						<p><font face="Times New Roman,Georgia,Times" size="3"><b>Miksi Amiga Inc. valitsi Matroxin?<br>
						</b>- NVidia (GeForcen valmistaja) ei anna ohjelmistokehitt&auml;jille n&auml;ytt&ouml;korteistaan lis&auml;tietoja, jotka vaaditaan native-tason ajurin valmistamiseen, koska tiedot pidet&auml;&auml;n tarkkaan salassa<b><br>
						</b></font><br>
						<font face="Times New Roman,Georgia,Times" size="3">- Matroxin kortit ylikuumenevat v&auml;hemm&auml;n kuin muut vastaavat kortit kovassa k&auml;yt&ouml;ss&auml;<br>
						- Matrox ymm&auml;rt&auml;&auml; pelaajien ja videoammattilaisten erilaiset tarpeet kuvanlaadun suhteen. Ohjelmoijat ja videoammattilaiset arvostavat Dual Head -tekniikkaa, jolloin samaan korttiin voidaan liitt&auml;&auml; kaksi toisistaan riippumatonta ja erityyppist&auml; n&auml;ytt&ouml;laitetta.<br>
						- Matrox ymm&auml;rt&auml;&auml; Amiga Inc.:n tavoitteet ja haluaa auttaa niiden saavuttamisessa parhaansa mukaan. Yhteisty&ouml; on my&ouml;s toimivaa molempien yritysten kesken.<br>
						- Dave Hayniekin pit&auml;&auml; Matrox G400:sta :-)<br>
						</font><font face="Times New Roman,Georgia,Times" size="2"><br>
						<b>Kotisivut:<br>
						</b><a href="http://www.matrox.com" target="_blank"><b>www.matrox.com</b></a><br>
						<br>
						</font></p>
						<p><font face="Times New Roman,Georgia,Times" size="3">
						<table border="0" cellpadding="2" cellspacing="0" width="100%">
							<tr>
								<td bgcolor="#f0f8ff">
									<center>
										<font face="Times New Roman,Georgia,Times" size="3"><b>Red Hat, Inc.</b></font></center>
								</td>
							</tr>
						</table>
						Red Hat on avoimen julkaisumallin markkinajohtaja, joka julkaisee omaa maksullista jakeluversiotaan Linux-k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml;. Amiga tarjoaa Red Hat Linux -k&auml;ytt&ouml;j&auml;rjestelm&auml;versioon multimediak&auml;ytt&ouml;liittym&auml;&auml; (DirectX:n tapainen), joka mahdollistaa my&ouml;s korkeatasoisten pelien kehitt&auml;misen my&ouml;s Linux-k&auml;ytt&ouml;j&auml;rjestelm&auml;lle. Lis&auml;ksi Amigan k&auml;ytt&ouml;liittym&auml;n skaalautuvuuden ansiosta Amiga-teknologialla ter&auml;stetty&auml; Linuxia voidaan lis&auml;ksi k&auml;ytt&auml;&auml; k&auml;mmenmikroissa, ty&ouml;p&ouml;yt&auml;koneissa tai set-top-box-laitteissa.<br>
						</font><font face="Times New Roman,Georgia,Times" size="2"><br>
						<b>Kotisivut:<br>
						</b><a href="http://www.redhat.com" target="_blank"><b>www.redhat.com</b></a><br>
						<br>
						</font><font face="Times New Roman,Georgia,Times" size="3">
						<table border="0" cellpadding="2" cellspacing="0" width="100%">
							<tr>
								<td bgcolor="#f0f8ff">
									<center>
										<font face="Times New Roman,Georgia,Times" size="3"><b>Ruksun Software Technologies, Inc.</b></font></center>
								</td>
							</tr>
						</table>
						</font></p>
						<p><font face="Times New Roman,Georgia,Times" size="3">Ruksun Software Tecnologies perustettiin vuonna 1993. Yriyksen ensimm&auml;isi&auml; tuotteita olivat lapsille suunnatut Internet-selaimet ja -viestiohjelmat. Nyky&auml;&auml;n Ruksunilla ty&ouml;skentelee noin 100 ammattilaista kannettavan ja langattoman Internet-teknologian parissa. Yrityksen tuotteet on suunniteltu toimimaan erilaisissa laitteistoissa ja verkoissa.</font></p>
						<center>
							<p><a href="http://www.ruksun.com" target="_blank"><font face="Times New Roman,Georgia,Times" size="3"><img src="kuvat/webshots/ruksun.gif" width="298" height="193" border="0"></font></a></p>
						</center>
						<p><font face="Times New Roman,Georgia,Times" size="3"><i>Messenger Force</i> ja <i>IMAP Force</i> ovat kaksi ensimm&auml;ist&auml; ohjelmaa, jotka Ruksun k&auml;&auml;nt&auml;&auml; uudelle AmigaOnelle, ja lis&auml;&auml; on tulossa my&ouml;hemmin. Molemmat ovat palkittuja ohjelmistoja. <i>Messenger Force</i> on ICQ:n tapainen viestiohjelma, joka on suunniteltu toimimaan erilaisissa laiteymp&auml;rist&ouml;iss&auml;. Lis&auml;ksi pian julkaistava versio mahdollistaa ohjelman k&auml;yt&ouml;n my&ouml;s k&auml;nnyk&ouml;iss&auml;. <i>Messenger Force</i> sis&auml;lt&auml;&auml; monipuolisia viestitoimintoja, mutta vie vain v&auml;h&auml;n j&auml;rjestelm&auml;n resursseja. <i>IMAP Force</i> on Amigalle ensimm&auml;inen email-asiakasohjelma, joka tukee IMAP4-protokollaa. T&auml;m&auml; mahdollistaa viestien selaamisen online-tilassa suoraan postipalvelimella ilman, ett&auml; e-mailit pit&auml;isi ensin ladata omalle koneelle. T&auml;st&auml; on suuri hy&ouml;ty, kun isokokoiset viestit halutaan poistaa suoraan postipalvelimelta. <i>IMAP Force</i> mahdollistaa mailien l&auml;hett&auml;misen SMTP-protokollan (Simple Mail Transfer Protocol) kautta. Lis&auml;ksi l&ouml;ytyy tuki POP3-tilien k&auml;ytt&ouml;&ouml;n.<br>
						</font><font face="Times New Roman,Georgia,Times" size="2"><br>
						<b>Kotisivut:</b><b><br>
						</b><a href="http://www.ruksun.com/" target="_blank"><b>www.ruksun.com</b></a><a href="http://www.redhat.com" target="_blank"><br>
						<br>
						</a></font></p>
						<p><font face="Times New Roman,Georgia,Times" size="3">
						<table border="0" cellpadding="2" cellspacing="0" width="100%">
							<tr>
								<td bgcolor="#f0f8ff" width="100%">
									<center>
										<font face="Times New Roman,Georgia,Times" size="3"><b>Hyperion Entertainment</b></font></center>
								</td>
							</tr>
						</table>
						Hyperion on yksityinen belgialainen yritys, joka perustettiin huhtikuussa 1999. Amiga Inc.:n kanssa tehty pitk&auml;n t&auml;ht&auml;imen yhteisty&ouml;sopimus takaa, ett&auml; Hyperion Entertainment tulee k&auml;&auml;nt&auml;m&auml;&auml;n PC-maailman parhaat pelihitit my&ouml;s Amiverselle.</font></p>
						<center>
							<p><a href="http://www.hyperion-software.com" target="_blank"><img src="kuvat/webshots/hyperion.gif" width="298" height="226" border="0" alt="Hyperion Entertainment"></a></p>
						</center>
						<div align="left">
							<p><font face="Times New Roman,Georgia,Times" size="3">T&auml;ll&auml; hetkell&auml; k&auml;&auml;nnett&auml;vien pelien listalla ovat Heretic II, Sin, Shogo, Freespace, Alien Nations ja Soldier of Fortune. N&auml;ist&auml; peleist&auml; ainakin Shogo k&auml;ytt&auml;&auml; Monolithin kuuluisaa Lithtech 3D-moottoria. Lis&auml;&auml; pelijulkistuksia on tulossa, kunhan Hyperion saa neuvotteluja viety&auml; eteenp&auml;in.<br>
							</font><font face="Times New Roman,Georgia,Times" size="2"><br>
							<b>Kotisivut:<br>
							</b><a href="http://www.hyperion-software.com" target="_blank"><b>www.hyperion-software.com</b></a></font></div>
					</td>
				</tr>
			</table>
			<br>
			<a name="Anchor-50479"></a></font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Amiwest 2000 -tapahtuman kohokohtia</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">Amiwest 2000 -tapahtuma pidettiin Sacramentossa, Kaliforniassa 29.-30. hein&auml;kuuta. J&auml;lleen tapahtumassa oli laajasti esill&auml; Amiga-alan yrityksi&auml; ja my&ouml;s Amiga Inc.:n p&auml;&auml;johtaja Bill McEwen piti tapahtumassa puheen, joka oli arvatenkin tapahtuman kohokohta. Seuraavassa t&auml;rkeimpi&auml; kohtia Bill McEwenin esiintymisest&auml; amigisti-yleis&ouml;lle.<br>
						* Amiga Inc. on p&auml;&auml;asiallisesti ohjelmistoyritys. Amigan p&auml;&auml;tavoitteena on tuoda markkinoille puhtaasti laitteistoriippumaton k&auml;ytt&ouml;j&auml;rjestelm&auml;, joka mahdollistaa saman koodin ajamisen eri laitteistoalustoilla. Py&ouml;r&auml;&auml; ei ole aikomus keksi&auml; uudelleen - nykyisen OS:n parhaat puolet pyrit&auml;&auml;n parhaan mukaan s&auml;ilytt&auml;m&auml;&auml;n.<br>
						* Amigan laitteistokehitysosasto valmistaa erityisi&auml; <i>referenssiratkaisuja</i> laitteistovalmistajille lisensoitavaksi ja prototyyppej&auml;. Amiga One, pitk&auml;&auml;n odotettu uusi Amiga-malli, on yksi n&auml;ist&auml; kehitett&auml;vist&auml; designeista. Koneen suunnitteluprosessin arvioidaan olevan loppusuoralla t&auml;m&auml;n vuoden loppuun menness&auml;. Kuluttajille tuote on saatavilla ilmeisesti vuoden 2001 alkupuolella, mit&auml;&auml;n aikataulua ei ole kuitenkaan ly&ouml;ty lukkoon. Amiga One -tietokoneen sarjavalmistuksesta huolehtivat kolmannet osapuolet.<br>
						* Amiga panostaa vahvasti Java-ohjelmistoteknologian hy&ouml;dynt&auml;miseen, ja Sun Microsystems on jo demonnut omia Java-ohjelmiaan k&auml;ytt&auml;en Amigan Java Virtual Machine -ohjelmistoa.<br>
						* Photogenicsin ohjelmoija Paul Nolan ty&ouml;skentelee sopimuksen alaisena Amiga Inc.:ll&auml; Amiversen k&auml;ytt&ouml;liittym&auml;n parissa. T&auml;m&auml; ei kuitenkaan ole h&auml;nen ainoa ty&ouml;ns&auml;, ja Photogenics kuvank&auml;sittelyohjelman kehitt&auml;minen jatkuu edelleen.<br>
						* Amiga tarjoaa ohjelmoijille vapaaehtoisen mahdollisuuden maksaa Amiga Inc.:lle rojaltia, jotta ohjelmoija voisi saada erityisen virallisen statuksen Amigalta (rojalti $1.50/myyty ohjelmistotuote tai 5 % t&auml;m&auml;n kokonaismyynnist&auml;). T&auml;ll&ouml;in Amiga lis&auml;ksi auttaa ohjelman markkinoinnissa, mainostamisessa ja jakeluun liittyviss&auml; asioissa.<br>
						* Classic Amigan ohjelmat toimivat my&ouml;s uudessa k&auml;ytt&ouml;j&auml;rjestelm&auml;ss&auml; vinhasti (jopa nopeammin kuin Classic-koneissa) uudentyyppisen emulointiteknologian ansiosta. Samantyyppist&auml; emulaatiota k&auml;ytet&auml;&auml;n todenn&auml;k&ouml;isesti my&ouml;s MacOS X -k&auml;ytt&ouml;j&auml;rjestelm&auml;ss&auml;.<br>
						* Amiga pyrkii julkaisemaan l&auml;hiaikoina SDK:n my&ouml;s Windowsille, koska monet ohjelmoijat ja varsinkin isot ohjelmistoyritykset k&auml;ytt&auml;v&auml;t koodaamiseen p&auml;&auml;osin Windows-pohjaisia ty&ouml;kaluja eiv&auml;tk&auml; n&auml;e mit&auml;&auml;n syyt&auml; vaihtaa Linuxiin. Lis&auml;ksi SDK:hon on tulossa natiivi &auml;&auml;ni- ja 3D-tuki l&auml;hiaikoina.<br>
						* Amiga ei ole viel&auml; ollut aktiivinen markkinoinnissa, koska kaikki projektit ovat t&auml;ss&auml;vaiheessa viel&auml; kiihdytysvaiheessa. Kuitenkin lehti- ja televisiohaastatteluihin ollaan valmiita osallistumaan.</font>
						<p>Tapahtuman aikana Bill McEwen my&ouml;s demosi SDK:n toimintaa eri k&auml;ytt&ouml;j&auml;rjestelmill&auml; varustetuilla koneilla (Windows ja Linux). Sama ohjelmakoodi toimi moitteettomasti molemmissa laitteistoymp&auml;rist&ouml;iss&auml; SDK:n alaisuudessa. Demokoneena oli tarjolla my&ouml;s Motorolan viimeisin &auml;lypuhelin, jossa py&ouml;ri Amiga-teknologian ansiosta Java-peli. <font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.myamiga.com/amiga/news/amiwest/amiwest.html" target="_blank"><font face="Times New Roman,Georgia,Times" size="2"><b>AmiWest 2000 Report</b></font></a><font face="Times New Roman,Georgia,Times" size="2"><b><br>
						<a href="http://www.myamiga.com/amiga/news/amiwest/webpages/1.html" target="_blank">Viisiosainen kuvagalleria<br>
						</a><a href="http://www.mypage.onemain.com/rudge/article.html" target="_blank">Another AmiWest 2000 Report<br>
						</a></b></font></td>
				</tr>
			</table>
			<font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1"><br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>AmigaRealm </b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<a href="http://www.amigarealm.com" target="_blank"><img src="kuvat/webshots/amiga_realm.gif" width="298" height="227" border="0" alt="Amiga Realm"></a></center>
						<p>Hienosti toteutettu Amiga Realm on eritt&auml;in laaja linkkihakemisto kaikkeen Amigaan liittyv&auml;&auml;n. Sivusto on jaettu kuuteen eri osastoon: Amiga-tietopankki, ihmiset&amp;chat, shoppailu, viihde ja Internet-palvelut. Ehdoton valinta tietoa kaipaavalle surffaajalle ja my&ouml;s Amiga-aiheisen surffailun aloituspaikaksi. Designiltaan Amiga Realm eroaa selv&auml;sti edukseen muista vastaavista Amiga-linkkipalveluista. <font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><font size="2" face="Times New Roman,Georgia,Times"><b>Lis&auml;tiedot:<br>
						<a href="http://www.amigarealm.com" target="_blank">www.amigarealm.com</a></b></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>The Commodore Billboard</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<br>
							<a href="http://www.commodorebillboard.com" target="_blank"><img src="kuvat/webshots/commodore_bb.gif" width="298" height="224" border="0" alt="The Commodore Billboard"></a></center>
						<p><font face="Times New Roman,Georgia,Times" size="3">The Commodore Billboard (TCB) osoittaa, ett&auml; vaikkakin Commodore meni konkurssiin yrityksen huonon hoidon vuoksi, niin silti se pystyi luomaan suosittuja ja teknisesti korkeatasoisia tietokoneita 80-luvulla ja 90-luvun alussa. Commodoren taktiikkana oli vahvasti luottaa siihen, ett&auml; koneen k&auml;ytt&auml;j&auml;t mainostaisivat sit&auml; eteenp&auml;in ja sit&auml; kautta hankittaisiin uusia ostajia Commodoren valmistamille tietokoneille. &quot;Meid&auml;n ei tarvitse mainostaa. Jos ihmiset haluavat Commodoren, he ostavat Commodoren&quot;, sanoi ex-p&auml;&auml;johtaja Irving Gould. T&auml;m&auml;n vuoksi Commodoren mainosprojektit olivat v&auml;h&auml;isi&auml;, ja nyt avatun TCB:n tarkoitus on s&auml;ilytt&auml;&auml; ja esitell&auml; n&auml;it&auml; materiaaleja. Mukana on erilaisia lehti- ja TV-mainoksia sek&auml; esitteit&auml;, mutta my&ouml;s uudempaakin materiaalia, kuten Gatewayn tekem&auml; Amiga MCC -promovideo.</font> <font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.commodorebillboard.com" target="_blank"><font size="2"><b>www.commodorebillboard.com</b></font></a><font size="2"><b><br>
						</b></font><font size="2">Webmaster: Soren Ladegaard, Tanska</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Commodore prototyyppej&auml; n&auml;ytill&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Commodore-retromeininki on nyt muotia. <a href="http://www.amigazone.com/images/merlancia/ryan2/index1.html" target="_blank">T&auml;m&auml; kuvagalleria</a><font face="Times New Roman,Georgia,Times" size="3"> esittelee kaikenlaisia Commodoren laiteprototyyppej&auml;, joita ei koskaan n&auml;hty markkinoilla. Klikkaamalla sivulta l&ouml;ytyvi&auml; pikkukuvia latautuu ruudulle isompi versio.<br>
						</font><font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.amigazone.com/images/merlancia/ryan2/index1.html" target="_blank"><font size="2" face="Times New Roman,Georgia,Times"><b>Linkki kuvagalleriaan</b></font></a></td>
				</tr>
			</table>
			<br>
			<font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1">[ <a href="#TOP" target="_self">Sivun alkuun</a> ] [ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
			<br>
			</font></center>
	</body>

</html>
