<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Assembly '2k</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Risto M&auml;ki-Pet&auml;ys &lt;<a href="mailto:basscade7@hotmail.com">basscade7@hotmail.com</a>&gt;<br>
						Kuvat: Antti Halko</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><b>Kello 14.15</b><br>
						Saavumme alueelle. Hirmuinen ty&ouml; saada k&auml;rryt lastausalueelle. Muutenkin menimme turhaan liian alas. Tilannetta erotti se, ett&auml; paikkamme olivat muusta alueesta erottuvalla oldskool-alueella, ja ulkopuolella ohjanneet neuvojat eiv&auml;t olleet varautuneet siihen. Hissill&auml; kuitenkin p&auml;&auml;see vaivattomasti yl&ouml;sp&auml;in. Kehnoksi yll&auml;tykseksi paikkamme oli viety. Noin tunnin tappelun j&auml;lkeen useamman henkil&ouml;kunnan j&auml;senen avustuksella saimme paikat kaapattua itsellemme. Juuri kun koneet olivat pystyss&auml;, l&auml;hti s&auml;hk&ouml;t. Tuki lupasi s&auml;hk&ouml;&auml; piakkoin, mutta korjaajaa ei n&auml;kynyt koko p&auml;iv&auml;n&auml;.
						<p>T&auml;ss&auml; vaiheessa p&auml;&auml;timme, ett&auml; olisi sopiva aika l&auml;hte&auml; k&auml;ym&auml;&auml;n sy&ouml;m&auml;ss&auml;. Yst&auml;v&auml;llinen kaverini Pasis kiinnitti t&auml;ll&auml; v&auml;lin tyylikk&auml;&auml;sti jakorasiamme naapurin p&ouml;yt&auml;&auml;n. Sen j&auml;lkeen verkon kanssa tuskailua: verkko ei toiminut mill&auml;&auml;n ja jouduin k&auml;ynnist&auml;m&auml;&auml;n PC:ni arviolta noin 20-30 kertaa uudestaan turhaan. Alkoi harmittaa, etten ottanut Amigaani mukaan, mutta viereisell&auml; Amigalla oli my&ouml;s ongelmia. P&ouml;yt&auml;naapurin mukaan korjaaja oli k&auml;ynyt paikalla ja saanut tiet&auml;&auml;, ett&auml; ongelma ratkaistiin. T&auml;st&auml; tuohtuneena avulias korjaaja kehotti jatkossa kirjoittamaan vikailmoitukseen jotta &quot;paska&quot;, niin asiat helpottuvat.</p>
						<p><b>19.30</b><br>
						Verkko toimii! Hartaan tuskailun j&auml;lkeen kokeilin vaihtaa verkkokortin ajurit 16-bittisiin. Muutos saattoi tosin johtua sattumastakin. Nyt &auml;kki&auml; rekister&ouml;itym&auml;&auml;n ja kilpailutuotos verkkoon. Huomasimme my&ouml;s, ett&auml; t&auml;n&auml; vuonna oli trendin&auml; koristella hiuslaitteita nippusiteill&auml;. P&ouml;yt&auml;mme l&auml;hell&auml; oli joku ryhm&auml; saanut p&auml;&auml;h&auml;ns&auml; ottaa mukaan Playstationin sek&auml; tanssimaton, ja he tanssittivat vieraita jatkuvasti koko tapahtuman ajan, mik&auml; her&auml;tti hilpeytt&auml; skenev&auml;en piiriss&auml;. S&auml;hk&ouml;t katkesivat toistamiseenkin, jolloin piti taas vaihtaa johtoa.</p>
						<center>
							<p><a href="kuvat/assembly_2.jpg" target="_blank"><img height="263" width="350" src="kuvat/assembly_2_pieni.jpg" alt=" " border="0"></a></p>
							<p><i>Vihdoin koneet kasassa ja netiss&auml;.</i></p>
						</center>
						<p>Nukkumisvuorot meniv&auml;t hieman vaikeasti. Jouduin valvomaan noin kahteen asti. Sen j&auml;lkeen yritin nukkua p&ouml;yd&auml;n alla, mutta saman p&ouml;yd&auml;n toisen puolen v&auml;ki soitti mm. Finlandiaa t&auml;risytt&auml;en p&ouml;yt&auml;&auml; sek&auml; lattiaa. Nukkumista haittasi my&ouml;s lattian kovuus, ja vartijat her&auml;tteliv&auml;t p&ouml;yd&auml;n alla nukkuvia toruen turvallisuuss&auml;&auml;nt&ouml;jen rikkomisesta. Kolme tuntia yritin saada unta nukkumatta hetke&auml;k&auml;&auml;n, mutta piristi se silti hieman. T&auml;m&auml;n j&auml;lkeen olisi pit&auml;nyt viel&auml; valvoa yhdeks&auml;&auml;n asti, ja onnistuihan se tuskalla ja vaivalla. Katsomon penkit soveltuivat nukkumiseen hieman paremmin, mutta niiden k&auml;sinojat puristivat vatsaa ik&auml;v&auml;sti.</p>
						<p><b>Perjantai, iltap&auml;iv&auml;</b><br>
						Verkko oli katkennut t&auml;n&auml;&auml;n, mutta olin sin&auml; lyhyen&auml; hetken&auml; poissa. Enemm&auml;n haittasi s&auml;hk&ouml;n huono toiminta. Hieman ennen nelj&auml;&auml; tultiin kuuluttamaan, ett&auml; oldskool-demokisaan tarvitaan 486/66:sta. Moista ei l&ouml;ytynyt, mutta meid&auml;n p&ouml;yd&auml;n 486/50 sai kelvata. Kone oli mukana tapahtumassa l&auml;hes turhaan, sill&auml; henkil&ouml; jonka piti saada kone kuntoon oli sammunut liikaa viinaa juotuaan eik&auml; kyennyt suorittamaan toimenpidett&auml;. Hiki hatussa rahdattuani koneen perille selvisi, etteiv&auml;t j&auml;rjest&auml;j&auml;t mielell&auml;&auml;n ryhtyneet pystytt&auml;m&auml;&auml;n varakonetta. Muutaman tunnin kuluttua selkisi, ettei kone kelvannut, mutta saimme silti ylim&auml;&auml;r&auml;isen ilmaislipun avuliaina ihmisin&auml;. Nyt pit&auml;&auml; viel&auml; odotella ensimm&auml;ist&auml; compoa.</p>
						<p><b>Lauantai, aamuy&ouml;</b><br>
						Kaikki kilpailut menneelt&auml; p&auml;iv&auml;lt&auml; ovat ohi. Oldskool-tuotokset olivat liev&auml; pettymys. Ainoastaan Skenefabu jurputus osasi yll&auml;tt&auml;&auml; yliampuvan sarkastisella tyylill&auml;. Playstation-kisassa oli vain kaksi tuotosta, mutta niist&auml; etenkin toinen, Yodelin Iaquo, oli mielest&auml;ni melko hieno muutenkin kuin kontrastin vaikutuksesta.</p>
						<p><b>Lauantai</b><br>
						Sain nukutuksi y&ouml;ll&auml; ehk&auml; kolme tuntia, senkin tuskaisesti. IRC:ss&auml; sain kuulla, ett&auml; jotkut suunnittelivat C64:lla pelattavaa International Karate -turnajaista. Kisan piti alkaa yhdeks&auml;lt&auml;, mutta se viiv&auml;styi noin kymmeneen. Kaiken kaikkiaan kahdeksan henkil&ouml;&auml; oli yhdess&auml; pelaamassa, ja kilpailu oli kova. Sattuman kaupalla ja hajoamispisteess&auml; olevien kahvojen ansiosta onnistuin voittamaan kisan. Koko kisa sek&auml; kaikkien osanottajien haastattelut esitettiin kankaalla sek&auml; nettitelevisiossa ja ATV:lla. Koska kisa oli viime tingassa valmisteltu, palkintoja ei herunut.</p>
						<center>
							<p><a href="kuvat/assembly_3.jpg" target="_blank"><img height="263" width="350" src="kuvat/assembly_3_pieni.jpg" border="0" alt=" "></a></p>
							<p><i>Paikan p&auml;&auml;lt&auml; l&ouml;ytyi erikoisia konekokoonpanoja.<br>
							Kuvassa mukaanottamamme maalautettu Commodore 64.</i></p>
						</center>
						<p>T&auml;n&auml; p&auml;iv&auml;n&auml; oli pakko my&ouml;s k&auml;yd&auml; kotosalla hakemassa puhtaita vaatteita ja muita unohtuneita tarvikkeita. Ep&auml;huomiossa olin unohtanut ainakin tyynyn, astian mikrol&auml;mmityst&auml; varten, C64:n lerput ja ylim&auml;&auml;r&auml;isen pyyhkeen, jonka unohdin toisellakin noudolla.</p>
						<p><b>Lauantai-ilta</b><br>
						MP3-kisan aikana tuli pieni pettymys. Esitett&auml;v&auml;t tuotokset olivat paikoitellen niin hirveit&auml;, ett&auml; oletin oman tuotokseni p&auml;&auml;sev&auml;n mukaan, mutta ei! Karsinnasta p&auml;&auml;si l&auml;pi vain 15 kappaletta, joista l&auml;hinn&auml; muutama oli hyvi&auml;, loput vitsej&auml; tai todella surkeita. Asmtv:ssa karsijat (joihin kuuluu mm. konkari Markus &quot;Captain&quot; Kaarlonen) ylistiv&auml;t tuotoksia ja pitiv&auml;t niit&auml; &quot;kaupallisesti p&auml;tevin&auml;&quot;. Makunsa kullakin.. My&ouml;s moni muu yleis&ouml;st&auml; oli hyvin vihaisina, kun eiv&auml;t omat tuotokset olleet p&auml;&auml;sset l&auml;pi.</p>
						<p>Nyt en&auml;&auml; odottamaan, josko wild compo -videomme p&auml;&auml;sisi l&auml;pi karsinnasta, mutta pahalta n&auml;ytt&auml;&auml;. Kuulemma video sis&auml;lt&auml;&auml; copyrightin alla olevaa materiaalia. Vaan p&auml;&auml;sip&auml; aiemmin l&auml;pi mm. Pixelin koostama video, joka on p&auml;&auml;osin televisiossa esitetyist&auml; mainoksista koostettua materiaalia ja n&auml;ytettiin t&auml;n&auml; vuonna uudestaan kankaalla, mik&auml; pist&auml;&auml; ihmettelem&auml;&auml;n karsijoiden moraalia. Hieman katkeruutta, mutta on syyt&auml;kin...</p>
						<p><b>Sunnuntai, aamuy&ouml;</b><br>
						Ei sitten p&auml;&auml;ssyt wild compo -tuotoksemme eik&auml; tuttavienkaan tuotos l&auml;pi karsinnasta. Sen sijaan yleis&ouml; sai nauttia mm. noin viiden minuutin lyhytelokuvasta, jossa kaksi varsin tukevaa tietokoneharrastajaa ahmii sisuksiinsa pizzaa ja kolajuomaa sek&auml; puuhaa tietokoneitten parissa k&auml;yden v&auml;liss&auml; nukkumassa patjojen v&auml;liss&auml;, t&auml;m&auml; kaikki nopeutettuna. Katselu tuntui ikuisuudelta viideksi minuutiksi, ja videolla n&auml;kyv&auml; kello py&ouml;ri ymp&auml;ri jo muutamaan kertaan. Kaiken kaikkiaan kisan osanottajien laatu vaihteli surkeasta hyv&auml;&auml;n. Olipa mukana my&ouml;s kaksi MSX-demoa.</p>
						<p><b>Sunnuntai</b><br>
						T&auml;n&auml;&auml;n on j&auml;ljell&auml; en&auml;&auml; animaatiokisat sek&auml; yhdistetty demokilpailu. Animaatiot olivat mielest&auml;ni viime vuosina esitettyihin verrattuna hieman tasokkaampia, vaikka tuttavat niit&auml; haukkuivatkin. Yht&auml;&auml;n t&auml;ydellist&auml; muitten yli menev&auml;&auml; ei ollut; yhdess&auml; oli hienoa mallinnusta, toisessa hyv&auml; animointi. Mukana oli mm. musiikkivideota, lyhytelokuvaa ja surrealistisia kuvauksia kolmen sep&auml;n patsaasta. Demot puolestaan olivat varsin koreita, mutta ne rupesivat pitemm&auml;n p&auml;&auml;lle maistumaan puulta. Juuri miss&auml;&auml;n ei ollut oikein py&ouml;riv&auml;st&auml; esineest&auml; erottuvaa ideaa lukuun ottamatta viimeist&auml; tuotosta: Exceedin Spot (PC) muistutti milj&ouml;&ouml;lt&auml;&auml;n ja musiikiltaan enemm&auml;n animaatioelokuvaa kuin perinteist&auml; demoa. Ep&auml;ilem&auml;tt&auml; kyseess&auml; oli kisan voittaja.</p>
						<center>
							<p><a href="kuvat/assembly_1.jpg" target="_blank"><img height="263" width="350" src="kuvat/assembly_1_pieni.jpg" border="0" alt=" "></a></p>
							<p><i>Oldskool-alueen p&ouml;yt&auml;rivit olivat t&auml;ynn&auml; tavaraa.</i></p>
						</center>
						<p>Kisojen p&auml;&auml;tytty&auml; teki jo mieli l&auml;hte&auml; pois, sill&auml; paha haju, huono ilma ja hiki eiv&auml;t en&auml;&auml; houkutelleet. Poistuminen onnistuikin melko vaivatta ja &auml;kki&auml; v&auml;ltt&auml;en pahempaa tungosta. Areenan kummallinen liikennej&auml;rjestelm&auml; vaikeutti lastausta hieman: autolla olisi voinut periaatteessa ajaa suoraan p&auml;&auml;oven eteen, mutta tie oli eristetty kettingeill&auml;, ja meid&auml;n olisi pit&auml;nyt menn&auml; parkkihallin kautta ja vied&auml; tavarat hissill&auml;, joten koimme helpommaksi ty&ouml;nt&auml;&auml; k&auml;rryj&auml; yl&auml;m&auml;ke&auml; v&auml;h&auml;n pidemmm&auml;n matkan.</p>
						<p>Kaiken kaikkiaan mielest&auml;ni Assembly '2k oli parempi kuin Assembly '99. Pitk&auml;lti t&auml;h&auml;n vaikutti erillinen oldskool-j&auml;rjestely, mik&auml; poisti pahemman tungoksen sek&auml; metelin, ja ilmastointi oli parempi. Ep&auml;kohtina mainittakoon, ett&auml; oldskool-alueelle oli hyv&auml;ksytty melko asiaankuulumatontakin v&auml;ke&auml;, eik&auml; vahvistimien voimakkuuksia tarkkailtu yht&auml; tarkasti kuin viimeksi.</p>
						<p>My&ouml;s karsinta kilpailuissa oli masentava. Ilmeisesti tuomarit eiv&auml;t ehtineet paneutumaan kunnolla materiaaliin sen paljouden vuoksi. Kuuleman mukaan wild compo -tuotoksia oli noin 80 ja mp3-kappaleita noin 40, musiikkikappaleita yhteens&auml; noin 250. N&auml;ist&auml; p&auml;&auml;see l&auml;pi vain 15-20, ja valinta n&auml;ytti olleen l&auml;hinn&auml; arvan varassa. Kuulimme my&ouml;s er&auml;&auml;st&auml; vieraasta, joka oli hakattu tapahtuma-alueen pihalla sairaalakuntoon. Hakkaajat eiv&auml;t ilmeisesti olleet tapahtumassa vierailijoina, joten syyn&auml; saattaa olla p&auml;&auml;kaupungin kova menokin. My&ouml;hemmin kuulemani toisen version mukaan joku osanottaja oli humaltuneena hyppinyt kalliolta ja satuttanut itsens&auml;, joten legenda saattoi olla vahvana tekij&auml;n&auml;.</p>
						<p>J&auml;lleen kerran viime kerrasta viisastumatta tuli raahattua paikan p&auml;&auml;lle paljon turhaa tavaraa. Jotenkin pit&auml;isi ensi vuonna muistaa j&auml;tt&auml;&auml; puolet tavarasta kotiin. K&auml;ynnist&auml; viisastuin ainakin Linuxin asennuksen suhteen, suuri kiitos avuliaille vierailijoille.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
