<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Assembly '2k amigistin silmin</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Ville Sarell &lt;<a href="mailto:tripper@mbnet.fi">tripper@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Assembly '2k pidettiin toistamiseen Hartwall Areenalla, jonka suurehkojen tilojen ansiosta tapahtuma ker&auml;si tuhansia tietokoneista kiinnostuneita. Tapahtuma oli t&auml;n&auml; vuonna nelip&auml;iv&auml;inen (kuten vuonna '95) ja erilaisia kilpailuja oli yllin kyllin. Allekirjoittanut on Assyill&auml; ravannut vuodesta '94. Ehk&auml; se on jo muodostunut jonkinlaiseksi traditioksi. T&auml;m&auml;nvuotiset Assyt olivat itselleni odotetunlaiset, sill&auml; en en&auml;&auml; uskaltanutkaan odottaa mit&auml;&auml;n mullistavaa partytapahtumaa vuosien takaa, vaan l&auml;hinn&auml; siet&auml;mist&auml; quake/warettajien joukossa.
						<p>Amiga on aina ollut mukana, ja t&auml;n&auml; vuonna p&auml;&auml;sin itsekin verkkoon ihmettelem&auml;&auml;n nopeaa yhteytt&auml;, vaikka sill&auml;kin oli tapana ruuhkautua usein, mutta 8-vuotisen modeemik&auml;yt&ouml;n j&auml;lkeen se ei juuri haitannut. Oman koneen ottamisessa on my&ouml;s aina jotain n&auml;ytt&auml;misen halua, ett&auml; saa porukoitten p&auml;&auml;t k&auml;&auml;ntym&auml;&auml;n ja sanomaan &quot;hei, onks toi muka Amiga?&quot;, mutta nyt huomasin, ettei juuri kiinnostuneita katseita n&auml;kynyt, niin ahtaassa paikassa kun olimme. Er&auml;s hevikundi vieress&auml; kuulemma tosin ihmetteli, mik&auml; emulaattori mulla oikein on. ;)</p>
						<p>Ahtaudesta puheenollen: virallisesti sit&auml; ei pit&auml;nyt olla, eik&auml; varmaan viel&auml;k&auml;&auml;n kuule j&auml;rjest&auml;jien suusta puhuttavan muuta kuin ett&auml; &quot;v&auml;ljemp&auml;&auml; kuin viime vuonna&quot;. Viime vuonna ('99) ahtaus olikin siet&auml;m&auml;t&ouml;nt&auml;, mutta t&auml;n&auml; vuonna omalta osaltani l&auml;hes yht&auml; paha. Toisaalla n&auml;kyi tilaa vaikka muille jakaa, mutta ep&auml;demokraattisesti tietyt alueet oli tiivistetty minimiin. Oli ruhtinaallista ircata aamun tunteina, kun osa porukasta oli nukkumassa, ja sain jopa jalat laitettua mukavasti lattialle!</p>
						<p>T&auml;n&auml; vuonna ensi kertaa j&auml;rjestettiin uusi kilpailusarja: oldskool compos (demo, grafiikka ja musiikki). T&auml;m&auml; oli mielest&auml;ni positiivista, sill&auml; jos viimevuotinen mit&auml;&auml;nsanomaton meininki olisi jatkunut, ei Assmblyill&auml; olisi ruusuista tulevaisuutta ollut (paitsi ehk&auml; verkkopelitapahtumana). Oldskool-kilpailujen lis&auml;ksi oli porukka jaettu kolmeen alueeseen: mainstream, scene ja oldskool.</p>
						<p>Mainstream ja scene oli tasapuolisesti pistetty hallin keskelt&auml; poikki, olskoolille oli pyhitetty aivan omat tilansa. N&auml;m&auml; kaksi suurempaa aluetta ei kyll&auml; mielest&auml;ni juuri toisistaan eronnut; kummassakin pelattiin ja wareteltiin, Windozeja tuntui olevan joka koneessa. Itse olin lipun ostanut scene-puolelle, ehk&auml; ensi vuonna on mahdollisuus p&auml;&auml;st&auml; oldskool-alueelle? Siell&auml; sent&auml;&auml;n oli viel&auml; jotain tunnelmaa ja aitoja scenepartyhenkisi&auml; ihmisi&auml;... ja Amigoita! Sinne oli pystytetty oma videoscreenikin, jos ei laiskuuttaan jaksanut isoon halliin menn&auml; katsomaan.</p>
						<p>Compot olivan kutakuinkin tyypillisi&auml;, music compot (oldskoolia lukuunottamatta) hyvin syv&auml;lt&auml;. Esimerkkin&auml; MP3-kilpailut, joissa tunnuttiin soitettavan vain b&auml;ndien demonauhoja (t&auml;t&auml;h&auml;n kuulee radiosta joka p&auml;iv&auml;, miss&auml; omaper&auml;isyys??). &quot;Teknomaiset&quot; kappaleet boikotoitiin t&auml;n&auml;kin vuonna, ja niiden tilalla soiteltiin j&auml;lleen i&auml;nikuisia &quot;wannabe-blues&quot;-biisej&auml;. Boring! Oli siell&auml; toki pari hyv&auml;&auml;kin kappaletta, mutta ei tarpeeksi, ett&auml; ensi vuonna jaksaisin vaivautua kuuntelemaan.</p>
						<p>Grafiikkakilpailuissa osa kuvista oli julkaistu sek&auml; oldskool-compossa sek&auml; varsinaisessa compossa l&auml;hinn&auml; v&auml;rien m&auml;&auml;r&auml;&auml; ja resoluutiota tiputtamalla. Oldskool-demoissa oli my&ouml;s vanhaa fiilist&auml; mukana, ja niit&auml; jaksoikin katsella mielenkiinnolla. N&auml;m&auml; kaikki vanhan koulukunnan demot taisivat olla Amiga-demoja, PC:ll&auml; tehdyiss&auml; &quot;oldskool&quot;-demoissa oli typeri&auml; ajanmukaistettuja efektej&auml;. T&auml;m&auml; jakaa mielipiteet kahtia, mutta itse pidin enemm&auml;n kunnon scrolliteksteist&auml; sek&auml; muista &quot;vanhan kunnon ajan&quot; efekteist&auml;.</p>
						<p>Intropuolella Amigan n&auml;kyvyytt&auml; pidettiin yll&auml; Explorerin kahden hienon intron voimalla. 4-kiloisten sarjan Amiga-intro voitti v&auml;rikkyytens&auml; ja musiikkinsa ansiosta (Explorerilla tuntuu olevan tapa muokata vain hieman jo hyvin toimivaa koodinp&auml;tk&auml;&auml;, mutta k&auml;yh&auml;n se n&auml;inkin ;). 64-kiloisissa Amiga-intro tuli toiseksi.</p>
						<p>Demoissa oli t&auml;n&auml; vuonna osallistujia monia kymmeni&auml;, joista kuitenkin karsittiin 15 bigscreenille (kuten aina). Amiga-demoja n&auml;ist&auml; oli kaksi (kolmas, Spedeksen demo ei l&auml;p&auml;issyt karsintoja, johtuiko sitten siin&auml; olleista Assy-ivaamisista vai vanhan idean j&auml;lleenk&auml;yt&ouml;st&auml;), molemmat olivat hyv&auml;&auml; keskitasoa; ei mit&auml;&auml;n mullistavaa, mutta eip&auml; toisaalta saanut juuri petty&auml;k&auml;&auml;n, vaikka Nerve Axisin vuoden '97 &amp; '98 - voittajademojen aikaansaamia &quot;Ooooh, c00l&quot; -el&auml;myksi&auml; ei n&auml;hty.</p>
						<p>Paremmat Assyt kuin viime vuonna on mielipiteeni, vaikkakin kaukana vuosien takaisten partyjen tunnelmasta. Mutta katsotaan nyt ensi vuonna (taas!), keksit&auml;&auml;nk&ouml; siell&auml; muita kivoja pelastustoimenpiteit&auml; kuin oldskool-kilpailut. Hartwall Areena oli sijainniltaan ihan hyv&auml;, vaikka betoniviidakon ymp&auml;r&ouml;im&auml; onkin. Sis&auml;lle toivoisin laadukkaampia pikaruokaloita, joissa saisi edes kasvisruokaa, sek&auml; sponsoreitten v&auml;henemist&auml; k&auml;yt&auml;vill&auml; (turha toivo ;). Nytkin oli edellisvuosien tapaiset reivit pilattu er&auml;&auml;n pizzaruokaketjun varattua tilat itselleen (valitus ei auttanut)! Taisi siin&auml; olla DJ:ll&auml; hieman fiilikset kadoksissa.</p>
						<p>PS: #AmigaFIN-miitti j&auml;rjestet&auml;&auml;n sitten my&ouml;s ensi vuonna, ok? :-)</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
