<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>J&auml;&auml;hyv&auml;iset levyke-Sakulle</b></font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="362" width="400" src="kuvat/sakubyebye.jpg"></center>
						<p>Kari Ahonniska kirjoitti 23. helmikuuta 1993 Fidonetin SF.AMIGA-viestialueella: &quot;Olisiko mielest&auml;nne tullut aika meid&auml;n Amiga-k&auml;ytt&auml;jien perustaa k&auml;ytt&auml;j&auml;kerho valistamaan koneen hy&ouml;tyk&auml;ytt&ouml;&auml;, opastamaan k&auml;ytt&ouml;&auml; muutenkin, kenties julkaisemaan jonkinlaista lehdykk&auml;&auml;, pit&auml;m&auml;&auml;n yll&auml; PD-kirjastoa ja kenties j&auml;rjest&auml;m&auml;&auml;n Amigan ymp&auml;rille jonkinlaisia yleis&ouml;tilaisuuksia.&quot; Kuten Janne Sir&eacute;n jo Sakussa #25 totesi, ei tainnut mies tiet&auml;&auml;, mihin nuo sanat viel&auml; johtaisivat. Yhdistys n&auml;ki p&auml;iv&auml;nvalon, Saku-tapahtumia on j&auml;rjestetty menestyksell&auml;, PD-kirjastoakin ehdittiin kokeilla.</p>
						<p>Kaiken ytimess&auml; on kuitenkin ollut aina Saku-lehti, joka on koonnut yhteen suomalaisia amigsteja vuodesta toiseen. &quot;Jonkinlainen lehdykk&auml;h&auml;n&quot; siit&auml; syntyi, nyt jo kahdeksatta vuosikertaansa tallustava Saku. Formaatteja on tullut ja mennyt vuosien varrella, niin elektronista kuin paperista, ollutta ja olematonta. HTML-lukumoottoriksi kaavailtu Amphibia ei tainnut koskaan n&auml;hd&auml; rivi&auml;k&auml;&auml;n koodia, paperi-Saku taas j&auml;i yhden kerran ihmeeksi. AmigaGuide-versio p&auml;&auml;stettiin ansaittuun lepoon numeron 30 j&auml;lkeen, mutta kaikkein pisimp&auml;&auml;n on taitettu peist&auml; levykeversion kohtalosta.</p>
						<p>Levyke-Saku on ollut niin kauan ja olennaisesti yhdistyksen konkreettinen &quot;sielu&quot;, ett&auml; pakostakin mielt&auml; kirpaisee sen lopettaminen (sanoisin mieluummin &quot;el&auml;kkeelle p&auml;&auml;st&auml;minen&quot;), vaikka se onkin jo pitk&auml;&auml;n ollut rajoittunut julkaisumuoto ja ty&ouml;l&auml;s koottava. Jutut suurenevat ja kuvat paranevat, mutta DD-levyke on valitettavasti mediana j&auml;&auml;nyt ajan jalkoihin. Itse olen puuhannut Sakun parissa jo vuodesta 1994, ja kuten Pasi Kovanen tuonnempana mainitsee, ei minulla ollut silloin hajuakaan, mihin oikolukupesti viel&auml; johtaisi - p&auml;&auml;toimittajaksi ja yhdistyksen puheenjohtajaksi. Mit&auml; oikein tapahtui?</p>
						<p>Yksinkertaista:&nbsp;Saku vei mukanaan. Niin se on vienyt monen muunkin vuosien saatossa. Osa alkuper&auml;isist&auml; puuhastelijoista on edelleen remmiss&auml;, osa on poistunut kuvioista ja aina tulee my&ouml;s uusia kirjoittajia sek&auml; osallistujia. Kuka tiet&auml;&auml;, miss&auml; formaatissa tulevaisuudessa Sakua viel&auml; luemme tai koemme... Seuraavassa Sakun entiset p&auml;&auml;toimittajat tarinoivat levyke-Sakun el&auml;k&ouml;itymisen kunniaksi. Lukekaa ja muistakaa.</p>
						<p>Kiitokset my&ouml;s Heimo Laukkaselle, Antti V&auml;h&auml;-Sipil&auml;lle ja Jani H&ouml;glundille, jotka eiv&auml;t omien kiireidens&auml; vuoksi valitettavasti ehtineet kirjoittaa t&auml;h&auml;n lehteen, mutta vastasivat s&auml;hk&ouml;postitse ja toivottivat Sakulle hyv&auml;&auml; jatkoa. Kiitos Mika Makkoselle, joka teki t&auml;h&auml;nkin Sakuun aiheeseen mainiosti sopivan kansikuvan. Suuri ja l&auml;mmin kiitos my&ouml;s Veli-Matti Vuorensyrj&auml;lle, joka on kaikki n&auml;m&auml; vuodet uskollisesti hoitanut levyke-Sakun postitukset kotiinkannon maksaneille j&auml;senille. Hiljainen mutta tunnollinen taustaty&ouml;si on ollut yhdistykselle ensiarvoisen t&auml;rke&auml;&auml;.</p>
						<p>Anu Seilonen<br>
						<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jaskarin Tomi kasasi aikoinaan ristiriitaisen vastaanoton saavuttaneen ensimm&auml;isen Sakun numeron. Esikoisesta viisastuneena seuraavaa numeroa suunniteltiin suuremmalla ryhm&auml;ll&auml;, ja lehden alkuvaiheissa tein sille muiden diskettilehtien kaltaisen lukuohjelman. Levyke-Saku oli ensimm&auml;isi&auml; suurempia C:ll&auml; tekemi&auml;ni ohjelmia, ja l&auml;hdekoodi taatusti sen mukaista.
						<p>Tomin vastuulla oli jatkossa kerhon toiminnan organisointi. Esimerkiksi lehden levitykseen tarvittiin kopioijaorjien verkosto (aina ei ole ollut Interneti&auml;, lapset). Itse keskityin lehden toimittamiseen vuoden 1994 syksyyn asti, jolloin p&auml;&auml;sin leikkim&auml;&auml;n sotaa.</p>
						<p>Lehti tuli varsin tunnetuksi ja ilmeisesti my&ouml;s melko luetuksi. Viimeisen toimittamani numeron aikoina saimme pari sivua tilaa MikroBitiss&auml;. Pikku hiljaa mukaan tuli uusia henkil&ouml;it&auml;. Nykyisen p&auml;&auml;toimittaja-Anun rekrysin aikoinaan oikolukuhommiin, eik&auml; raukka tainnut tiet&auml;&auml; miten pitk&auml;aikainen pestist&auml; tulisi. :) Hienoa n&auml;hd&auml;, ett&auml; harrastajavoimin voidaan viel&auml; tehd&auml; n&auml;in ansiokasta toimintaa - enk&auml; olisi ikin&auml; uskonut, ett&auml; mokoma levyke-Sakun ohjelma olisi k&auml;yt&ouml;ss&auml; viel&auml; vuonna 2000. Varsinainen Y2K-ongelma, joka siis vihdoinkin poistuu (snif).</p>
						<p>Nykyisin vaikutan Lappeenrannassa. Amigaa en ole omistanut kuuteen vuoteen, enk&auml; ole kyll&auml; toviin n&auml;hnytk&auml;&auml;n. Toisaalta tietoliikennealalla ty&ouml;skentelev&auml;n&auml; eiv&auml;t tietokoneet en&auml;&auml; vapaa-aikana jaksa kiinnostaa.</p>
						<p>Lopussa on s&auml;hk&ouml;postiosoitteeni. Olisi kiva kuulla, minne el&auml;m&auml; on viskonut vanhoja Amiga-aikojen tuttavia. Menestyksek&auml;st&auml; syksy&auml; kaikille!</p>
						<p><font color="black">Pasi Kovanen<a href="mailto:Kovis@iki.fi"><br>
						Kovis@iki.fi</a></font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">18.34 2000-10-10 - Saku on the Road Trip
						<p>Olin jo aikeissa l&auml;hett&auml;&auml; Anulle viestin, etten jaksa kirjoittaa mit&auml;&auml;n muisteluita, mutta t&auml;ss&auml; sit&auml; nyt istutaan toisen ty&ouml;koneen &auml;&auml;ress&auml; ja n&auml;kytell&auml;&auml;n; ensimm&auml;inen artikkelin lausekin (vai onko se virke) taitaa olla jo valmiina - hiiohoi ja rommia pullo!</p>
						<p>Niin siis, lupasin yhdistyksen vuosikokouksessa muistella levykelehtemme alkuaikoja ja on aika t&auml;rke&auml;t&auml; pit&auml;&auml; se mink&auml; lupaa. Jos ei muuten, niin oman itsetuntonsa vuoksi: voi pit&auml;&auml; itse&auml;&auml;n sanansa mittaisena miehen&auml;. Eli kannattaa v&auml;ltt&auml;&auml; liian isoja sanoja, vai mit&auml; olet mielt&auml;, yst&auml;v&auml;iseni. Olikohan minulla sanottavaa ja mit&auml; halusinkaan sanoa? T&auml;m&auml;n artikkelin tarkoitus on l&auml;hinn&auml; kiitt&auml;&auml; Teit&auml; kaikkia, jotka olette olleet mukana Sakun Road Trip -tapahtumasarjassa.</p>
						<p>Sakun eli pidemmin Suomen Amiga-k&auml;ytt&auml;jien Unionin koossapit&auml;v&auml;n&auml; voimanahan oli alkujaan ja on viel&auml; nyky&auml;&auml;nkin erikoislaatuinen lehti, jota tukemaan my&ouml;hemmin perustettiin Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. Lehtemme on erikoislaatuinen monessakin mieless&auml;.</p>
						<p>Ensiksikin se on integroinnin mestarin&auml;yte - musiikki + teksti + kuvat + ohjelma. Toisekseen se on jaetun vastuun ja korkean ty&ouml;moraalin osoitus. Tosin aallonpohjassakin on k&auml;yty, mutta n&auml;m&auml; kerrat ovat olleet poikkeuksia. T&auml;st&auml; suurkiitokset p&auml;&auml;toimittajakaartillemme. Taputtakaa itse&auml;nne selk&auml;&auml;n, hyvin olette ty&ouml;nne tehneet. Kolmanneksi, lehtemme on my&ouml;s muistanut jatkuvasti uudistua ja pysy&auml; hengiss&auml;, vaikka lukijakunta ei varmasti ole maailman suurin. Olemme kokeilleet jopa paperiformaattia - viel&auml;k&ouml; joku muistaa Bermuda's Triangle -nimisen purkin? Siell&auml; valmistimme Sakun ainokaisen paperipainoksen. Nelj&auml;nneksi, lehtemme on jopa sis&auml;lt&auml;nyt asiaa ja huumoria. Mit&auml; enemp&auml;&auml; voi hyv&auml;lt&auml; lehdelt&auml; toivoa?</p>
						<p>Mutta nyt armon vuonna 2000 olemme vapaaehtoisesti p&auml;&auml;tt&auml;neet luopua diskettilehdest&auml; ja menn&auml; t&auml;ysill&auml; mukaan Internetiin. Lehdest&auml;mme on siis tulossa virtuaalistakin virtuaalisempi. Hyperteksti&auml;h&auml;n oli aivan ensimm&auml;isell&auml; Sakulla. Tosin nimi &quot;Saku&quot; keksittiin lehdelle vasta ensimm&auml;isten levykkeiden j&auml;lkeen. Mutta olin kertomassa levykelehtemme historiaan. Mahtuuko sinne hauskoja sattumuksia?</p>
						<p>Ainakin muistan ikimuistoisesti vierailuni Kotkaan Pasi Kovasen luo sek&auml; Naaraj&auml;rvelle Esa Heikkisen luo. J&auml;lkimm&auml;isest&auml; reissusta on jopa Mikrobittiin asti p&auml;&auml;ssyt valokuva todisteena. Muistan my&ouml;s raivoisasti testanneeni Saku-levykett&auml; tiedekeskus Heurekan demokomuutilla ja kiroilleeni guruisasti. Mutta en itse asiassa halua muistella enemp&auml;&auml;, kirjeit&auml; Sakuun minuun on tallella kai satoja. Niiden edes auttavaan k&auml;sittelyyn ei aikani t&auml;n&auml;&auml;n anna my&ouml;den. T&auml;rkein sanottavani oli siis tuolla ylemp&auml;n&auml;. P&auml;&auml;t&auml;n artikkelini jonkinlaiseen katsaukseen.</p>
						<p>Tietokoneen muisti on siit&auml; merkillinen v&auml;line, ett&auml; se tallettaa sis&auml;lt&ouml;ns&auml; (jos se on RAM-tyyppist&auml;) vain niin kauan kuin virrat ovat p&auml;&auml;ll&auml;. Klick, ja kaikki tieto h&auml;ipyy! Uskoisin, ett&auml; jokainen on menett&auml;nyt v&auml;hint&auml;&auml;n 8 bitti&auml;, kun 230 voltin j&auml;nnite on yht&auml;kki&auml; j&auml;&auml;nyt hetkeksi saapumatta koneen tehol&auml;hteeseen. Ik&auml;v&auml; juttu, varsinkin jos teksti&auml; tuli n&auml;pytelty&auml; enemm&auml;nkin ennen viimeist&auml; tallennusta massamuistille. Olen el&auml;m&auml;ni varrella k&auml;sitellyt 8-tuumaisia tietokonelevykkeit&auml;, reik&auml;kortin lukijaakin olen tainnut kosketella ja jopa hetken opiskella, miten sit&auml; k&auml;ytet&auml;&auml;n. Siit&auml; ei ole kuin 17 vuotta.</p>
						<p>Nyt on magneettinen ulkoinen media kutistunut 3,5 tuumaan tai jopa siit&auml;kin pienemm&auml;ksi. Mutta varsinainen optinen vallankumous on vasta alkamassa. Verkon r&ouml;&ouml;reihin ollaan ihan vakavasti tunkemassa useampaa kuin yht&auml; aallonpituutta fotoneja, ja seurauksena on tietenkin verkon suorituskyvyn dramaattinen nousu. Joten tietoteollinen vallankumous on vasta alkamassa - n&auml;in min&auml; ainakin asian n&auml;en. J&auml;tin tarkoituksella mainitsematta sanan DVD, sill&auml; se on ihan oma artikkelinsa. Kirjoitan sen Joskus.</p>
						<p>Tomi Jaskari - Vanha Talvitie 10.10.2000 kello 19:00:00</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Janne Sir&eacute;n toimi Saku-lehden p&auml;&auml;toimittajana 11/1994 - 1/1996 sek&auml; 11/1997 - 6/1998. H&auml;n vastasi my&ouml;s Pasi Kovasen j&auml;lkeen levyke-Sakun lukijaohjelman kehitysty&ouml;st&auml; vuoden 1994 lopusta l&auml;htien aina lehtikoodin viimeisimp&auml;&auml;n versioon saakka. P&auml;&auml;toimittajan uraa aloitellessaan Janne oli lukiolainen. Nykyisin h&auml;n opiskelee Helsingin yliopistolla tietojenk&auml;sittelytiedett&auml;, avustaa MikroBitti&auml; ja on osakkaana Spellpoint Software Oy:ss&auml;.
						<center>
							<p>* * *</p>
						</center>
						<p>Ensimm&auml;inen muistikuvani disketti-Sakusta, tai SAKU:sta, kuten sit&auml; kutsuttiin, on aivan lehden ensimetreilt&auml;, vuoden 1993 perukoilta. Py&ouml;ritin tuolloin Epsilon Indin nimell&auml; kulkenutta purkkia, joka oli ker&auml;nnyt jonkin verran suosiota Amiga-k&auml;ytt&auml;jien keskuudessa. En muista, kuka ensimm&auml;isen kerran uudesta Amiga-k&auml;ytt&auml;jien kerhosta kanssani keskusteli, mutta Epsilon Indi p&auml;&auml;tyi joka tapauksessa jokusen sysop-k&auml;ytt&auml;j&auml;-chattituokion (viel&auml;k&ouml; muistatte moiset?-) seurauksena yhdeksi SAKU:n virallisista levityskanavista. Purkki listattiin lehdess&auml;kin.</p>
						<p>Commodore oli viel&auml; elossa ja olin amigisti henkeen ja vereen, joten asian tukeminen tuntui luonnolliselta. Tutustuin purkkien kautta yhdistyst&auml; puuhanneisiin Tomi Jaskariin ja Heimo Laukkaseen, ja muutaman mutkan kautta p&auml;&auml;dyin &quot;ulkoasupoliisiksi&quot; (kyll&auml;, se oli ensimm&auml;inen tittelini) SAKU:n seuralaiseksi joitakin kuukausia my&ouml;hemmin startanneeseen AmigaGuide-Sakuun, jota Jaskari p&auml;&auml;toimitti. Teht&auml;v&auml;n&auml;ni oli siisti&auml; Tomi Jaskarin tuottamasta raakaversiosta lopullinen, julkaisukelpoinen painos.</p>
						<p>Varsinaisen Sakun puikoissa sorvasi Pasi Kovanen, jonka k&auml;sialaa my&ouml;s lehden lukijaohjelma sattui olemaan. En tied&auml; tarkkaa tarinaa, mutta ko. lukijaohjelma oli alun perin tehty MikroBitiss&auml; tai C-lehdess&auml;kin mainostaneelle Guru-levykelehdelle, joka ei kuitenkaan ottanut tuulta purjeisiinsa ja hiipui nopeasti. Kovanen harmitteli asianhaaroja ensimm&auml;isen levyke-Sakun p&auml;&auml;kirjoituksessa.</p>
						<p>Kirjoittelin noihin aikoihin my&ouml;s ensimm&auml;iset artikkelini lehteen, ja AmigaGuide-Sakun toiseen numeroon menness&auml;, joka julkaistiin vuoden 1994 tammikuussa, olin jo &quot;ylennyt&quot; lehden p&auml;&auml;toimittajaksi, Jaskarin k&auml;ytt&auml;ess&auml; titteli&auml; tuottaja. Tomi olikin t&auml;ss&auml; vaiheessa yh&auml; enemm&auml;n uppoutumassa sittemmin paljon hyv&auml;&auml; poikineeseen urakkaansa: rekister&ouml;idyn yhdistyksen perustamiseen. AmigaGuide-Sakua julkaistiin tuolloin erill&auml;&auml;n Sakusta, ja lehtien artikkelisis&auml;ll&ouml;ss&auml;, aikataulussa sek&auml; oikoluvussa oli eroja. Jossain vaiheessa lehden nimen kirjoitusasustakin k&auml;ytiin polemiikkia ja tultiin siihen tulokseen, ett&auml; se kirjoitetaan normaalisti isoin kirjaimin muodossa &quot;SAKU&quot;, mutta taivutettaessa muodossa &quot;Sakussa&quot;. Nykyisinh&auml;n oikea kirjoitusasu on aina Saku, jossa vain alkukirjain on isolla.</p>
						<p>Itse n&auml;perrelless&auml;ni AmigaGuide-Sakun parissa Pasi Kovanen jatkoi Sakun p&auml;&auml;median kehittely&auml;. Alkuper&auml;inen SAKU tuki vain kaksipalstaisia artikkeleita ja taustamusiikin tuki puuttui (musiikki ladattiin erillisell&auml; ohjelmalla), mutta pian yksipalstaiset artikkelit syrj&auml;yttiv&auml;t palstoituksen, jota ei ole vuosiin taidettu k&auml;ytt&auml;&auml;, vaikka ohjelma sit&auml; edelleen tukeekin. Artikkelitekstit saivat v&auml;rej&auml; ja hakemistoa parannettiin lis&auml;&auml;m&auml;ll&auml; mm. v&auml;liotsikot. My&ouml;s lehden juttuaiheet laajenivat, haastatteluun saatiin jonkun kontaktin kautta kotimainen Dance Nation -yhtye, jonka Sakussakin k&auml;ytetyn pressikuvan muistan ihmetyksekseni n&auml;hneeni my&ouml;s Avussa tms. lehdess&auml; kes&auml;m&ouml;kill&auml;. Oli siin&auml; teini-Jannella ihmettelemist&auml; kerrakseen.</p>
						<p>Seitsem&auml;n Saku-lehden ja noin vuoden puurtamisen j&auml;lkeen Pasi Kovanen ilmoitti l&auml;htev&auml;ns&auml; armeijaan, myyv&auml;ns&auml; Amigansa ja hakevansa Saku-lehden p&auml;&auml;toimittajan teht&auml;v&auml;&auml;n jatkajaa. Viestit taisivat tuolloin kulkea mm. Fidonetin perustetun SF.AMIGA.SAKU-alueen kautta. Halukkaita ei tuntunut liiemmin l&ouml;ytyv&auml;n, joten l&auml;hetin &quot;ty&ouml;hakemuksen&quot; Kovaselle, joka ojensi valtikan kouraani ilomielin - olinhan sent&auml;&auml;n puuhastellut AmigaGuide-versiota lehdest&auml; jo jonkin aikaa. Ty&ouml;m&auml;&auml;r&auml;ni lis&auml;&auml;ntyi siis melkoisesti: sain ty&ouml;stett&auml;v&auml;kseni nyt paitsi Sakun levyke- ja AmigaGuide-versiot, my&ouml;s lehtikoodin, joka oli melko kimurantti kasa C-p&auml;tki&auml;.</p>
						<p>Sain kuin sainkin lehtikoodin k&auml;&auml;ntym&auml;&auml;n seuraavan numeron (#8) julkaisuun menness&auml;. Ensimm&auml;iset parannukseni olivat l&auml;hinn&auml; kosmeettisia: selkiytin lehden tiedosto- ja hakemistorakenteen nime&auml;mist&auml;. Lehtikoodi oli edelleen l&auml;hes t&auml;ysin Kovasen k&auml;sialaa, executablesta l&ouml;ytynytt&auml; piiloviesti&auml; my&ouml;ten: &quot;Onkos kiva lueskella softan k&auml;&auml;nnetty&auml; versiota?? :) T&auml;t&auml; viesti&auml; ei Sakussa tulostetakaan!&quot; L&ouml;rp&ouml;ttelin ensimm&auml;isess&auml; p&auml;&auml;kirjoituksessani mantroja, joita my&ouml;hemm&auml;t p&auml;&auml;toimittajatkin ovat tuntuneet toistelevan - lis&auml;&auml; apua tarvitaan ja lukijakyselykin on usein ollut ajankohtainen:</p>
						<p>&quot;T&auml;m&auml; on sitten minun ensimm&auml;inen disketti-Sakuni. AmigaGuide-puoltahan olen toimittanut alusta alkaen reilut puoli vuotta. Nyt kaikki piti tehd&auml; kahdesti - molempiin lehtiin erikseen erilaisten leveyksien ja kuva-asettelujen vuoksi. Toivottavasti lopputulos on kaiken sen puurtamisen arvoinen. Artikkeleita on tippunut varsin nihke&auml;sti vaikka viimeisten viikkojen aikana niit&auml; tulikin varsin kiitett&auml;v&auml;sti. Enemm&auml;n aktiviteettia kaivataan silti... Sakua ei voida tehd&auml; ilman Sinun, hyv&auml; lukija, apua. L&auml;hetelk&auml;&auml; my&ouml;s vastauksia lukijakyselyymme, sill&auml; tarvitsemme palautetta ja joku onnellinen voittaa my&ouml;s palkinnon. Marraskuussa tapaamme taas!&quot;</p>
						<p>Vuoden 1995 kes&auml;ll&auml; ker&auml;sin Saku-lehden formaatin ensimm&auml;ist&auml; kertaa spesifikaatioksi, joka julkaistiin mahdollisia halukkaita vaihtoehtoisten lukijaohjelmien tekij&ouml;it&auml; varten. Ainakin yksi projekti lukijaohjelman tekemisest&auml; PC:lle oli jossain vaiheessa k&auml;ynniss&auml;, ja aivan viime vuosina muutama vaihtoehtoinen lukija on Amigallekin ilmestynyt, vaikka suurempaa numeroa niist&auml; ei ole tehty. Disketti-Sakun rajoitukset muuten tiedostettiin jo t&auml;ll&ouml;in, ja tilalle kaavailtiin HTML-lehte&auml;, jolle teht&auml;isiin pikku-Amigoillakin toimiva lukija, Amphibia (nimen muuten satuin min&auml; tietosanakirjasta bongaamaan, tarkoittaa sammakkoel&auml;imi&auml; latinaksi). Suunnitteluty&ouml;t&auml; ehdittiin tehd&auml;, mutta varsinaista koodia ei tainnut koskaan synty&auml;.</p>
						<p>Levyke-Sakun pulskimpia numeroita kohtasi my&ouml;s toistuvasti tilaongelma: yhdelle DD-korpulle kun mahtui vain sen verran tavaraa, ja yhteensopivuuden nimiss&auml; piti viel&auml;p&auml; pit&auml;&auml; kiinni OFS-standardin mukaisesta formaatista. Virittelin lukijaohjelmaan kahden levykkeen tukea, josta ei kuitenkaan noihin aikoihin koskaan oikein tullut mit&auml;&auml;n - paitsi jokunen kakkoslevykett&auml; pyyt&auml;v&auml; virheilmoitus ongelmatilanteissa. Yritimme nimitt&auml;in tuolloin sulloa kotiinkantoa varten kaksi levykett&auml; pakattuna yhdelle, mutta emme onnistuneet rakentamaan luotettavaa ja yhteensopivaa purkumekanismia. Lehti pysyi siis yhdell&auml; levykkeell&auml;, vaikka ohjelmakoodiin j&auml;ikin lojumaan heikko kahden levykkeen tuki.</p>
						<p>Toinen rasite oli kahden lehtiformaatin yll&auml;pit&auml;minen: kaikki tekstit piti muotoilla kahteen kertaan, sill&auml; levyke-Sakun ruudunleveys oli 80 merkki&auml; ja AmigaGuidessa taas suosittiin 75-merkkisi&auml; rivej&auml;. Kun sitten joukossa oli superpitki&auml; tai runsaasti kuvitettuja juttuja Ville-Pertti Keinosen C-kurssien tai Esa Heikkisen elektroniikkajuttujen tapaan, ty&ouml;m&auml;&auml;r&auml; oli melkoinen - ja tulihan sit&auml; virheit&auml;kin v&auml;lill&auml; tehty&auml;, mist&auml; syyst&auml; Errata-palstakin perustettiin. C-kurssit olivat omanlaisensa rumba, kun koodiesimerkkien aaltosulut eiv&auml;t levyke-Sakussa saaneet aloittaa rivi&auml;, sill&auml; samaisella merkill&auml; aloitettiin rivin v&auml;rikoodi. Toisaalta esimerkkikoodit ja k&auml;ytetty tekstinmuotoiluohjelma aiheuttivat lis&auml;ty&ouml;t&auml;.</p>
						<p>Ent&auml; muistaakohan kukaan, ett&auml; Saku #9 ei alkujaan toiminut AmigaOS 1.3:lla, kun olin erehtynyt k&auml;ytt&auml;m&auml;&auml;n yht&auml; 2.0:n kutsua. Liek&ouml; SAKU9FIX.LHA-korjauspaketti viel&auml; jollain kiintolevyll&auml; jossain p&ouml;ly&auml; ker&auml;&auml;m&auml;ss&auml;...</p>
						<p>Jatkoin lehden parissa pakertamista aina vuoden 1996 alkuun, Saku-numeroon 16 saakka, pit&auml;en kiinni silloisesta julkaisurytmist&auml;: lehti julkaistiin tarkalleen kahden kuukauden v&auml;lein. Olin tuolloin saanut t&ouml;it&auml; MikroBitist&auml; ja ylioppilaskirjoitukset h&auml;&auml;m&ouml;ttiv&auml;t edess&auml;, joten suurin into ja aika Sakun viilaamiseen oli kadonnut. Jatkajaksi l&ouml;ytyi Esa Heikkinen, joka lyhyen puhelinkeskustelun j&auml;lkeen vastaanotti teht&auml;v&auml;n. Esa sai ev&auml;stykseksi mm. Sakun l&auml;hdekoodit, mutta tiet&auml;&auml;kseni h&auml;n ei niill&auml; koskaan mit&auml;&auml;n arkistointia kummempaa tehnyt. Esa otti kuitenkin p&auml;&auml;toimittajan haasteen innostuksella vastaan ja Saku pysyi julkaisurytmiss&auml;&auml;n, kunnes yhdistyksen virheelliset linjavedot Amphibia-projektin suhteen sotkivat kuviot.</p>
						<p>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n ja Amiga-yhteis&ouml;n vaikeudet vuosina 1996-1997 on dokumentoitu laajalti jo aikaisemmissa historiikeissa (ks. esim. Saku #25), mutta uutta potkua Amiga-toiminta sai vuoden 1997 alussa Gatewayn ostettua konemerkin. Hallituksessa keksimmekin puuhata syksylle 1997 Saku-tapahtumaa ja julkaista siell&auml; levykkeell&auml; levyke-Sakun koodiin perustuvan erikoisnumeron. Tapahtuman my&ouml;t&auml; usko yhdistykseen alkoi taas palailla ja Saku-lehte&auml; kaipailtiin. Esa Heikkisell&auml; oli omat kiireens&auml;, joten palasin v&auml;liaikaiseksi p&auml;&auml;toimittajaksi aina Sakun viisivuotisjuhlanumeroon saakka, ennen kuin kes&auml;ll&auml; 1998 oli oma aikani astua varusmiespalvelukseen. Ympyr&auml; sulkeutui. Uudeksi p&auml;&auml;toimittajaksi suostuteltiin Anu Seilonen, joka oli jo pitk&auml;&auml;n hoitanut lehden oikolukua. Tein Anulle laajat ohjeet levyke-Sakun tekoon - tietotaidon siirt&auml;misen haasteellisuus oli opittu kantap&auml;&auml;n kautta.</p>
						<p>En kuitenkaan j&auml;tt&auml;nyt levyke-Sakun ohjelmakoodin kehittely&auml; sikseen, vaan ehdin kirjoittaa sen suurilta osin uusiksi, vaikka t&auml;t&auml; ei ulkoisesti aina huomaakaan. Ohjelma on kuitenkin paljon alkuper&auml;ist&auml; stabiilimpi ja nopeampi, ja tulihan se kunnollinen kahden levykkeen tukikin aikanaan (itse asiassa koodi tukee tarvittaessa vaikka satoja levykkeit&auml; :-), kun luovuttiin suosiolla ideasta pakata kaksi levykett&auml; yhdelle. Jopa grafiikakortit saivat rajoitettua tukea, kun alapalkin copper-listan k&auml;yt&ouml;lle tarjottiin vaihtoehtona 32-v&auml;rin ruutupalettia.</p>
						<center>
							<p><img height="300" width="400" src="kuvat/saku25.jpg" border="0" alt=" "></p>
						</center>
						<p>Paljon vett&auml; on virrannut siltojen alta sen j&auml;lkeen, kun vuonna 1995 yhdistyksen ensimm&auml;isess&auml; kokouksessa varovaisesti ehdotettiin, ett&auml; jotain uutta (HTML) pit&auml;isi saada. Disketti-Sakun kiistaton tunnelma ja tietynlainen kulttistatus ovat tehneet sen lopettamisp&auml;&auml;t&ouml;ksest&auml; vaikean, eik&auml; yhteensopivuudesta vanhojen Amigoiden kanssa kovin helpolla haluttu luopua.</p>
						<p>Yli viisi vuotta my&ouml;hemmin tuo ehdotus on kuitenkin viimein muuttunut p&auml;&auml;t&ouml;kseksi, joka t&auml;m&auml;n viimeisen levyke-Sakun my&ouml;t&auml; my&ouml;s toteutetaan. Ehk&auml;p&auml; aika olisi ollut kyps&auml; jo aikaisemmin, mutta viimeist&auml;&auml;n uuden, loistavan HTML-layoutin ja alati muuttuvan Amiga-tulevaisuuden my&ouml;t&auml; vanhan sotaratsun siirt&auml;minen el&auml;kkeelle tuntuu kiistattomalta ratkaisulta. HTML:kin on tullut pitk&auml;n tien vuodesta 1995. Levykelehdet olivat pitk&auml;lti 80- ja 90-lukujen vaihteen tuote, joten on pienoinen ihme, ett&auml; levyke-Saku pystyi s&auml;ilytt&auml;m&auml;&auml;n suosionsa uudelle vuosituhannelle saakka.</p>
						<p>Mieleeni nousee vain yksi selitys: ainutlaatuinen joukko ihmisi&auml; onnistui kerta toisensa j&auml;lkeen luomaan ainutlaatuisen julkaisun, johon tekee mieli palata my&ouml;hemminkin. Toivon hartaasti, ett&auml; t&auml;m&auml; tunnelma jatkuu nykyisen HTML-julkaisun ja, ken tiet&auml;&auml;, muiden tulevaisuuden mediaformaattien &quot;sivuilla&quot;. Sen mink&auml; menet&auml;mme historiallisessa tunnelmassa, voitamme moninkertaisesti informaation n&auml;ytt&auml;vyydess&auml; ja k&auml;ytett&auml;vyydess&auml;. Lis&auml;ksi p&auml;&auml;semme eroon monen formaatin ongelmasta; AmigaGuidestahan luovuttiin jo aikaisemmin. Nyt on aika luoda uutta tunnelmaa ja uusi legenda.</p>
						<p>L&auml;mmin kiitos teille kaikille, jotka teitte levyke-Sakusta unohtumattoman kokemuksen. Olen iloinen ja ylpe&auml;, ett&auml; sain olla tekem&auml;ss&auml; kanssanne historiaa. Seitsem&auml;n vuotta ja 34 numeroa ei nimitt&auml;in ole mik&auml;&auml;n pieni saavutus - edes pienelle, suurelle sammakolle.</p>
						<p>Janne Sir&eacute;n<br>
						<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a></p>
						<p>PS. Yksi erityisen hauska muisto levyke-Sakun vuosilta liittyy lehden kansiin. Alkuper&auml;isell&auml; p&auml;&auml;toimittajakaudellani levyke-Saku sai erilliset kannet, tai tarkemmin kannen. Joku heitti leikill&auml;&auml;n Sakunetiss&auml; palautteen, ett&auml; jos lehdell&auml; on kansi, niin pit&auml;&auml;h&auml;n sill&auml; olla my&ouml;s takakansi.</p>
						<p>Palautteeseen vastattiin huumorilla: takakannen n&auml;kee, kun valitsee etukannen ja katsoo monitorin taakse. Muutamaa vuotta my&ouml;hemmin teimme Anun kanssa vitsist&auml; vitsin, kun Saku #30 sai takakannen - joka oli kuva n&auml;yt&ouml;st&auml; takaap&auml;in. Kuvan nappasi digitaalikameralla Tapani Tanskanen varamonitoristaan, joka ei kuvan ottohetkell&auml; ollut edes k&auml;yt&ouml;ss&auml;.</p>
						<p>Toinen huumorin kukkanen tuli Saku 99:n j&auml;rjest&auml;neen hallituksen kaudella, kun joku keksi, ett&auml; Sakussa vieraillut saksalainen, Jens Sch&ouml;nfeld, ja puheenjohtajamme Tomi Jaskari n&auml;ytt&auml;v&auml;t samalta. Onneksi molemmista l&ouml;ytyi viel&auml;p&auml; hyv&auml;t kasvokuvat, jotka l&auml;isk&auml;istiin samaiseen Saku-lehden numeroon hieman er&auml;&auml;n p&auml;iv&auml;lehden viikkoliitett&auml; muistuttaen...</p>
						<p>Kiitos hymyist&auml; vastuullisille. :-)</p>
						<p>Janne</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">On h&auml;mm&auml;stytt&auml;v&auml; n&auml;hd&auml; miten asiat muuttuvat. Ei ole kauaa siit&auml;, kun lukijakyselyiden tuloksista n&auml;ki, ett&auml; Sakun levykeversio oli ylivoimaisesti suosituin formaatti. Kymmenisen numeroa sitten oli HTML-formaatti vasta juuri tullut uutuus, jota melko harva halusi k&auml;ytt&auml;&auml;. Perinteinen Saku kun oli paljon livakampi k&auml;ytt&auml;&auml; kuin raskas HTML-pohjainen toteutus.
						<p>Mutta tekstipohjaiset, nopeat sovellukset n&auml;ytt&auml;v&auml;t kuolevan pois. Onhan hiiren kanssa huseeraaminen helpompaa k&auml;ytt&auml;j&auml;lle - vai onko? Ennen vanhaan sivut vaihtuivat nuolin&auml;pp&auml;imi&auml; painelemalla salamannopeasti, nyt klikkaillaan linkkej&auml; ja odotellaan. Helsingin pojjaat ei odottele, kun niill&auml; on kiinte&auml;. No, on se kiinte&auml; tulossa t&auml;nne korpeenkin. Saunalahtikin tuossa juuri pari viikkoa sitten l&auml;hetti asiakaskirjeen, ett&auml; nyt saisi alle kahdella sadalla kuussa (ja ilmeisesti my&ouml;s maassa) kiinte&auml;t&auml;, mutta eip&auml; ole viel&auml; vastausta kuulunut kun kyselin, ett&auml; mitenk&auml;h&auml;n t&auml;nne Naaraj&auml;rvelle... Ei taida saada...</p>
						<p>Jossain vaiheessa Amiga Zonen alkutaipaleella, kun webist&auml; ei ollut viel&auml; tietoakaan ja modeemien nopeudet alkoivat kasvaa, ideoimme WWF-Readerin tekij&auml;n, Veli-Matti Linnun kanssa purkkisoftaa, joka tarjoaisi k&auml;ytt&auml;j&auml;lle graafisen, hiiriohjatun k&auml;ytt&ouml;liittym&auml;n, kun k&auml;ytett&auml;isiin sit&auml; varten suunniteltua terminaaliohjelmaa. Toiminnot tapahtuisivat hiiren klikkauksilla ja erilaiset valikot olisivat voineet koostua IFF-brusheista. Purkki voisi my&ouml;s l&auml;hett&auml;&auml; koodia ajettavaksi terminaalille, ja t&auml;ll&auml; tavoin l&auml;hes mik&auml; tahansa olisi mahdollista, esimerkiksi todella upeat online-pelit, joista varsinkin monilinjaisissa purkeissa voisi tulla supersuosittuja. Tiedostojen siirto onnistuisi kumpaankin suuntaan yht&auml;aikaa ja boxia voisi k&auml;ytt&auml;&auml; samalla, vaikkapa chattia toisten k&auml;ytt&auml;jien kanssa.</p>
						<p>Sitten tulikin web. Mit&auml; se tarjoaakaan? Graafisen k&auml;ytt&ouml;liittym&auml;n, jota klikkaillaan hiirell&auml;. Sit&auml; k&auml;ytet&auml;&auml;n varta vasten suunnitellulla terminaalilla (web browser). My&ouml;s ohjelmien ajo k&auml;ytt&auml;j&auml;n koneessa on mahdollista (Java). TCP/IP:n perusluonteeseen kuuluu ett&auml; asioita voi tehd&auml; yht&auml;aikaa. Omituista - haaveemme toteutui, joskaan ei ihan siin&auml; muodossa kuin odotimme.</p>
						<p>Niin my&ouml;s Sakusta ideoitiin graafista versiota. Jaskarin Amphibia taisi sekin olla hyvin l&auml;hell&auml; sit&auml;, millainen Saku nykyisyydess&auml;&auml;n on HTML- formaatissa. T&auml;m&auml;kin idea lopulta toteutui, mutta aivan erilaisena kuin sit&auml; alunperin kuviteltiin.</p>
						<p>Levykelehti on nopea lukea, mutta hidas luoda. Itse edesmenneen&auml; p&auml;&auml;toimittajana muutaman numeron ehdin kasata ja kyll&auml; siin&auml; tuhoton homma oli joka kerta. Nytkin kun teen kotiteatteriaiheista juttuani loppuun, t&auml;ytyy tehd&auml; hieman esity&ouml;t&auml; mm. kuvien kanssa jotta Anu voisi keskitty&auml; oleellisempaan eli oikolukuun ja muotoiluun. Pelkk&auml; kuvien paikalleen asettelu on melkoinen homma, puhumattakaan siit&auml; ett&auml; nykyaikaiset kuvat on aluksi konvertoitava 16-v&auml;risiksi ja sopivan kokoisiksi. Kuvista on teht&auml;v&auml; eri versiot HTML-levityst&auml; ja levykelehte&auml; varten.</p>
						<p>Yhteist&auml; uusille formaateille on se, ett&auml; peruskoneessa ne ovat hitaita. Peruskone tarvitsisi tekstipohjaisen formaatin. No, olihan viel&auml; hetki sitten AmigaGuide, mutta sekin on nyt kuollut pois. Kun nyt levyke-Saku loppuu, ei Amiga 500:lla ole en&auml;&auml; mahdollista lukea Sakua kovin k&auml;tev&auml;sti. Mutta kehitys kehittyy - lieneek&ouml; kell&auml;&auml;n en&auml;&auml; tosik&auml;yt&ouml;ss&auml; Amiga 500?</p>
						<p>Esa Heikkinen<br>
						<a href="mailto:oh4kju@sci.fi">oh4kju@sci.fi</a></td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
