<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Ajankohtaiset &gt; Uutiset &gt; Ohjelmistouutiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="#000066" vlink="#000066" alink="red" topmargin="0" marginheight="0">
		<center>
			<a name="TOP"></a><font size="1"><br>
			</font><font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="3"><b>Ohjelmistouutiset</b></font></td>
				</tr>
			</table>
			<br>
			[ <a href="amiga_uutisia.html" target="_self">Amiga nyt</a> ] [ <a href="amiga_uutisia.html" target="_self">Uutisia Amiga-maailmasta</a> ] [ <a href="laiteuutiset.html" target="_self">Laiteuutiset</a> ] [ </font><font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1" color="red">Ohjelmistouutiset</font><font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1"> ] [ <a href="paivitykset.html" target="_self">P&auml;ivitykset</a> ]<br>
			<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Taifun kehitteill&auml; AmigaOnelle</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<br>
							<a href="http://www.wk-artworks.de" target="_blank"><img src="kuvat/taifun/taifun.jpg" width="515" height="140" border="0"></a></center>
						<p><font face="Times New Roman,Georgia,Times" size="3">WK Artworks ja KDH Datentechnic ovat ilmoittaneet alottaneensa Taifun-nimisen video- ja animaatio-erikoisefektiohjelman kehityksen. Taifun on arvosteluissa monasti palkitun Wildfire 7 -PPC-ohjemiston seuraaja. Uutta tuotetta kehitet&auml;&auml;n parhaillaan k&auml;ytt&auml;en Amiga SDK:ta, ja kehitysty&ouml; on hyv&auml;ss&auml; vauhdissa. Yritysten johtohenkil&ouml;t ovat vakuuttuneita uuden AmigaOS:n mahdollisuuksista ja my&ouml;s siit&auml;, ett&auml; ohjelmistoa voidaan ajaa useissa laitteistoymp&auml;rist&ouml;iss&auml; - kiitos Amigan uuden k&auml;ytt&ouml;ymp&auml;rist&ouml;n laitteistoriippumattomuuden.<br>
						<br>
						&quot;Taifun on fantastinen esimerkki siit&auml; innovatiivisesta hengest&auml;, joka on synnynn&auml;ist&auml; Amiga-yhteis&ouml;ss&auml;. Me olemme ylpeit&auml;, kun voimme tukea Taifunin kehitysprosessia&quot;, kertoi Randy Hughes Amiga Inc.:lt&auml;.<br>
						<br>
						&quot;Olemme varmoja, ett&auml; Taifun kehittyy AmigaOne-tietokoneen &quot;killer application&quot; -tasolle. Investoimme Amigan tulevaisuuteen ja tunnemme, ett&auml; my&ouml;s monet muut yritykset aloittavat kehitysty&ouml;n tai nykyisten ohjelmistojen k&auml;&auml;nt&auml;misprosessin. T&auml;st&auml; syyst&auml; me suosittelemme eritt&auml;in paljon Amiga SDK:ta ja lis&auml;ksi yhteisty&ouml;t&auml; Amiga Inc.:n kanssa&quot;, sanoi Andreas Kuessner WK Artworksist&auml;.<br>
						<br>
						Taifunin julkaisup&auml;iv&auml; ajoittuu samoihin aikoihin kuin Amiga Inc.:n uusi AmigaOne-tietokone saadaan markkinoille. Taifun Lightin hinnaksi arvioidaan 100 euroa. Kalliimpi ammattilaisversio julkaistaan my&ouml;hemmin. Molempia versioita on tarkoitus kehitt&auml;&auml; aktiivisesti. Maailmanlaajuisesta jakelusta huolehtii KHD Datentechnic.<br>
						</font></p>
						<p><font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><font size="2" face="Times New Roman,Georgia,Times"><b>Lis&auml;tiedot:<br>
						<a href="http://www.wk-artworks.de" target="_blank">www.wk-artworks.de</a></b></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Haage &amp; Partner uudisti ArtEffect Workshopin</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<a href="http://www.haage-partner.com/arteffect/workshop/index.htm" target="_blank"><img src="kuvat/webshots/arteffect_workshop.gif" width="298" height="230" border="0"></a></center>
						<div align="left">
							<p>Arteffect Workshop sis&auml;lt&auml;&auml; 12 jaksoa, joissa k&auml;sitell&auml;&auml;n ArtEffectin uusimman version eri toimintoja yksityiskohtaisesti. <font face="Times New Roman,Georgia,Times">
							<hr noshade size="1" color="#b0c4de">
							</font><a href="http://www.haage-partner.com/arteffect/workshop/index.htm" target="_blank"><font size="2" face="Times New Roman,Georgia,Times"><b>ArtEffect Workshop</b></font></a></div>
					</td>
				</tr>
			</table>
			<br>
			<a name="Anchor--windows"></a>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>P&auml;ivitetty SDK Windowsille ja Linuxille</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">Gary Peake kertoi Amiga-Open-postituslistalla Amiga SDK:n Windows-version tilanteesta. H&auml;nen mukaansa ensimm&auml;inen versio Windowsin alaisuudessa toimivasta SDK:sta on l&auml;hes valmis. Tuote on testattavana laadunvalvonnassa ja arvioiden mukaan Windows-SDK valmistuu lokakuun puoliv&auml;lin tienoilla. Linux-version omistajille valmistuu ilmainen p&auml;ivitys samaan aikaan, jolloin molemmat versiot pysyv&auml;t samassa tahdissa.<br>
						<br>
						Lis&auml;ksi Bill McEwen kertoi viimeisimm&auml;ss&auml; kirjeess&auml;&auml;n Amiga-yhteis&ouml;lle, ett&auml; p&auml;ivitettyyn SDK-pakettiin kuuluu uusia teknologioita, kuten <a href="http://www.amiga.com/press/zine/8-1-00/Mesa/" target="_blank">Mesa</a> (OpenGL:&auml;&auml;n perustuva 3D-API), SSEYO Koan Audio Engine ja streemaus. Lis&auml;ksi uutuuksiin kuuluu paremmat kehitysty&ouml;kalut, rikkaampi AVE ja parannettu suorituskyky.<br>
						</font><font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.amiga.com/corporate/100900-mcewen.shtml" target="_blank"><font size="2" face="Times New Roman,Georgia,Times"><b>Executive Update<br>
						<br>
						</b></font></a><font face="Times New Roman,Georgia,Times" size="3"><b>SSEYO Koan Audio?</b><br>
						Kyseess&auml; on perusteellinen &auml;&auml;nenhallintakirjasto ja -moottori, joka mahdollistaa kehittyneiden &auml;&auml;niefektien luomisen spotti-sampleista musiikkiin. Erikoisuutena on mm. s&auml;&auml;nt&ouml;pohjaiset generoidut &auml;&auml;nimaailmat. Teknologiaan on lis&auml;ksi integroitu digitaalinen/analoginen syntetisaattori. Sen avulla voidaan luoda &auml;&auml;nt&auml; kapeakaistaisille yhteyksille, jopa 1 kb:n kokoisien tiedostojen avulla. Lis&auml;ksi kehitt&auml;j&auml;t voivat j&auml;rjestelm&auml;n avulla lis&auml;t&auml; syntetisaattori&auml;&auml;ni&auml; ja MPEG-3 samplej&auml; MIDI-raitoihin. Lis&auml;ksi on mahdollista lis&auml;t&auml; monipuolisia efekteja k&auml;yt&ouml;ss&auml; oleviin MPEG-3 sampleihin.<br>
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.tao-group.com/2/tao/press/20000127-koan.html"><font face="Times New Roman,Georgia,Times" size="2"><b>Lis&auml;tietoja</b></font></a></td>
				</tr>
			</table>
			<br>
			<a name="Anchor-10920"></a>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>IBM Developer Worksissa artikkeli SDK:sta</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">Amiga Inc.:n<i> </i>SDK (Software Development Kit) on saanut laajaa huomiota mediassa, eik&auml; syytt&auml;. Paketti on onnistunut ja toimiva, kunhan sen ensin alkuhankaluuksien j&auml;lkeen saa asennettua Linuxiin. SDK:n toimivuutta on kiitelty, vaikkakin ensimm&auml;isest&auml; versiosta puuttui kokonaan &auml;&auml;ni ja natiivi 3D-tuki Matroxin G400-n&auml;ytt&ouml;kortille. Amiga SDK tuo my&ouml;s lis&auml;arvoa Linux-k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n ja sen ohjelmistokehitt&auml;jille.</font>
						<center>
							<p><a href="http://www-4.ibm.com/software/developer/library/amiga2/index.html?dwzone=linux" target="_blank"><font face="Times New Roman,Georgia,Times" size="3"><img src="kuvat/webshots/ibm.jpg" width="298" height="227" border="0"></font></a></p>
						</center>
						<p><font face="Times New Roman,Georgia,Times" size="3">Daniel Robbins Gentoo Technologiesilta tutustui Amigan SDK-pakettiin, ja seuraavassa otteita h&auml;nen kokemuksistaan:<br>
						* Uusi Amigan arkkitehtuuri on radikaalisti erilainen perinteisiin k&auml;ytt&ouml;j&auml;rjestelmiin verrattuna, sill&auml; vain Amiga pystyy tarjoamaan t&auml;yden bin&auml;&auml;riyhteensopivuuden eri arkkitehtuurien v&auml;lill&auml;, ilman ett&auml; ohjelmien suoritusnopeus k&auml;rsii.<br>
						* SDK:n mukana tulevat demot kertovat paljon j&auml;rjestelm&auml;n nopeudesta ja toimivuudesta. Mukana on mm. TrueType- ja PostScript-fonttien esittelydemo, joka my&ouml;s pehment&auml;&auml; fonttien reunat. Lis&auml;ksi l&auml;pin&auml;kyv&auml;t ikkunat ja alpha-sekoitusta hy&ouml;dynt&auml;v&auml;t demot tekev&auml;t vaikutuksen. SDK:sta puuttuu t&auml;ss&auml; vaiheessa kokonaan Amigan k&auml;ytt&ouml;liittym&auml;, koska sit&auml; ei ehditty saada valmiiksi t&auml;h&auml;n ensiversioon.<br>
						* Suorituskyvyst&auml; kertoo jotakin se, ett&auml; SDK k&auml;ynnistyy l&auml;hes v&auml;litt&ouml;m&auml;sti. T&auml;m&auml; tulee ilmeisesti olemaan yksi t&auml;rkeimmist&auml; ominaisuuksista Amiverse-k&auml;ytt&ouml;ymp&auml;rist&ouml;ss&auml;, sen halutaan olevan k&auml;ytt&ouml;valmis hetkess&auml; ilman odottelua.<br>
						* T&auml;rkein teknologinen piirre uudessa Amigan k&auml;ytt&ouml;ymp&auml;rist&ouml;ss&auml; on ohjelman latauksen aikana tapahtuva prosessi, jolloin yleinen VP-koodi (Virtual Processor) k&auml;&auml;nnet&auml;&auml;n kulloinkin k&auml;yt&ouml;ss&auml; olevan laitteiston prosessorille sopivaksi. T&auml;m&auml; on huomaamaton vaihe, joka jopa nopeuttaa ohjelmien lataamista, koska yleens&auml; VP-koodi menee pienemp&auml;&auml;n tilaan kuin esim x86-prosessorille tehty natiivi koodi. Systeemi toimii erinomaisesti ja esimerkiksi demo-ohjelmat toimivat nopeasti ilman ett&auml; k&auml;&auml;nn&ouml;sprosessi aiheuttaisi havaittavaa suoritustehontehon laskua.<br>
						* Bin&auml;&auml;riyhteensopivuus voi radikaalisti muuttaa esimerkiksi Linuxin suosiota positiiviseen suuntaan. Esimerkiksi Amigan j&auml;rjestelm&auml;&auml; tukeva peli, joka toimii Windowsissa toimii my&ouml;s sellaisenaan Linuxissa. T&auml;m&auml; avaa aivan uusia mahdollisuuksia, koska Linuxin suosio on kasvanut jatkuvasti.<br>
						* Amigan k&auml;ytt&ouml;j&auml;rjestelm&auml;n toimivuus eri laiteymp&auml;rist&ouml;iss&auml; mahdollistaa sen, etteiv&auml;t Amiga-tietokoneet ole riippuvaisia tietyst&auml; prosessorista. N&auml;in esim. jokainen uusi Amiga voi toimia sen hetken parhaalla prosessorilla, ja siten j&auml;rjestelm&auml; pysyy jatkuvasti kehityksen k&auml;rjess&auml;.<br>
						</font><font face="Times New Roman,Georgia,Times" size="3">* Amigan SDK:n ensimm&auml;inen versio on tarkoitettu uuden Amiga-k&auml;ytt&ouml;ymp&auml;rist&ouml;n opetteluun ja niille, jotka haluavat heti aloittaa ohjelmoinnin uudelle j&auml;rjestelm&auml;lle. N&auml;ihin kuuluvat l&auml;hinn&auml; Classic Amiga -ohjelmistokehitt&auml;j&auml;t ja pelivalmistajat. Uusien versioiden my&ouml;t&auml; SDK:n k&auml;ytett&auml;vyys lis&auml;&auml;ntyy huomattavasti ja se soveltuu paremmin perus ohjelmoijalle ja harrastajille.</font>
						<hr noshade size="1" color="#b0c4de">
						<font size="2" face="Times New Roman,Georgia,Times"><b>Lis&auml;tiedot:<br>
						<a href="http://www-4.ibm.com/software/developer/library/amiga2/index.html?dwzone=linux" target="_blank">IBM DeveloperWorks: The new Amiga SDK</a></b></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Amiga SDK -saitti avattu</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">100% ep&auml;virallinen Amiga SDK -sivusto on laaja tietol&auml;hde SDK:sta, Amigan SDK-tukiohjelmista, asennuksesta ja t&auml;h&auml;n asti valmistuneista ohjelmista jne. Mukana on my&ouml;s ruutukaappauksia ja ratkaisuja erilaisten Linux-jakelupakettien aiheuttamiin ongelmiin.</font> <font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.amigasdk.com" target="_blank"><font size="2" face="Times New Roman,Georgia,Times"><b>www.amigasdk.com</b></font></a></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							Amigan SDK-tukiohjelma</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">Tukiosaston johtaja Gary Peake on tuonut julkisuuteen tietoja Amigan SDK-tukiohjelmasta. Ohjelmistokehitt&auml;jien tukeen kuuluu nelj&auml; eri tasoa, perustason tuki tulee ostetun ja rekister&ouml;idyn SDK-paketin mukana. Muut saa hankkimalla Amigan hyv&auml;ksym&auml;n virallisen developer-koneen tai ostamalla tukipalveluita.<br>
						<br>
						<b>Ohjelmoijien koulutus<br>
						</b>Kehitt&auml;jien konferensseja ja koulutustilaisuuksia aiotaan pit&auml;&auml; vuosittain nelj&auml; kappaletta, joista kaksi eri puolilla maailmaa ja kaksi Amigan p&auml;&auml;majassa, Snoqualmiessa. Lis&auml;ksi Amiga suunnittelee kymmenosaisen kirjasarjan julkaisemista (n. 29,95 USD/kpl), joka keskittyy mm. Virtual Processor -ohjelmointiin.<br>
						<br>
						<b>Sertifiointi<br>
						</b>Amiga tarjoaa asiasta kiinnostuneille ohjelmistokehitt&auml;jille erityist&auml; sertifiointia, jonka saavuttamiseen tarvitaan Amigan laadunvalvonnan kehitystuen hyv&auml;ksynt&auml;. Kun sertifikaatti on my&ouml;nnetty, Amiga tukee kyseist&auml; tuotetta laajemmin, esim. auttaa markkinoinnissa ja antaa mahdollisuuden Amiga-tavaramerkkien ja -logojen k&auml;ytt&ouml;&ouml;n tuotteessa.<br>
						<br>
						<b>Web-pohjainen tuki<br>
						</b>NDA:n (Non Disclosure Agreement) allekirjoittaneet kehitt&auml;j&auml;t voivat keskustella IRCiss&auml; Fleecy Mossin, Bill McEwenin yms. kanssa. Lis&auml;ksi erityinen suljettu keskustelualue avataan kehitt&auml;jien webbisivusolle.</font> <font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.amigasdk.com/support.htm" target="_blank"><font size="2" face="Times New Roman,Georgia,Times"><b>Lis&auml;tietoja</b></font></a></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Innovative julkisti tulevaisuuden suunnitelmansa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">fxPAINT-, fxSCAN-, VHI Studio- ja Ultraconv-ohjelmista tuttu Innovative julkaisi tulevaisuuden suunnitelmansa lehdist&ouml;tiedotteessa. Innovative ei jatkossa ole pelk&auml;st&auml;&auml;n Amigalle ohjelmia valmistava yritys, vaan se laajentaa osaamistaan my&ouml;s muille markkina-alueille. Innovative ei my&ouml;sk&auml;&auml;n n&auml;e Amiga SDK:n olevan varmuus siit&auml;, ett&auml; Amiga-tietokoneet ja k&auml;ytt&ouml;j&auml;rjestelm&auml;t s&auml;ilyisiv&auml;t markkinoilla tulevaisuudessa.<br>
						<br>
						FXScan 3.0 -sovelluksen julkaisun j&auml;lkeen Innovative tulee ty&ouml;skentelem&auml;&auml;n intensiivisesti kehitt&auml;m&auml;ns&auml; uuden teknologian parissa (koodinimi: InNT). Ohjelmat, jotka kehitet&auml;&auml;n t&auml;m&auml;n uuden teknologian avustuksella, ovat mukavampia k&auml;ytt&auml;&auml; ja ne on my&ouml;s helpompi k&auml;&auml;nt&auml;&auml; eri k&auml;ytt&ouml;j&auml;rjestelmille ja prosessoreille. K&auml;&auml;nn&ouml;sprosessin odotetaan viev&auml;n vain muutaman p&auml;iv&auml;n (Vrt. Amiga VP-koodi :), mink&auml; ansiosta kehitysaika ja kustannukset voidaan saada minimoitua. Heti kun ensimm&auml;inen versio uudesta teknologiasta saadaan valmiiksi, Innovative alkaa k&auml;&auml;nt&auml;&auml; ohjelmiaan eri k&auml;ytt&ouml;j&auml;rjestelmille kuten Windowsille ja Linuxille. Suunnitelmissa on my&ouml;s teknologian mahdollinen lisensoiminen, mutta t&auml;st&auml; ei ole tehty viel&auml; lopullista p&auml;&auml;t&ouml;st&auml;.<br>
						<br>
						Innovativen uusi teknologia (jossa ohjelmakoodi ja GUI on eriytetty toisistaan) ei todenn&auml;k&ouml;isesti toimi k&auml;ytt&ouml;kelpoisilla nopeuksilla 68k/PPC-prosessoreilla varustetuissa Amigoissa, mutta MorphOS ja APUS Linux -k&auml;ytt&ouml;j&auml;rjestelmien hy&ouml;dynt&auml;mist&auml; tutkitaan. Amigan uutta Amiverse-k&auml;ytt&ouml;ymp&auml;rist&ouml;&auml; tuetaan heti kun se julkaistaan markkinoille. Classic Amiga -malleille Innovativen tuki tulee siis v&auml;hentym&auml;&auml;n merkitt&auml;v&auml;ti, ainoastaan p&auml;ivityksi&auml; tullaan julkaisemaan nykyisiin ohjelmiin, mutta ei niit&auml;k&auml;&auml;n yht&auml; intensiivisesti kuin ennen.<br>
						<br>
						<b>fxSCAN 3.0<br>
						</b>fxSCAN-skannausohjelma on nyt kehittynyt versioon 3.0 saakka. Se on huomattava p&auml;ivitys edelliseen versioon verrattuna. Uusia ominaisuuksia mm.:<br>
						* &auml;lyk&auml;s OCR (Optical Character Recognition) -moottori<br>
						* tuki BetaScan-ajureille<br>
						* k&auml;tev&auml; Copymachine-kopiointi-toiminto<br>
						* uusi k&auml;ytt&ouml;liittym&auml;<br>
						* JPEG-kuvat voidaan ladata nopeammin PPC-tuen avulla<br>
						* Hinta: 35 euroa</font> <font face="Times New Roman,Georgia,Times" size="3"><br>
						</font><font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.innovative-web.de/cgi-bin/inno-ecomm.pl/innovative" target="_blank"><font size="2" face="Times New Roman,Georgia,Times"><b>Lis&auml;tiedot Innovativen kotisivuilta</b></font></a></td>
				</tr>
			</table>
			<font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1"><br>
			<a name="Anchor-8416"></a></font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>StormC:st&auml; uusi versio</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3">Uusi <i>StormC 4</i> -kehitysj&auml;rjestelm&auml; on askel eteenp&auml;in kohti uutta AmigaOS:i&auml;. T&auml;ll&auml; hetkell&auml; kaikki ohjelmat toimivat normaalisti Classic Amigalla, mutta StormC:ss&auml; on panostettu siihen, ett&auml; tuotetut ohjelmat voidaan jatkossa helposti k&auml;&auml;nt&auml;&auml; tuleville Amiga-k&auml;ytt&ouml;j&auml;rjestelmille. T&auml;rke&auml; lis&auml;ys StormC:hen on verkon tuki, esimerkiksi nyt on mahdollista tiimiss&auml; ty&ouml;skennell&auml; ohjelmointiprojektin parissa. CVS:n (Concurrent Versions System) avulla useat ohjelmistokehitt&auml;j&auml;t voivat ty&ouml;skennell&auml; projektissa tai l&auml;hdekoodin parissa yht&auml; aikaa ja raportoida muutoksista kontrolloidusti. StormC n&auml;ytt&auml;&auml; projektin versionumeron, tiedostojen statuksen ja v&auml;rikoodaa tiedostot, joiden kanssa voi olla ongelmia. Lis&auml;ksi jaettu Make-komento mahdollistaa sen, ett&auml; useat koneet verkossa voivat k&auml;&auml;nt&auml;&auml; samaa projektia. StormC l&ouml;yt&auml;&auml; automaattisesti verkosta k&auml;ytt&auml;m&auml;tt&ouml;m&auml;t tietokoneet ja siirt&auml;&auml; ty&ouml;taakan niihin. Valmiiden ohjelmien dokumentointiin paketista l&ouml;ytyy erityinen StormDOC, jonka avulla ToDo-listat, bugiraportit ja muu dokumentointi sujuu k&auml;tev&auml;sti. Mukana on my&ouml;s kattava Online-Help systeemi, parannettu debuggeri ja paljon muuta. Julkaisuajankohdan Haage &amp; Partner on sijoittanut lokakuulle 2000. </font><font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><a href="http://www.haage-partner.com/news/news_20000828_e.htm" target="_blank"><font size="2" face="Times New Roman,Georgia,Times"><b>Haage &amp; Partner -uutiset</b></font></a></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Epic Marketing uudistuu, Classic-tuki ep&auml;varmaa jatkossa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Saksalainen Epic Marketing sulkee ovensa syyskuun lopussa, ja lokakuun alussa avataan kaksi uutta Epic-yrityst&auml;. <i>Epic Interactive Entertainment Software</i> panostaa p&auml;&auml;asiallisesti uusien huipputason pelien julkaisuun Apple Macintoshille, kuitenkin Simon The Sorcerer 2, Earth 2140 ja Dafel : Bloodline kehitet&auml;&auml;n ja julkaistaan viel&auml; Classic-markkinoille. Edell&auml;mainittujen pelien myynti vaikuttaa p&auml;&auml;t&ouml;kseen, jatketaanko Classic-linjan tukea tulevaisuudessa.<font face="Times New Roman,Georgia,Times" size="3"> AmigaOne ja Atari Milan -tietokoneita tuetaan, jos ne ilmestyv&auml;t markkinoille. <i>Epic Multimedia</i> taasen julkaisee pelej&auml; ja multimediatuotteita Macintoshille, Windowsille, Linuxille, AmigaOnelle ja Atari Milanille.<br>
						</font><font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><font size="2" face="Times New Roman,Georgia,Times"><b>Lis&auml;tiedot:<br>
						<a href="http://www.epicinteractive.de" target="_blank">www.epicinteractive.de</a></b></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Sender auttaa tiedostojen k&auml;sittelyss&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Times New Roman,Georgia,Times" size="3"><i>Sender v1.0</i> on verrattavissa Windowsin &quot;avaa sovelluksessa&quot;-toimintoon. Amiga &quot;k&auml;&auml;nn&ouml;ksess&auml;&quot; asia on hoidettu k&auml;ytt&ouml;j&auml;rjestelm&auml;n AppIcon-systeemill&auml;. Kun Sender k&auml;ynnistet&auml;&auml;n Amigassa, Workbenchiin ilmestyy ikoni, jonka p&auml;&auml;lle voi pudottaa tiedostoikonin. Sen j&auml;lkeen esiin tulee erityinen ikkuna, josta voi valita, miss&auml; ohjelmassa tiedosto avataan.<br>
						</font><font face="Times New Roman,Georgia,Times">
						<hr noshade size="1" color="#b0c4de">
						</font><font size="2" face="Times New Roman,Georgia,Times"><b>Lis&auml;tiedot:<br>
						<a href="http://www.trogsoft.uklinux.net/new/download/dl.cgi?p=sender">Lataa Sender v1.0</a></b></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
							<table border="0" cellpadding="0" cellspacing="2" height="20" align="right">
								<tr>
									<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
								</tr>
							</table>
							</b></font><font color="black" face="Times New Roman,Georgia,Times" size="3"><b>Lataa QNX-k&auml;ytt&ouml;j&auml;rjestelm&auml; ilmaiseksi</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<a href="http://get.qnx.com" target="_blank"><img src="kuvat/webshots/qnx.jpg" width="298" height="195" border="0"></a></center>
						<div align="left">
							<p><i>QNX Realtime Platform</i> on perinteisen k&auml;ytt&ouml;j&auml;rjestelm&auml;n ja reaaliaikak&auml;ytt&ouml;j&auml;rjestelm&auml;n risteytys<font face="Times New Roman,Georgia,Times" size="3">. Se on my&ouml;s modulaarinen, pienikokoinen ja tehokas. Paketti asentuu omaan erilliseen kovalevyn osioon tai Windowsiin tiedostona. Muista tarkistaa tuetut laitteistot <a href="http://qdn.qnx.com/support/hardware/platform/index.html" target="_blank">virallisilta QNX:n sivuilta</a>, allekirjoittaneen laitteistossa QNX ei suostunut useista yrityksist&auml; huolimatta k&auml;ynnistym&auml;&auml;n.</font></p>
						</div>
						<p>
						<hr noshade size="1" color="#b0c4de">
						<font size="2" face="Times New Roman,Georgia,Times"><b>QNX:n lataussivu:<br>
						<a href="http://get.qnx.com" target="_blank">get.qnx.com</a></b></font></td>
				</tr>
			</table>
			<br>
			<font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1">[ <a href="#TOP" target="_self">Sivun alkuun</a> ] [ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
			<br>
			</font></center>
	</body>

</html>
