<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses2.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses4.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

3. Programmiersprache JForth als Freeware ver&ouml;ffentlicht

&raquo;Presse-Ver&ouml;ffentlichung, 21.00 Uhr, Montag, 10. August 1998


May the Forth be with you...Always !!!

(Un&uuml;bersetzbares Wortspiel mit dem Zitat aus &quot;Krieg der Sterne&quot;:
May the force be with you...Always !!!
M&ouml;ge die Macht mit dir sein...Immer!
Forth = Programmiersprache, force = St&auml;rke, Macht)


Anpassung an OS3.1

Mit besonderem Dank an die urspr&uuml;nglichen Autoren, Mike Haas und Phil Burk,
die gro&szlig;herzig entschieden haben, dieses Produkt (fr&uuml;herer Preis $179) als
Freeware herauszugeben, hat der Amiga nun einen weiteren Pfeil in seinem
K&ouml;cher.

***** HINWEIS - Drucken Sie das ausgezeichnete Handbuch aus. Es bietet
Ihnen nicht nur unsch&auml;tzbare Informationen &uuml;ber die mitgelieferten
Hilfsprogramme, sondern es enth&auml;lt auch ein sehr gutes 3-stufiges
Lernprogramm *****

***** Kommen Sie zur JForth Mailinglist!!! Um sich anzumelden, senden Sie
eine E-Mail an &quot;<a href="mailto:MDaemon@ChaosSolutions.com">MDaemon@ChaosSolutions.com</a>&quot; mit &quot;subscribe JForth-list&quot; als
einzige Zeile im Textbereich (ohne Anf&uuml;hrungszeichen) *****


Um was handelt es sich denn?

JForth ist eine Programmiersprache, die es Ihnen erlaubt, mit Ihrem Amiga
zusammenzuarbeiten. Wenn Sie in JForth programmieren, sind Sie &quot;innerhalb&quot;
der Sprache. Sie haben von der Tastatur aus Zugriff zu jeder Datenstruktur,
k&ouml;nnen jede Routine testen oder irgendein Entwicklungshilfsmittel 
verwenden. Diese direkte Verbindung zum Computer erh&ouml;ht Ihre Produktivit&auml;t
und gibt Ihnen dadurch zus&auml;tzliche Zeit, die Qualit&auml;t Ihrer Software zu
verbessern. JForth beruht auf dem Standard f&uuml;r die Sprache Forth aus dem
Jahre 1983. Forth war zun&auml;chst von Charles Moore konzipiert worden, als er
erwas Neues brauchte, um Fernrohre zu kontrollieren. Er entwickelte eine
Sprache, die auf einer Zusammenfassung von Worten, einem W&ouml;rterbuch,
beruhte. Dieses W&ouml;rterbuch kann durch Schreiben neuer Worte, die auf
vorhandenen aufbauen, erweitert werden. Seit der Originalversion von Mr.
Moore wurde Forth f&uuml;r nahezu jeden Computertyp &uuml;bersetzt, vom gr&ouml;&szlig;ten Ger&auml;t
bis zum kleinsten Mikrocomputer. Da ein Minimalsystem von Forth in nur ein
paar Kilobytes Speicher eingerichtet werden kann, wird es oft in
Einbaucomputern von Prozesssteuerungen und Arbeitsmaschinen verwendet.
Forth ist jedoch genauso gut f&uuml;r gr&ouml;&szlig;ere, fortschrittliche Computer, wie
den Amiga, geeignet. Forth ist eine sehr flexible Sprache und kann an
gr&ouml;&szlig;ere Rechner angepasst werden, ohne dass man den &quot;Geschmack&quot; der
Originalsprache verliert. JForth ist eine Anpassung von Forth, die
besonders f&uuml;r den Commodore Amiga entworfen wurde. JForth verwendet einen
32-Bit-Stack und kompiliert direkt in Maschinensprache des 68000. Dadurch
wird JForth schneller als die meisten Forth-Dialekte. JForth bietet auch
einen breiten Satz von Werkzeugen, um auf die besonderen Eigenschaften des
Amiga zugreifen zu k&ouml;nnen. Sie k&ouml;nnen jede Library-Routine mit Namen
aufrufen und sich auf jede Amiga-Struktur beziehen, indem Sie
Datenstrukturen &auml;hnlich wie in 'C' verwenden. JForth besitzt auch einige
besondere Hilfsmittel, die einfache Grafiken, Intuition-Men&uuml;s, IFF-Dateien
und andere Amiga-Eigenschaften unterst&uuml;tzen. Diese Hilfsmittel k&ouml;nnen
direkt zur Vereinfachung Ihrer Amiga-Programmierung eingesetzt werden. Die
Quellcodes aller dieser Hilfsmittel stehen zur Verf&uuml;gung, so dass Sie sie 
an Ihre Bed&uuml;rfnisse anpassen oder sie als Lernbeispiele f&uuml;r die
Amiga-Programmierung verwenden k&ouml;nnen. JForth bietet auch mehr als ein
Dutzend kleiner Beispielprogramme f&uuml;r jene, die so wie ich am besten aus
Beispielen lernen. JForth erlaubt auch Dinge zu tun, die einmalig in der
Forth-Geschichte sind, wovon das Eindruckvollste wohl CLONE ist. Mit diesem
au&szlig;ergew&ouml;hnlichen Hilfprogramm k&ouml;nnen Sie eine eigenst&auml;ndige Version Ihres
Programm von minimaler Gr&ouml;&szlig;e erzeugen.


Aufrufe der Amiga-Libraries - JForth bietet ein System, um beliebige
Routinen jeder Amiga-Library mit Namen aufrufen zu k&ouml;nnen. Es ermittelt, in
welche Register des 68000 die Parameter geschrieben werden und erstellt den
passenden Code. So k&ouml;nnen Sie leicht die Parameter an den Stack in der
Reihenfolge &uuml;bergeben, wie sie in der Amiga-Dokumentation beschrieben sind.
Eine Anzahl von Hilfen wurden zur Unterst&uuml;tzung spezieller Teile von
Amiga-Libraries geschrieben, darunter sind EZMENUS, Graphics, das Serial
Device, ANSI-Codes und viele weitere.

Unterst&uuml;tzung der Amiga-Strukturen - JForth bietet Gleichwertiges f&uuml;r alle
&quot;.h&quot;-Include-Dateien von &quot;C&quot;. Diese &quot;.j&quot;-Dateien definieren alle
notwendigen Strukturen und Konstanten, um Informationen an die Routinen der
Amiga-Libraries &uuml;bergeben zu k&ouml;nnen. Strukturen k&ouml;nnen interaktiv f&uuml;r das
Debugging durch Verwendung von DST ausgegeben werden, wobei alle Elemente
mit Namen und Wert dargestellt sind. Angepasst an OS3.1!

ARexx-Unterst&uuml;tzung - ARexx ist eine Sprache, die unterschiedlichen
Anwendungen die Kommunikation miteinander erm&ouml;glicht. Zum Beispiel k&ouml;nnte
ein Rechenblatt-Programm (spread sheet) mit einer Datenbank
zusammenarbeiten. Diese Arbeitsmittel helfen Ihnen, ARexx-kompatible
Programme zu schreiben.

Assembler - JForth unterst&uuml;tzt zwei verschiedene Assembler, einen mit
umgekehrter polnischer Notation (Reverse Polish Notation = RPN) und einen
mit einer Syntax &auml;hnlich Motorola. Der RPN-Assembler kann zur Erzeugung von
Macros verwendet werden, aber der Motorola-Assembler ist leichter zu lesen.
Dazu gibt es auch einen Disassembler.

Block-Unterst&uuml;tzung und SCRED - F&uuml;r alle, die die &quot;altmodische&quot; BLOCK- oder
SCREEN-Arbeitsumgebung vorziehen, bieten wir LIST, LOAD und den &uuml;blichen
Zeileneditor. Wir haben aber auch einen WYSIWYG SCREEN Editor, den wir
SCRED nennen. (Wir empfehlen die Verwendung normaler Textdateien mit
JForth.)

CLONE - CLONE k&ouml;nnen Sie zur Erzeugung kleiner, ausf&uuml;hrbarer Abbilder
(images) Ihres JForth-Programmes verwenden. CLONE &uuml;bernimmt das kompilierte
JForth-Programm, entnimmt alle Befehle und Daten, die zum Ablaufen des
Programms ben&ouml;tigt werden und reassembliert eine kleinere Version davon.
Alle JForth-Entwicklungshilfen, die Namensfelder und Verbindungsfelder
(link fields) und alle anderen unbenutzten Worte werden zur&uuml;ckgelassen. Die
endg&uuml;ltige Abbild-Gr&ouml;&szlig;e ist vergleichbar mit solchen, die mit einem
C-Kompiler und -Linker erzeugt werden. Abbilder k&ouml;nnen mit einer
Symbol-Tabelle gespeichert werden, um (falls n&ouml;tig) WHACK oder einen
anderen Debugger anwenden zu k&ouml;nnen. Der JForth Source Level Debugger
(Debugger auf Quell-Ebene) kann ebenfalls mit geCLONEten Programmen ben&uuml;tzt
werden. Die meisten Programme CLONEn ohne &Auml;nderungen, wenn ein paar
einfache Regeln bez&uuml;glich der Runtime-Initialisierung von Variablen oder
Arrays, die Forth-Adressen enthalten, befolgt werden.

Debugger - JForth bietet einen Quellcode-Debugger, mit dem Sie in
Einzelschritten Ihren Code durchlaufen k&ouml;nnen. Bei jedem Schritt sehen Sie
den Inhalt des Stacks. Sie k&ouml;nnen auch den R&uuml;ckgabe-(return-)Stack pr&uuml;fen,
den Speicherinhalt ausgeben, Breakpunkte setzen, die Ausf&uuml;hrung
kontrollieren und sogar Forth-Befehle eingeben.

Gleitpunkt-Rechnung (Floating point) - JForth unterst&uuml;tzt sowohl Fast
Floating Point mit einfacher Genauigkeit als auch den IEEE-Standard mit
doppelter Genauigkeit. Diese Worte sind konform mit dem Forth Vendors Group
Standard (Standard der Forth Verk&auml;ufer-Gruppe).

IFF-Unterst&uuml;tzung - JForth bietet Allzweck-Hilfsmittel zum Lesen und
Schreiben von IFF-Dateien. Es enth&auml;lt auch eine Werkzeugsammlung
besonders zur Bearbeitung von ILBM-Grafikdateien. Damit k&ouml;nnen Sie Bilder,
Bildausschnitte (brushes), Animationen und Ausschnitte von Animationen
(anim brushes) in Ihr Programm einbauen. JForth bietet Ihnen auch
Hilfsmittel f&uuml;r die Darstellung von Animationen und Pr&auml;sentationen, wie
Blitten, Wischblenden, Ein- und Ausblenden, usw. M&auml;chtige grafische und
Animationsprogramme k&ouml;nnen mit diesen Hilfen geschrieben werden.

Lokale Variablen - Lokale Variablen k&ouml;nnen die Definitionen komplexer Worte
durch den Wegfall vieler Stack-Bearbeitungen vereinfachen. Lokale Variablen
sind schnelle direkt&uuml;bernehmende (self fetching) Variablen, mit denen man
r&uuml;ckgekoppelte sich wiederholende (reentrant recursive) Befehlsabl&auml;ufe
schreiben kann. Durch die Verwendung von regul&auml;ren VARIABLEn kann man ein
Wort nicht-reentrant machen.

Module - Die vorkompilierten Module von JForth bieten eine Methode, um
schnell auf Codes zugreifen zu k&ouml;nnen, die w&auml;hrend der Kompilation ben&ouml;tigt
werden. Das schlie&szlig;t die Assembler, den Disassembler und die Amiga-Include-
Dateien mit ein. Diese Module werden dynamisch mit dem W&ouml;rterbuch 
verkn&uuml;pft, wenn sie gebraucht werden. Dadurch nehmen sie keinen Platz im
normalen W&ouml;rterbuch weg, stehen aber sofort zur Verf&uuml;gung.

Mehrfach-Standards - Dieses System erlaubt Ihnen, zwischen JForth und den
wichtigen Standards - FIG, '79 und '83 - hin- und herzuschalten. Das ist
angenehm zum Kompilieren von Codes, die mit einem anderen Forth geschrieben
wurden. An einem ANSI-kompatiblen Modul wird gearbeitet.

ODE - ODE (Object Oriented Development Environment) ist eine
objektorientierte Arbeitsumgebung f&uuml;r Entwicklung mit &auml;hnlicher Grundidee
wie SmallTalk. Sie k&ouml;nnen Klassen intelligenter Datenstrukturen entwickeln
und so viele Kopien dieser Strukturen anfertigen, wie gebraucht werden.
Diese Technik kann die Programmierung au&szlig;erordentlich vereinfachen, weil es
leichter wird, wiederverwendbaren Code zu schreiben.

Profiler - Dieses Werkzeug &uuml;berwacht den Ablauf eines Programms um
herauszufinden, wo es seine Zeit verbringt. Die meisten Programme
verbrauchen die meiste Zeit in einem kleinen Bereich ihres Codes. Durch das
Erkennen dieser Stellen kann man den Aufwand bei der Optimierung darauf
b&uuml;ndeln, wo es am Notwendigsten ist.

Textra - ist ein m&auml;chtiger, aber leicht benutzbarer Texteditor mit mehreren
Fenstern, der f&uuml;r Programmierer entworfen wurde. Er ben&uuml;tzt die Maus, um
den Text auszuw&auml;hlen, und erlaubt Ausschneiden (Cut), Kopieren (Copy) und
Einsetzen (Paste) von Fenster zu Fenster. Er hat auch ARexx-Anschluss, mit
dem Sie vorbereitete (oder selbst verfasste) Makros (.textra-Dateien) zur
Textbearbeitung heranziehen k&ouml;nnen. Textra arbeitet mit JForth zusammen,
so dass Sie direkt aus dem Editor heraus kompilieren k&ouml;nnen. Wenn w&auml;hrend
der Kompilierung ein Fehler erkannt wird, macht ihn Textra kenntlich,
so dass er schnell korrigiert werden kann.

Tutorials (Lehrprogramme) - F&uuml;hrungen f&uuml;r Anf&auml;nger, Ge&uuml;bte und
Fortgeschrittene leiten Sie durch die grundlegenden Dinge des Systems.

Verschiedene Hilfsmittel zur Fehlersuche - Anzeigeteile (Showhunks) zur
Analyse von Amiga-Bin&auml;rdateien, grafische Hilfen f&uuml;r Animationen und
Ausschnitte davon.


... und noch viel mehr!!!


Vergessen Sie nicht, sich das hervorragende Handbuch auszudrucken, Es
bietet Ihnen sowohl unbezahlbare Informationen &uuml;ber die vielen vorhandenen
Hilfsmittel als auch ein ausgezeichnetes 3-stufiges Lehrprogramm.


Kommen Sie zur JForth Mailinglist!!!

Um sich anzumelden senden Sie eine Nachricht an

   <a href="mailto:MDaemon@ChaosSolutions.com">MDaemon@ChaosSolutions.com</a>

mit dem Text

   subscribe JForth-list

als einzige Zeile im Textbereich.


Sie k&ouml;nne die Software herunterladen von

   <a href="http://www.softsynth.com/jforth/">http://www.softsynth.com/jforth/</a>


May the Forth be with you...always !!!

Copyright Martin Randall - August 1998&laquo;


Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses2.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses4.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
