<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="powerup3.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Diverse Neuigkeiten
-------------------

1. Neues StormC-Paket mit 68k-Emulation &raquo;powered by AMIGA&laquo;

Wenn ein Produkt das Logo &quot;powered by AMIGA&quot; von AMIGA International 
erh&auml;lt, ist das normalerweise nichts Besonderes. Hier aber k&ouml;nnte das 
Gegenteil der Fall sein.
Darum geht es: Am 28. August hat Haage &amp; Partner ein StormC-Komplettpaket 
angek&uuml;ndigt, das laut der WWW-Homepage des Unternehmens (<a href="http://www.haage-">http://www.haage-</a>
partner.com) von AMIGA International das &quot;powered by AMIGA&quot;-Logo bekommen 
hat.

Hier zun&auml;chst die inhaltliche Beschreibung des Pakets:

&raquo;StormC DSK

Das StormC DSK (Developer Survival Kit) ist das neue &quot;Alles-Inklusive&quot;-
Paket f&uuml;r AMIGA-Programmierer. Es beinhaltet alle bekannten Storm-
Komponenten in der aktuellen Version sowie die neuesten Entwicklungen f&uuml;r 
PowerPC und 3D. Als Bonus ist die Betaversion unseres neuen 68k-Emulators 
f&uuml;r PowerPC enthalten.


Inhalt des StormC DSK

StormC 68k - Version 3.0 -
Motorola 680x0 ANSI C/C++ Compilersystem mit integrierter 
Entwicklungsumgebung.

StormC PowerPC - Version 3.0 -
PowerPC 603/604/750 ANSI C/C++ Compiler, Linker und Debugger.

StormPowerASM - Version 3.0 -
PowerPC 603/604/750 Assembler und Disassemblersystem.

StormWizard - Version 2.2 -
Editor (Boopsi) zur besonders einfachen Erzeugung von Ressourcen-basierten 
Benutzeroberfl&auml;chen (GUI).

StormMESA 3.0 - Neue Version -
PD-Umsetzung der OpenGL -Bibliotheken inklusive PowerPC-Version und allen 
Sourcecodes. Neu in Version 3.0: GLUT-Funktionsbibliothek.

Warp3D - Neu -
Hardwareunabh&auml;ngiges Treibersystem f&uuml;r 3D-Grafikkarten. Unterst&uuml;tzung f&uuml;r 
CVision64 3D (Virge) und CVisionPPC/BVisionPPC (Permedia 2).

WarpUP 3.1 - Neueste Version -
Der bekannte PowerPC-Kernel f&uuml;r die einfache PPC-Programmierung.

PowerPC 68k-Emulator - Betaversion -
Die neue L&ouml;sung zur einfachen PowerPC-Programmierung. Das gesamte AmigaOS 
l&auml;uft damit auf dem PPC.

Amiga Developer CD - Neu -
Speziell auf StormC/PowerPC angepa&szlig;te Version des Standard-Developer-Kits 
inklusive modifizierter RKMS (Libraries, Devices).

Demo-Sourcen - Neu -
Viele Sourcen f&uuml;r StormC, StormPowerASM, StormWizard, StormMESA, Warp3D 
etc.

Lieferumfang
CD-ROM mit ca. 300-seitiger, englischsprachiger Anleitung


Preise


Vollversion

StormC DSK - Commercial-Edition                       698,- DM    ~ 398 US$
StormC DSK - Private-Edition*                         498,- DM    ~ 298 US$

* Die Privat-Edition hat den gleichen Lieferumfang wie die Commercial-
Edition, doch darf damit keine kommerzielle Software und Shareware 
produziert werden. Es kann jedoch jederzeit ein Lizenz-Update auf die 
Commercial-Edition erworben werden!


Cross-Upgrades

StormC DSK - Commercial-Edition - Cross Upgrade       598,- DM    ~ 348 US$
StormC DSK - Private-Edition* - Cross Upgrade         398,- DM    ~ 248 US$

Besitzer eines &auml;lteren kommerziellen Compilersystems wie z.B. SAS/C, 
MaxonC, AztecC k&ouml;nnen ein Cross-Upgrade erwerben. Hierf&uuml;r ist ein Nachweis 
durch Einsendung der Originaldisketten erforderlich!


Upgrades f&uuml;r StormC-Besitzer

StormC DSK - Commercial-Edition - Upgrade             298,- DM    ~ 175 US$
StormC DSK - Private-Edition* - Upgrade               198,- DM    ~ 119 US$

Jeder registrierte Besitzer eines StormC-Pakets kann ein kosteng&uuml;nstiges 
Upgrade erwerben.


Verf&uuml;gbarkeit

Die StormC DSK-Pakete k&ouml;nnen ab sofort vorbestellt werden. Die Auslieferung 
wird ca. Ende September 98 erfolgen.&laquo;


Nun ist es ja so, dass Haage &amp; Partner die PowerPC-Betriebssoftware WarpOS 
entwickelt und - gegen den Willen von Phase 5 - auf den Markt gebracht hat.
Wenn nun ein Softwarepaket, welches ma&szlig;geblich aus Komponenten f&uuml;r WarpOS 
besteht (Storm, die 68k-Emulation, und WarpUp selbst nicht zu vergessen), 
das besagte Logo von AMIGA International tragen darf, k&ouml;nnte es sich dabei 
um ein deutliches Signal handeln, dass sich AMIGA International f&uuml;r WarpOS 
als PowerPC-Betriebssoftware ausspricht.

Zwar sind die Streitigkeiten zwischen Phase 5 und Haage &amp; Partner offiziell 
beigelegt, aber von Fortschritten bei der Entwicklung des angek&uuml;ndigten 
neuen PowerPC-Standards ist nichts zu h&ouml;ren, so dass man fragen muss: Wurde 
mit der Entwicklung &uuml;berhaupt schon begonnen? Wenn man Ger&uuml;chten glauben 
schenkt, nein.

Aus diesem Grund k&ouml;nnte die auf den ersten Blick belanglose Vergabe eines 
Logos entscheidend daf&uuml;r sein, welche PowerPC-Software am Ende die Nase 
vorn haben wird.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="powerup3.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
