<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="forum1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum3.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Programmierer gesucht!

&raquo;An alle Programmierer,

da es f&uuml;r den Amiga keine Plottertreiber gibt haben wir uns nach unz&auml;hligen 
Anfragen einiger Handwerksbetriebe hier aus Hof/Saale &uuml;berlegt, das Heft 
selbst in die Hand zu nehmen.
Das Problem ist nur, dass wir keinen f&auml;higen Programmierer haben, der ein
fundiertes Wissen &uuml;ber solche Ansteuerungen der Plotter hat.
Es sollte f&uuml;r den HP entwickelt werden, da diese einen leihweise zur 
Verf&uuml;gung stellen w&uuml;rden.
Die n&ouml;tigen Unterlagen sowie Zubeh&ouml;r werden wir dann nach Absprache noch 
zusenden!  
Es w&auml;re nun nett, wenn sich einer bzw. einige diesbez&uuml;glich melden 
w&uuml;rde(n), da dieses Projekt sofort in Angriff genommen werden m&uuml;sste.
Es w&auml;re auch lobenswert, wenn dieser dann mit den f&uuml;hrenden Mal- und 
Zeichenprogrammen bzw. Raytracern auf dem Amiga zusammenarbeiten w&uuml;rden 
(PPaint, Tornado3D, Reflections, Draw-Studio usw.).
Auch PPC sollte er unterst&uuml;tzen, wir sind der Meinung, dass dies die 
Zukunft des Amigas ist und diese auch unterst&uuml;tzt werden muss.

Interesse an einem solchen Treiber ist vorhanden, seit der Einf&uuml;hrung des
Architekturprogramms &quot;Cycas&quot; ist dies eine g&uuml;nstige und leistungsf&auml;hige 
Alternative gegen&uuml;ber den PCs.


Wenn Sie Interesse haben, k&ouml;nnen Sie sich unter folgenden Adressen melden:

Computer-Club-Hof
Kammergutweg 21
95032 Hof

Tel: 09281/96584
Handy: 0172/8550548
e-mail: <a href="mailto:ott-krappmann@hof.baynet.de">ott-krappmann@hof.baynet.de</a>
<a href="http://www.hof.baynet.de/~ott-krappmann">http://www.hof.baynet.de/~ott-krappmann</a>
  

&Uuml;ber finanzielle Dinge schweigen wir uns noch aus, da wir den Vertrieb
&uuml;bernehmen werden.


Heiko Krappmann&laquo;
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="forum1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum3.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
