<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt 
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot; 
zusammengefasst. 

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


1. Leserbrief zu AMIGA, Inc. und AMIGA International (von Jens Illigen)

&raquo;Ich will Amiga nicht die Kompetenz absprechen, die sie hoffentlich haben,
dennoch ist bisher davon leider noch nicht viel zu sehen gewesen. Es mag
sein, dass Gateway Spielregeln vorschreibt, um m&ouml;glichst im Hintergund zu
bleiben, aber was f&uuml;r Gateway gilt, muss nicht f&uuml;r s&auml;mtliche
Tochterunternehmen gelten. 
Gateway verkauft IBM-kompatible PCs. Eine Annonce, dass sie das tun, 
reicht, denn Micro$oft und Intel machen gen&uuml;gend Werbung, f&uuml;r ihre 
Produkte, wie auch f&uuml;r ihre n&auml;chsten Vorhaben. Bei Amiga ist das ganz 
anders. Eine gro&szlig;e Werbekampagne w&auml;re jetzt zwar hinausgeworfenes Geld, da 
die attraktiven Produkte fehlen, aber wenigstens k&ouml;nnte man einen Zeitplan 
f&uuml;r die Amiga-Gemeinde ver&ouml;ffentlichen.
&Uuml;berraschungen sind gut und sch&ouml;n, aber man muss die aktuellen Benutzer bei
der Stange halten und ihnen Grund zur Hoffnung geben. Ank&uuml;ndigungen, 
welcher Prozessor benutzt werden wird, und dies kurze Zeit sp&auml;ter  
zur&uuml;ckzunehmen, sind genauso falsch wie die Ank&uuml;ndigung eines Intel-Amigas. 
Man h&auml;tte hier wesentlich sensibler sein m&uuml;ssen und von Anfang an 
klarstellen m&uuml;ssen, dass es ein Entwickler-System sein soll. Selbst wenn 
man von einem AMD-Prozessor gesprochen h&auml;tte, w&auml;re die Wintel-Phobie wohl 
nicht so gro&szlig; ausgefallen.

Sicher, Amiga braucht wieder ein Flagschiff, welches die PC-Besitzer vor
Neid erblassen l&auml;sst, ob jetzt mit Standardkomponenten wie PCI oder ohne.
Aber dieses Flagschiff muss preiswert sein, und wenn Amiga dieses 
revolution&auml;re System erst in ein paar Jahren herausbringt, und nicht die 
M&ouml;glichkeit hat, vorher einen neuen Computer zu entwickeln, dann muss der 
User das wissen. Mit einer offenen und festgelegten Marschrichtung w&uuml;rde 
Amiga, Inc. die M&ouml;glichkeit schaffen, dass Drittanbieter wie Phase 5, 
Access Innovation, etc. sowie Softwarefirmen wissen, worauf sie sich 
einlassen (am idealsten w&auml;re nat&uuml;rlich die L&ouml;sung, dass man jetzt auf 
68k/PPC von Phase 5 und auf die geplanten Mehrprozessorsysteme setzen kann, 
und sp&auml;ter auf den neuen Super-Amiga umsteigt/aufr&uuml;stet, ohne Investitionen
umsonst get&auml;tigt zu haben. Soll das zuk&uuml;nftige OS nicht sowieso 
verschiedene Prozessoren unterst&uuml;tzen ?).

Solange aber niemand wei&szlig;, was Amiga plant, solange k&ouml;nnen
Hardwarehersteller nur Amiga-Kopien anfertigen und nicht die Durststrecke 
zum Superamiga &uuml;berwinden, und Softwareproduzenten wagen eventuell nicht 
die PowerPC-Umsetzung ihrer Titel. Dies ist ein gef&auml;hrlicher Teufelskreis: 
Keine Software, also lohnt sich auch nicht der Kauf von Hardware. Amiga 
verliert weiter an Attraktivit&auml;t, und es desertieren immer weiter User zum 
PC-Lager. Folglich lohnt sich immer weniger die Entwicklung neuer Software. 
Keine Software...

Darum bin ich pers&ouml;nlich der Meinung, dass es f&uuml;r den Amiga essentiell ist,
dass Amiga, Inc. zusammen mit Amiga Int. die Marschroute festlegt, unter
Beobachtung des aktuellen Marktes. Regelm&auml;&szlig;ige News auf den Homepages von
Amiga sollten dann den Entwicklungsstand beschreiben. &Uuml;berraschungen k&ouml;nnen
gerne bleiben, aber Infos wie &quot;folgende Systembibliotheken werden gerade
&uuml;berarbeitet...&quot; und &quot;Eine 5%-ige Leistungsteigerung konnte durch 
Erneuerung von...&quot; w&auml;ren sch&ouml;n und w&uuml;rden den Amiga-Besitzer teilhaben 
lassen an der Entwicklung seines Computers.
Ja, ich denke sogar, dass es so lebenswichtig f&uuml;r den Amiga ist, dass man
Amiga, Inc./Int. dazu &quot;zwingen&quot; muss, wenn es nicht schon freiwillig
geschieht. 
Es ist nur eine Idee, aber wenn man eine Homepage errichten w&uuml;rde mit eben 
diesen Forderungen nach einer besseren Informationspolitik, vielleicht auch 
mit allgemeing&uuml;ltigen Vorschl&auml;gen von namhaften Soft- &amp; Hardwarefirmen, 
dann k&ouml;nnte jeder Amiga-Besitzer sich dort informieren und mit Hinweis auf 
diese Seite Amiga, Inc./Int. mailen und die Befolgung dieser Ideen fordern. 
Wenn wirklich jeder dies tun w&uuml;rde - wirklich jeder - (und AMIGA aktuell 
w&auml;re eine gute Ausgangsbasis ;-) ), dann kann sich Amiga, Inc./Int. dem 
nicht verschlie&szlig;en.
Denn wir, die Amiga-Benutzer, sind es, die den Amiga bis jetzt am Leben
hielten. Jeder Nicht-Amiganer hielt oder h&auml;lt den Amiga f&uuml;r tot. Bei der 
Wende in der Ex-DDR hatten die B&uuml;rgerrechtler bei den Demonstrationen ein 
sehr gutes Motto: &quot;Wir sind das Volk&quot;. Und das Gleiche gilt f&uuml;r uns. Wir
sind der Amiga - we are the Amiga. Vielleicht w&auml;re das auch ein sehr gutes
Motto f&uuml;r diese Initiative.

Schreibt doch mal, was ihr davon haltet. Es noch nur eine Idee - aber wer 
wei&szlig;?

Mit freundlichen Gr&uuml;&szlig;en

                            Jens Illigen&laquo;


Jens' Aufruf kann ich mich nur anschlie&szlig;en. Was haltet ihr von einer 
Homepage, auf der Forderungen an AMIGA, Inc. vorgetragen werden und man 
diese mit seiner Stimme unterst&uuml;tzen kann? Schreibt an <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
