<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="intern4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Das AMIGA-aktuell-Gewinnspiel
-----------------------------

Mit 34 Einsendungen war die Zahl der Teilnehmer etwas geringer als in den 
Vormonaten. Entscheidende Gr&uuml;nde d&uuml;rften die Urlaubszeit und die sehr sp&auml;t 
erschienene HTML-Version gewesen sein.


Zur Aufl&ouml;sung:


Standard-Frage: Phase 5 digital products hat im Juli eine neue Grafikkarte  
                auf den Markt gebracht. Wie hei&szlig;t das Produkt?

Antwort: Auf Grund des gewohnt einfachen Schwierigkeitsgrads der
         Standardfrage war langes Nachdenken sicher nicht angesagt. Der
         Name der Grafikkarte lautet &quot;CybervisionPPC&quot;.


Master-Frage: Wof&uuml;r steht im Computerbereich die Abk&uuml;rzung &quot;API&quot;? (Gesucht  
              sind die W&ouml;rter, die sich hinter der Abk&uuml;rzung verbergen,     
              KEINE Begriffserkl&auml;rung.)
              
Antwort:  Die Bedeutung von &quot;API&quot; lautet &quot;Application Programming           
          Interface&quot;, wobei wir statt &quot;Programming&quot; auch &quot;Programmer(s)&quot;    
          und &quot;Program(me)&quot; gelten lie&szlig;en.
         
             
Meinungsfrage: Welche Bedeutung wird Deiner Meinung nach die PowerPC-       
               Prozessorreihe in den n&auml;chsten Jahren f&uuml;r den AMIGA          
               besitzen?


Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------

1 (Sehr gro&szlig;e Bedeutung.)                                                 8
2 (Eine eher gro&szlig;e Bedeutung.)                                           17
3 (Eine weniger gro&szlig;e Bedeutung.)                                         6
4 (Kaum eine Bedeutung.)                                                  2

Ein Leser hat die Meinungsfrage nicht beantwortet.


Fazit:
------

Ich muss gestehen, das Ergebnis dieser Meinungsfrage war f&uuml;r mich eine 
&Uuml;berraschung. Ich pers&ouml;nlich hatte gedacht, dass der PowerPC-Reihe nach der 
Bekanntmachung der Pl&auml;ne von AMIGA, Inc. nur geringe Zukunftschancen 
einger&auml;umt w&uuml;rden.
Aber ganz offensichtlich setzt eine deutliche Mehrheit darauf, dass es 
Phase 5, Haage &amp; Partner und die &uuml;brigen den PowerPC unterst&uuml;tzenden Firmen 
in Zukunft gelingt, diese Technologie im AMIGA-Bereich st&auml;rker zu 
etablieren, als dies im Moment der Fall ist.


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:

1 x Vollversion von &quot;ManiacBall&quot;: Fabian Kruse
1 x Vollversion von &quot;CDCat&quot;: Gerd Schniggenberg
1 x Vollversion von &quot;PrintManager&quot;: Jan Andres
1 x Virtual-Memory-Software &quot;GigaMem&quot;: Thomas Franziskowski


Herzlichen Gl&uuml;ckwunsch!


Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


Frank Weber hat sein Programm AFiloFaxPro f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&raquo;AFiloFaxPro managet Ihr t&auml;gliches Leben. Dazu bietet es eine umfangreiche 
Terminplanerfunktion und dar&uuml;ber hinaus Features wie einen elektronischen 
Notizblock oder Statistikfunktionen, die u.a. die t&auml;gliche Computerlaufzeit 
protokollieren. (Unterst&uuml;tzt MUI)&laquo;

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.

Der Autor von AFiloFaxPro ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland 

E-Mail: <a href="mailto:fweber@amigaworld.com">fweber@amigaworld.com</a>


Peter Elzner hat sein Programm Diamond Caves II f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;Diamond Caves II ist eine Weiterentwicklung des klassischen Emerald Mine
und Boulder Dash. In einer H&ouml;hle m&uuml;ssen alle Diamanten eingesammelt
werden, zahlreiche Objekte wie T&uuml;ren, Schutzschilder, Dynamitstangen und
Bomben sowie verschiedene Gegner sorgen f&uuml;r teilweise verzwickte Level.
Enthalten ist ein Zwei-Spieler-Modus (gleichzeitig!) sowie ein
komfortabler Leveleditor.
Voraussetzungen: Amiga mit Kick2.0, mind. 1MB Chipmem und 1MB Fastmem,
&#009;&#009;            schneller Prozessor empfohlen, MUI wird f&uuml;r den Editor ben&ouml;tigt
Unregistrierte Version: 50 Level, Editor eingeschr&auml;nkt
Registrierte Version: 40 DM&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)


Andreas Falkenhahn hat sein Programm NewInstaller f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;Es gibt viele Softwarepakete im Aminet ohne Installationsprogramm, obwohl 
Commodore das Installerprogramm entwickelt hatte, welches eine einfach zu 
bedienende grafische Benutzeroberfl&auml;che bietet und dazu noch powervolle 
Funktionen hat.

Aber viele Autoren haben nicht die Zeit oder sind zu faul, ein Installer- 
Skript zu schreiben. Viele fanden es auch zu schwer.

Diese Zeit ist jetzt vorbei. NewInstaller macht es jedem Autor m&ouml;glich, ein 
Installskript in seinem Softwarepaket mitzuliefern.
Aber stop - sie m&uuml;ssen das Skript nicht selber schreiben - NewInstaller 
macht das alles automatisch.

Die einzige Sache, die Sie noch machen m&uuml;ssen, ist ein Piktogramm mit dem 
Standardprogramm NewInstaller in Ihr Softwarepaket zu f&uuml;gen. 
Au&szlig;erdem k&ouml;nnen Sie weitere Optionen in den Tooltypes einstellen.
 
Eine Demoversion des Programms k&ouml;nnen Sie im Aminet unter util/wb oder von 
der Airsoft Softwair Homepage (<a href="http://airsoft.home.pages.de">http://airsoft.home.pages.de</a>) 
runterladen. Die Vollversion (=Keyfile) gibt's f&uuml;r 20 DM bei:

Andreas Falkenhahn
An der Trift 2
36132 Eiterfeld-Arzell
 
E-Mail: <a href="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</a>&laquo;


MediaSpace Electronic Media Design hat f&uuml;r ein Jahr 5 MB Webspace f&uuml;r das 
Gewinnspiel zur Verf&uuml;gung gestellt:

&raquo;MediaSpace Electronic Media Design bietet WebSpace und WebDesign f&uuml;r
jedermann zu Top-Preisen. Au&szlig;erdem erstellen wir Grafiken, Prospekte und
Amiga-Software f&uuml;r unsere Kunden.
N&auml;here Informationen gibt's auf unserer Homepage: <a href="http://www.mediaspace.net">http://www.mediaspace.net</a>
oder auf Anfrage via E-Mail: <a href="mailto:info@mediaspace.net">info@mediaspace.net</a>
&Uuml;brigens: Auch Amiga aktuell l&auml;uft auf unserem Server!&laquo;

Der Gewinner bekommt die URL <a href="http://www.mediaspace.net/SeinName/">http://www.mediaspace.net/SeinName/</a> mit 5 MB 
WebSpace f&uuml;r ein Jahr. Dazu eigenen FTP-Zugang, WebCounter inkl. 
Zugriffstatistik soviel er will und eigene E-Mail-Adressen.


Des weiteren hat Thomas Hasemann acht AMIGA-FD- und -Cover-CDs zur 
Verf&uuml;gung gestellt.


Vielen Dank an alle Preisstifter!


Aufruf an alle innovativen Programmierer und AMIGA-Firmen:

Haben Sie Interesse, in einem der bekanntesten deutschsprachigen AMIGA-
Online-Magazine, beinahe kostenlos f&uuml;r Ihr(e) Produkt(e) zu werben?
Dann stiften Sie f&uuml;r das AMIGA-aktuell-Gewinnspiel doch einen oder mehrere 
Preise! Jedes Produkt wird mit dem von Ihnen gew&uuml;nschten Text vorgestellt. 
Als H&auml;ndler haben Sie die M&ouml;glichkeit, Ihr Unternehmen besser 
bekanntzumachen.
       

Hier die neuen Fragen (nur ZWEI davon m&uuml;ssen beantwortet werden):


Standard-Frage: Wie hei&szlig;t die neue kommerzielle AMIGA-Textverarbeitung, die  
                im August auf den Markt gekommen ist?
                
                  
Master-Frage: Wof&uuml;r steht im DF&Uuml;-Bereich die Abk&uuml;rzung &quot;TCP/IP&quot;? (Gesucht  
              sind die W&ouml;rter, die sich hinter der Abk&uuml;rzung verbergen,     
              KEINE Begriffserkl&auml;rung.)

             
Meinungsfrage: Wie beurteilst du die bisherige Informationspoliik der        
               AMIGA-Entwicklungsabteilung AMIGA, Inc.?


M&ouml;gliche Antworten: 
           
1: Ich bin mit der Informationspolitik sehr zufrieden.
2: Ich bin mit der Informationspolitik eher zufrieden.
3: Ich bin mit der Informationspolitik eher unzufrieden.
4: Ich bin mit der Informationspolitik &uuml;berhaupt nicht zufrieden.

Es gen&uuml;gt, die Nummer anzugeben.


Unter allen Teilnehmern, die mindestens ZWEI dieser Fragen bis zum 25. 
September (Einsendeschluss) beantworten (die Wissensfrage[n] nat&uuml;rlich 
richtig), werden die folgenden Gewinne verlost:


1 x Vollversion von &quot;Diamond Caves II&quot; (Wert: DM 40,-)
1 x Vollversion von &quot;AFiloFaxPro&quot; (Wert: DM 25,-)
1 x Vollversion von &quot;NewInstaller&quot; (Wert: DM 20,-)
1 x f&uuml;r ein Jahr 5 MB Webspace (Wert: nach Ermessen)
1 x acht AMIGA-FD- und -Cover-CDs (Wert: nach Ermessen)


Wer alle drei Fragen beantwortet (die Wissensfragen m&uuml;ssen nat&uuml;rlich 
richtig sein), nimmt mit ZWEI Stimmen an der Verlosung teil und hat somit 
die doppelte Chance auf einen Preis.


Schickt Eure Antworten bitte bis zum 25. September an folgende Adresse:

Carsten Schr&ouml;der
Helmoltstra&szlig;e 10
37081 G&ouml;ttingen
Deutschland

oder per E-Mail an:

<a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


Bitte vergesst nicht, Eure Post-Anschrift anzugeben, und ggf. den 
bevorzugten Preis. Eine Garantie, dass Ihr im Gewinnfall dann auch genau 
diesen Preis erhaltet, kann nat&uuml;rlich nicht gegeben werden.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="intern4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
