<html>
<head>
  <title>Interviews</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="interviews2.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

3. Interview mit Vulcans Marble-Eyes Development Team (MeD)
   
&raquo;F: Ich erinnere mich, dass ich eine Vorschau von Genetic Species aus dem
Aminet heruntergeladen hatte, die von Ambrosia gemacht worden war und nun
nennen Sie sich Marble-Eyes. Was ist passiert? 

MeE: Unser vollst&auml;ndiger Name ist Marble-Eyes Development. Unser Spiel
begann als eine gute Demo-Darstellung, aber zu dieser Zeit war unser
Programmierer mehr oder weniger allein mit diesem Projekt und er war ein
Mitglied der Demogruppe namens Ambrosia. Die GeneticSpecies-Engine wurde
zum ersten Mal beim Gathering96 in Norwegen vorgestellt und erhielt sehr
positive Kritiken. Nach diesem Ereignis schienen sich die anderen 
Mitglieder bei Ambrosia mehr um die Produktion anderer Demos zu k&uuml;mmern und 
der Programmierer musste andere Alternativen finden, damit jemand die 
Arbeit erledigte.

Schlie&szlig;lich antwortete ein sehr talentierter Grafiker auf eine E-Mail und
der Ablauf begann sich zu beschleunigen. Sp&auml;ter stie&szlig; unser Audio-Mann,
Martin Halberg, zum Team und unser Demo-Effekt fing an immer mehr wie ein
Spiel auszusehen. Wir alle entschieden uns, die Demoszene hinter uns zu
lassen und uns auf die Entwicklung von Spielen zu konzentrieren. Deshalb
erschien es uns nur nat&uuml;rlich, mit dem Neustart auch einen neuen Namen
anzunehmen.


F: Wann trat Vulcan Software in Erscheinung?

MeD: Die Demo vom Gathering96 wurde ins Aminet gestellt und von Vulcan
heruntergeladen. Ihnen gefiel es und sie erkannten die M&ouml;glichkeiten im
Konzept. Deshalb traten sie mit uns in Verbindung und am 1. Dezember 1996
wurde der Vertrag unterzeichnet.


F: Versuchen Sie doch mal Genetic Species mit 50 Worten zu beschreiben.

MeD: Auf der Grundlage von Paradroid bietet dieses Spiel energische und
packende 3D-Action mit einem Umfang an Einzelheiten, die man auf dem Amiga 
lange nicht mehr gesehen hat. Ungeahnte Mengen von R&auml;tseln, Atmosph&auml;re und 
Spiel! 200 MB Intro-Animation, 30 Minuten CD-Musik und 29 000 Zeilen
optimierter 68k-Assembler.


F: 49 Worte, gut getroffen ;) [Im englischen Original sind es 46 Worte!]
Der Amiga hat eine ganze Menge Doom-Clones gesehen, enth&auml;lt Ihr Spiel noch
etwas Neues?

MeD: Das Tempo, die Spielbarkeit, die Atmosph&auml;re und die Unterst&uuml;tzung f&uuml;r
alles Erw&auml;hnenswerte! Nicht zuletzt die einzigartige M&ouml;glichkeit, die 
K&ouml;rper menschlicher Wesen, von Cyborg und von Droiden zu &uuml;bernehmen, was 
wie nachgewiesen sehr gut in der 3D-Umgebung arbeitet. Wir halten es f&uuml;r 
nicht fair, GS als einen Doom-Clone zu bezeichnen. Tats&auml;chlich verwenden 
wir die 3D-Umgebung als Grundlage, ein Adventure-Spiel aufzubauen. Stellen 
Sie sich vor, Sie werfen im Jahr 2034 Ihre gro&szlig;e Virtual-Reality-Maschine 
an und betreten den grenzenlosen Cyberspace. Werden Sie dann sagen: 
&quot;Gruseliger Doom-Clone, mein lieber Mann!&quot;


F: Warum glauben Sie, dass Genetic Species besser ist als andere 3D-Spiele?

MeD: GS hat eine originelle Spielidee, die gut mit der Story und den
Spielm&ouml;glichkeiten kombiniert ist. Die Idee des Spiels ist nicht nur zur
Dekoration da. Sobald man beginnt, entwirrt sich eine zun&auml;chst nur schwach
erkennbare und verwickelte Geschichte. Alles abzuschie&szlig;en, was sich bewegt,
bringt einen nirgendwohin und das ist das Interessante an Genetic Species.


F: Verraten Sie uns ein Geheimnis, das niemand au&szlig;erhalb von Marble Eyes
kennt!

MeD: Wir sind Aliens von Alpha Centauri und planen die Weltherrschaft vor
der Jahrtausendwende.


F: Was k&ouml;nnen wir von Marble Eyes in der Zukunft erwarten?

MeD: Nun, wir sind da und wir wollen bleiben! Unsere Motivation und Hingabe
zur Computer-Wissenschaft dauert fort und wir haben gro&szlig;e Pl&auml;ne f&uuml;r Genetic
Species, ehe wir mit einem weiteren Spiel beginnen. Das Erste auf der Liste
ist ein Zusatz f&uuml;r mehrere Spieler (Multiplayer-AddOn) mit TCP/IP-
Unterst&uuml;tzung. Das hei&szlig;t, man wird auch &uuml;ber das Internet spielen k&ouml;nnen.
Wir hoffen, das erste anwendbare Internetspiel f&uuml;r den Amiga zu machen, 
wenn uns Mr. Burkey hier nicht schl&auml;gt. Dieses Multiplayer-AddOn wird mit 
allen Arten von Piratenschutz &quot;infiziert&quot; sein, was wir aus Zeitgr&uuml;nden 
noch nicht auf der CD einrichten konnten. Mit vierj&auml;hriger Erfahrung bei 
der Demo-Codierung und der R&uuml;ckw&auml;rts-Zerlegung (reverse engineering) von 
Demos sollte ich in der Lage sein, den Crackern kr&auml;ftige Kopfschmerzen zu 
bereiten, und sobald das AddOn geknackt ist, kommt ein Neues heraus.


F: Da wir &uuml;ber Piratentum reden: Wie l&auml;uft es mit Genetic Species?

MeD: Wir haben noch nichts zum Schutz vor Raubkopierern unternommen, aber 
die Gr&ouml;&szlig;e des Spiel betr&auml;gt mehr als 600 MB, wodurch eine nat&uuml;rliche Grenze 
f&uuml;r Internet/BBS-Piraten gesetzt ist. Trotzdem gibt es da Spa&szlig;v&ouml;gel, die 
lieber zwei Tage online zubringen als die Zukunft des Amiga zu 
unterst&uuml;tzen. Die meisten Leute unterst&uuml;tzen jedoch ein Spiel nur f&uuml;r den 
Amiga. Eine Darstellung unserer Verk&auml;ufe bei der WOA unterstreicht das 
stilvoll!
 


Live Long &amp; Prosper!
(Lebe lange und erfolgreich!)
Paul Carrington BA(Hons)
Vulcan Software Limited&laquo;

(Quelle des Originals: Vulcan Software)
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="interviews2.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
