<html>
<head>
  <title>Interviews</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="tests6.html"><img src="prev.gif" alt="PREV" border=0></a><a href="interviews2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Interviews
----------

1. Interview mit E. Br&uuml;ggemann von Village Tronic

HK (Heiko Krappmann): Village Tronic ist einer der gr&ouml;&szlig;ten 
Hardwarehersteller auf dem Amiga-Markt. Das hei&szlig;t auch, dass die Produkte 
&uuml;ber mehrere Jahre stets weiterentwickelt worden sind, wie z.B Picasso, 
Paloma, Pablo, und immer wieder technische Erweiterungen mit einbezogen 
wurden.

EB (E. Br&uuml;ggemann): Stillstand hat es bei uns in der Amiga-
Entwicklungsabteilung eigentlich nie gegeben. Trotz eines bekannterma&szlig;en 
immer kleiner werdenden Amiga-Marktes ist es uns zum Trotz aller Unkenrufer 
gelungen, unser Sortiment stetig zu erweitern und zu verbessern. Die 
Ariadne haben wir auf Wunsch von vielen Usern wieder auferstehen lassen und 
werden sie demn&auml;chst mit einem sensationellen Preis (um die 200 DM, inkl.  
Software) auf den Markt bringen. Die Resonanz auf unsere Produkte ist auch 
in den weniger guten Zeiten des Amigas nicht schlechter (wenn nicht sogar 
besser) geworden.


HK: Im Apple-Markt haben Sie ja nun auch Fu&szlig; gefa&szlig;t. Was hat das f&uuml;r
Vor- bzw. Nachteile f&uuml;r ein solches Unternehmen, wie Sie es sind?

VT: Nachteile hat es eigentlich keine. Die Vorteile sprechen aber eher eine 
deutliche Sprache: Unsere Amiga-Entwicklungen laufen oftmals parallel
mit denen auf der Mac-Seite. Dadurch wird unser Erfahrungsschatz im Hause
extrem erweitert, da wir Fehler nur einmal machen m&uuml;ssen. Die 
Spezialanpassungen an die Amiga-Hardwareumgebung werden dann von sehr
erfahrenen Amiga-Hardwareingenieuren entwickelt.


HK: Ist der Konkurrenzkampf eigentlich sehr gro&szlig; auf dem Amiga, z.B. mit
Phase 5?

EB: Village Tronic und Phase 5 stehen nicht in direkten Konkurrenzkampf.
Wir sind sogar froh, dass es noch engagierte Firmen gibt, die nach wie vor
emotional und finanziell genauso viel Schwei&szlig; und Geld in den Amiga 
stecken, wie wir es tun. Konkurrieren tun Phase 5 und Village Tronic allein 
schon deswegen nicht, weil wir verh&auml;lnism&auml;&szlig;ig unterschiedliche 
Marktsegmente abdecken.


HK: Zum Thema PowerPC h&ouml;rt man von ihrer Seite kaum &Auml;u&szlig;erungen. Sind sie 
daran &uuml;berhaupt interessiert?

EB: Grunds&auml;tzlich sind wir an allen Neuerungen bez&uuml;glich des Amigas sehr 
interessiert. Allerdings ist es f&uuml;r uns noch zu fr&uuml;h zu behaupten, dass die 
PowerPC-Schiene das Nonplusultra in der derzeitigen Form darstellt.
F&uuml;r uns w&uuml;rde eine Entwicklung f&uuml;r den PowerPC-Port noch keinen Sinn 
machen, da wohl insgesamt zu wenige Boards verkauft worden sind, dass sich 
eine Entwicklung lohnen k&ouml;nnte.
Au&szlig;erdem ist die Frage noch nicht gekl&auml;rt, was Amiga, Inc. macht. Solange 
es kein natives PowerPC-Kernel gibt, werden wir mit solchen Entwicklungen
nicht auf den Markt dr&auml;ngen. Au&szlig;erdem ist PowerPC ja nach Seiten von
Amiga, Inc. wohl noch nicht der Wei&szlig;heit letzter Schluss.
Wir wollen zun&auml;chst einmal abwarten und uns Gedanken &uuml;ber die zuk&uuml;nftigen
Produkte machen, bevor wir uns in unsichere Fahrwasser begeben.


HK: Wie kam bei Ihnen das Statement von Amiga, Inc. bez&uuml;glich der Messe WoA 
an? Teilen Sie deren Meinung, oder wie sehen Sie das Ganze?

EB: Was f&uuml;r ein Statement? War das eins? Ich habe leider noch nichts von
Amiga, Inc. gesehen. Die Informationspolitik l&auml;sst bis jetzt sehr zu 
w&uuml;nschen &uuml;brig.


HK: Rentiert es sich eigentlich noch, f&uuml;r den Amiga zu entwickeln?

EB: Komischerweise sind die Verkaufszahlen in den letzten Monaten ein wenig 
gestiegen. Da wurde doch immer wieder gesagt, dass Entwicklungen f&uuml;r den 
Amiga nicht rentabel seien... K&ouml;nnen wir nicht behaupten.


HK: Bez&uuml;glich des OS 3.1 hat es Querelen um Sie gegeben. K&ouml;nnen Sie uns 
sagen, was damals vorgefallen ist, man h&ouml;rte ja immer nur eine Seite?

EB: Nun...  Wir verkaufen OS 3.1 nicht mehr. Mit Commodore hatten wir einen 
Vertrag. Lange Zeit lief das Gesch&auml;ft mit Commodore gut, bis dann durch die 
Pleite die rechtliche Seite der Besitzlage des Betriebssystems ungekl&auml;rt 
war. Das OS haben wir aus dem Sortiment genommen.


HK: Was werden Sie zur Computer '98 mitbringen, etwas Neues oder die
vorhandenen Produkte?

EB: Erst einmal nat&uuml;rlich die Ariadne II.  Wir werden aber auch andere
aktuelle Produkte dabei haben, und vielleicht eine Neuentwicklung. Dar&uuml;ber
k&ouml;nnen wir aber noch nichts sagen; haben Sie also bitte noch ein bisschen
Geduld.


HK: Hat es etwas mit PowerPC zu tun?

EB: Warten Sie ab. Schauen Sie sich das Statement oben an. Ich kann
leider nichts Weiteres sagen!


HK: Gibt es sonst irgendwelche Neuigkeiten aus Ihrem Hause?

EB: Wir &uuml;berarbeiten gerade unsere Homepage, die demn&auml;chst ins Netz geht.
Des weiteren haben wir unseren Service ausgebaut. Village Tronic ist nun 
Mo-Do von 10-19 Uhr und Fr von 10-18 Uhr zu erreichen.


HK: Wir m&ouml;chten uns f&uuml;r dieses Interview herzlich bedanken und w&uuml;nschen
Ihrem Unternehmen noch alles Gute f&uuml;r die Zukunft. Wir hoffen, dass Ihnen 
das Onlinemag Amiga aktuell gef&auml;llt?!

EB: Jawohl, tut es... Schlie&szlig;lich habe ich es als E-Mail abonniert. :)


E. Br&uuml;ggemann
Village Tronic&laquo;
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="tests6.html"><img src="prev.gif" alt="PREV" border=0></a><a href="interviews2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
