<html>
<head>
  <title>Spieleteil</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele5.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele7.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

6. Preview: Eat the Whistle
---------------------------

<a href="eatthewhistle.png">Screenshot</a> (ab OS 3.0; PNG-Datatype mu&szlig; installiert sein)

Seit langer, langer Zeit ist kein Fu&szlig;ballspiel f&uuml;r unseren AMIGA mehr
erschienen. Epic will dieser Zeit nun mit der Ver&ouml;ffentlichung von Eat
the Whistle ein Ende setzen. Wie der Titel des Spiels schon vermuten l&auml;&szlig;t,
wird Eat the Whistle keine bierernste Simulation werden, sondern ein
Fu&szlig;ballspiel gespickt mit Gags, da&szlig; sehr viel Spa&szlig; machen soll. Das nun
ver&ouml;ffentlichte Demo vermittelt einen ersten Eindruck von dem, was da
kommen mag. Die Grafik geh&ouml;rt zwar nicht zu dem besten, was der AMIGA bis
jetzt gesehen hat, sie ist aber auch nicht schlechter als die der Klassiker
Kick Off 2 oder SWOS. Das Demo, in dem 2 Spieler f&uuml;r 2 Minuten spielen
k&ouml;nnen wird immer wieder von &quot;Werbeeinblendungen&quot; unterbrochen, die einige
Features der Vollversion vorstellen. Und genau diese Features sind es, die
Eat the Whistle zu einem der besten AMIGA-Fu&szlig;ballspiele aller Zeiten machen
k&ouml;nnten. So gibt es WM-, Liga-, und Pokal-Modi, gesprochene Kommentare,
mehr als 550 Frames an Animationen f&uuml;r die Spieler, 30 Spielfelder (von
matschig &uuml;ber gefroren bis zu einem verschneiten Platz auf dem das Spielen
sehr schwierig sein d&uuml;rfte). Auch ein Taktik-Editor, einen Spielernamen-
Editor und Replays gibt es. Auf der technischen Seite sind vor allem die
Systemfreundlichkeit (ETW soll auf JEDEM Amiga laufen), das Spielen in
einem Fenster auf der Workbench, Grafikkarten und AHI-Support, Gamepad-
Support zu nennen.
Eat the Whistle spielt sich bereits in der Demoversion sehr gut, wenn nun
noch die zahlreichen Features sinnvoll in das Spiel integriert werden,
steht einem AGPJ-Award nichts mehr im Weg.
Das Demo kann auf der Homepage der Entwickler Hurricane Software (Adresse
siehe Bookmarks) heruntergeladen werden.
Die Vollversion soll Ende August / Anfang September bei Epic erscheinen.

Preview: GunBee F-99
--------------------

<a href="gunbee.jpg">Screenshot</a> (ab OS 3.0; JFIF/JPEG-Datatype mu&szlig; installiert sein)

GunBee F-99 ist ein h&uuml;bsch-altmodisches Shoot Em Up, das Ende der 80er
Jahre sicher ein Hit geworden w&auml;re. Die Sprites sind niedlich, doch die
Grafik insgesamt befindet sich keinesfalls auf dem Stand der sp&auml;ten 90er
Jahre. Auch der Bildschirmausschnitt ist viel zu klein. Die Spielbarkeit
ist zwar recht gut, doch auf die Dauer werden nur ShootEmUp-Fanatiker
ihren Spa&szlig; haben. Zum Gl&uuml;ck gibt es im Aminet ein spielbares Demo (game/
demo/Gunbee-F99.lha), also kann sich jeder sein eigenes Bild machen.
Das Spiel ben&ouml;tigt AGA und 2 MB ChipRAM.

Preview: In Shadow of Time
--------------------------

<a href="inshadowoftime.png">Screenshot</a> (ab OS 3.0; PNG-Datatype mu&szlig; installiert sein)

In Shadow of Time ist ein weiteres Adventure im Stile der LucasArts-
Klassiker. Entwickelt wird es seit einigen Jahren von den schwedischen
Entwicklern Shadow Elks. Der Eindruck der nun ver&ouml;ffentlichten Demoversion
ist recht gut. 384 Farben gleichzeitig, sowie &quot;realtime image sclaing
routines&quot; und &quot;realtime shadow routines&quot; sorgen f&uuml;r eine gute Grafik. Die
Spielbarkeit in der sehr eingeschr&auml;nkten Demoversion ist ebenfalls in
Ordnung. Mit Hilfe der rechten Maustaste l&auml;&szlig;t sich jederzeit das Men&uuml; mit
den einzelnen Handlungsm&ouml;glichkeiten aufrufen. Das Demo l&auml;uft komplett im
Multitasking. Etwas unzeitgem&auml;&szlig; ist, da&szlig; In Shadow of Time nicht mit
Grafikkarten l&auml;uft, Systemvoraussetzung ist ein AGA-Amiga mit 68020 und
1.5-2 MB RAM. Das Demo l&auml;&szlig;t sich auf der Shadow Elks-Homepage (URL siehe
Bookmarks) herunterladen. Adventure-Fans sollten das auch unbedingt tun.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele5.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele7.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
