<html>
<head>
  <title>Vorwort</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Vorwort
-------

Willkommen zur neuen Ausgabe von AMIGA aktuell.

&quot;Es muss endlich etwas passieren&quot; - dieser Ruf war in den letzten Wochen 
noch st&auml;rker zu h&ouml;ren als sonst, erst recht, nachdem bekannt worden war, 
dass die bekannte britische AMIGA-Zeitschrift CU AMIGA eingestellt wird.
Der Niedergang unseres Computersystems geht also weiter - wenn auch wohl 
etwas gebremst.
In den letzten f&uuml;nf Jahren gab es eine Vielzahl von Pl&auml;nen, um dem AMIGA 
wieder auf die Beine zu helfen. Entweder scheiterten sie noch vor ihrer 
Realisierung (Beispiel: ABox), oder sie erf&uuml;llten die Erwartungen nicht 
(Beispiel: p.OS, von dem ja sowieso nur eine Vorabversion erschienen war).
Die undurchsichtige Informationspolitik von AMIGA, Inc. tut ihr &Uuml;briges, um 
Anwender und Entwickler zu verunsichern. Nichtsdestotrotz gab es in den 
letzten Wochen einige Anzeichen, dass sich in der AMIGA-
Entwicklungsabteilung entgegen allen Unkenrufen doch etwas tut. Mehr dazu 
in der vorliegenden Ausgabe von AMIGA aktuell.


Nun zu den Dingen in eigener Sache:

* &quot;Es muss endlich etwas passieren&quot; - das passt auch sehr gut zu dem        
  Fertigstellungsproblem der von Hand erstellten HTML-Version von AMIGA    
  aktuell. Leider hat sich noch niemand gefunden, der sowohl Lust als auch  
  vor allem Zeit hat, AMIGA aktuell jeden Monat ein ansprechendes HTML-     
  Layout zu verpassen.
  Wir erwarten nicht, dass das Magazin innerhalb von ein paar Stunden      
  konvertiert wird, l&auml;nger als eine Woche sollte es aber auch nicht        
  dauern.
  Wenn es also doch jemanden gibt, der sich f&uuml;r diese Aufgabe              
  bereiterkl&auml;rt, dann m&ouml;ge er sich bitte bei uns melden: <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>

* In dieser Ausgabe von AMIGA aktuell ist eine AMIGA-H&auml;ndlerliste
  enthalten, die von Jens Jahnke und Matthias Puch zusammengestellt wurde.
  Uns w&uuml;rde interessieren, ob die Ver&ouml;ffentlichung innerhalb dieses Mags
  bei euch auf Zustimmung gesto&szlig;en ist oder nicht.

* Da dem Aufruf in AMIGA aktuell 7/98 hin, zu den Vorstellungen von Stefan  
  Schulze bez&uuml;glich des geplanten C-Workshops Stellung zu nehmen, lediglich  
  ein(!) Leser gefolgt ist, hat Stefan leider beschlossen, das Projekt      
  aufzugeben.

* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Mailingliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden      
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller            
  Programme und nicht &uuml;ber die Mailingliste vorgeschlagener FD-Software.
  Schreibt an <a href="mailto:aakt@gmx.de">aakt@gmx.de</a> .


Viel Spa&szlig; jetzt bei dieser Ausgabe,

Euer

Carsten Schr&ouml;der
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
