<html>
<head>
  <title>Workshops</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="forum4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="workshops2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Update: So senkt ihr eure Telekom-Rechnung!

Die Einbindung eines Telekommunikationsthemas ist bei euch auf Zustimmung 
gesto&szlig;en, so dass ich beschlossen habe, die Tarif&uuml;bersicht der g&uuml;nstigsten 
Ferngespr&auml;chsanbieter auch in Zukunft zu ver&ouml;ffentlichen, sofern es 
zwischenzeitlich &Auml;nderungen gab. 
Und das war im August bereits der Fall: TelDaFax hat einen Teil seiner 
Tarife gesenkt, was erfreuliche Auswirkungen auf die Festnetz-Tabelle hat.

Zwar senkt(e) zum 1. September auch der nach der Telekom wohl bekannteste 
Anbieter, Otelo, die Preise, Auswirkungen auf die Tabellen hat dies aber 
nicht, da nach wie vor permanent andere Unternehmen g&uuml;nstiger sind.
Fazit: Ohne preiswerte Tarife l&auml;uft nichts - da kann Otelo auch soviel 
werben oder seinen Gesch&auml;ftsf&uuml;hrer so oft austauschen, wie es will...

Auch die Preissenkung bei Arcor zum 1. September bewirkt(e) keine &Auml;nderung 
in den Tabellen.

Ausdr&uuml;cklich m&ouml;chte ich an dieser Stelle auf einen Fehler aufmerksam 
machen, der in einigen Versionen der letzten AMIGA-aktuell-Ausgabe 
enthalten war: Entgegen der Eintragung ist die Deutsche Telekom von Montag 
bis Freitag zwischen 02.00 und 05.00 auch bei Entfernungen ab 50 km am 
g&uuml;nstigsten. Ein gro&szlig;es Dankesch&ouml;n geht in diesem Zusammenhang an Cord 
Hagen, durch den ich auf den Fehler aufmerksam wurde.

Hier nun die korrigierte und aktualisierte Version (alle Angaben ohne 
Gew&auml;hr):


G&uuml;nstigster Anbieter f&uuml;r Verbindungen innerhalb des Festnetzes:

Tag, Uhrzeit      | Bis 50 km Entfernung      |         Ab 50 km Entfernung
===========================================================================
    
Mo-Fr, 05.00-09.00  Arcor (01070), 11 Pfg.&sup1;       TelDaFax (01030), 14 Pfg.
Mo-Fr, 09.00-18.00  Arcor (01070), 15 Pfg.        Mobilcom (01019), 19 Pfg.
Mo-Fr, 18.00-21.00  Arcor (01070), 11 Pfg.&sup1;       TelDaFax (01030), 14 Pfg.
Mo-Fr, 21.00-02.00  Arcor (01070), 7,5 Pfg.       TelDaFax (01030), 14 Pfg.
Mo-Fr, 02.00-05.00  Deutsche Telekom, 6 Pfg.       Deutsche Telekom, 6 Pfg.

Sa/So, 05.00-21.00  Arcor (01070), 11 Pfg.&sup1;       TelDaFax (01030), 14 Pfg.
Sa/So, 21.00-05.00  Arcor (01070), 7,5 Pfg.       TelDaFax (01030), 14 Pfg.

&sup1;: Bei Verbindungen von bis zu etwa 2 Minuten Dauer ist auf Grund der       
   Arcor-Verbindungsgeb&uuml;hr (s.u.) TelDaFax (01030), 14 Pfg., g&uuml;nstiger.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 55,9 Pfg.!)


G&uuml;nstigster Anbieter f&uuml;r Verbindungen vom Festnetz in ein Mobilfunknetz:

Tag, Uhrzeit      | D1 (0170/0171), E+ (0177) |             D2 (0172, 0173)  
=========================================================================== 

Mo-Fr, 09.00-18.00  Viatel (01079), 73,1 Pfg.     Viatel (01079), 73,1 Pfg.
Mo-Fr, 18.00-09.00  TelDaFax (01030), 47,4 Pfg.     Arcor (01070), 46 Pfg.&sup2;

Sa/So, 00.00-24.00  TelDaFax (01030), 47,4 Pfg.     Arcor (01070), 46 Pfg.&sup2;

&sup2;: Bei Verbindungen von bis zu etwa 4 Minuten Dauer ist auf Grund der       
   Arcor-Verbindungsgeb&uuml;hr (s.u.) TelDaFax (01030), 47,4 Pfg., g&uuml;nstiger.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 137 Pfg.!)


Die Tabellen sollten im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Gespr&auml;chs- / Onlineminute f&auml;llig          
  werdende Betrag.

* An Feiertagen gilt der Samstag/Sonntag-Tarif.

* Bei Verbindungen in ein Mobilfunknetz h&auml;ngt der g&uuml;nstigste Tarif davon    
  ab, in welches Netz man sich einw&auml;hlt. Dies l&auml;sst sich an Hand der        
  Telefonnummer (siehe erste Zeile der Mobilfunk-Tabelle) erkennen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  spezielle City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf <a href="http://www.muc.de/~hm/telefon-tarife/tarifzonen.html">http://www.muc.de/~hm/telefon-tarife/tarifzonen.html</a> k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr &quot;f&auml;lschlicherweise&quot; einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: <a href="http://www.teltarif.de/db/index.html">http://www.teltarif.de/db/index.html</a>


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDafax rechnet sekundengenau ab, d.h. ihr zahlt hier wirklich nur f&uuml;r   
  die Zeit, die das Gespr&auml;ch / die Online-Sitzung dauert.

* Dasselbe gilt im Prinzip auch f&uuml;r Arcor, blo&szlig; berechnet das Unternehmen   
  pro Gespr&auml;ch zus&auml;tzlich eine Verbindungsgeb&uuml;hr von 6 Pfg.

* Viatel berechnet bei Gespr&auml;chen bis 30 Sekunden Dauer die gesamten 30     
  Sekunden, danach wird exakt abgerechnet.

* Mobilcom rechnet minuten(un)genau ab, d.h. auch wenn das Gespr&auml;ch nur 5   
  Sekunden dauert, zahlt ihr 19 Pfg.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="forum4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="workshops2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
