<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Buchbesprechungen</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <A name="top"></A> 

          <P align="center"><FONT color="#000080" size=
          "7"><B>Buchbesprechungen</B></FONT></P>

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">Anruf in der Nacht</A></LI>

            <LI><A href="#a02">Die R&auml;tsel von Badger's
            Drift</A></LI>

            <LI><A href="#a03">Harry Potter und der Orden des
            Ph&ouml;nix</A></LI>

            <LI><A href="#a04">Der verlorene Blick</A></LI>

            <LI><A href="#a05">Der Herr der Ringe - Band 1 - Die
            Gef&auml;hrten</A></LI>

            <LI><A href="#a06">Der Herr der Ringe - Die
            R&uuml;ckkehr des K&ouml;nigs</A></LI>

            <LI><A href="#a07">Das Enneagramm-Video</A></LI>

            <LI><A href="#a08">Atlantis</A></LI>

            <LI><A href="#a09">Der Dagon-zyklus</A></LI>

            <LI><A href="#a10">David Copperfield</A></LI>

            <LI><A href="#a11">Das wiedergefundene Licht</A></LI>

            <LI><A href="#a12">Liebe Tracey, Liebe Mandy</A></LI>

            <LI><A href="#a13">Der kleine Hobbit</A></LI>

            <LI><A href="#a14">Das Bild Rose Madder</A></LI>

            <LI><A href="#a15">Johannes</A></LI>

            <LI><A href="#a16">Der Maler</A></LI>

            <LI><A href="#a17">Telepathie, Hellsehen und
            Psychokinese</A></LI>

            <LI><A href="#a18">Die Farm</A></LI>
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>Buchtitel: Anruf in der Nacht<BR>
          Autor: Susan Howatch<BR>
          Vorgestellt von: Rothaut<BR>
          Verlag:<BR>
          Erscheinungsjahr:<BR>
          Gesamtseitenzahl: 249<BR>
          ISBN:<BR>
          Format: Digital ASCII</H3>

          <P><B>Inhalt:</B><BR>
          Claire bekommt einen Hilfeanruf ihrer Schwester aus
          Europa, und als sie der Sache nachgeht, ist zun&auml;chst
          einmal ihre Schwester verschwunden und sie macht noch
          einige grausige Entdeckungen</P>

          <P><B>Anmerkungen:</B></P>

          <P><B>Empfehlung:</B><BR>
          Ich fand das Buch sehr spannend, aber auch voll von
          menschlicher W&auml;rme</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>Buchtitel: Die R&auml;tsel von Badger's Drift<BR>
          Autor: Caroline Graham<BR>
          Vorgestellt von: Rothaut<BR>
          Verlag: Goldmann<BR>
          Erscheinungsjahr: 1997<BR>
          Gesamtseitenzahl: 318<BR>
          ISBN:<BR>
          Format: Digital ASCII</H3>

          <P><B>Inhalt:</B><BR>
          Badgers Drift: Ein verschlafenes englisches Dorf, das
          zwischen gr&uuml;nen H&uuml;geln friedlich vor sich hin
          d&ouml;st. Bis die Idylle von einem schrecklichen
          Ereignis j&auml;h zerst&ouml;rt wird. Miss Emily Simpson,
          eine freundliche &auml;ltere Dame, wird beim
          Spazierengehen im Wald Zeugin eines Vorfalls, der besser
          unentdeckt geblieben w&auml;re - vor allem f&uuml;r Miss
          Emily. Als sie stirbt, findet der Arzt zwar keinerlei
          Hinweise auf einen unnat&uuml;rlichen Tod, aber Miss
          Emilys alte Freundin Lucy Bellringer ist misstrauisch.
          Hartn&auml;ckig setzt sie dem unwilligen Detective Chief
          Inspector Barnaby so lange zu, bis er schlie&szlig;lich
          nachgibt und den Fall untersucht. Tats&auml;chlich
          entdeckt er bald Risse in der blankpolierten Fassade des
          Dorfes. Dahinter kommen langj&auml;hrige
          Rivalit&auml;ten, alte Aff&auml;ren und neue Skandale zum
          Vorschein. Als auch noch ein zweiter Mord geschieht, ist
          Barnaby endg&uuml;ltig wachger&uuml;ttelt, und nun kann
          ihn nichts und niemand mehr aufhalten, den M&ouml;rder zu
          stellen.</P>

          <P><B>Anmerkungen:</B></P>

          <P><B>Empfehlung:</B><BR>
          Ich fand das Buch sehr spannend, aber auch
          ersch&uuml;tternd.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>Buchtitel: Harry Potter und der Orden des
          Ph&ouml;nix<BR>
          Autor: Joanne K. Rowling<BR>
          Vorgestellt von: Karin<BR>
          Verlag: Carlsen<BR>
          Erscheinungsjahr: 2003<BR>
          Gesamtseitenzahl: 1021<BR>
          ISBN: 3-551-55555-9<BR>
          Format: digital</H3>

          <P><B>Inhalt:</B><BR>
          Es sind Sommerferien und wieder sitzt Harry bei den
          uns&auml;glichen Dursleys im Ligusterweg fest. Doch
          diesmal treibt ihn gr&ouml;&szlig;ere Unruhe denn je -
          warum schreiben seine Freunde Ron und Hermine nur so
          r&auml;tselhafte Briefe? Und vor allem: Warum
          erf&auml;hrt er nichts &uuml;ber die dunklen M&auml;chte,
          die inzwischen neu erstanden sind? Noch ahnt er nicht,
          was der geheimnisvolle Orden des Ph&ouml;nix gegen
          Voldemort ausrichten kann ...</P>

          <P>Als Harrys f&uuml;nftes Schuljahr in Hogwarts beginnt,
          werden seine Sorgen nur noch gr&ouml;&szlig;er. Und dann
          schl&auml;gt der Dunkle Lord wieder zu. Harry muss seine
          Freunde um sich scharen, sonst gibt es kein
          Entrinnen.</P>

          <P><B>Anmerkungen:</B></P>

          <P><B>Empfehlung:</B><BR>
          Dieses Buch ist voller Spannung und ich kann es nur
          weiterempfehlen</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>Buchtitel: Der verlorene Blick<BR>
          Autor: Jana Frey<BR>
          Vorgestellt von: nathalie<BR>
          Verlag: Loewe Verlag<BR>
          Erscheinungsjahr: 2002<BR>
          Gesamtseitenzahl: 170<BR>
          ISBN: 3785541988<BR>
          Format: Schwarzschrift</H3>

          <P><B>Inhalt:</B><BR>
          Leonie ist 15, und ihre Augen sind waldmeistergr&uuml;n.
          Das ist es, was er so an ihr liebt, sagt ihr Freund
          Frederik. Doch eines Tages geschieht ein entsetzlicher
          Unfall, und Leonie erwacht in einer neuen Welt aus
          Finsternis. Leonie ist blind. Jeder Schritt zur&uuml;ck
          in ihr altes Leben wird zur Qual. Aber w&auml;hrend
          Leonie sich mehr und mehr in die Dunkelheit verkriecht,
          k&auml;mpfen ihre Freunde um sie. Leonies Geschichte ist
          tats&auml;chlich passiert. In einem m&uuml;hevollen
          Prozess musste das M&auml;dchen lernen, seine
          Selbstst&auml;ndigkeit und damit sein Selbstbewusstsein
          zur&uuml;ckzuerlangen. Wie schmerzvoll das f&uuml;r
          Leonie war, hat sie der Autorin Jana Frey erz&auml;hlt
          und damit diesen bewegenden Roman erm&ouml;glicht.<BR>
           (Quelle: www.amazon.de)</P>

          <P><B>Anmerkungen:</B><BR>
          Ich selbst habe das Buch nicht gelesen, mir daf&uuml;r
          aber einige Rezensionen von Amazon.de-Kunden zu
          Gem&uuml;te gef&uuml;hrt. Dabei war vor allem einhellige
          Meinung, dass das Buch sehr "bewegend", "spannend" und
          "realistisch" sei. Andererseits wiederum kommt auch ein
          Blindenp&auml;dagogik-Student zu Wort, der den gelegten
          Schwerpunkt auf Mitleid statt Miteinander bem&auml;ngelt.
          Dies k&ouml;nnte eins der B&uuml;cher sein, die f&uuml;r
          Blinde &uuml;berwiegend nur Mitleid erregen will und kein
          wirkliches Verst&auml;ndnis.</P>

          <P><B>Empfehlung:</B><BR>
          Vielleicht sollte man das Buch mal lesen, um sich die
          Meinung der heutigen blindenunerfahrenen Gesellschaft
          n&auml;herzubringen. Vielleicht tue ich mir dieses sogar
          mal an!</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <H3>Buchtitel: Der Herr der Ringe - Band 1 - Die
          Gef&auml;hrten<BR>
          Autor: Tolkien, John Ronald R.<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: Klett-Cotta verlag<BR>
          Erscheinungsjahr: 1994<BR>
          Gesamtseitenzahl: 491<BR>
          ISBN: 3-608-95211-X<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Drei Ringe den Elbenk&ouml;nigen hoch im Licht,<BR>
           Sieben den Zwergenherrschern in ihren Hallen aus
          Stein,<BR>
          Den Sterblichen, ewig dem Tode verfallen, neun,<BR>
          Einer dem Dunklen Herrn auf dunklem Thron<BR>
          Im Lande Mordor, wo die Schatten drohn.<BR>
          Ein Ring, sie zu knechten, sie alle zu finden,<BR>
          Ins Dunkel zu treiben und ewig zu binden<BR>
          Im Lande Mordor, wo die Schatten drohn.</P>

          <P>Dies ist die &Uuml;bersetzung der Worte, die auf eben
          jenem Ring in der dunklen Sprache Mordors geschrieben
          stehen.</P>

          <P>Auf einer seiner zahllosen Reisen durch Mittelerde
          st&ouml;&szlig;t der "Hobbit" Bilbo Beutlin unterhalb des
          Nebelgebirges in einer H&ouml;hle an einem unterirdischen
          See auf das lichtscheue und merkw&uuml;rdige
          Gesch&ouml;pf Gollum.</P>

          <P>Unter Begebenheiten, die woanders n&auml;her
          erkl&auml;rt werden sollen, findet er dort diesen Ring
          und beh&auml;lt ihn lang bei sich, ohne zu wissen, von
          welcher Macht dieses Schmuckst&uuml;ck ist.</P>

          <P>Die n&auml;chsten 60 Jahre verbringt er dann
          haupts&auml;chlich im Heimatland der Hobbits, dem
          Auenland, wo er schlie&szlig;lich auch seinen Neffen
          Frodo gro&szlig;zieht.</P>

          <P>An seinem "Einundelfzigsten" Geburtstag, der
          gleichzeitig Frodos dreiunddrei&szlig;igster ist, macht
          sich Bilbo jedoch aufs neue auf die Wanderschaft,
          hinterl&auml;sst seinem Neffen jedoch sein Haus und einen
          Briefumschlag, der ebenfalls den geheimnisvollen Ring
          enth&auml;lt, von dem man nur wei&szlig;, dass er seinen
          Tr&auml;ger unsichtbar macht.</P>

          <P>Gandalf, ein Zauberer und Freund von Frodo und Bilbo
          r&auml;t dem jungen Hobbit jedoch, ihn so wenig wie
          m&ouml;glich zu benutzen.</P>

          <P>17 Jahre sp&auml;ter kommt Gandalf erneut ins
          Auenland, um Frodo zu besuchen, um ihm die Geschichte des
          "Zauberrings" zu erz&auml;hlen.</P>

          <P>Die Elbenschmiede fertigten vor langer Zeit, in einem
          anderen Zeitalter, magische Ringe. Drei erhielten die
          Elbenherrscher selbst, sieben wurden den Zwergen
          geschenkt, und neun waren f&uuml;r die Sterblichen.</P>

          <P>Diese Ringe wurden geschmiedet um zu heilen, zu
          schaffen und zu erhalten.</P>

          <P>Im Dunkel seiner Schmiede begann jedoch Sauron, der zu
          dieser Zeit nicht mehr als ein Lehrling des B&ouml;sen
          war, seinen eigenen Ring zu schaffen, der alle anderen
          beherrschen sollte.</P>

          <P>Wie der Ring von Sauron selbst schlie&szlig;lich
          &uuml;ber Krieg und Mord unter das Nebelgebirge geriet,
          sodass der Hobbit Bilbo ihn finden sollte, wird in diesem
          und in einem anderen Buch erkl&auml;rt.</P>

          <P>Gesagt sei, dass Gandalf dem jungen Frodo auftrug, den
          Ring aus dem Auenland zu bringen, da der dunkle Herrscher
          Sauron bereits seine Diener ausgeschickt hatte, ihm den
          einstmals gestohlenen und f&uuml;r seine
          unumschr&auml;nkte macht notwendigen Ring wieder zu
          bringen.</P>

          <P>Diese Diener sind die Ringgeister.</P>

          <P>Einstmals waren sie m&auml;chtige K&ouml;nige und
          Hexenmeister, sie waren die Tr&auml;ger der neun Ringe
          der Sterblichen.</P>

          <P>Als Sauron noch im Besitz des gro&szlig;en Ringes war,
          war es ihm gelungen, sich diese neun zu unterwerfen,
          sodass sie fortan als k&ouml;rperlose, jedoch
          unheilbringende Wesen unter der Sonne wandelten, die,
          wohin sie auch kamen, das B&ouml;se ihres Herrschers mit
          sich brachten und noch immer bringen.</P>

          <P>So macht er sich unter Begleitung seiner drei Freunde
          Sam, Pipin und Meriadok auf den Weg nach Imladris, oder
          auch Bruchtahl genannt, wo Elrond und einige andere
          beraten sollen, was mit dem Ring geschieht.</P>

          <P>Unter vielen Gefahren und stets verfolgt von den
          dunklen Dienern Saurons, gelangt Frodo schlie&szlig;lich
          nach Bree, wo er auf Aragorn st&ouml;&szlig;t.</P>

          <P>Dieser erst recht unheimliche Geselle stellt sich
          ihnen erst als ein Waldl&auml;ufer vor, jedoch
          erf&auml;hrt Frodo bald, dass es sich um den letzten
          Erben in einer langen Reihe von K&ouml;nigen handelt.</P>

          <P>In seiner Begleitung erreichen die vier hobbits
          schlie&szlig;lich Bruchtahl, wo Elrond in Gesellschaft
          vieler Elben, Menschen, Zwerge und auch des Zauberers
          Gandalf einen Rat &uuml;ber das weitere Schicksal des
          Ringes abh&auml;lt.</P>

          <P>Der Ring muss vernichtet werden, so ist man sich
          einig. Doch kein Zauber und keine Gewalt w&auml;re
          ausreichend, einen Gegenstand solcher Magie zu
          vernichten.</P>

          <P>Da der dunkle Herrscher Sauron jedoch nie diesen Ring
          erhalten und damit wieder Herrschaft &uuml;ber alle
          anderen und wohl &uuml;ber ganz Mittelerde erlangen darf,
          soll Frodo nun in das Land Mordor, das Land Saurons
          selbst gehen, um dort den Ring in die Feuer des
          Schicksalsberges zu werfen, in denen er geschmiedet
          wurde, da alle hierin die einzige M&ouml;glichkeit sehen,
          ihn zu zerst&ouml;ren.</P>

          <P>Und so macht Frodo sich auf, in Begleitung seiner acht
          Gef&auml;hrten, - seine drei Freunde aus dem Auenland,
          dem Zauberer Gandalf, dem Waldelben Legolas, dem Sohn des
          Herren von Gondor, dem Zwergen Gimli und dem
          Waldl&auml;ufer Aragorn.</P>

          <P>Durch viele Gefahren werden sie gehen, und l&auml;ngst
          ist noch nicht alles erz&auml;hlt, denn dies ist nur der
          erste Teil, der von der Reise des Ringes und seines
          Tr&auml;gers erz&auml;hlt.</P>

          <P><B>Anmerkungen:</B><BR>
          Dies ist der erste von drei Teilen, die das Lebenswerk J.
          R. R. Tolkiens bilden.</P>

          <P>Die ISBN-Nummer Erkl&auml;rt sich dadurch, dass alle
          drei Teile hier in einer Gesamtausgabe erschienen
          sind.</P>

          <P>Im Laufe der Jahrzehnte gab es viele Verlage, die
          deutsche &Uuml;bersetzungen von Tolkiens "The Lord Of The
          Rings" herausgebracht haben, doch nicht viele besitzen
          eine Qualit&auml;t, die die Sorgfalt des Autors in
          Benennung von Wesen, Gegenst&auml;nden und Orten wirklich
          &auml;quivalent wiedergibt.</P>

          <P>Deswegn hier ein kleiner Tipp, ein Hinweis auf eine
          der besten &Uuml;bersetzungen, die ich selbst je gesehen
          habe. Wer kann, sollte sich diese holen, oder versuchen,
          an eine Textausgabe dieser zu kommen.</P>

          <P>&Uuml;bersetzt wurden alle drei Teile in diesem Fall
          von Margaret Carroux. Die Gedicht&uuml;bertragung wurde
          vorgenommen von E. M. von Freymann.</P>

          <P><B>Empfehlung:</B><BR>
          Nun, ich denke, der Erfolg, den die B&uuml;cher und auch
          die Filme haben, sprechen v&ouml;llig f&uuml;r sich.
          bereits vor der Erscheinung der Filme hatte dieses Buch
          fast Kultstatus, auf jeden Fall aber eine
          Ber&uuml;hmtheit, zu der es wenige andere Werke gebracht
          haben.</P>

          <P>Lesenswert. Auf jeden Fall.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a06"></A> 

          <H3>Buchtitel: Der Herr der Ringe - Die R&uuml;ckkehr des
          K&ouml;nigs<BR>
          Autor: Tolkien, John Ronald Reuel<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: Klett-Cotta Verlag<BR>
          Erscheinungsjahr: 1994<BR>
          Gesamtseitenzahl: 359<BR>
          ISBN: 3-608-95211-X<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          "Gondor! Gondor vom Gebirg zum K&uuml;stenstrich!<BR>
          Westwind wehte; das Licht der K&ouml;nigsg&auml;rten
          glich<BR>
          Hellem Regen: so fiel es auf den Silberbaum<BR>
          Einstmals. T&uuml;rme, Thron und Krone, goldner
          Traum!<BR>
          Gondor! Gondor! Wird der Westwind wieder wehn?<BR>
          Werden Menschen den Silberbaum dort wiedersehn?"</P>

          <P>Nach der Schlacht um Helms Klamm befinden sich Gandalf
          und Pipin nun auf dem Weg nach Minas Tirith, da sie
          vermuten, dass dort der erste Schlag des Feindes zu
          erwarten ist.</P>

          <P>Diese Stadt ist "das Bollwerk des Westens", also der
          Schutzschild Mittelerdes gegen die Heere des Feindes. Man
          wei&szlig;, f&auml;llt Minas Tirith, wird auch Mittelerde
          fallen.</P>

          <P>Die anderen machen sich auf den Weg nach Rohan, um
          dort erneut ihre Kr&auml;fte gegen den dunklen Herrscher
          zu sammeln und Minas Tirith in der bevorstehenden
          Schlacht zur Seite zu stehen.</P>

          <P>Die Leuchtfeuer Minas Tiriths werden entz&uuml;ndet,
          und die Hauptstadt Gondors ruft jeden um Hilfe und
          Beistand an, der es sieht und nur zu helfen vermag,
          w&auml;hrend sich die Finsternis vom Osten her ausbreitet
          und bald sogar die Sonne und das Tageslicht selbst
          verschlucken wird.</P>

          <P>Die Heerschau Minas Tiriths f&auml;llt weit weniger
          vielf&auml;ltig aus, als man es sich auch nur
          gew&uuml;nscht h&auml;tte, und als der erste Pfeilregen
          und Katapultbeschuss des Feindes auf die wei&szlig;e
          Stadt niedergeht, ist das Heer Rohans noch fern, und die
          Kr&auml;fte, die der dunkle Herrscher ausschickt,
          scheinen &uuml;berm&auml;chtig.</P>

          <P>Und nicht nur das, eine Flotte von Schiffen, bemannt
          von den Corsaren aus dem S&uuml;den n&auml;hert sich bei
          Lebennin den Str&ouml;mungen des Gro&szlig;en Flusses, um
          die Stadt von dort aus anzugreifen.</P>

          <P>Aragorn erreicht &uuml;ber diese Schiffe Botschaft in
          Rohan, und er wird mit ein paar M&auml;nnern, unter ihnen
          Gimli und Legolas, einen anderen Weg gehen, einen
          d&uuml;steren weg, der nur ihm als Erbe Isildurs offen
          steht, um diese Schiffe aufzuhalten.</P>

          <P>Dies wird die zweite und wohl furchtbarste Schlacht in
          den Erz&auml;hlungen des Ringkrieges werden.</P>

          <P>Frodo ist noch immer in Gefangenschaft der Orks, und
          Sam auf der Suche nach ihm. Er tr&auml;gt nun zwar an
          Frodos statt den Ring, doch ist ihm sein Herr das
          Wichtigste, und nachdem er wei&szlig;, dass er immer noch
          lebt und nun in Gefangenschaft der Orks ist, ist sein
          Ziel klar.</P>

          <P>Tats&auml;chlich schafft er es auch, Frodo zu
          befreien, und so machen sie sich zu zweit auf, durch die
          unwirkliche und gef&auml;hrliche Landschaft Mordors in
          Richtung des Schicksalsberges.</P>

          <P>Je n&auml;her Frodo diesen Feuern kommt, desto
          m&auml;chtiger wird der Ring, und desto schwerer wird
          auch seine B&uuml;rde. Sie zehrt an seinen Kr&auml;ften,
          und er ist kurz davor, endg&uuml;ltig aufzugeben,
          erdr&uuml;ckt von der Last des Ringes.</P>

          <P>Und doch wird die Zeit knapp, denn es ist seine
          Aufgabe, die Aufgabe zu vollenden, w&auml;hrend seine
          Freunde im Westen eine Schlacht schlagen, die nun schon
          aussichtslos scheint, die nur dadurch einen Sinn bekommt,
          dass sie die Aufmerksamkeit Saurons fort von seinen
          eigenen Landen weiter in den Westen zieht und somit den
          beiden Hobbits eine - wenn auch nur geringe -Chance
          einr&auml;umt.</P>

          <P><B>Anmerkungen:</B><BR>
          Dies ist nun der letzte Teil der Erz&auml;hlung &uuml;ber
          die Ringkriege. Sie stellt wohl den spannendten der drei
          Teile dar, da sich hier alles zuspitzt und man bis zum
          Ende nicht wei&szlig;, wie es ausgeht. Dieses Buch ist
          durchsetzt mit positiven und negativen Erlebnissen der
          Gef&auml;hrten, mit Hoffnung und tiefgehendem
          Pessimismus. Worauf all dies hinausl&auml;uft, kann man
          nicht sagen, bevor man es liest.</P>

          <P>In diesem Band wird in einem Anhang auch
          vollst&auml;ndig die Geschichte Arwens und Aragorns
          erz&auml;hlt, wie sie sich kennenlernten und welchen
          Kampf sie beide gegen die Konventionen der Gesellschaft
          und vor allem gegen die Vorstellungen Elronds zu
          f&uuml;hren hatten.</P>

          <P><B>Empfehlung:</B><BR>
          Es lohnt sich auf jeden Fall, denn wie auch die anderen
          beiden Teile versteht es dieses Buch, seinen Leser in
          jedes Hoch und Tief der Erz&auml;hlung mitzurei&szlig;en
          und mitfiebern zu lassen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a07"></A> 

          <H3>Buchtitel: Das Enneagramm-Video<BR>
          Autor: Rohr, Richard<BR>
          Vorgestellt von: Weinstein<BR>
          Verlag: Claudius Verlag GmbH<BR>
          Erscheinungsjahr: 1990<BR>
          Gesamtseitenzahl:<BR>
          ISBN: 3-532-62088-X<BR>
          Format: audio</H3>

          <P><B>Inhalt:</B><BR>
          Das Enneagramm-Video: Die 9 Gesichter der Seele</P>

          <P>Das Buch erl&auml;utert sehr umfangreich,
          ausf&uuml;hrlich und informativ die 9-Typenlehre und gibt
          einen sehr guten thematischen Einblick.</P>

          <P><B>Anmerkungen:</B><BR>
          F&uuml;r jeden, der an Weiterentwicklung interessiert
          ist, ist dieses Buch ein absolutes Muss.</P>

          <P><B>Empfehlung:</B><BR>
          unbedingt lesenswert</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a08"></A> 

          <H3>Buchtitel: Atlantis<BR>
          Autor: King, Stephen<BR>
          Vorgestellt von: Weinstein<BR>
          Verlag: Heyne<BR>
          Erscheinungsjahr: 1999<BR>
          Gesamtseitenzahl: 591<BR>
          ISBN: 3-453-15992-6<BR>
          Format: audio</H3>

          <P><B>Inhalt:</B><BR>
          Dieser Roman erz&auml;hlt die Geschichte einiger
          Jugendlicher in den 60er und 70er Jahren in den USA. Er
          gibt einen guten Einblick in die Denkweise und die
          Motivation der Antivietnambewegung und ist nicht nur eine
          Geschichte, sondern einige Geschichten paralell. Aber
          abschlie&szlig;end vereinen sich die Geschichten wieder
          zu einer.</P>

          <P><B>Anmerkungen:</B><BR>
          Dieses Buch unterscheidet sich von Kings &uuml;brigen
          B&uuml;chern, wie z. B. "The Green Mile" oder "Der
          Friedhof der Kuscheltiere" oder auch "Amok" und gibt ein
          beredtes Zeugnis der Vielf&auml;ltigkeit Stephen Kings.
          Nie langweilig, psychologisch gut geschrieben in der
          Darstellung der Charaktere.</P>

          <P><B>Empfehlung:</B><BR>
          unbedingt lesenswert</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a09"></A> 

          <H3>Buchtitel: Der Dagon-zyklus<BR>
          Autor: Hohlbein, Wolfgang<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: BECHTERM&Uuml;NZ VERLAG<BR>
          Erscheinungsjahr: 1996<BR>
          Gesamtseitenzahl: 893<BR>
          ISBN: 3404143388<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Sp&auml;tes 19.Jahrhundert. Der 24-J&auml;hrige Robert
          Craven, der bis dahin bei einer Frau gelebt hatte, die er
          f&uuml;r seine Tante hielt, trifft das erste Mal in
          seinem Leben bewusst auf seinen Vater (Roderick
          Andara).</P>

          <P>Er erf&auml;hrt von dessen Vergangenheit. Andara ist
          einer der ber&uuml;chtigten Hexen und Hexer von Salem.
          Auf der Flucht vor seiner Familie, die sich mit
          M&auml;chten eingelassen hatte, die &auml;lter als die
          Menschheit - ja sogar &auml;lter als die Erde selbst sind
          - hatte Andara seinen damals 3-j&auml;hrigen Sohn im
          Geheimen weggegeben und war bis zu jener Zeit weiter
          durch die Welt gereist auf der Flucht vor seinen Feinden
          und dem Fluch, der seit dem Streit mit den Hexen von
          Salem auf ihm lastete.</P>

          <P>Als Andara schlie&szlig;lich doch seinem Schicksal
          erliegt und er von den Wesen get&ouml;tet wird, die ihn
          sein halbes Leben verfolgt hatten, wird Robert Craven nun
          gezwungen, sein gef&auml;rhliches Erbe anzutreten, da das
          Schicksal seines Vaters auf ihn &uuml;bergegangen zu sein
          scheint.</P>

          <P>Er wird nun die Hauptgestalt in einer langen Serie von
          mysteri&ouml;sen Ereignissen, die ihn mehrmals um ein
          Haar das Leben kosten.</P>

          <P>Doch trotz allen Schreckens begleiten ihn Freunde auf
          diesem Weg, den zu verlassen ihm nicht erlaubt sein
          wird.</P>

          <P><B>Anmerkungen:</B><BR>
          Der Dagon-Zyklus ist ein Dreiteiler, der in Wolfgang
          Hohlbeins gr&ouml;&szlig;eres Werk "Der Hexer von Salem"
          oder auch "Der Hexer-Zyklus" eingebettet ist. Diese
          B&uuml;cher handeln alle von Roderick Andara und seinem
          Sohn Robert.</P>

          <P>All diese B&uuml;cher behandeln einen teilweise heute
          noch existenten Okkultismus und die Geschichten und
          Ger&uuml;chte, die sich um den Orden der Tempelritter
          ranken, der im 13. Jahrhundert ins Leben gerufen und
          offiziell etwa 300 Jahre sp&auml;ter wieder zerschlagen
          wurde.</P>

          <P>Eine der Hauptgestalten dieser B&uuml;cher neben
          Robert Craven ist der Schriftsteller Howard P. Lovecraft,
          der tats&auml;chlich im 19. Jahrhundert lebte und dessen
          Leben und vor allem Sterben bis heute R&auml;tsel
          aufgibt. Auch seine B&uuml;cher behandeln diese doch
          recht mystischen Themen.</P>

          <P><B>Empfehlung:</B><BR>
          Eine Trilogie, die eine Menge Fantasy birgt und auch eine
          Menge Anlass zum Gruseln gibt. Auf jeden Fall lesenswert.
          :-)</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a10"></A> 

          <H3>Buchtitel: David Copperfield<BR>
          Autor: Dickens, Charles<BR>
          Vorgestellt von: bianka<BR>
          Verlag: Diogenes Verlag<BR>
          Erscheinungsjahr: 1982<BR>
          Gesamtseitenzahl: 802<BR>
          ISBN: 3257210345<BR>
          Format: digital (Project Gutenberg)</H3>

          <P><B>Inhalt:</B><BR>
          Dickens beschreibt hier die Wirrungen und Irrungen des
          David Copperfield, eines nicht ganz reichen jungen Mannes
          im 19. Jahrhunderts und zeichnet dabei ein sehr gutes
          Bild der englischen Gesellschaft zu dieser Zeit.
          Besonders die Kindheit und Jugend des David Copperfield
          wird sehr feinf&uuml;hlig beschrieben.</P>

          <P><B>Anmerkungen:</B><BR>
          Wenn man sich auf die etwas skurrile, manchmal dr&ouml;ge
          englische Art einlassen kann, findet man darunter viele
          sch&ouml;ne Beschreibungen und viele einf&uuml;hlsame
          Momente, die einen durch ihre unverbl&uuml;mte
          Ehrlichkeit und Offenheit fesseln.</P>

          <P><B>Empfehlung:</B><BR>
          Lekt&uuml;re f&uuml;r Tage, an denen man viel Zeit hat
          und in denen man ohne viel Fantasy und Action in eine
          andere Welt fl&uuml;chten will.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a11"></A> 

          <H3>Buchtitel: Das wiedergefundene Licht<BR>
          Autor: Lusseyran, Jacques<BR>
          Vorgestellt von: bianka<BR>
          Verlag: Deutscher taschenbuchverlag<BR>
          Erscheinungsjahr: 1989<BR>
          Gesamtseitenzahl: 245<BR>
          ISBN: 3423300094<BR>
          Format: punktschrift (Paderborn)</H3>

          <P><B>Inhalt:</B><BR>
          Der Autor beschreibt seine Kindheit und Jugend als
          Blinder in Paris vor und w&auml;hrend des zweiten
          Weltkrieges. Aufgrund seiner T&auml;tigkeit im Widerstand
          erlebt er die Schrecken von Buchenwald und wird in
          letzter Minute befreit.</P>

          <P><B>Anmerkungen:</B><BR>
          Ich habe dieses Buch als recht ehrlich und befreiend
          empfunden, eben kein Buch, welches auf die
          Tr&auml;nendr&uuml;se dr&uuml;ckt, aber eben auch keine
          Betroffenheitsprosa im Stil "Blinde aller welt vereinigt
          Euch". :-) Eins der wenigen B&uuml;cher &uuml;ber
          Blindheit, die nach dem Lesen ein gutes Gef&uuml;hl bei
          mir hinterlassen haben.</P>

          <P><B>Empfehlung:</B><BR>
          F&uuml;r alle, die eine hoffnungsvolle und ehrliche (wenn
          auch subjektive) Sicht auf eine schwierige Welt zu
          w&uuml;rdigen wissen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a12"></A> 

          <H3>Buchtitel: Liebe Tracey, Liebe Mandy<BR>
          Autor: Marsden, John<BR>
          Vorgestellt von: Coni<BR>
          Verlag: Beltz Verlag<BR>
          Erscheinungsjahr: 2003<BR>
          Gesamtseitenzahl: 160<BR>
          ISBN: 3407789173<BR>
          Format: Schwarzdruck, digital</H3>

          <P>Inhalt: Ein Buch nur aus Briefen. Tracey und Mandy
          sind Brieffreundinnen und schreiben sich st&auml;ndig.
          Sie erz&auml;hlen sich von Familie, Freunden und
          Erlebnissen, doch dann f&auml;llt Mandy auf, dass Tracey
          sich in Widerspr&uuml;che verstrickt. Erst erz&auml;hlt
          sie, ihre Eltern seien gl&uuml;cklich verheiratet, dann
          sind sie geschieden. Mandy hakt nach, woraufhin Tracey
          nicht mehr schreibt. Aber Mandy bleibt hartn&auml;ckig
          und erf&auml;hrt schlie&szlig;lich, dass Tracey in
          Wahrheit im Jugendgef&auml;ngnis sitzt. Wird ihre
          Freundschaft diese Wahrheit &uuml;berstehen?</P>

          <P><B>Anmerkungen:</B><BR>
          Der Anfang des Buches war zwar etwas langweilig und immer
          nur Briefe zu lesen ist auf die Dauer nicht leicht, aber
          als dann das mit dem Gef&auml;ngnis kam, war es richtig
          packend und manchmal sogar herzergreifend. Hier sieht man
          wirklich, was Freundschaft bedeuten bzw. nicht bedeuten
          kann.</P>

          <P><B>Empfehlung:</B><BR>
          Unbedingt lesen!</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a13"></A> 

          <H3>Buchtitel: Der kleine Hobbit<BR>
          Autor: Tolkien, John Ronald Roy<BR>
          Vorgestellt von: zini<BR>
          Verlag: dtv<BR>
          Erscheinungsjahr: 1974<BR>
          Gesamtseitenzahl: 302<BR>
          ISBN: 3-7903-0133-7<BR>
          Format: Schwarzdruck</H3>

          <P><B>Inhalt:</B><BR>
          In einer H&ouml;hle unter dem Berg, da lebte ein Hobbit.
          Doch er lebte nicht in einer schmutzigen dunklen
          Erdh&ouml;hle. Nein, es war ein gem&uuml;tliches Haus.
          Dieser Hobbit hie&szlig; Bilbo Beutlin von Beutelsend. Er
          war, wie er glaubte, ein Hobbit wie jeder andere. Hobbits
          haben stets lust zum Essen, Trinken und Lachen. Doch
          niemals, ja, niemals haben sie Lust dazu, auf
          irgendwelche Abenteuer. Schon gar keine
          gef&auml;hrlichen. Denn diese versp&auml;ten doch nur die
          Mahlzeiten.</P>

          <P>Doch als eines Tages der Zauberer Gandalf in Bilbos
          Leben und sein Haus trat, und das auch noch mit dreizehn
          Zwergen, von denen einer der ber&uuml;hmte Thorin
          Eichenschild war, ver&auml;nderte sich sein Leben. Der
          Zauberer schickte den Hobbit n&auml;mlich auf eine
          Abenteuerreise, auf der er Leib und Leben riskieren
          musste.</P>

          <P>In dieser Geschichte erf&auml;hrt man, wie ein
          v&ouml;llig abenteuerunlustiger Hobbit namens Bilbo
          Beutlin in den Besitz eines Elbendolches kommt, gegen
          Riesenspinnen, Orks und Drachen k&auml;mpft und sogar
          einen Zauberring findet. Nicht genug damit. Er wird sogar
          zum Meisterdieb. Aber er erlangt auch die Freundschaft
          von Elben, Zwergen, Menschen und B&auml;ren, und ist ein
          Gast von Adlern. Das alles nur, weil er Thorin und seinen
          Zwergen helfen muss, den gewaltigen Schatz, der unter dem
          einsamen Berg liegt, aus den Klauen von Smaug dem Drachen
          zu holen. Dies alles und noch mehr erlebt Bilbo auf
          seiner langen und vor allem abenteuerlichen Reise.</P>

          <P><B>Anmerkungen:</B><BR>
          Tolkien hat mit seinem Buch eine eigene Welt geschaffen,
          in die man sich einfach entf&uuml;hren lassen muss und
          aus der man nur schwer wieder nach Hause findet.</P>

          <P><B>Empfehlung:</B><BR>
          Dieses Buch kann einfach nur als sehr gut befunden
          werden.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a14"></A> 

          <H3>Buchtitel: Das Bild Rose Madder<BR>
          Autor: King, Stephen<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: WILHELM HEYNE VERLAG M&uuml;nchen<BR>
          Erscheinungsjahr: 1995<BR>
          Gesamtseitenzahl: 588<BR>
          ISBN: 3-453-09078-0<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Rosie war der Hintergrund gleichg&uuml;ltig - ihre ganze
          Aufmerksamkeit galt der zentralen Figur des
          Gem&auml;ldes. Auf der H&uuml;gelkuppe stand eine Frau
          und sah auf die Ruinen des Tempels hinunter, so da&szlig;
          jeder, der das Bild betrachtete, nur ihren R&uuml;cken
          sehen konnte. Ihr Haar war blond und hing zu einem Zopf
          geflochten den R&uuml;cken hinab. Um einen ihrer
          anmutigen Oberarme - dem rechten - trug sie einen breiten
          Goldreif. Die linke Hand hatte sie erhoben, und obwohl
          man es nicht mit Sicherheit sagen konnte, sah es aus, als
          w&uuml;rde sie die Augen abschirmen. Das war seltsam
          angesichts des wolkenverhangenen Gewitterhimmels, dennoch
          schien sie genau das zu tun. Sie trug ein kurzes Gewand
          -eine Toga, vermutete Rosie, die eine milchwei&szlig;e
          Schulter entbl&ouml;&szlig;t lie&szlig;. Die Farbe des
          Kleidungsst&uuml;cks war ein leuchtendes Purpurrot.</P>

          <P>Es war unm&ouml;glich zu sagen, was, wenn
          &uuml;berhaupt, sie an den F&uuml;&szlig;en trug - das
          Gras, in dem sie stand, reichte fast bis zu ihren Knien,
          wo die Toga aufh&ouml;rte.</P>

          <P>Rosie, Anfang 30, vor einiger Zeit aus ihrer Ehe
          geflohen, eine Ehe mit einem Mann, der sie fast 14 Jahre
          lang mit grausamer Regelm&auml;&szlig;igkeit
          verpr&uuml;gelt hatte, nun noch immer auf der Flucht vor
          ihm - die von der Tatsache, dass der recht brutal
          veranlagte Norman Polizist ist nicht leichter gemacht
          wird - nun nach einiger Zeit in einem Frauenhaus auf dem
          Wege ihr eigenes Leben in einer fremden Stadt auf sich zu
          nehmen, landet auf der Suche nach einem Pfandleiher, bei
          dem sie ihren Ehering zu Geld machen kann, in einem
          Laden, der mit allerlei "Schnickschnack" angef&uuml;llt
          ist, und bleibt auf den ersten Blick v&ouml;llig
          gefesselt und fasziniert vor diesem Bild stehen.</P>

          <P>Keine Frage, kein Nachdenken und Zaudern, sie muss
          dieses Bild kaufen.</P>

          <P>Es wird jedoch l&auml;nger dauern, bis sie bemerkt,
          welche Auswirkungen dieses Bild auf ihr Leben haben wird,
          bis sie bemerkt, wie sie selbst langsam anf&auml;ngt der
          Frau darauf immer &auml;hnlicher zu sehen, bis sie
          bemerkt, welche Beziehung sie wirklich zu diesem Bild und
          der Frau darauf hat, oder diese zu ihr ...</P>

          <P>"Kein Titel, keine Signatur", sagte Steiner. "Es sei
          denn ..."</P>

          <P>Er drehte das Bild herum. Auf dem Karton der
          R&uuml;ckseite standen in sanften, etwas verschwommenen
          Kohlestrichen die Worte ROSE MADDER geschrieben.</P>

          <P>"Nun", sagte er zweifelnd, "da haben wir ja den Namen
          der K&uuml;nstlerin, wie es aussieht. Komischer Name.
          Vielleicht ein Pseudonym." Robbie sch&uuml;ttelte den
          Kopf, machte den Mund auf, um etwas zu sagen, aber dann
          sah er, da&szlig; die Frau, die sich f&uuml;r das Bild
          entschieden hatte, es auch besser wu&szlig;te.</P>

          <P>"Es ist der Name des Bildes", sagte sie, und dann
          f&uuml;gte sie aus Gr&uuml;nden, die sie nie h&auml;tte
          erkl&auml;ren k&ouml;nnen, noch hinzu: "Rose ist mein
          Name."</P>

          <P><B>Anmerkungen:</B><BR>
          Ein Buch, das eine erstaunliche Bandbreite abdeckt, alles
          ist darin zu finden. Spannung, ein gewisser Zauber,
          Schrecken, aber auch Gef&uuml;hl.</P>

          <P>Es ist nicht der Horror, der Stephen King oft
          zugesprochen wird, sondern ein Buch, das ich selbst eher
          schon fast als mystisch bezeichnen m&ouml;chte.</P>

          <P>Einmal damit angefangen, und es l&auml;sst seinen
          Leser nicht so schnell wieder fort. Es Lohnt sich!</P>

          <P><B>Empfehlung:</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a15"></A> 

          <H3>Buchtitel: Johannes<BR>
          Autor: Heinz K&ouml;rner<BR>
          Vorgestellt von: nathalie<BR>
          Verlag: Felbach: Lucy K&ouml;rner<BR>
          Erscheinungsjahr: 1997<BR>
          Gesamtseitenzahl:<BR>
          ISBN: 3-9220-2800-4<BR>
          Format: Punktschrift</H3>

          <P><B>Inhalt:</B><BR>
          "Johannes" ist in manchen Kreisen ebenso ein Klassiker
          wie "Die M&ouml;we Jonathan". Es ist die Geschichte einer
          wundersamen Begegnung: Eines Tages trifft Klaus - ein
          Mensch wie Du und ich - auf Johannes, einen seltsamen
          alten Mann, der ihn mit auf eine Wanderung nimmt.
          Johannes h&auml;lt Klaus einen Spiegel vor und stellt
          sein bisheriges Leben in Frage. Klaus kommt dahin, zu
          erkennen, was es hei&szlig;t, selbst die Verantwortung
          f&uuml;r das eigene Leben zu &uuml;bernehmen. Die
          Stilform der Geschichte ist sehr gut geeignet, um
          schwierige und tiefgehende Botschaften zu vermitteln.
          "Johannes" vermag es, uns Leser sehr nachdenklich zu
          machen. Denn so wie Klaus erst alles von sich weist, so
          m&ouml;gen auch wir uns in der Distanz des Lesens
          zun&auml;chst aus der Aff&auml;re ziehen wollen. Schnell
          aber merken wir, dass der Name "Klaus" austauschbar ist,
          und dass genauso gut wir es selbst sein k&ouml;nnten, die
          dort in dem Buch die Hauptrolle spielen.<BR>
          Quelle:
          http://www.zeitzuleben.de/buch/in/johannes.html</P>

          <P><B>Anmerkungen:</B><BR>
          Ein Buch f&uuml;r alle, die ihren Weg zur
          Eigenverantwortlichkeit suchen und denen Sprengers "Die
          Entscheidung liegt bei Dir" zu heftig war. Auch gut
          geeignet als Geschenk f&uuml;r Menschen, die einem am
          Herzen liegen.<BR>
          Quelle:
          http://www.zeitzuleben.de/buch/in/johannes.html</P>

          <P><B>Empfehlung:</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a16"></A> 

          <H3>Buchtitel: Der Maler<BR>
          Autor: Silva, Daniel<BR>
          Vorgestellt von: nathalie<BR>
          Verlag: Piper / Centralbibliothek f&uuml;r Blinde
          Hamburg<BR>
          Erscheinungsjahr: 2001<BR>
          Gesamtseitenzahl: 528<BR>
          ISBN:<BR>
          Format: Punktschrift</H3>

          <P><B>Inhalt:</B><BR>
          Islamische Terroristen schie&szlig;en eine amerikanische
          Verkehrsmaschine ab. Gleichzeitig sind
          Pr&auml;sidentenwahlen, wobei dem Pr&auml;sidenten dieser
          Abschuss nat&uuml;rlich zugute kommt, da er in den
          Umfragen sehr schlecht dasteht. Ein reicher
          Gesch&auml;ftsmann und ihm h&ouml;rige Komplizen
          unterst&uuml;tzen die Wahl mit allen schmutzigen Mitteln.
          Dabei kommt auch eine Reporterin ums Leben, die diesen
          M&auml;nnern auf die Schliche gekommen ist. Der
          Pr&auml;sident veranlasst einen Vergeltungsschlag auf
          entsprechende Trainingslager der sogenannten Organisation
          "Schwert von Gaza", die sich zu dem Attentat auf die
          US-Maschine in einem Telex bekannt hat, das in London
          eintraf. Parallel dazu nimmt ein CIA-Agent namens Michael
          Osburne gegen den Willen des Chefs die Spur auf und
          durchlebt viele Gefahren, u.a. einen Granatenanschlag auf
          den Flughafen Heathrow, bei dem er selbst zum Helden
          wird, weil er einen Terroristen erschie&szlig;t und einen
          anderen erfolgreich au&szlig;er Gefecht setzt. In den
          70ern hatte auch der fr&uuml;here KGB ein! Interese an
          diesem Mann gehabt und setzte eine Agentin auf ihn an,
          die sich aber dann in ihn verliebte und deshalb
          liquidiert werden musste.</P>

          <P><B>Anmerkungen:</B><BR>
          Ein spannender Roman mit Verstrickung von Mafia,
          Geheimdiensten, der Politik, Anw&auml;lten etc., der
          durchaus in das heutige Weltgeschehen und das
          Weltterrorismusbild passt.</P>

          <P>Dieser Roman wurde vorgestellt von Konny Faber</P>

          <P><B>Empfehlung:</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a17"></A> 

          <H3>Buchtitel: Telepathie, Hellsehen und Psychokinese<BR>
          Autor: Bender, Hans<BR>
          Vorgestellt von: Coni<BR>
          Verlag: R. Piper<BR>
          Erscheinungsjahr: 1984<BR>
          Gesamtseitenzahl: 144<BR>
          ISBN: 3-492-00331-1<BR>
          Format: digital</H3>

          <P><B>Inhalt:</B><BR>
          In diesem Sachbuch sind verschiedene Aufs&auml;tze rund
          um das Thema Parapsychologie gesammelt. Es f&auml;ngt an
          mit Allgemeinem &uuml;ber die Parapsychologie, geht
          &uuml;ber Telepathie und Hellsehen hin zu
          Spukvorg&auml;ngen und Spiritismus (Glasr&uuml;cken usw.)
          zu Wunderheilungen. Es wird auch &uuml;ber
          Krankheitsbilder berichtet, die beim
          Gl&auml;serr&uuml;cken und automatischem Schreiben
          auftreten k&ouml;nnen. Wer sich f&uuml;r so etwas
          interessiert, kann mit diesem Buch vielleicht was
          anfangen.</P>

          <P><B>Anmerkungen:</B><BR>
          Man kann nicht bestreiten, dass das Buch interessant ist
          f&uuml;r die, die sich f&uuml;r Parapsychologie
          interessieren.</P>

          <P><B>Empfehlung:</B><BR>
          Der Anfang ist ja noch interessant bis
          einschlie&szlig;lich dem Aufsatz &uuml;ber die
          Spukvorg&auml;nge, aber dann kommt das ganze
          Spiritismusgerede und die Wunderheilungen und das Buch
          wird immer voller von Fremdw&ouml;rtern und komplizierten
          S&auml;tzen. Man versteht's zwar, aber das Lesen macht
          keinen Spa&szlig;, zumal das Buch trotz aller
          geschilderten F&auml;lle unpers&ouml;nlich ist und man
          mit den gelieferten Interpretationen als Laie nur bedingt
          etwas anfangen kann.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a18"></A>

          <H3>Buchtitel: Die Farm <BR>
          Autor: Grisham, John <BR>
          Vorgestellt von: Bitschreck <BR>
          Verlag: Wilhelm Heyne Verlag <BR>
          Erscheinungsjahr: 2002 <BR>
          Gesamtseitenzahl: 400 <BR>
          ISBN: <BR>
          Format: Digital </H3>

          <P><B>Inhalt: </B><BR>

          Arkansas, Anfang der F&uuml;nfziger: Der siebenj&auml;hrige Luke Chandler
          lebt mit seinen Eltern und Groﬂeltern auf einer kleinen Farm inmitten von
          Baumwollfeldern. In diesem Roman wird aus der Sicht des kleinen Luke der
          Kampf mit Regen und Hitze w&auml;rend der Erntezeit beschrieben. In diesem
          Sommer brechen Ereignisse &uuml;ber Lukes Leben herein, er erf&auml;hrt
          Geheimnisse, die seine kindliche Seele stark in Aufruhr versetzen. Mit
          seinem Wissen versucht er Liebe, Hass und Neid zu begreifen. Die
          Beobachtung eines Mordes treibt den kleinen Jungen an die Grenze seiner
          Belastbarkeit.

          <P><B>Anmerkungen: </B><BR>

          Wer John Grisham durch seine ber&uuml;hmten B&uuml;cher, die sich meist um
          juristische Feinheiten aus den USA drehen, kennt, wird durch diesen Roman
          positiv &uuml;berrascht sein.

          <P><B>Empfehlung: </B><BR>
          Lesenswert </P> 

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

