<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- Author = Mathias Klingner -->

<TITLE>AquaDom &amp; SEA-LIFE</TITLE>
</HEAD>

<BODY background="images/bga.gif" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" summary="Seitenlayout mit Rand">
<TR><TD>
<CENTER>
<TABLE width="750" border="1" summary="Formatierung">
<TR><TD>
<H3><A href="mm_mmx.html"><B>zur&uuml;ck</B></A>zum Frame</H3>

<P align="center"><FONT color="#000080" size="7"><B>AquaDom &amp; SEA-LIFE</B></FONT></P>

<TABLE width="100%" border="0" summary="Bilderreihe 1">
<TR><TD>
<IMG src="images/sl01.jpg" alt="01" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Eingang zum AquaDom &amp; SEA-LIFE Berlin</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl02.jpg" alt="02" width="360" height="240"><BR>
<CENTER>
<FONT size="1">&Uuml;bersichtsplan vom AquaDom &amp; SEA-LIFE Berlin</FONT>
</CENTER>
</TD></TR></TABLE>

<P>Anfang Dezember er&ouml;ffnete in Berlin, im Dom Aquarée an der
Karl-Liebknecht-Stra&szlig;e das neue AquaDom und Sea-Life Berlin. Die
Sea-Life Centre geh&ouml;ren zur gr&ouml;&szlig;ten Aquariumskette der
Welt. Sie werden jedes Jahr von &uuml;ber 5 Millionen Menschen besucht. Das
besondere an den Sea Life Centre ist die ausschlie&szlig;liche
Pr&auml;sentation der einheimischen Fischarten. </P>

</TD></TR>

<TR><TD>
<TABLE width="100%" border="0" summary="Bilderreihe 2">
<TR><TD>
<IMG src="images/sl03.jpg" alt="03" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Das Spree-Aquarium</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl04.jpg" alt="04" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Der Wannsee mit dem Panorama der Pfaueninsel</FONT>
</CENTER>
</TD></TR></TABLE>

<P>Im Berliner Sea-Life-Centre kann man in mehr als 30 verschiedenen, teils
oben offenen Becken, den Verlauf der Spree von ihrer Quelle &uuml;ber den
Spreewald bis nach Berlin und weiter &uuml;ber Havel, Elbe und Nordsee bis
zum Atlantik sehen. Alle Tiere, die in den oben genannten Gew&auml;ssern
heimisch sind, k&ouml;nnen in den verschiedenen Becken bestaunt werden. Es
handelt sich dabei um ca. 3000 Fische aus rund 60 verschiedenen Arten - von
der Muschel &uuml;ber Krebse und Rochen bis zu Haien. </P>
</TD></TR>

<TR><TD>
<TABLE width="100%" border="0" summary="Bilderreihe 3">
<TR><TD>
<IMG src="images/sl05.jpg" alt="05" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Der Sterlet - einer der kleinsten Art der St&ouml;rfamilie</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl06.jpg" alt="06" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Becken aus dem Bereich Havel und Elbe mit Wasserrad</FONT>
</CENTER>
</TD></TR></TABLE>
</TD></TR>

<TR><TD>
<TABLE width="100%" border="0" summary="Bilderreihe 4">
<TR><TD>
<IMG src="images/sl07.jpg" alt="07" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Hafenbecken</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl08.jpg" alt="08" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Hafenbecken - Hochseehafen</FONT>
</CENTER>
</TD></TR></TABLE>
</TD></TR>

<TR>
<TD>
<TABLE width="100%" border="0" summary="Bilderreihe 5">
<TR><TD>
<IMG src="images/sl09.jpg" alt="09" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Einsiedlerkrebs</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl10.jpg" alt="10" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Schwarming - Fischschwarmbecken</FONT>
</CENTER>
</TD></TR></TABLE>
</TD></TR>

<TR><TD>
<TABLE width="100%" border="0" summary="Bilderreihe 6">
<TR><TD>
<IMG src="images/sl11.jpg" alt="11" width="360" height="240"><BR>

<CENTER>
<FONT size="1">in der Nordsee lebende Mur&auml;ne</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl12.jpg" alt="12" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Ohrenquallen</FONT>
</CENTER>
</TD></TR></TABLE>
</TD></TR>

<TR><TD>
<TABLE width="100%" border="0" summary="Bilderreihe 7">
<TR><TD>
<IMG src="images/sl13.jpg" alt="13" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Kugelaquarium mit dem Gefleckten Seewolf</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl14.jpg" alt="14" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Gefleckter Seewolf</FONT>
</CENTER>
</TD></TR></TABLE>
</TD></TR>

<TR><TD>
<TABLE width="100%" border="0" summary="Bilderreihe 8">
<TR><TD>
<IMG src="images/sl15.jpg" alt="15" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Seesterne im Streichelaquarium</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl16.jpg" alt="16" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Der Nagelrochen</FONT>
</CENTER>
</TD></TR></TABLE>

<P>F&uuml;r Kinder besonders interessant sind die oben offenen Becken. So ist
z.B. das Becken mit Seesternen oben offen und diese k&ouml;nnen, unter den
Augen der freundlichen Angestellten, in die Hand genommen werden. </P>

</TD></TR>

<TR><TD>
<TABLE width="100%" border="0" summary="Bilderreihe 9">
<TR><TD>
<IMG src="images/sl17.jpg" alt="17" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Haifisch &uuml;ber dem Kopf im Tunnelbecken</FONT>
</CENTER>
</TD>

<TD>
<IMG src="images/sl19.jpg" alt="19" width="360" height="240"><BR>

<CENTER>
<FONT size="1">Blick aus dem Fahrstuhl in den AquaDom</FONT>
</CENTER>
</TD></TR></TABLE>

<P>Ein besonderer Anziehungspunkt ist ein nur ein Meter tiefes aber 300
Quadratmeter gro&szlig;es Rochenbecken und ein acht Meter langer
gl&auml;serner Tunnel. Wer durch ihn geht f&uuml;hlt sich auf den
Meeresgrund versetzt und kann dabei noch Haien zusehen, die zum greifen
Nahe an einem vorbeiziehen. </P>
</TD></TR>
<TR><TD colspan=2>
<TABLE border="0" summary="Bilderreihe 10" align=left>
<TR><TD>
<IMG src="images/sl18.jpg" alt="18" width="240" height="360"><BR>

<CENTER>
<FONT size="1">Der AquaDom</FONT>
</CENTER>
</TD></TR></TABLE>

<P valign=top>Die Hauptattraktion ist jedoch das von dem amerikanischen
Unternehmen Reynolds Polymer Technologie aus bis zu 22 Zentimeter dicken
Acrylglasscheiben so zusammengeklebte, zylindrische Aquarium, das keine
R&auml;nder mehr zu sehen sind. Der Riesenzylinder ist 16 Meter hoch, hat
einen Durchmesser von 11,50 Metern und ist damit der gr&ouml;&szlig;te
Acrylzylinder der Welt. Dieser Aqua-Dom genannte Acrylzylinder steht mitten
im Foyer des Radisson SAS Hotels im Dom Aquareé. Durch dieses, mit ca.
einer Million Litern, 25 Grad warmen Meerwassers gef&uuml;llte Aquarium
kann man mit einem zweist&ouml;ckigen, gl&auml;sernen Fahrstuhl fahren und
dabei die ca. 2600 Fische in 56 Arten aus der Karibik, dem Mittelmeer und
dem Pazifik sehen (Bild 18 und 19). Die Fahrt mit dem Fahrstuhl, f&uuml;r
bis 30 Besucher gleichzeitig, dauert ca. f&uuml;nf Minuten. Wenn man
Gl&uuml;ck hat, dann kann man einem Taucher dabei zusehen, wie er die
Fische in dem Riesenaquarium f&uuml;ttert. </P>

<P>Ich war am dritten Tag nach der Er&ouml;ffnung morgens um 10 Uhr im
Aqua-Dom und Sea-Life Berlin. Zu dieser Zeit war der Besucherandrang noch
nicht so gro&szlig; und man brauchte nicht zu lange warten um eingelassen
zu werden. Der Eintritt kostet f&uuml;r Erwachsene 13,50 EUR und Kinder 10
EUR und umfasst auch die Fahrstuhlfahrt durch den AquaDom. </P>

<P>F&uuml;r den Rundgang ben&ouml;tigt man ca. 1,5-2 Stunden, je nachdem
wie lange man sich bei den verschiedenen Becken aufh&auml;lt. Bei den
gr&ouml;&szlig;eren Becken stehen Angestellte von Sea-Life die zu den
gezeigten Fischen Hinweise geben und die gerne auch Fragen beantworten.
</P>

<P>Am Ende des Rundganges, nachdem man am Souvenirgesch&auml;ft vorbei
gekommen ist, muss man seine Eintrittskarte mit einem Zeitstempel versehen
und sich danach &uuml;ber den Hof zum Aqua-Dom begeben wo man dann mit dem
Fahrstuhl durch diesen fahren kann. </P>

<P>Zum Zeitpunkt, als ich diesen besuchte, wirkte das Riesenaquarium noch
etwas kahl und wenig an ein richtiges Aquarium erinnernd. Das liegt aber
daran, das der Pflanzenwuchs noch recht sp&auml;rlich war. Mit der Zeit
wird sich das aber bestimmt &auml;ndern und der Zylinder wird zunehmend
einem Aquarium immer &auml;hnlicher werden. </P>

<P>F&uuml;r fotointeressierte Besucher noch einige Hinweise: an manchen
Becken ist kein Blitz erlaubt, mit einem 400 ASA - 27 DIN-Film ist es aber
m&ouml;glich mit ruhiger Hand und ca. 1/15 - 1/30 sek. noch Aufnahmen von
den Becken zu machen, was ja auch die von mir gemachten Fotos beweisen.
</P>

<P>Zum Schluss kann ich zusammenfassend sagen, dass der Besuch sich gelohnt
hat und ich Jedem einen Besuch empfehlen kann. Es wird wirklich viel und
zum Teil auch mit gro&szlig;em Aufwand ein vielf&auml;ltiger Eindruck von
der heimischen Unterwasserwelt und seinen Bewohnern gezeigt. Besonders auch
f&uuml;r Kinder ist es bestimmt ein nachhaltiges Erlebnis. Der Rundgang
wurde mit einem Quiz f&uuml;r Kinder versehen bei dem Fragen zu den
gezeigten Fischen beantwortet werden k&ouml;nnen. </P>

<P>Mathias Klingner <BR>
e-mail: Tschandru.Shing@firemail.de </P>
</TD></TR></TABLE>
</CENTER>

<H3><A href="mm_mmx.html"><B>zur&uuml;ck</B></A>zum Frame</H3>
</TD></TR></TABLE>
<BR>
</BODY>
</HTML>

