<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      RndWBPatt
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling051203">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="images/jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="Text ohne Tabelle">
      <TR>
        <TD>
          <H3><B><A href="tl_tlx.html">zur&uuml;ck</A> zum Frame</B></H3>
          <H2 align="center">
            <B>RndWBPatt</B>
          </H2>
          <BR>
           <BR>

          <P>
            Ich m&ouml;chte heute mal &uuml;ber ein Programm berichten, das schon seit einiger Zeit auf meinem Amiga einen Auff&auml;lligen und sch&ouml;nen Dienst leistet: RndWBPatt.<BR>
             Wie es sich bestimmt schon vom Namen her vermuten l&auml;&szlig;t, handelt es sich hier um ein weiteres Programm, das den Hintergrund der Workbench mit zuf&auml;llig wechselnden Bildern
            versorgt.<BR>
            <BR>
             Viele werden jetzt denken: `<I>Hab ich schon</I>` oder `<I>noch so was`.</I><BR>
             Nun zeichnet sich dieses Programm aber dadurch aus, das au&szlig;er dem Workbench-Hintergrund zus&auml;tzlich noch die Fenster,- und Screen-Hintergr&uuml;nde zuf&auml;llig gewechselt
            werden k&ouml;nnen.<BR>
             Ein weiterer Punkt, der f&uuml;r RndWBPatt spricht, ist die M&ouml;glichkeit, die Qualit&auml;t der Bilder durch das Programm zu beeinflussen. Dazu werden die Parameter <TT>SCRCOLOR</TT>
            (<TT>WBCOLOR, WINCOLOR</TT>) und <TT>SCRDITHER</TT> (<TT>WBDITHER, WINDITHER</TT>) mit den Schl&uuml;sselworten <TT>POOR, GOOD</TT> und <TT>BEST</TT> genutzt.<BR>
             Wer unterschiedlich gro&szlig;e Bilder zu benutzen gedenkt, dem wird die Skalierung (<TT>SCALE</TT>) kleiner Bilder auf einen gr&ouml;&szlig;eren Bildschirm oder umgekehrt gefallen.
            Weitere Parameter gibt es mit <TT>WBLAYOUT Tile</TT> (kacheln) und <TT>CENTER</TT> (zentrieren). All diese Parameter werden dem Programm gleich beim Aufruf mit &uuml;bergeben.<BR>
             Hiermit wird wohl niemand Schwierigkeit bekommen, es sind im Prinzip die gleichen Parameter wie im OS3.9 Prefs-Einsteller WBPattern.<BR>
             <B>Zur Installation von RndWBPatt:</B><BR>
             Man nehme das Progamm und kopiere es in das <B>C:</B> - Verzeichnis. Nun wird eine Schublade f&uuml;r die Bilder, z.B. <I>WBBilder</I>, erzeugt und dort hinein ein paar Bilder
            kopiert.<BR>
             Der Start von RndWBPatt kann jederzeit nach dem Erzeugen des <B>ENV:</B> - Verzeichnisses in der Startup-Sequence erfolgen (<TT>C:Copy &gt;NIL: ENVARC: RAM:ENV ALL NOREQ</TT>).<BR>
             Mit einem Text-Editor wird nun die Startup-Sequence oder die User-Startup folgenderma&szlig;en ver&auml;ndert:<BR>
             <B>RndWBPatt WBDIR=DH0:WBBilder WBLAYOUT=SCALEWELL</B><BR>
             Das hei&szlig;t, das <B>RndWBPatt</B> die Hintergrundbilder von der Festplatte <B>DH0</B> aus den Verzeichnis <B>WBBilder</B> liest und bestm&ouml;glichst Skaliert.<BR>
          </P>
          <DIV align="CENTER">
            <H1>
              <A href="images/st_wbscreen1.jpg"><IMG src="images/st_wbscreen1_tump.jpg" alt="Workbench Nr. 1 anklicken" width="160" height="120" hspace="12"></A>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="images/st_wbscreen2.jpg"><IMG src="images/st_wbscreen2_tump.jpg" alt="Workbench Nr.2 anklicken" width="160" height="120" hspace=
              "12"></A>
            </H1>
            Zwei Beispiele meiner ver&auml;nderlichen Workbench
          </DIV>
          <BR>
           <BR>
           Es besteht auch die Option, mehrere Verzeichnisse mit Bilder anzulegen aus denen RndWBPatt seine Zufalls-Bilder ausw&auml;hlt.<BR>
           Soll auch der Hintergrund der Fenster g&auml;ndert werden, empfiehlt sich der nochmalige Aufruf gleich nach dem ersten:<BR>
           <B>RndWBPatt WINDIR=DH0:WINBilder</B>.<BR>
           (Als zusammengef&uuml;gter Aufruf in einer Zeile funktioniert der Start von RndWBPatt bei mir nicht.)<BR>
           Ein kleiner Nachteil an RndWBPatt ist mir aber dennoch aufgefallen: Ganz so zuf&auml;llig ist die Auswahl der Bilder dann doch nicht. Das Programm scheint ein paar `Lieblings-Bilder` zu
          haben, die es etwas h&auml;ufiger ausw&auml;hlt. Auch nicht schlimm, besser als st&auml;ndig das gleiche Bild...<BR>
           Da das Programm nur eine Gr&ouml;sse von ca. 6,5 KByte hat, k&ouml;nnte es jeder mal ausprobieren, wenn, ja wenn da nicht die Bilder w&auml;ren. Die nehmen nat&uuml;rlich geh&ouml;rig
          Platz auf der HD weg. Aber das ist ja heutzutage nicht mehr das Problem. Bei mir hat das Bilder-Verzeichnis mittlerweile 119 Eintr&auml;ge und eine Gr&ouml;sse von 18 MByte. Aber solang der
          Platz da ist, lohnt es sich.<BR>
           <BR>
           <BR>

          <P>
            RndWBPatt unterst&uuml;tzt folgende <B>CPU`s</B>: ab 68000<BR>
             <B>Ben&ouml;tigtes OS:</B> 3.9<BR>
             <B>RndWBPatt</B> ist <B>Freeware</B> und zu beziehen im Aminet <B>RndWBPatt.lha</B><BR>
             <B>Das Archiv</B> hat eine Gr&ouml;sse von ca. 5 KByte.<BR>
             <B>Autor:</B> <A href="mailto:jhyvonen@mail.student.oulu.fi">Juha Hyvonen</A>
          </P>
          <P>
            <B>Mein Fazit:</B> Ein kleines aber feines, sinnvolles Programm.
          </P>
          <HR>
          <BR>

          <CENTER>
            <BR>

            <CENTER>
              <IMG src="images/jojo.jpg" alt="JoJo" width="212" height="50">
            </CENTER>
          </CENTER>
          <H3><B><A href="tl_tlx.html">zur&uuml;ck</A> zum Frame</B></H3>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

