<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">

    <TITLE>Ein` hab ich noch...</TITLE>
    <META name="author" content="J&uuml;rgen Sperling051203 ">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="images/jsbg.jpg" text="#000000" link="#0000ff"
  vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10"
    summary="Eine Seite mit Witzen">
      <TR>
        <TD>
          <CENTER>
            <IMG src="images/st_einnoch.jpg" alt=
            "Ein` hab ich noch" width="432" height="96">
          </CENTER>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>
           

          <P>"Warum kommst du so sp&auml;t aus dem B&uuml;ro nach
          Hause?" - "Kleiner Scherz von den Kollegen. Die haben
          mich nicht geweckt."</P>
          <BR>
           
          <HR align="center" width="100%">

          <P><BR>
           Graf Koks kehrt in ein Hotel in Berlin ein. In seinem
          Hotelzimmer angekommen, &ouml;ffnet er den Schrank, um
          seine Sachen dort zu verstauen. Dort findet er ein
          reizendes Damennachthemd. Also l&auml;&szlig;t er den
          Pagen auf sein Zimmer kommen und &uuml;bergibt dem das
          leicht durchsichtige Etwas mit den Worten: "Bitte vom
          Zimmer-Service f&uuml;llen lassen!"</P>
          <BR>
           
          <HR width="100%" size="3">
          <BR>
           

          <P>Zwei Saufbr&uuml;der schwanken auf dem Bahngleis nach
          Hause. "Die Treppe nimmt einfach kein Ende!", schimpft
          der erste. - "Und erst das Gel&auml;nder. Wenn das
          blo&szlig; nicht so niedrig w&auml;re!"</P>
          <BR>
           
          <HR width="100%" size="3">
          <BR>
           

          <P>Zwei Bergsteiger stehen an einer Felsspalte: "Letzte
          Woche ist hier mein Bergf&uuml;hrer reingefallen!" -
          "Und, wurde er wieder heraus geholt?"<BR>
           "Ach, das lohnte nicht. Der war schon f&uuml;nf Jahre
          alt und es fehlten ein paar Seiten!"</P>
          <BR>
           
          <HR width="100%" size="3">
          <BR>
           

          <P>Der achtj&auml;hrige Franz f&auml;hrt mit dem Bus in
          die Schule. Da steigt eine Mutter mit einem Kleinkind
          ein. Da kein Platz mehr im Bus ist, bietet Franz der Frau
          seinen Sitzplatz an. Sagt die Mutter zu Franz: "Du bist
          ja ein richtiger Kavalier!"<BR>
           Im Deutschunterricht wird an diesem Tage zuf&auml;llig
          das Thema H&ouml;flichkeit behandelt. Fragt der Lehrer
          die Sch&uuml;ler, was denn ein Kavalier w&auml;re.
          Nat&uuml;rlich meldet sich Franz und erz&auml;hlt
          freudig: "Das ist jemand, der eine Frau mit Kind sitzen
          l&auml;&szlig;t!"</P>
          <BR>
           
          <HR width="100%" size="3">
          <BR>
           

          <P>"Warum ist denn Mama in Ohnmacht gefallen?", fragt der
          Vater seine vierzehnj&auml;hrige Tochter<BR>
           "Das war ihre eigene Schuld! - Warum liest sie auch mein
          Tagebuch!"</P>
          <BR>
           
          <HR width="100%" size="3">
          <BR>
           

          <P>"Mami, heut war die Frau vom Umweltschutz wieder da!"
          - "Vom Umweltschutz???"<BR>
           "Ja, die fragt Papi immer, ob die Luft rein ist!"</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Um 6 Uhr am morgen eilt der Familienvater mit seiner
          Aktentasche aus dem Haus Richtung Garage. An der
          Haust&uuml;r steht seine Frau mit der Tochter. Sagt die
          Tochter zur Mutter: "Sollten wir Papa nicht doch lieber
          sagen, das heute Sonntag ist?"</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Zwei Freundinnen unter sich: "Weisst du, was mit
          neulich passiert ist? Klingelt es letzte Woche an der
          Haust&uuml;r. Steht da ein junger Mann, und fragt, ob
          mein Mann da w&auml;re. Ich sagte `Nein, der ist auf der
          Arbeit`. Da nimmt der mich auf seine Arme, bringt mich
          ins Schlafzimmer und verf&uuml;hrt mich. Und das ist bis
          heute f&uuml;nf mal passiert. Langsam frage ich mich -
          was will der nur von meinem Mann?"</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Woran merkt man, dass die Kinder Erwachsen werden? -
          Sie h&ouml;ren auf, zu fragen woher sie kommen, und sagen
          nicht mehr, wohin sie gehen!</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Fragt der Ober beim Gast nach: "Haben sie Barsch
          bestellt?" - "Nicht doch, eigentlich sehr
          h&ouml;flich!"</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Ein Amerikaner, ein T&uuml;rke, ein Franzose und ein
          Deutscher unterhalten sich &uuml;ber ihre Nationen.<BR>
           Sagt der Amerikaner: "Ich bin stolz auf unseren CIA. Der
          wei&szlig; schon eine Woche vorher wo etwas passiert!"
          Der T&uuml;rke: "Ich bin stolz auf unsere Teppiche. Das
          sind die weichesten und die besten der Welt!". Meldet
          sich der Franzose: "Und ich bin stolz auf unsere Frauen.
          Das sind die h&uuml;bschesten und besten Liebhaberinnen
          auf der Welt!".<BR>
           Der Deutsche sagt nichts. Fragt der Ami den Deutschen:
          "Und du, bist du denn auf gar nichts von euch Deutschen
          stolz?" - "Na ja," entgegnet der Deutsche, "eigentlich
          nur auf mich."<BR>
           "Wieso das denn?", will der Franzose wissen. - "Ich bin
          stolz auf mich," kommt als Antwort, "weil ich mit einer
          Franz&ouml;sin auf einem T&uuml;rkischen Teppich schlafe
          und der CIA wei&szlig; nichts davon!"</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Der Lehrer in der Schule: "Heinz, kennst du einen
          griechischen Dichter?" - "Ja, Herr Lehrer. Achilles!"<BR>
           "Hmm - den kenn ich aber nicht, Heinz. Womit ist der
          denn ber&uuml;hmt geworden?" - "Durch seine Ferse!"</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>War ich doch letztens mit meinem Sohn zu einer
          Hochzeit eingeladen. Ich tippte meinen Sohn auf die
          Schulter und sagte zu ihm: "Sieh dir das an, bald bist du
          dran!"<BR>
           Vorige Woche mu&szlig;te ich mit meiner Familie zu einer
          Beerdigung. Da tippte mich mein Sohn an und sagte das
          gleiche zu mir...</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Ein Mann, der auf seinen Zug wartet, geht in die
          Bahnhofs-Kneipe um ein Bier zu trinken. Dort ist es aber
          sehr unruhig, denn ein anderer Gast hat einen Affen mit
          gebracht, der auf dem Billard-Tisch rumturnt. Auf einmal
          schnappt sich der Affe die Schwarze Acht und schluckt sie
          runter. Der Kneipenwirt, gar nicht begeistert, zu seinen
          G&auml;sten: "Habt ihr das gesehen? Der Affe hat meine
          Billardkugel gefressen!"<BR>
           Dem Reisenden ist das zu laut hier und geht zu seinem
          Zug.<BR>
           Eine Woche sp&auml;ter kommt er wieder zur&uuml;ck. Auch
          dieses mal m&ouml;chte er in Ruhe ein Bier trinken. Also
          geht er wieder in die Bahnhofs-Kneipe. Als er sein Bier
          trinkt, kommt auf der Mann mit dem Affen in die
          Sch&auml;nke. Der Affe turnt wie gewohnt auf den
          M&ouml;beln umher. Auf einmal sieht der Affe eine Schale
          mit Erdn&uuml;sse auf einem Tisch stehen. Es nimmt sich
          eine aus der Schale, steckt sich die Erdnuss in den
          Hintern, nimmt sie wieder heraus und fri&szlig;t diese
          dann. Der Wirt fragt den Besitzer des Affen, was das denn
          soll. Sagt der Affen-Besitzer: "Seit er das letzte mal
          hier war, fri&szlig;t er nur noch das, was hinten auch
          rein passt!"</P>
          <BR>
           
          <HR align="center" width="100%">
          <BR>
           

          <P>Ruf ein Bauer beim Tierarzt an: "Mein Zucht-Bulle
          braucht wieder seine Potenz-Pillen!" - "Wie war denn der
          Name dieser Pillen?"<BR>
           "Keine Ahnung, aber sie schmeckten nach
          Pfefferminz!"</P>
          <BR>
           
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>
           

          <CENTER>
            <IMG src="images/jojo.jpg" alt="JoJo" width="212"
            height="50"><BR>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

