<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Leveldesign 10</TITLE>
<META name="author" content="Rainer Wrieden">
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</HEAD>

<BODY background="images/comp005.gif" text="Black">
<DIV align="CENTER">
<table width="640" border="0" cellspacing="0" cellpadding="8"
background="images/comp005t.gif" summary="">
<TR>
<TD>
<p title=""><A href="ws_wsx.html"><font face="" size="+1">
<B>zur&uuml;ck</B></FONT></A></P>
<H1 align="center"><FONT face="" color="Green">Leveldesign 10</FONT></H1>
<p title="" align="JUSTIFY"><font face="" size="+2" color="Red">Vorwort:</FONT>
<BR><BR>
Ich hoffe Ihr seit mit meinen Ausf&uuml;hrungen des 9. Teils klargekommen.
Hier gibt es die Level aus den vorangegangenen Teilen 1-9 f&uuml;r alle die
sie noch nicht konstruiert haben aber nun einsteigen wollen
[<a href="test1.wad">test1.wad</a>] [<a href="test2.wad">test2.wad</a>]
[<a href="test3.wad">test3.wad</a>] [<a href="test4.wad">test4.wad</a>]
[<a href="test5.wad">test5.wad</a>] [<a href="test6.wad">test6.wad</a>]
[<a href="test7.wad">test7.wad</a>] [<a href="test8.wad">test8.wad</a>].
<br><br> 
In dieser Ausgabe unseres Leveldesigns wollen wir unsere T&uuml;r durch
eine Keycard sichern und auch entsprechend grafisch kenntlich machen.</P>
<FONT face="" size="+2" color="Red">Wir &auml;ndern unsere T&uuml;r:</FONT>
<BR><BR>
Wie immer starten wir DEU &uuml;ber die Workbench.<br>
Dann lesen wir mit <font face="" color="Blue">r test8.wad</font> unseren
Level ein, den wir im 8. Teil des Workshops konstruiert hatten.<br>
Nun geben wir <font face="" color="Blue">e 1 1</font> ein um diesen Level
zu ver&auml;ndern.<br>
Nun sind wir im DEU mit unserem Level aus dem 8. Teil.<br>
Wie wir es auch schon von den vorherigen Teilen kennen, skalieren wir
erstmal die Anzeige.<br>
Solange die <font face="" color="Blue">&szlig;-Taste</font> dr&uuml;cken
bis Scale 1/1 erscheint.<br>
Danach solange die <font face="" color="Blue">G-Taste</font> dr&uuml;cken
bis Grid=16 erscheint.<br>
<br>Als erstes erstellen wir einen neuen Sektor, indem wir die markierten
LineDefs teilen und auch den Sektor.<br><br>
<DIV align="center">
<IMG src="images/deua.png" width=562 height=245 border=0 alt="">
</DIV>
<BR>
<p>Wir verschieben die Vertices so, wie im unteren Bild gezeigt.</p>
<DIV align="center">
<IMG src="images/deud.png" width=577 height=225 border=0 alt="">
</DIV>
<BR>
<p title="" align="JUSTIFY">Die Deckenh&ouml;he des unten markierten
Sektors setzen wir auf 128.</p><br>
<DIV align="center">
<IMG src="images/deub.png" width=530 height=203 border=0 alt="">
</DIV>
<BR><BR>
<p title="" align="JUSTIFY">Die untere gezeigte LineDef setzen wir auf den
Typ Normal und tragen bei den SideDefs nichts ein bzw. l&ouml;schen die
Eintragungen.</p>
<br>
<DIV align="center">
<IMG src="images/deuc.png" width=534 height=213 border=0 alt="">
</DIV>
<p title="" align="JUSTIFY">Bei den unten markierten LineDefs setzen wir
f&uuml;r die normale Textur der 1. SideDefs <font face=""
color="Blue">DOORYEL2</font> ein.</p>
<br>
<DIV align="center">
<IMG src="images/deue.png" width=530 height=203 border=0 alt="">
</DIV>
<p title="" align="JUSTIFY">Bei den unten markierten LineDefs setzen wir
f&uuml;r die obere Textur der 1. SideDefs <font face=""
color="Blue">BIGDOOR2</font> ein. Bei dem Typ der LineDefs setzen wir unter
Door den Wert <font face="" color="Blue">3 DR open door (close after 6
sec.) yellow key (27)</font> ein.</p>
<br>
<DIV align="center">
<IMG src="images/deuf.png" width=530 height=203 border=0 alt="">
</DIV>
<p title="" align="JUSTIFY">Nun m&uuml;ssen wir aber auch noch einen gelben
Schl&uuml;ssel in unserem Level einf&uuml;gen. Den legen wir einfach an die
rot markierte Stelle. Dazu gehen wir im Thing-Mode auf Edit Thing --&gt;
Change Type --&gt; 4 Bonus --&gt; 5 Yellow Skull Key. Nun &auml;nderen wir noch
die Ausrichtung des gelben Kopfes unter 2 Change Angle --&gt; 6 SouthWest.</p>
<br>
<DIV align="center">
<IMG src="images/deug.png" width=288 height=363 border=0 alt="">
</DIV><br>
<FONT face="" size="+2" color="Red">Wir testen unsere T&uuml;r:</FONT><BR>           
<p title="" align="JUSTIFY">Wie auch schon in den vorangegangenen Teilen
des Workshop kommt nun der spannende Teil. Klappt das denn nun auch alles
mit unserer T&uuml;r oder finden wir keinen Weg sie zu &ouml;ffnen? Wir
k&ouml;nnen dies nun wieder anhand von DoomAttack testen.</p>
Bitte dazu nun unseren Level test9.wad in den Ordner von DoomAttack
kopieren.<BR>
Dann das Icon DoomAttack_Clickme anw&auml;hlen.<BR>
Danach im CLI in den Ordner von DoomAttack.<BR>
Einen Stack von 100000 einrichten.<BR>
Nun wird DoomAttack im CLI wie folgt aufgerufen: <font face=""
color="Blue">doomattack -file test9.wad</font><BR>
<p title="" align="JUSTIFY">Dann ein neues Spiel mit Episode 1 starten. Am
Anfang sehen wir nun auf der linken Seite unsere T&uuml;r mit der neuen
Seitengrafik, den gelben Totenk&ouml;pfen. Leider l&auml;sst sich die
T&uuml;r nun nur noch mit dem gelben Schl&uuml;ssel &ouml;ffen. D. h. wir
m&uuml;ssen uns auf die Suche nach ihm begeben. Da unser Level nur ein
Minilevel ist, ist es wohl nicht allzu schwer. Wir gehen den &uuml;blichen
Weg durch die Geheimt&uuml;r, steigen auf den Lift und dann rauf auf den
Teleporter. Nun befinden wir uns in dem Raum auf der anderen Seite der
T&uuml;r. Auch von dieser Seite ist sie nur mit dem gelben Schl&uuml;ssel
zu &ouml;ffnen. Wenn wir uns aber noch ein wenig in diesem Raum umschauen
werden wir f&uuml;ndig. Nun k&ouml;nnen wir ohne Probleme die T&uuml;r
&ouml;ffnen.<br><br>
Hier ist der fertige Level [<a href="test9.wad">test9.wad</a>].</p><BR>
             
<table cellspacing="5" cellpadding="0" align="CENTER" summary="">
<TR>
<TD><IMG src="images/doom1.png" width=320 height=200 border=2 alt=""
style="border-color: Red;"></TD>
<TD><IMG src="images/doom2.png" width=320 height=200 border=2 alt=""
style="border-color: Red;"></TD>
</TR>
</TABLE>
<BR>
<FONT face="" size="+2" color="Red">Schlusswort:</FONT><BR><BR>
Mit diesem Teil des Leveldesigns m&ouml;chte ich den aktuellen Level
abschliessen, da ich der Meinung bin, dass nun genug Grundwissen besteht um
uns an ein gr&ouml;sseres Projekt zu wagen. Gerne nehme ich auch Eure
Anregungen f&uuml;r Ideen eines neuen Projektes entgegen. Ich hoffe ich
habe mich auch diesmal verst&auml;ndlich ausgedr&uuml;ckt.<BR>
F&uuml;r Anregungen und Fragen bin ich unter meiner E-Mail Adresse <a
href="mailto:spezis@terra.es">spezis@terra.es</a> erreichbar.<BR><BR>
DEU sowie auch DoomAttack gibt es im Aminet.<BR><BR>
Euer Spezi<BR><BR>
<TABLE border="5" cellspacing="1" cellpadding="5" align="CENTER" summary="">
<TR>
<TD>Rainer Wrieden</TD>
<TD>E-Mail: <A href="mailto:spezis@terra.es">spezis@terra.es</A></TD>
</TR>
</TABLE>
<A href="ws_wsx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A>
</TD>
</TR>
</TABLE>
</DIV>
<BR>
</BODY>
</HTML>

