<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 03/98 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>R&auml;tselhafte Abst&uuml;rze eines A500 (von Marc Jochimsen)</H2>
&#187;Erinnert Ihr Euch noch an die Guru-Probleme, die ich im Herbst hatte?
Leider konnte ich die Ursache immer noch nicht finden, es ist eher noch
schlimmer geworden.<P>
Vielleicht kann mir ein Leser helfen, meine Probleme zu l&ouml;sen. Zuerst
einmal meine Rechnerkonfiguration:<P>
Hardware:A500+/68000/2Chip/4Fast/OS3.1 (bitte nicht lachen, als ganz armer
Sch&uuml;ler kann ich mir leider keinen A4000T060/32/etc. leisten...). Au&szlig;erdem
kommen noch ein GVP-SeriesII-SCSIController mit 240MB HD und einem IOMEGA
ZIP100 sowie ein HP550C zum Einsatz.<P>
Software: KS 40.63 WB 40.42, MCP, VisualPrefs, PatchControl, BootScreen
(startup-sequence), TurboPrint, MagicMenu, TolleUhr, ToolManager,
BenchTrash (WBStartup+). Au&szlig;erdem ist MUI3.3 installiert.<P>
Der Rechner st&uuml;rzt laufend ab. Als die Probleme erstmals auftraten, konnte
ich nur etwa jedes f&uuml;nfte Mal zu Ende booten. Bald fand ich mit SnoopDos
heraus, da&szlig; IPrefs abst&uuml;rzt, wenn es die Daten des WBPattern-Voreinstellers
liest. Voreingestellt war ein kleines IFF-Bild (etwa 5kB). Dieses wurde
also entfernt. Nun kam ich zumindest schon jedes Mal nach dem Booten auf
die WB. Hier st&uuml;rzt der Rechner jedoch auch laufend ab, sobald Programme
geladen werden. Die Highscore der Gurus f&uuml;hren #8000 000x an, wobei die
letzte Zahl 3,4,A,B sein kann. Au&szlig;erdem sind die folgenden Fehlermeldungen
aufgetreten: #8100 0005, #8738 540F, #A269 0004, #E000 F9BA und #801C
4E75. MCP konnte mir bei den Ursachen helfen: Emulator Error Line 1111,
Corrupt MemoryList detected in FreeMem, SanityCheck on memory failed during
AvailMem (MEMF_LARGEST). Als Verursacher wurden u.a. ramlib und
Exec.library genannt. Nun habe ich die Vermutung, da&szlig; irgendein Programm
irgend etwas mit meinem Speicher macht, zum Beispiel ihn in kleine
St&uuml;ckchen fragmentiert. Wenn ich zum Beispiel mit APlayer eine mod-Datei
lade, kommt sie meistens total verrauscht daher, ebenso ist es mit gr&ouml;&szlig;eren
Samples (>100kB), die ich in DOpus abspiele: der Anfang ist normal, ab etwa
der H&auml;lfte beginnt ein f&uuml;rchterliches Rauschen. Oder wenn ich in
FinalCopyII mehrere Schriftarten &ouml;ffnen will, st&uuml;rzt der Rechner ab etwa
der dritten ab. Selbst der AmigaDOS-Befehl "copy" oder lha st&uuml;rzen bei
gro&szlig;en zu kopierenden oder entpackenden Dateien ab. MUI-Programme laufen
&uuml;brigens auch nicht mehr, mit SnoopDos habe ich herausgefunden, da&szlig;
sie beim Laden der Hintergrundgrafik abst&uuml;rzen (wie IPrefs). Manchmal
bleibt der Rechner auch einfach nur stehen, und der Motor des internen
Laufwerks beginnt sich ger&auml;uschlos zu drehen (also keine Stepschritte
o.&auml;.).<BR>
Ich habe schon mehrere Gegenma&szlig;nahmen versucht. Als erstes Deaktivierung
aller Utilities aus startup-sequence und WBStartup. Dies hat die Probleme
jedoch nur zeitlich hinausgez&ouml;gert, irgendwann kam es immer zum Crash. Dann
habe ich das Betriebssystem und die Tools sowie MUI neu installiert, mu&szlig;te
jedoch von der alten Platte einige libraries etc. wieder aufspielen. Keine
L&ouml;sung. Au&szlig;erdem habe ich alle Programme darauf &uuml;berpr&uuml;ft, ob sie
vielleicht f&uuml;r den 030er optimiert sind.
Ich hatte vorher eine Derringer-Turbokarte installiert, diese hat jedoch
vor einem halben Jahr leider den Geist aufgegeben. Auch keine L&ouml;sung.
Viruschecks habe ich nat&uuml;rlich auch durchgef&uuml;hrt. Keine Viren.<P>
Nun hoffe ich, da&szlig; mir jemand helfen kann. Vielleicht kann ein Leser (mit
&auml;hnlicher Konfiguration) eine Kopie meiner WB-Partition mal auf einem ZIP-
Medium begutachten. Au&szlig;erdem w&uuml;rde ich mir gerne mal das Guru-Buch von
Ralph Babel (gegen Leihgeb&uuml;hr) ausleihen. Wer mir helfen oder Tips
geben kann oder mir das Buch leihen m&ouml;chte, bitte bei mir melden.<P>
Meine Adresse: Marc Jochimsen, Deichstra&szlig;e 10, 25826 St.Peter-Ording oder
Tel./Fax: 04863/95427. Bitte nicht mailen (kann mein Postfach leider immer
noch nicht abfragen :-( ), und nicht auf Handy, ist n&auml;mlich ab 1. M&auml;rz
abgemeldet&#171;<P>
<CENTER><BR><A HREF="0011.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0013.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

