<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 03/98 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Reaktion auf Harald Knoops AMIGA-Vorschl&auml;ge (von Markus Lunk)</H2>
&#187;Dein Lob an Petro T. kann ich gar nicht teilen, zumal er ja vor ein paar
Tagen erst signalisierte, es werde 1998 keinen neuen Amiga geben, wo er
doch noch vor ein paar Wochen auf der Computer 97 ganz anderes verlauten
lie&szlig;. H&auml;tte er schon zu der Zeit gesagt, da&szlig; dies nicht m&ouml;glich ist,
w&auml;re ihm zumindest Realismus nachgesagt worden. H&auml;tte er im Herbst 98
irgendwann gesagt, in diesem Jahr werde es nichts mehr, w&auml;re es
zumindest eine enge Sache gewesen - h&auml;tte man jedenfalls meinen k&ouml;nnen,
auch wenn es von vornherein klar war. In dieser Situation jetzt jedoch
die erst wenige Wochen alte Aussage zu widerrufen, r&uuml;hrt am ehesten den
Zorn der User, wird so doch klar, da&szlig; es sofort eine Finte war, die
nicht eben glaubw&uuml;rdiger macht. Eines darf n&auml;mlich nicht vergessen
werden: Wer bis heute &uuml;briggeblieben ist, geh&ouml;rt zwar zum harten Kern,
aber man sollte uns nicht l&auml;nger f&uuml;r dumm verkaufen, so wie Commo es all
die Jahre getan hat.<BR>
Daher sollten auch endlich die Spielereien aufh&ouml;ren in Sachen 68k bzw.
&uuml;berhaupt CISC, ganz gleich, mit wieviel MHz. Bis vor ein paar Monaten
w&auml;re der Alpha noch mein Wunschkandidat gewesen, aber seitdem sich DEC
erst in Richtung Intel und dann unter das Dach von Compaq verzogen hat,
spielt diese &Uuml;berlegung keine Rolle mehr. SPARC w&auml;re noch eine
Alternative und eventuell StrongARM, da MIPS wohl auch bald eingehen
wird. In jedem Fall ist ein endlich wieder leistungsf&auml;higer Prozessor
vonn&ouml;ten, der auf absehbare Zeit, d.h. f&uuml;r die n&auml;chsten Jahre, stetig
weiterentwickelt wird. Da bleiben wohl nur PPC und SPARC &uuml;brig. Welcher
es davon wird - oder vielleicht doch Exponential`s X704 ? -, ist gar
nicht so wichtig. Wichtig ist, da&szlig; endlich sinnvolle und tragf&auml;hige
&Uuml;berlegungen in Taten umgesetzt werden. Wir m&uuml;ssen endlich die letzten 6
Jahre aufholen, und zwar nicht im Kleckertempo, sonst ist der Ofen
endg&uuml;ltig aus. Das OS 4 ist genau der richtige Zeitpunkt, endlich auch
andere Bereiche, auch im Bereich der Hardware, auszumisten, z.B. die
elend lahmen Schnittstellen (warum soll ich mir extra eine
Schnittstellenkarte kaufen?) oder die Einf&uuml;hrung von
Netzwerkschnittstellen f&uuml;r Ethernet, oder was auch immer bis dahin
gebraucht wird. Wir brauchen endlich schnelle RAMs, Flickerfixering
onboard, vollwertiges UMA, wie es seinerzeit mit dem Chipmem schon
einmal angedacht, aber bis heute nicht umgesetzt wurde (wo bleibt die
M&ouml;glichkeit, die 8 MB beim 4000er auszunutzen? Daf&uuml;r ist es heute im
Grunde zu sp&auml;t, aber bis eine neue Rechnergeneration fertig ist, w&auml;ren
hier, bei entsprechenden RAM-Bausteinen, noch einige Reserven vorhanden).
Was sollen wir mit MS-DOS auf dem PPC? Auch Windows 98 w&auml;re f&uuml;r mich
bestenfalls als Subtask denkbar, zumal G2000 gar nicht das Potential
hat, hier mit MS Gespr&auml;che zu f&uuml;hren. MS w&uuml;rde sicherlich, wenn
&uuml;berhaupt, nichts anderes als Windows NT doch noch weiterentwickeln,
wobei ich denen ausnahmsweise sogar mal Recht g&auml;be. Aber es w&uuml;rde uns
doch auch gar nichts bringen, wenn z.B. auf jedem CHRP Win NT lauff&auml;hig
w&auml;re, denn die w&auml;ren nicht so bl&ouml;d, jedenfalls marketingtechnisch,
exklusiv f&uuml;r eine Plattform zu entwickeln, die sie nicht im Griff haben,
zumal f&uuml;r den Amiga. Eine Virtual Machine beispielsweise w&auml;re viel
sinnvoller, weil man dann endlich die St&auml;rken des AmigaOS ausnutzen
k&ouml;nnte, ja sogar dazu gezwungen w&auml;re. Es gilt also, entsprechende VMs zu
entwickeln, die nicht nur Windows sondern auch OS/2, MacOS, RiscOS, TOS
etc. nutzbar machten. Wenn man es dann schaffte, deren Funktionen auf
AmigaOS-Systemaufrufe nativ umzulenken, w&auml;re man auch in der Lage, bei
entsprechender Software von den Geschwindigkeitsvorteilen AmigaOS -
64-Bit-Risc-CPU zu profitieren. Das machte auch noch Sinn, solange MS
nicht f&auml;hig ist, aufgrund der Kompatibilit&auml;t wenigstens ein
durchg&auml;ngiges 32-Bit-System anzubieten, Ausnahme NT, das noch nicht
massentauglich ist. Das Problem solcher VMs w&auml;re jedoch die hohe
Hardwareintensit&auml;t, und das, wo doch heute noch viele mit einem blankem
500er oder 1200er DTP oder "die neuesten 3D-Spiele" betreiben wollen.
Fraglich ist also auch, ob diese Art des Fortschritts irgendwann in die
K&ouml;pfe aller Amiga-User vordringen wird, denn nur dann werden sie noch
viele weitere 13 Jahre mit ihrem Rechner sinnvoll arbeiten k&ouml;nnen.<P>
Soweit mein Kommentar hierzu. Ich freue mich auf Eure Antworten.<P>
Markus Lunk&#171;<BR>
<CENTER><BR><A HREF="0012.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0014.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

