<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 03/98 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Reaktionen auf die AMIGA-aktuell-Kritik von Christian Wimmer</H2>
Mehrere Leser haben mir ihre Meinung zu der von Christian Wimmer ge&auml;u&szlig;erten
Kritik an AMIGA aktuell mitgeteilt. Einige der Stellungnahmen sind im
folgenden ver&ouml;ffentlicht:<P>
Gunter Hinrichsen schreibt:<P>
&#187;Also zu der Kritik von Christian Wimmer muss ich folgendes sagen:<P>
Ich habe nichts gegen Kleinanzeigen in der AA, allerdings kann man
ja die Leserbriefe und Kleinanzeigen in zwei Rubriken aufteilen. So
koennen die Leser, die sich dafuer nicht interessieren, sie einfach
ueberspringen.<P>
<I>Da hat einer 'n Prob und dann kommen seitenlange Infos und
Beschreibungen.</I><P>
Meiner Meinung nach gehoeren zu einer guten Zeitschrift auch Fragen zu
Probs und die Antworten darauf. Ich habe in solchen Ecken auch schon
L&ouml;sungen gefunden. Um eine Loesung abzukuerzen koennte man allerdings, wenn
vorhanden, auf eine FAQ hinweisen.<BR>
Auch Leserbriefe gehoeren zu einer Zeitschrift, man kann sie zwar kuerzen,
allerdings besteht die Gefahr, da&szlig; der Inhalt verfaelscht wird, ausserdem
lese ich die Leserbriefe recht gerne, da man dort Meinungen von anderen
Usern hoert, ohne grosses "Rumgeflame".<P>
<I>Die Vorank&uuml;ndigungen sind ja nicht schlecht. Doch man sollte vielleicht
nicht alles reinnehmen. Letztes Mal waren einige MUI-Sachen dabei.</I>
Was erwartet er? Es gibt nun mal Sachen, die einen ueberhaupt nicht
interessieren, dafuer aber andere brennend. Eine Zeitschrift ist fuer
alle da und nicht nur fuer einen einzigen....<P>
<I>Vor allem nerven mich diese ellenlangen "Werbetexte".
Also Pressemitteilungen, Produktank&uuml;ndigungen</I><P>
Ich finde die Produktankuendigungen und Pressemitteilungen gut, da sie
einem stundenlanges Herumgesurfe zu den einzelnen Seiten erspart und
man dann ganz gezielt zu den Seiten surfen kann.<P>
<I>Das war, bzw. ist, auch bei WARPUP/WARPOS vs. PowerUp so.</I>
Dieser Konflikt ist leider wichtig, wird Zeit, da&szlig; AI mal ein Machtwort
spricht, also weiter darueber berichten!<P>
Ich wuerde nicht sagen, da&szlig; sich die AA verschlechtert hat, sie entwickelt
sich weiter, bis jetzt, muss ich sagen, zum guten, also weiter so!&#171;<P><BR>
Martin Biro hat folgende Meinung:<P>
&#187;Ich wollte mich zur Kritik von Christian Wimmer &auml;u&szlig;ern.<P>
Ich finde das Magazin AMIGA aktuell eher zu mager! Ich brauche
allerh&ouml;chstens 30 Minuten, um es von vorne bis hinten durchzulesen. :(<P>
Sicherlich ist das eine oder andere Thema nicht f&uuml;r jedermann geeignet oder
interessant genug, aber es ist so wie mit Kirschenessen, zuerst die
sch&ouml;nen, und sp&auml;ter halt das, was im Topf noch &uuml;brig ist.
Ich finde es sogar ganz gut, da&szlig; es ein wenig von allem ist!<P>
Den Workshop von Heiko Kuschel "ARexx-Kurs" finde ich gut! Es k&ouml;nnten ruhig
noch mehr Workshops sein, z.B. ein C++-Crashkurs oder die Generierung von
MP3-Audio-Files mit dem Amiga.<BR>
Es kann aber auch eine Einf&uuml;hrung ins Internet oder das Rendern mit
Lightwave oder etwas &auml;hnlichem sein.
Beispieldateien zum Workshop, k&ouml;nnte man irgendwo im Netz ablegen, wo sie
von jedermann erreichbar w&auml;ren.<P>
Die Screenshots aber k&ouml;nnte man echt weglassen, da einzelne Bilder oft
wenig Aussagekraft besitzen.&#171;<P><BR>
Soweit Martin Biro, der n&auml;chste bitte. Es ist Uwe Pannecke:<P>
&#187;Ich habe zu vielen Punkten, die Christian anf&uuml;hrt, eine andere Meinung.<P>
<OL>
<LI>Der Umfang des Magazins geht aus meiner Sicht nicht auf Kosten der
Qualit&auml;t.
Auch wenn hin und wieder etwas l&auml;ngere Beitr&auml;ge zu einem speziellen
Thema, wie z.B. WarpUP &lt;-&gt; PowerUP, erscheinen, so kann der geneigte
Leser entweder weiterlesen oder genauso komfortabel weiterbl&auml;ttern.
Ich bin sehr wohl an etwas tiefergehenden Infos interessiert, auch wenn
in dem o.a. Beitrag Hard- und Software angesprochen wird, die (noch)
nicht in meinem Rechner steckt. So habe ich aber eine bessere Chance,
VOR dem Kauf schlau zu werden. :)<BR>
Ich kenne zu viele kurze Statements, auch gerade in AMIGA-Zeitschriften,
in denen lediglich die Texte der Disketten- oder CD-Cover abgeschrieben
wurden und das ganze eine Kurzvorstellung, oder noch schlimmer, ein
angeblicher Praxistest sein sollte.<P>
<LI>Gegen Kleinanzeigen in Ma&szlig;en habe ich nichts einzuwenden. Ich bin immer
auf der Suche nach Schn&auml;ppchen. ;)<P>
<LI>Wenn Fragen in aakt aufgeworfen werden, egal zu welchem Thema, sollten
auch die Antworten in aakt erscheinen. Auch wenn im Augenblick das
behandelte Problem auf dem eigenen Rechner nicht aktuell ist, kann dies
in ein paar Tagen/Wochen schon ganz anders aussehen, und man greift
erleichtert nach dem Erinnerungsblitz "da war doch mal was in einer
aakt" auf die Probleml&ouml;sung zur&uuml;ck.<P>
<LI>Produktank&uuml;ndigungen sind durchaus erw&uuml;nscht. Da z.Zt. ja keine Tonnen
von Soft- und Hardware auf den AMIGA-User niederprasseln, kann eine
KURZE Ank&uuml;ndigung das Bed&uuml;rfnis nach News durchaus mit befriedigen.
Ob in deutscher oder englischer Sprache ist eigentlich f&uuml;r mich
nebens&auml;chlich. Dennoch ziehe ich nat&uuml;rlich Beitr&auml;ge in deutscher Sprache
vor. :-)<BR>
Wenn ich jede Homepage der Firmen/Autoren besuchen m&uuml;&szlig;te, um an die
Infos zu kommen, w&auml;re der Aufwand ungleich h&ouml;her.
Auch hier kann der Leser problemlos die unerw&uuml;nschten Links in aakt
&uuml;berspringen.<P><BR>
<LI>Die aakt-Qualit&auml;t ist gut und in den letzten Monaten eher besser
geworden.<BR>
Nat&uuml;rlich werden immer wieder Beitr&auml;ge dabei sein, die f&uuml;r einige Leser
weniger interessant sind. Aber das ist in anderen Online-Mags und
besonders Zeitschriften auch nicht anders. Stichwort: Weiterbl&auml;ttern.<P>
Ich w&uuml;nsche mir f&uuml;r die n&auml;chsten Ausgaben neben News,
Produktank&uuml;ndigungen und Leserbriefen vor allem auch praxisnahe Tests
verschiedener Hard- und Software und, wie in dieser Ausgabe begonnen,
interessante Kurse.<BR>
Nicht zu vergessen ein durchaus auch intensiverer Blick &uuml;ber den AMIGA-
Tellerrand zu anderen Rechnersystemen. Ohne Kriegsgeschrei.
Auch wenn sich der aakt-Umfang verdoppeln sollte. ;-)&#171;</OL><P><BR>
Rainer Kalthoff wendet sich direkt an Christian Wimmer:<P>
&#187;Christian, irgendwie habe ich das Gef&uuml;hl, da&szlig; Du meinst, Amiga aktuell
werde nur f&uuml;r Dich geschrieben. Wenn Dich einige Artikel nicht
interessieren, dann zwingt Dich ja auch keiner, diese zu lesen.
Wie zum Beispiel der WARP<->PowerUp-Artikel. Wenn Dich solche offiziellen
Stellungnahmen nicht interessieren, und die notwendigen Erl&auml;uterungen f&uuml;r
Dich "Gefasel, wo nur noch Programmierer durchblicken" sind, dann
beschr&auml;nke Dich doch darauf, die reinen Testberichte zu lesen.
Der n&auml;chste Punkt: Leserbriefe. Sag' mal, w&auml;re es nicht langweilig, nur
Leserbriefe mit Verbesserungsvorschl&auml;gen (Der Rand mu&szlig; 2 Pixel nach links,
das Rot ist einfach viel zu rot...) zu lesen. Dann w&uuml;rde wohl auch jeder
andere Leser immer daran vorbeibl&auml;ttern, und auf Deinen Brief w&uuml;rde kaum
jemand antworten.<BR>
Das Ganze kann man dann auch auf eine Stufe mit dem Forum stellen. Die
passende Antwort hat Carsten darauf ja schon gegeben. Und wen's nicht
interessiert, der kann ja dr&uuml;ber wegbl&auml;ttern.
Was die Vorank&uuml;ndigungen betrifft, widersprichst Du Dir selbst. Erst sind
sie nicht schlecht, dann sind doch nur einige (die Dich interessieren) gut,
und dann st&ouml;ren die Produktank&uuml;ndigungen. Ja was denn nun? Ja oder nein
oder was??<BR>
Dich st&ouml;ren die Vorank&uuml;ndigungen von MUI-Produkten. &Uuml;ber MUI kann jeder
denken, was er will, aber jetzt stell Dir mal vor, eins dieser Proggies
h&auml;tte Dich interessiert, und Du h&auml;ttest Dir dieses dann besorgt. Nach der
Installation: Oh Graus, welch Schock: xyz requires MUI 3.8+
Davor haben Dich doch die Beitr&auml;ge bewahrt. Sei doch froh!
Auch im vorletzten Punkt kann ich nur dagegen halten. Obwohl ich Amiga
aktuell noch nicht so lange kenne, kann ich von einer inhaltlichen
Verschlechterung nichts feststellen.<BR>
Alles in allem, wenn Du das n&auml;chste Mal *Deine* Meinung (zur Amiga aktuell)
sagst, dann w&auml;hle doch auch den entsprechenden Stil und lasse es nicht so
aussehen, als ob die Redakteure nur Mist verzapfen w&uuml;rden.
Wenn Du unter Informationsflut leiden solltest, dann schau Dir halt nur die
News-Seiten der Amiga Plus an. Da stehen die News sch&ouml;n komprimiert, und Du
verlierst beim Lesen nur wenig Zeit.&#171;<P>
<B>Fazit:</B><P>
Bislang habe ich den Eindruck, als w&uuml;rde die &uuml;berwiegende Zahl der AMIGA-
aktuell-Leser Christians Auffassungen nicht teilen.
An dieser Stelle sei noch einmal jeder aufgerufen, mir seine Meinung zu
AMIGA aktuell bzw. den bislang ver&ouml;ffentlichten Leserbriefen mitzuteilen.
Jeder konstruktiven Kritik, egal ob negativ oder positiv, wird
nachgegangen. Schreibt an: <A HREF="aakt@gmx.de">aakt@gmx.de</A><P>
<CENTER><BR><A HREF="0017.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="1100.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

