<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 03/98 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Softwaretest: XFileSystem (von Rainer Kalthoff)</H2>
&#187;Softwaretest: XFileSystem (xfs209_beta2) von Francis Swift<P>
Wenn man sich regelm&auml;&szlig;ig durch die Recent-Liste des Aminets w&uuml;hlt, gibt es
viele Programme, bei deren Beschreibung man schnell weiterliest. Ach, schon
wieder ein xyz-Clone. Oh, ein Update von 0.12beta3gamma7 auf
0.12beta3gamma71, wie interessant: In der Dokumentation wurde ein ";" gegen
ein "." ausgetauscht.<P>
Aber das xfs-readme fiel mir sofort ins Auge: Multi filesys+.device,
pc+pcw+minix+more.<BR>
Ein Filesystem f&uuml;r viele Formate. Prima, nur noch ein Laufwerk f&uuml;r Mac und
PC und Amiga, oder? Ich war ganz sch&ouml;n gespannt.<P>
Zun&auml;chst einmal die Features:<P>
<UL>
<LI>Ein einziger Handler und ein Device, das die folgenden Formate liest:
<PRE>
Name          System                Hersteller/
                                    Modell

Acorn         Archimedes            Acorn
              E Format              Computers
Amiga OFS     Workbench 1.x         Commodore
Amiga FFS     Workbench 2.xx        Commodore
Amiga FFS/DC  Workbench 3.xx        Commodore/
                                    Gateway
Atari ST/TT   TOS 1, TOS 2 etc.     Atari
                                    Corporation
BetaDOS       Spectrum und +D       BetaSoft
Diskspare     Amiga custom
              High capacity format
GDOS          Sinclair Spectrum     MGT Disciple
                                    Interface
G+DOS         Sinclair Spectrum     MGT/Datel +D
                                    interface
MasterDOS     SAM Coupe             MGT and
                                    BetaSoft
MSDOS         IBM PCs und Clones    Micro$oft
MSXDOS        Alle MSX              Sony, Toshiba
                                    etc.
QDOS          QL &amp; Clones           Sinclair, CST,
                                    Miracle
SAMDOS        SAM Coupe             Miles Gordon
                                    Technology
Windows95/NT  IBM-Kompatibel        Micro$oft

</PRE>

Unterst&uuml;tzung f&uuml;r CP/M-Formate (teilweise Amstrad PCW und Plus 3) und
Apple Mac soll bei entsprechender Nachfrage folgen. Alle anderen
Vorschl&auml;ge k&ouml;nnen ber&uuml;cksichtigt werden, sofern Dokumentationen f&uuml;r das
LowLevel- und das logische Format beiliegen. Geplant ist ein Handler, der
jedes Format, das dem Amiga zug&auml;nglich ist, verarbeiten kann, inklusive
FM & GCR und multiplen Sector-Gr&ouml;&szlig;en pro Track.<P>
<LI>Im Moment versteht das fd.device Amiga-Tracks (normal und Diskspare) und
PC-Tracks (in den meisten allgemeing&uuml;ltigen Sektor-Gr&ouml;&szlig;en, z.B. 128, 256,
512, 1024, 2048 etc).<P>
<LI>Kompatibel mit ALLEN Amiga-Systemen von Workbench 1.2 bis 3.1. Man kann
OFS-Disketten auf einem A4000 formatieren und FFS-DC auf einem alten A500
lesen!<P>
<LI>Kompatibel mit HD- (High Density) und DD-Laufwerken sowie ungew&ouml;hnlichen
Mediengr&ouml;&szlig;en (3 Zoll [Amstrad] und 5.25 Zoll).<P>
<LI>Unterst&uuml;tzt lange Windows95-Dateinamen.<P>
<LI>FILE0 und FILE1 lassen die Bearbeitung von Disk-Images auf anderen Medien
(RAM, HDD, CD, ...) zu.</UL><P><BR>
Die Einschr&auml;nkungen:<P>
Formatieren von Disketten funktioniert, solange das urspr&uuml;ngliche Format
des Datentr&auml;gers benutzt wird. Es ist nicht m&ouml;glich, das Format zu &auml;ndern.
PC bleibt PC, Atari bleibt Atari...<P>
Schreiben wurde nur auf QDos getestet und ist f&uuml;r Spectrum und PC noch
nicht verf&uuml;gbar.<P>
Der CatWeasel-Disketten-Controller wird nicht unterst&uuml;tzt, da dort das
Format vom Benutzer explizit angegeben werden mu&szlig;.<P><BR>
So viele M&ouml;glichkeiten machten nat&uuml;rlich neugierig. Also, schnell
installieren und testen. Handler und Device an die entsprechenden Stellen
kopieren, FD0 mounten und eine Win95-Disk ins Laufwerk schieben. ... ...
... Sofort ein Erfolgserlebnis.<BR>
Das Icon erscheint wie bei CrossDOS auf der Workbench. Jetzt wird es
spannend:<BR>
Ein Doppelklick auf das Icon ... ... Das Fenster geht auf ... ... Nix zu
sehen.<P>
Ouh Hah, den Anzeigemodus wechseln: Alles anzeigen. Das Laufwerk rattert,
und ... alles 8+3. Aber was ist das? Nicht alle Namen sind in
Gro&szlig;buchstaben. Eine Datei besteht auch aus kleinen, und im Kommentar steht
der gleiche Name, nur in Gro&szlig;buchstaben.<P>
Vielleicht war die Win95-Startdisk doch nicht das Gelbe vom Ei. Also ein
neuer Versuch mit abgespeicherten Texten aus WinWord. Hurra, lange
Dateinamen, und im Kommentar steht der DOS-Name in 8+3. Endlich hat der
Datenaustausch mit kryptischen Namen ein Ende. Jetzt kommt der H&auml;rtetest.
Eine ASCII-Datei mit einem langen Namen wird auf die Disk kopiert.
Einwandfrei. Die Disk in den PC, Verzeichnis auflisten unter Win95, alles
in Ordnung, kein Datenverlust, der Datentr&auml;ger ist OK.<P>
FD0: verh&auml;lt sich also genau wie ein normales Amiga-Laufwerk, auch mit
Amiga-Disketten. Nur hat man dann je ein Icon f&uuml;r DF0: und FD0: auf der
Workbench. Wie angek&uuml;ndigt tut sich bei Mac-Disketten nicht viel. Erkannt
wird die Diskette zwar, der Inhalt bleibt jedoch verborgen, und die
Kapazit&auml;tsanzeige stimmt auch nicht. Aber der Autor verspricht in K&uuml;rze
Abhilfe.<P>
Die FILE-Devices konnte ich mangels File leider nicht testen, ebenso wie
die Arbeit mit WinNT-Disketten, jedoch die Anwendung des xfs auf von Win95
formatierte Festplatten. Ich habe meinen Amiga &uuml;ber Siamese und SCSI mit
meinem PC verbunden. Bisher habe ich die in der Mitte liegende Festplatte
&uuml;ber Cross-DOS dem Amiga zur Verf&uuml;gung gestellt. Mit einer &Auml;nderung der
Mountlist auf xfs und einer Erh&ouml;hung der Stacksize auf 16000 meldete sich
die Platte sofort mit den langen Win95-Namen.
Ich benutze xfs jetzt mit dieser Platte seit Mitte Januar und hatte noch
keinen Datenverlust, xfs betreffend. Leider gab es jedoch einige Abst&uuml;rze.
Jedesmal wenn die Platte nicht eingeschaltet ist, st&uuml;rzt xfs beim Mounten
ab.<P>
Alles in allem lohnt sich die Installation, schon wegen der langen
Dateinamen f&uuml;r Win95. Die anderen Formate, au&szlig;er Atari, sind f&uuml;r
Deutschland vielleicht etwas exotisch. Schmerzlich vermisse ich eigentlich
nur die Unterst&uuml;tzung f&uuml;r Macintosh, aber hier wird ja dran gearbeitet.<P>BR>
Rainer Kalthoff<P>
eMail:<BR>
<A HREF="mailto:R.Kalthoff@ping.de">R.Kalthoff@ping.de</A><BR>
<A HREF="mailto:kaltho00@marvin.informatik.uni-dortmund.de">kaltho00@marvin.informatik.uni-dortmund.de</A><BR>
<A HREF="mailto:su0326@studserver.uni-dortmund.de">su0326@studserver.uni-dortmund.de</A><P>
Homepage:<BR>
<A HREF="http://www.ping.de/sites/storm/index.html">http://www.ping.de/sites/storm/index.html</A><P><BR>
Das XFileSystem findet man im Aminet unter    disk/misc/xfs209_beta2.lha  &#171;<P>
Anmerkung der Redaktion: Mittlerweile ist xfs in der Version 2.10beta2
erschienen (Aminet: disk/misc/xfs210b2).<P>
<CENTER><BR><A HREF="0100.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0102.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

