<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 03/98 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Softwaretest: Visage (von Uwe Pannecke)</H2>
<B>&#187;Visage - der ultimative Bildanzeiger?!</B><P>
<A HREF="Visage.png">Screenshot</A><BR>
Nachdem in der aakt 2/98 der Bildanzeiger Mysticview einem Praxistest
unterzogen wurde, soll heute sein Mitbewerber VISAGE unter die Lupe
genommen werden.<BR>
Es ist erstaunlich, da&szlig; bei der Vielzahl bereits vorhandener Bildanzeiger
unterschiedlichster Couleur immer wieder noch ein neuer Vertreter
programmiert und unter die AMIGA-Gemeinde "geworfen" wird.
VISAGE-Autor Magnus Holmgren meint, keiner der vorhandenen Bildanzeiger
entspricht seinen W&uuml;nschen vollst&auml;ndig, und so programmierte er sein
eigenes Anzeigeprogramm.<BR>
Das Ergebnis seiner Programmierbem&uuml;hungen macht einen guten Eindruck!
Doch der Reihe nach:<P><BR>
<B>Systemvoraussetzungen:</B><P>
Wie Mysticview ben&ouml;tigt auch VISAGE AMIGA-OS 3.0. Der Autor verspricht eine
sichere Funktion des Programmes bereits ab 512 kB, wenn auch gr&ouml;&szlig;ere Bilder
zwingend mehr RAM-Speicher verlangen.<BR>
W&auml;hrend der Installation (benutzerfreundlich mittels Installer) wird bei
Bedarf eine f&uuml;r 68020+ Prozessoren optimierte Programmversion auf die
Festplatte geschrieben.<BR>
Im Gegensatz zu MysticView ist VISAGE Freeware, also kostenlos, jedoch
nicht umsonst ;)<P>
VISAGE unterst&uuml;tzt jeden ECS- und AGA-Chipsatz sowie RTG.
Es werden programmintern die Bildformate IFF ILBM, JPEG, PNG und &uuml;ber
Datatypes alle nur denkbaren Formate angezeigt.<P>
Ich habe die aktuelle 68020-Version 39.18 unter CyberGfx 2.25 und
picture.datatype Version 43 getestet.
Dabei mu&szlig;te sich VISAGE an IFF ILBM-, JPEG-, EPSF-, AMF-, GIF-, PNG-, PCX-
und TIFF-Bildern beweisen.<P>
VISAGE kann sowohl von der Workbench als auch von der Shell aus gestartet
werden.<BR>
In beiden Varianten bietet sich eine schier un&uuml;berschaubare Anzahl an
Optionen, die dem Programm mit auf den Weg gegeben werden k&ouml;nnen.
Es sind insgesamt 60 (in Worten &lt;sechzig&gt;!) Argumente, die in den
Tooltypes des Piktogramms oder im CLI bei Bedarf einzugeben sind.
Diese enorme Vielfalt ist aus meiner Sicht auch gleichzeitig eine
Schw&auml;che von Visage.<BR>
Da es im Gegensatz zu MysticView keine Benutzeroberfl&auml;che gibt, in der
intuitiv bestimmte Optionen angew&auml;hlt werden k&ouml;nnen, wird sich eine lange
Einarbeitungszeit mit umfangreichem Handbuch-Studium nicht vermeiden
lassen, um alle M&ouml;glichkeiten des Programmes aussch&ouml;pfen zu k&ouml;nnen.
Wer gewillt ist, diesen Aufwand auf sich zu nehmen, wird dann allerdings
mit fast unbegrenzter Einflu&szlig;nahme durch den User belohnt.<P><BR>
So k&ouml;nnen z.B.<P>
<UL>
<LI> nat&uuml;rlich Bilder bildschirmf&uuml;llend und/oder zentriert dargestellt werden,
<LI> die unterschiedlichsten Bildschirme vorgegegeben oder der optimalste
ausgesucht werden,
<LI> dabei l&auml;&szlig;t sich jeder (nicht nur native) AMIGA-ScreenModus als Text,
Kenn-Nummer oder mit Hilfe eines Requesters w&auml;hlen,
<LI> auch wie bei MysticView ein Diashow-Modus genutzt werden, der u.a. bei
Bedarf mit Bildschirmschonern zusammenarbeitet,
<LI> w&auml;hrend der Bildanzeige vorher definierte Kommandos ausf&uuml;hren,
um dem Bild einen Kommentar ("Dieses Bild l&ouml;schen") anzuh&auml;ngen, das
Bild zu verschieben, zu l&ouml;schen...
<LI> die Bilddaten (Bildformat, Gr&ouml;&szlig;e, Farbtiefe, Name) im Bild selbst
angezeigt,
<LI> xpk-gepackte IFF ILBM-Bilder betrachtet,
<LI> der Gamma-Wert des Monitors festgelegt werden, so da&szlig; die Helligkeit
des angezeigten Bildes optimiert wird,
<LI> Color-Cycling aktiviert,
<LI> die Nutzung der programminternen Bildformat-Routinen oder nur die der
Datatypes erzwungen,
<LI> die in einer Datei "VisageOpts" abgelegten Voreinstellungen gelesen
oder ignoriert,
<LI> die Nutzung von Interlace-Screenmodes verweigert werden, und und und.
</UL><P>
Im t&auml;glichen Gebrauch erf&uuml;llte VISAGE seine Aufgaben zuverl&auml;ssig und
absturzfrei.<P>
Aber auch VISAGE hat seine Ecken und Kanten.
Nicht alle meiner JPEG-Bilder konnte das Programm darstellen.
Dabei spielte es keine Rolle, ob die programminternen JPEG-Routinen oder
die des Datatypes benutzt wurden.<BR>
Statt dessen bekam ich die Fehlermeldung
"Konnte xxx.jpg nicht anzeigen: Nicht gen&uuml;gend Graphikspeicher".
Erstaunlich, denn unter gleichen Betriebsbedingungen hat Multiview
keinerlei Schwierigkeiten mit diesen Bildern.<P><BR>
<B>Fazit:</B>
Im finalen Vergleich VISAGE - MysticView gibt es einen eindeutigen Sieger,
geht es nur um eine simple Anzeige von Bildern:
MULTIVIEW als Bestandteil der System-Software!
Multiview ist am kompatibelsten, kleinsten und damit platzsparendsten
(MysticView ist dreimal, VISAGE sogar viermal gr&ouml;&szlig;er als MultiView) sowie
durch einen ARexx-Port durchaus fernsteuerbar.<P>
Soll das Anzeigen der Bilder auf m&ouml;glichst vielf&auml;ltige Weise beeinflu&szlig;bar
sein, findet der Vergleich keinen eindeutigen Sieger.<P>
F&uuml;r den intuitiv arbeitenden User ist MysticView die erste Wahl.
Eine gef&auml;llige und sinnvoll arrangierte Bedienoberfl&auml;che erleichtert den
Umgang mit dem Programm wesentlich. Au&szlig;erdem k&ouml;nnen hier mehrere Bilder,
nur begrenzt durch den verf&uuml;gbaren Speicher, auf einem Screen ge&ouml;ffnet (und
dort z.B. verglichen) werden.<P>
Dies kann VISAGE leider nicht bieten, weder GUI noch mehrere Bilder auf
einem Screen. Daf&uuml;r kennt die Einstellvielfalt dieses Programmes kaum
Grenzen. Der experimentierfreudige und Shell-orientierte User wird an
VISAGE seine Freude haben.<P>
Sowohl VISAGE als auch MysticView k&ouml;nnen sehr gut in Programme wie DOpus
eingebunden werden.<P><BR>
<B>Bezugsquelle:</B><P>
Aminet unter /gfx/show/visage.lha<BR>
VISAGE ist Freeware.<P>
Uwe Pannecke<BR>
<A HREF="Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&#171;<P>
&#187;Kleiner Nachtrag:<BR>
Habe photocd.datatype installiert und Visage sowie MysticView mit vielen
Photo-CD-Bildern intensiv gequ&auml;lt.<BR>
Beide Programme haben den Test bestanden.<BR>
[MultiView nat&uuml;rlich auch ;) ]&#171;<BR>
<CENTER><BR><A HREF="0101.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0103.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

