<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Spiele-News aus aller Welt</H2>
<H3>Quake-Update</H3>
Die englische Zeitschrift CU AMIGA berichtet in ihrer neuesten Ausgabe auf
6 Seiten &uuml;ber Quake. Ihr lag scheinbar schon eine erste Version des Spiels
vor. Nach Meinung der Redakteure ist die AMIGA-Version die schnellste
Version des Spiels bisher, auf einem 68060/50 laufe das Spiel so schnell
wie auf einem PC mit Cyrix P150-Prozessor, und selbst die AGA-Version
laufe mit 68060/50 in der 320x200-Aufl&ouml;sung so schnell wie auf einem 486
mit 100 Mhz.<BR>
Quake soll inzwischen &uuml;brigens Ende Februar erscheinen, bzw. erschienen
sein.<P><BR>
<H3>Doom-Update</H3>
Neue Versionen der Amiga-Doom-Ports sind im Aminet erschienen. Der beste
Port ADoom ist mittlerweile in der Version 1.1 erh&auml;ltlich. Im Vergleich zum
letzten Monat gab es weitere Geschwindigkeitssteigerungen und viele neue
Features und Bugfixes. Neben VDoom gibt es inzwischen mit ZhaDoom eine
weitere Portierung f&uuml;r die PowerPC-Amigas, die allerdings unter WarpUp
l&auml;uft.<BR>
Ein Tip noch f&uuml;r Leser ohne Modem oder Leute, die Geld sparen wollen. Auf
der CD der neuesten CU AMIGA-Ausgabe (M&auml;rz 1998 - CUCD 20) befinden sich
neben (logischerweise nicht aktuellen) Amiga-Doom-Ports das Shareware-WAD-
File und sage und schreibe 80 zus&auml;tzliche WADs. Die 28 DM sind also
sicherlich eine lohnende Investition.<P><BR>
<H3>Descent-Update</H3>
Nachdem der Sourcecode von Descent freigegeben wurde, dauerte es nat&uuml;rlich
nicht lang, bis erste Ports f&uuml;r den AMIGA erschienen. Die
Systemvoraussetzungen sind noch recht hoch, aber die Komplexit&auml;t des Spiels
sollte sowieso einen schnellen Prozessor und eine Grafikkarte ben&ouml;tigen,
um das Spiel halbwegs spielbar zu machen. Ein Hindernis zur Bekanntheit,
die die AMIGA-Doom-Ports erreicht haben, ist, da&szlig; zum Spielen der Amiga-
Descent-Ports die kommerzielle Descent-Version von N&ouml;ten ist. Die
Shareware-Version l&auml;uft leider nicht. Alle Besitzer des PC-Spiels k&ouml;nnen
sich die AMIGA-Ports aus dem Aminet downloaden (game/shoot).<P><BR>
<H3>Myst-Patches im Aminet</H3>
2 Patches f&uuml;r Myst sind ab sofort im Aminet erh&auml;ltlich. Der eine patcht
das Spiel auf Version 1.1 und merzt einige Fehler des Spiels aus, der
andere deutscht einige versehentlich in die deutsche Version gekommene
englische Dateien ein.<P><BR>
<H3>Vulcan-News</H3>
In einer seeeehr langen Pressemitteilung hat Paul Carrington von Vulcan
Software im Februar sein Leid geklagt.<BR>
In der Erkl&auml;rung geht es haupts&auml;chlich um die Vergangenheit und die
Gegenwart von Vulcan Software und dem AMIGA-Markt im allgemeinen. Der
AMIGA-Markt sei mittlerweile so klein, da&szlig; es sich kaum noch lohne, Geld
zu investieren. Vulcan bem&auml;ngelt haupts&auml;chlich die immer noch vorhandenen
Raubkopierer und Software-Piraten und sieht als einzige Chance f&uuml;r ein
Comeback des AMIGAs, da&szlig; ein Rechner auf den Markt gebracht wird, der
einen Monitor, Tastatur, Disketten-Laufwerk, 24xCD-ROM-Laufwerk, 1 bis
10 GB-Hard Disk, Modem, Grafikkarte mit 4 MB RAM, 3D Chipset, 32 MB RAM,
060 CPU mit 200 MHz-PowerPC-Karte, MPEG-Decoder, Soundkarte, Lautsprecher,
AGA (f&uuml;r R&uuml;ckw&auml;rts-Kompatibilit&auml;t), neues OS, vorinstallierte Web-Browser,
E-Mail-Programme, Textverarbeitung, und andere Software bietet und f&uuml;r
einen Preis von 400 englischen Pfund (ca. 1200 DM) erh&auml;ltlich sein mu&szlig;;
und er mu&szlig; AMIGA hei&szlig;en. Da dies in der n&auml;heren Zukunft nicht in Sicht
ist, hat Vulcan beschlossen, auch Software f&uuml;r PC und Playstation zu
produzieren. Eine weitere Konsequenz ist die Einstellung der Titel
Breed2000, 3D Games Creator, Jet Pilot Expansion CD und Valhalla 4. Die
Titel Hellpigs und Wasted Dreams sind von den Programmierern so lange auf
Eis gelegt, bis der AMIGA-Markt sich regeneriert hat.
All dies bedeutet jedoch nicht einen Ausstieg Vulcans aus dem AMIGA-Markt.
Genetic Species soll im Februar erscheinen, gefolgt von Desolate und Hard
Target sowie dem Genetic Species World Creator. In Zukunft werde sich
Vulcan verst&auml;rkt in Richtung PowerPC bewegen, was durch den Vertrag mit
World Foundry schon begonnen habe.<BR>
Die komplette, sehr lesenswerte Erkl&auml;rung ist z.B. auf der Amiga-Flame-
Website erh&auml;ltlich.<P><BR>
<H3>Genetic Species-Update</H3>
Die Programmierer von Genetic Species sind scheinbar Perfektionisten. Wie
ist es anders zu erkl&auml;ren, da&szlig; das Spiel immer noch nicht erschienen ist
und das Spiel seit dem 3. Demo wieder extrem verbessert wurde. Wir warten
also wieder einen Monat.<P><BR>
<H3>Sadeness entt&auml;uscht</H3>
Auch die Firma Sadeness ist &uuml;ber die Verkaufszahlen ihres Spiels onEscapee
entt&auml;uscht. Die Firma meint, die niedrigen Zahlen zeigen den AMIGA-Markt
in keinem guten Licht. Wenn ein Spiel, das von allen Magazinen als sehr
gut bewertet wird, sich nur so schwach verkaufe, sei das nicht gut f&uuml;r
zuk&uuml;nftige AMIGA-Titel. Man hofft nun auf bessere Zahlen beim Spiel
Foundation.<P><BR>
<H3>Scions of a forgotten World-Programmierer suchen Hilfe</H3>
Die Programmierer des Spiels Almagica - Scions of a Forgotten World
suchen Programmierer, die m&ouml;glichst schnell an dem Echtzeit-Strategie-
Spiel mitprogrammieren wollen. N&auml;here Informationen gibt es auf der
Website von Vulcan Software.<P><BR>
<H3>Alive Mediasoft-Split</H3>
Die Firma Alive Mediasoft hat sich gesplittet. Die urs&uuml;pr&uuml;ngliche Firma
wird nur noch als Versand f&uuml;r Amiga-Spiele aller Art t&auml;tig sein. Neue
Titel (Gilbert Goodmate, Haunted, etc.) werden bei der neuen Firma Crystal
Software erscheinen.<P><BR>
<H3>Dialog-Autor f&uuml;r Gilbert Goodmate</H3>
Auch die Programmierer des Adventures Gilbert Goodmate (Preview in dieser
Ausgabe) suchen Hilfe. Alle Leute, die als Dialog-Autor f&uuml;r das Spiel
t&auml;tig werden wollen, melden sich bei prelusion@swipnet.se<P><BR>
<H3>Grafiker-Suche bei Desktop Corruption</H3>
Auch f&uuml;r Grafiker gibt es in diesem Monat ein Job-Angebot. Desktop
Corruption sucht einen Grafiker f&uuml;r den Diablo-Clone Dafel: Bloodline,
der bei Sadeness Software erscheinen soll. Interessierte melden sich bei
jason.hayman@virgin.net<BR>
Desktop Corruption arbeiten au&szlig;erdem an einem zweiten Spiel. Es handelt
sich um (wie soll es anders sein) einen Command & Conquer-Clone namens
Scrap Metal.<P><BR>
<H3>Claws of the Devil</H3>
Der Tomb-Raider-Clone "Claws of the Devil" von Titan nimmt konkretere
Formen an. Nach Angaben von Titan wird es ein Horror-Action-Adventure
mit einer Tomb-Raider-&auml;hnlichen 3D-Engine und vielen Zwischensequenzen.
Die Engine soll bis zu 4096 Farben gleichzeitig, sowie aufwendige Licht-,
Wasser und Spiegeleffekte bieten. Auch das Blicken nach oben und unten
soll mit der Claws of the Devil-Engine m&ouml;glich sein.
Erste Screenshots sollen demn&auml;chst ver&ouml;ffentlicht werden. Erscheinen soll
das Spiel voraussichtlich im Juni. Unter 68040 l&auml;uft allerdings nichts,
eine PowerPC-Version wird es ebenfalls geben.<BR>
Eins noch f&uuml;r Lara Croft-Fans: Auch Claws of the Devil hat eine
Titelheldin. Mal sehen, ob sie Lara das Wasser reichen kann.<P><BR>
<H3>neue Forgotten Forever-Screenshots</H3>
Wieder einmal sind neue Screenshots des angek&uuml;ndigten Echtzeit-Strategie-
Spiels Forgotten Forever erschienen. Die Bilder, die wieder einmal
hervorragend aussehen, beinhalten einen Screenshot des Map-Editors, der
vielleicht in das Spiel integriert wird. Forgotten Forever soll im Sommer
bei Sadeness Software erscheinen.<P><BR>
<H3>Oxyron planen neues Spiel</H3>
Oxyron, Programmierer von Trapped 1 und 2 arbeiten bereits vor Erscheinen
von Fratzengeballer an ihrem n&auml;chsten Titel. Leider gibt es bisher keine
Informationen dar&uuml;ber, aber man soll sich auf etwas Unglaubliches gefa&szlig;t
machen. Da sind wir aber mal gespannt.<P><BR>
<H3>Screenfun verabschiedet sich scheinbar wieder vom AMIGA</H3>
Nach einer scheinbar recht gro&szlig;en Menge an Kritik von AMIGA-Besitzern
hat sich die Zeitschrift nach ihrem unr&uuml;hmlichen AMIGA-Artikel recht
schnell wieder vom AMIGA verabschiedet. Unter den Systemen auf der Seite
"So bewertet BRAVO SCRENFUN" erscheint der AMIGA nicht mehr. Tsch&uuml;&szlig;!<P><BR>
<H3>APC &amp; TCP-News</H3>
Nachdem einige APC&amp;TCP-Titel eingestellt worden sind (Hotelmanager, etc.)
und ein neuer Titel dazugekommen ist, sieht die Release-Liste im Moment
so aus: Pulsator (April 1998); Adventure-Shop (Mai 1998); Testament 2
(Mai 1998); Phoenix (Juni 1998); AmiBee (Juni 1998); Marblelous 2 (Juli
1998); Skaut (September 1998); Skimmers (Dezember 1998); Daydream (1998);
Westerados (1998). Ob Magic Island noch erscheinen wird, steht nicht fest.<P><BR>
<H3>Counterstrike</H3>
Und wieder ein Command &amp; Conquer-Clone. Counterstrike wird sehr
detaillierte Karten und Sprachausgabe bieten. Nat&uuml;rlich gibt es auch
viele verschiedene Geb&auml;ude und Fahrzeuge. TCP/IP-Support, CyberGFX-Support
und 040/060-optimierte Routinen runden das f&uuml;r CD-ROM geplante Spiel ab.<P><BR>
<H3>Orion Wars</H3>
Eine Mischung aus Elite und Wing Commander ist mit dem Spiel Orion Wars
geplant. Das Spiel soll f&uuml;r AGA, CyberGFX und Picasso '96 erscheinen.
<CENTER><BR><A HREF="0203.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0205.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

