<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Review: MegaBlast</H2>
Kommerzielle Spiele, die auf einer einzigen Diskette daherkommen, gab es in
den letzten Jahren eher selten. Bei dem neuesten Produkt aus dem Hause APC&amp;
TCP ist dies der Fall. MegaBlast ist ein Low-Cost-Bomberman-Clone. Ist
dieses Spiel seinen geringen Preis von ca. 30 DM wert? Dieser Test wird es
zeigen.<BR>
Eine gedruckte Anleitung sucht man (wie in der heutigen AMIGA-Spiele-Zeit
leider zu oft) vergeblich, statt dessen befindet sich auf der Diskette eine
recht schlechte Amiga-Guide-Anleitung. Das Spiel kommt auch nur in einer
CD-H&uuml;lle daher (irgendwie irref&uuml;hrend f&uuml;r ein Disketten-Spiel).
Startet man das Spiel, f&auml;llt der erste Blick auf das Titelbild, auf dem
am unteren Rand "Copyright 1995"(!!!) steht. Nun hat man drei
Auswahlm&ouml;glichkeiten: Start, Options und Quit. Da wir das Spiel nicht
gleich wieder verlassen wollen, gehen wir also zuerst ins Optionsmen&uuml;.
Hier kann man die Spieleranzahl ver&auml;ndern. Im Gegensatz zum Text auf der
Verpackung und in der Anleitung kann man das Spiel auch allein spielen -
gegen 1-5 Computergegner. Hat man ein paar Freunde, die mitspielen wollen,
kann man auch mit insgesamt 2-6 menschlichen Gegnern spielen. F&uuml;r das Spiel
zu sechst ben&ouml;tigt man jedoch einen Joystick-Adapter (eine Bauanleitung
befindet sich in der Anleitung). Die weiteren Men&uuml;punkte im Optionsmen&uuml;
sind die Einstellung der Rundenzahl, die zum Sieg ben&ouml;tigt wird, die
Regelung der Musik-Lautst&auml;rke und die Auswahl der Kontrolle der einzelnen
Spieler (also Joystick, Keyboard oder Computergegner).
Viele Einstellungsm&ouml;glichkeiten gibt es also nicht. Verschiedene Spielmodi
h&auml;tten sicher nicht geschadet... Hier m&uuml;ssen noch einige Worte zur
schlechten Anleitung ("W&uuml;r w&uuml;nschen Dir viel Spa&szlig;") gesagt werden. Im
Gegensatz zum dortigen Text kann n&auml;mlich nicht zwischen verschiedenen
Spielarten gew&auml;hlt werden, wenn das Spiel allein gespielt wird. Einen
Modus, in dem man Diamanten einsammeln mu&szlig;, habe ich zumindest vergeblich
gesucht.<BR>
Startet man das Spiel nun endlich, gilt es die 1-5 Gegner wegzubomben, um
die Runde f&uuml;r sich zu entscheiden. Da sich die Spieler nur durch die Farbe
der M&uuml;tzen unterscheiden, mu&szlig; man sich gerade im Spiel gegen 5
Computergegner beeilen, um seine Spielfigur &uuml;berhaupt zu erkennen. Es kann
schon mal passieren, da&szlig; man tot ist, bevor man &uuml;berhaupt wei&szlig;, wer man
ist bzw. war. F&uuml;r die Zerst&ouml;rung der W&auml;nde, der Gegner und der anderen
Monster stehen 2 verschiedene Bombentypen zur Verf&uuml;gung. Bomben, die dort
liegenbleiben, wo man sie hinlegt und Bomben, die man &uuml;ber alle W&auml;nde
hinweg in eine Richtung werfen kann, wo sie dann nach einiger Zeit des
Fluges explodieren. Die Arbeit wird den Spielern dabei von einigen
Bonusgegenst&auml;nden, die unter zerst&ouml;rten Mauern hervorkommen, erleichtert
bzw. erschwert. Hierzu geh&ouml;ren solche, die die Anzahl der gleichzeitig
verwendbaren Bomben steigern und Gegenst&auml;nde, die die Reichweite der
Bombenexplosionen erh&ouml;hen. Weiterhin findet man Fragezeichen, die (wie
kann es anders sein) einige &Uuml;berraschungen hervorrufen. So wird das
Spielfeld schon mal um 180 Grad gedreht, oder die Spielfiguren werden f&uuml;r
eine bestimmte Zeit unsichtbar.<BR>
Das Spiel ist zwar nicht wirklich langweilig, aber vom Sitz rei&szlig;t es auch
nicht. Vor allem mit mehreren Spielern kann MegaBlast (wie nahezu jeder
Bomberman-Clone) Spa&szlig; machen. Angesichts des brillianten, in diesem Monat
im Aminet als Freeware ver&ouml;ffentlichten Blitzbombers kann das Fazit dieses
Tests nur hei&szlig;en: Spart die 30 DM und spielt Blitzbombers. Nur Hardcore-
Fans des Spielprinzips und Sammler von Bomberman-Clones sollten angesichts
des nicht sehr hohen Preises zuschlagen.<BR>
Besonders gelungen ist der Werbetext, der sich auf der Verpackung des
Spiels befindet (Text in Klammern - Kommentar von mir): Deine Aufgabe
besteht darin (Komma vergessen) alles zu vernichten (noch ein Komma
vergessen) was Dir in den Weg kommt (Komma vergessen) au&szlig;er den Diamanten
(welche Diamanten ???) (ach ja - Komma vergessen) welche verteckt (soso!)
in der Gegend liegen. Dabei ist es Dir &uuml;berlassen (jaja, ich bin pingelig,
aber hier fehlt nunmal ein Komma) ob Du als einsamer Gegner gegen den
Computer k&auml;mpfst (Ratet mal !!!) oder aber gegen 6 menschliche Gestalten.
(menschliche Gestalten ???) Es wird nicht lange dauern und das Spiel wird
Dich selber so fesseln (na ja) und faszinieren (soso), das (wird mit "&szlig;"
geschrieben) Du es garnicht ("gar nicht" wird gar nicht
zusammengeschrieben) merken wirst wie die Zeit vergeht (abgesehen davon,
da&szlig; das Spiel wahrscheinlich niemanden so faszinieren wird, da&szlig; er die Zeit
vergi&szlig;t, m&uuml;ssen wir wohl den Umgang mit den verschiedenen Zeitformen auch
noch &uuml;ben). Wundersch&ouml;ne Grafik (wo?) und interessante Effekte (wann?)
werden Dich bis zum bitteren Ende begleiten.<BR>
Jaja, es mag so aussehen, als sei ich ein etwas pingeliger Mensch, aber
diesen schlechten Text kann man doch so nicht auf eine Verpackung drucken.
6 Kommafehler, 2 Rechtschreib- bzw. Grammatikfehler, und ein inhaltlicher
Fehler (wo sind die Diamanten?) h&auml;tten nicht mal f&uuml;r ein "ausreichend" in
einem Diktat gereicht. Also macht es bitte beim n&auml;chsten Mal besser,
APC&amp;TCP.

<PRE>
Name:          MegaBlast
Hersteller:    APC & TCP
               Dorfstr. 17
               83236 &Uuml;bersee
               Tel.: 08642/899953
               E-Mail: ANDREAS@HIGHVOLT.gun.de
Preis:         29.95 DM
Datentr&auml;ger:   1 Diskette
Genre:         Geschicklichkeit
Spieler: 1-6
Sprache:       englisch
Anleitung: deutsch + englisch
System:        1 MB RAM
Fazit:         mittelm&auml;&szlig;iger Bomberman-Clone
               mit einigen Schw&auml;chen und
               sehr geringer Optionsf&uuml;lle.
Wertung:
                       Grafik:     5/10
                       Sound:      4/10
                       Handhabung: 5/10
                       Spielspa&szlig;:  5/10
                       GESAMT:     49 %
</PRE>
<CENTER><BR><A HREF="0205.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0207.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

