<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Review: Myst</H2>
Es ist soweit. Nachdem das Spiel zeitweise ausverkauft war und clickBOOM
dann statt der Luftpost die normale Post benutzt hat, um mir ein Exemplar
von Myst zukommen zu lassen, ist das Schiff mit dem P&auml;ckchen an Bord nun
von Kanada kommend in Hamburg eingelaufen (zum Gl&uuml;ck ist es nicht
gesunken), und ich habe das Spiel in meinen H&auml;nden. Ganz neu war es mir
nicht, hatte ich schlie&szlig;lich schon die PC-Version gesehen und auch die
AMIGA special-Testversion f&uuml;r den Testbericht, der in der n&auml;chsten AMIGA
special erscheinen wird, begutachten d&uuml;rfen.<BR>
Nun habe ich aber meine eigene AMIGA AGPJ-Testversion und einem Bericht
steht nichts im Wege.<BR>
Was soll man &uuml;ber Myst eigentlich noch sagen ?
Es ist das meistverkaufte Computerspiel aller Zeiten, B&uuml;cher wurden &uuml;ber
Myst geschrieben und ein Kino-Film war in Planung. Endlich d&uuml;rfen wir
AMIGA-Besitzer teilhaben am Mysterium Myst. Ist das Spiel nun gut oder
schlecht? Nie war ein Spiel so umstritten wie dieses, man liebt es oder
man ha&szlig;t es... aber der Reihe nach:<BR>
Myst kommt in einer &uuml;berdimensionalen Pappbox daher. Neben dem Jewel Case
mitsamt der randvollen CD und einem Booklet mit der deutschen und
englischen Anleitung finden sich in dieser Box noch Flyer mit Werbung f&uuml;r
Capital Punishment und Quake.<BR>
Nach der Installation (je nach Wunsch mit mehr oder weniger Bedarf an
Festplattenplatz) kann man das Spiel sofort starten oder erst einen
"Making of Myst-Film" ansehen. Nach dem Doppelklick auf das Spiel-Icon
und einem kurzen Intro befindet man sich endlich auf Myst, jener
mysteri&ouml;sen Insel ohne Bewohner, auf der es seltsame Geb&auml;ude, Maschinen
und andere Gegenst&auml;nde gibt. Welche Aufgabe wartet hier?
Myst ist ein Adventure mit einer denkbar einfachen Steuerung. Mit einem
einfachen Mausklick kann man Hebel bewegen, Kn&ouml;pfe dr&uuml;cken und nat&uuml;rlich
durch die Gegend gehen. Das Besondere an Myst ist die hervorragende
Grafik. Selten war in einem Adventure etwas &Auml;hnliches zu sehen. Perfekt
gerenderte Landschaften ziehen den Spieler in seinen Bann und lassen ihn
nicht mehr los, in Sachen Atmosph&auml;re ist Myst das beste Spiel aller
Zeiten. Besitzt man eine CyberGFX-Karte kann man die kleinen Filmchen,
die &uuml;berall im Spiel auftauchen, in einer verbesserten Qualit&auml;t bestaunen.
Der Sound im Spiel besteht aus Hintergrundger&auml;uschen und einer Musik, die
die Stimmung des Spiels verst&auml;rkt.<BR>
Kurz nach Start findet man den ersten Hinweis, einen Brief von Katharina.
Doch wer ist diese Katharina, nach und nach l&ouml;st sich das Geheimnis der
Insel, besonders die Bibliothek ist eine wahre Fundgrube, die Fragen
beantwortet, aber auch neue Fragen aufwirft.<BR>
Sp&auml;ter wird der Spieler (man spielt &uuml;brigens sich selbst und nicht eine
fiktive Person, in die man hineinschl&uuml;pft) in verschiedene Welten
teleportiert, um dort nach etwas zu suchen (was das ist, m&uuml;&szlig;t Ihr leider
selbst herausfinden).<BR>
Unter dem Strich bleibt ein Adventure, das zu den besten geh&ouml;rt, die
Computer jemals gesehen haben. Eine perfekte Grafik, ein guter Sound und
eine Steuerung, die einfacher nicht sein kann, sorgen daf&uuml;r, da&szlig; Myst den
Spieler nicht mehr losl&auml;&szlig;t, bis er es durchgespielt hat.
Negativ kann man allerh&ouml;chstens den Schwierigkeitsgrad der R&auml;tsel ansehen,
doch auch hier streiten sich die Geister. Einige finden die R&auml;tsel zu
einfach, andere zu schwer. Anf&auml;nger brauchen aber einige Zeit, um sich an
die R&auml;tsel zu gew&ouml;hnen und die eigene Myst-Logik in sich aufzunehmen.
Die Absturzfreudigkeit des Spiels an einigen Stellen wird durch den
inzwischen im Aminet erh&auml;ltlichen Patch auf Version 1.1 behoben. Wer immer
noch Probleme mit Abst&uuml;rzen hat, sollte die neueste Setpatch-Version von
der AMIGA International-Homepage downloaden, auch diese behebt einige
Probleme des Spiels. Ein zweiter Patch, der zwei englische Dateien (einen
Film und einen Zettel), die aus Versehen in die deutsche Version gelangt
sind, eindeutscht, ist ebenfalls verf&uuml;gbar.<BR>
Das Fazit dieses Test kann also nur lauten: KAUFEN !!!
<PRE>
<A HREF="Myst.jpg">Screenshot</A>
Name:          Myst
Hersteller:    clickBOOM / PXL Computers
               Box 969 - 31 Adelaide St.East
               Toronto Canada, M5C 2K3
Preis:         ca. 100 DM
Datentr&auml;ger:   1 CD
Genre:         Adventure
Spieler:       1
Sprache:       deutsch oder englisch
               Anleitung: deutsch + englisch
System:        mind. 68020 + 8 MB RAM + CD-ROM +
               AGA oder CyberGfx
Fazit:         perfekte Umsetzung des meistverkauften
               Computerspiels aller Zeiten. Ein Mu&szlig;
               f&uuml;r jeden AMIGA-Besitzer.
Wertung:
               Grafik:    10/10
               Sound:      7/10
               Handhabung:10/10
               Spielspa&szlig;:  9/10
               GESAMT:     93 %     AMIGA AGPJ AWARD
</PRE>
<CENTER><BR><A HREF="0206.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0208.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

