<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Leserbrief</H2>
Da es keinen Street Racer-Test in AMIGA AGPJ gab, ver&ouml;ffentliche ich hier
Ausz&uuml;ge eines Leserbriefs von Dirk Neubauer. Da es sich nicht um einen
offiziellen AMIGA AGPJ-Test handelt, sei noch dazu gesagt, da&szlig; z.B. die
englische Fachpresse das Spiel nicht so gut bewertete wie Dirk, aber hier
seine Meinung:<P>
&#187;Also hier nun ein Test zu dem Spiel StreetRacer von Vivid Images!...<P>
...So dann wollen wir mal das Spiel starten. Man kann es auf HD
installieren, aber wozu.  Wird so und so komplett ins RAM geladen dank jst.
Aber nicht mal 'ne registrierte Version von jst liegt vor, nur v0.2a, da
es ab 0.3 Shareware ist. Die 0.5 findet man noch gepackt vor, ebenso wie
viele einzelne Dateien sehr oft irgendwie lzx-, lha-, pak-, zip- und
sonstwie gepackt &uuml;berall auf der CD zu finden sind. Man kann direkt von der
CD als NTSC oder PAL starten. Ich nehme PAL, da mein SuperVGAmi kein NTSC
unterst&uuml;tzt.<BR>
Es erscheint der Hauptbildschirm mit dem Eingangstrack, gute Musik. Man
kann &uuml;brigens jederzeit mit F10 aussteigen, eigentlich ganz gut, ansonsten
aber vollkommen ohne Multitasking. Erstmal in den Optionsbildschirm:
Waffen, K&auml;mpfen, Schaden und Kollisionen kann man f&uuml;r jeden menschlichen
Spieler einzeln ein- oder ausstellen. Ach so, Spieler 1 und 2 nehmen die
Joysticks, und 3 und 4 die Tastatur, das ist fest. Dann stellt man noch
Runden pro Rennen (1 - 20), Schwierigkeit (easy, medium, hard), Anzahl
Karts in Practice ein. Dann sind  da noch Optionen f&uuml;r den Soccer-Modus:
Speed (slow, medium, fast), Zeit, Gewinntore. Und dann noch das Pa&szlig;wort f&uuml;r
den Championship-Modus. Und hier ein dickes Fragezeichen: Meine Tastatur
reagiert so tr&auml;ge bis gar nicht, da&szlig; eine Eingabe des Codes oder ein
Spielen von Tastatur komplett unm&ouml;glich sind. Selbst das Dr&uuml;cken der
Leertaste, notwendig f&uuml;r den Custom-Options-Screen oder das Anw&auml;hlen
einzelner Tracks im Practice-Modus gestaltet sich zu einer Geduldsprobe.
Das mu&szlig; unbedingt noch ge&auml;ndert werden. Aber fangen wir jetzt mit dem Spiel
an: Anzahl der Spieler ausw&auml;hlen und Spielmodus. Ich k&ouml;nnte hier vielleicht
noch erw&auml;hnen, da&szlig; eine gewisse &Auml;hnlichkeit mit Streetfighter nicht zu
&uuml;bersehen ist, jedenfalls bei der Spielerauswahl. 8 Spieler, jeder aus 'ner
eigenen Welt und mit speziellem Gef&auml;hrt, Helmut der rote Baron, Biff der
fette Schl&auml;ger, Surf die rosa Braut, Frank(enstein), Raph der Smartie,
Hodja der Muselmann, Sulu.. der Negerh&auml;uptling... Im Practice kann man alle
anderen Modi erstmal antesten. Im  Head to Head fahren zwei oder mehr Leute
gegeneinander (auch Computer).<BR>
Dann starten wir mal ein Championship, den Bronzecup. Am Start ist man
jetzt hinten,  und  aufpassen, nicht zu fr&uuml;h Gas geben, sonst kommt man
nicht von der Stelle. Im richtigen Augenblick Gas geben und ab, jetzt geht
'ne Riesenkeilerei los. Auf der Bahn bleibt man sowieso nie richtig. Am
besten immer Vollgas und alles vom Platz schubsen, um sich schlagen und
andere plattmachen. Bomben aufsammeln, oder besser gesagt einfahren, denn
gezielt Objekte einsammeln geht bei der Geschwindigkeit und der Steuerung
nur bei gro&szlig;er &Uuml;bung. Ach so, die Bomben so schnell wie m&ouml;glich loswerden,
sonst geht man selber hoch, blo&szlig; dumm ist, man kann sie nicht wegschmei&szlig;en,
nur wenn man andere anrempelt, hinterl&auml;&szlig;t man ihnen die Bombe. Ab und zu
sammelt man auch Turbos, &auml;u&szlig;erst wichtig, besonders in h&ouml;heren Cups. Und
f&uuml;r Sterne kann's Extra-Bonus geben. Die Grafik ist nicht gerade
berauschend, die Bahnen sind ja gut gelungen, aber daneben alles einfarbig,
und der Hintergrund steht fest, obwohl der gut gezeichnet ist. Also ich
erkenne wirklich nicht, warum es dieses Spiel nicht schon 1992 auf dem
guten alten 500er gegeben hat.  Aber die Geschwindigkeit ist echt super.
Und zu jedem Track 'ne neue Musik.  Und es macht echt Spa&szlig;, ist ja auch
richtig 'was los, wenn man sich eine Bombe hundertmal gegenseitig
zuschiebt, bis sie dann endlich hochgeht...<P>
...Ich kann das Spiel jedem empfehlen, der ein lustiges Kartrennen sucht,
und nicht soviel Wert auf tolle gerenderte Grafiken (a la Flying High)
legt. Vom Spielspa&szlig; her nimmt es auf jeden Fall einen vorderen Platz ein,
nicht zu vergleichen mit dem langweiligen Flying High, eher mit Xtreme
Racing. Und wer schon immer mal mit 'nem Kart Fu&szlig;ball spielen wollte, der
mu&szlig; das Game einfach kaufen. Wenn auch der Hack mit der Tastatur eines
Tages aus der Welt ist, kann es richtig abgehen.<P>
<PRE>
Grafik:          4/10 (eher bescheiden)
Spielspa&szlig;:       9/10 (echt super)
Musik:           7/10 (nicht gerade langweilig)
Installation:   10/10 (total easy)
Preis/Leistung:  8/10 (geht so, wenn alle Fehler behoben
                      sind, aber die alten Demos h&auml;tte
                      man sich sparen k&ouml;nnen)...
</PRE>
- Dirk Neubauer&#171;

<CENTER><BR><A HREF="0212.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0214.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

