<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Amiga-News</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amine.gif" ALT="Amiga-Aktuell 03/98 Amiga-News" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>&Auml;u&szlig;erungen der AMIGA-F&uuml;hrung sorgen f&uuml;r Irritationen</H2>
Nach der Ver&ouml;ffentlichung des Fragenkatalogs von Joe Torre (siehe AMIGA
aktuell 2/98) sorgten, einigen Aussagen des Torre-Textes entgegenstehende,
Statements f&uuml;r Unruhe und Verwirrung in der AMIGA-Gemeinde.<P>
Zum einen meldete sich Chris Jones vom ICOA (Industry Council for Open
AMIGA), der Interessenvertretung der AMIGA-Entwickler, unter Berufung auf
AMIGA, Inc. zu Wort. Es folgt eine Zusammenfassung seines Stellungnahme,
die den AMIGA-aktuell-Abonnenten bereits durch ein Special bekannt ist:
<H3 ALIGN=CENTER>Erlaeuterungen zur Prozessorfrage und zum AMIGA OS 3.5</H3>
Chris Jones vom Industry Council for Open AMIGA (ICOA) machte in einer
E-Mail an AMIGA.org naehere Angaben zu den getroffenen Entscheidungen und
zur derzeitigen Entwicklung:<P>
Demnach hat AMIGA, Inc. noch KEINE Entscheidung ueber den in der naechsten
AMIGA-Generation zu verwendenden Prozessor getroffen. Vielmehr fuehre man
noch Gespraeche mit bekannten und weniger bekannten Chip-Herstellern, um
den Prozessor mit dem besten Preis/Leistungsverhaeltnis auszuwaehlen, der
den AMIGA fuer die naechsten zehn Jahre in Fuehrung bringen kann und dort
haelt.<BR>
Die getroffene Entscheidung zugunsten 68K&PowerPC sei lediglich eine
INTERIMLOESUNG, um die derzeit anderen Plattformen hinterherhinkende
Rechenleistung zu verbessern. Dies muesse nicht unbedingt das
phase5-Konzept darstellen, sondern koenne z.B. auch ein BoXeR mit PPC- oder
Alpha-CPU oder ein Pios mit 68K&PPC-Karte sein. Der ICOA sei offen, eine
Arbeitsgruppe zu bilden, die diese Hardware-Architektur festlegt.<P>
Zum AMIGA OS 3.5: Alain Penders, Olaf Barthel und er (Chris Jones) stellen
der Mail zufolge seit Ende November einen technischen Katalog zusammen, um
trotz der existierenden Zeit- und Ressourcen-Knappheit das AMIGA OS 3.5 so
gut wie moeglich herzustellen.<BR>
Viele Entwickler seien kontaktiert und um Rat, Kommentare und Kooperation
gebeten worden. Da AMIGA, Inc. Gateways Strategie verfolgt, so weit wie
moeglich im Hintergrund zu arbeiten, habe Jeff Schindler (Chef von AMIGA,
Inc.) dies bislang nicht veroeffentlichen wollen.<P><BR>

Die AMIGA-Gemeinde wu&szlig;te nicht mehr ein noch aus. War die endg&uuml;ltige
Prozessorentscheidung bereits getroffen oder nicht?
Auf Anfrage von AMIGA aktuell pr&auml;zisierte Joe Torre seine im Fragenkatalog
gemachten Aussagen: Solange noch kein leistungsf&auml;higer NativePPC-Port des
AMIGA OS samt 68k-Emulation verf&uuml;gbar ist, setze man auf die Hybrid-L&ouml;sung
"68k&PPC". Anschlie&szlig;end folge der &Uuml;bergang zum reinen PowerPC-AMIGA, wobei
es nat&uuml;rlich nicht ausgeschlossen sei, da&szlig; das AMIGA OS auf weitere CPUs
portiert wird.<P>
Auch Petro Tyschtschenko, Pr&auml;sident von AMIGA International, sah Anla&szlig; f&uuml;r
Klarstellungen: Gegen&uuml;ber AMIGA aktuell sagte er, in dem Punkt, da&szlig; AMIGA,
Inc. keine eigenen AMIGAs produziere, sei (Zitat) "das letzte Wort noch
nicht gesprochen. [...] Ich als Verantwortlicher f&uuml;r Sales und Marketing
will jedenfalls auch eigene Rechner vertreiben".<P><BR>
<B>Fazit:</B><P>
Ganz deutlich ist in den letzten Wochen geworden, da&szlig; die Aufgabenteilung
zwischen den beiden AMIGA-T&ouml;chtern von Gateway 2000 in den Bereichen zu
Schwierigkeiten f&uuml;hrt, wo es zu Interessen- bzw. Kompetenz-&Uuml;berschneidungen
kommt.<P>
Nur ein Beispiel: AMIGA, Inc. kann als f&uuml;r die Hard- und
Softwareentwicklung Verantwortlicher im Prinzip entscheiden, ob das
Unternehmen selbst neue AMIGA-Modelle herstellen wird oder dies Fremdfirmen
&uuml;berl&auml;&szlig;t.<BR>
AMIGA International, Inc. ist jedoch auf den Verkauf von AMIGA-Rechnern
angewiesen. Denn was n&uuml;tzt eine Vertriebsfirma, wenn es nichts zu
vertreiben gibt? Und gerade der AMIGA ben&ouml;tigt aufgrund seiner leider sehr
geringen Bedeutung im Einzelhandel ein solches Unternehmen dringendst.<P>
Eine m&ouml;gliche L&ouml;sung dieser Streitfrage w&auml;re, da&szlig; AMIGA International
Rechner bei einem Fremdunternehmen fertigen l&auml;&szlig;t und unter eigenem Label
vertreibt, wie das z.B. Commodore mit seinen Monitoren gemacht hat.<P>
Kehren wir aber zur&uuml;ck zum Ausgangsproblem, es soll hier nicht um einzelne
Beispiele gehen.<BR>
Was sollen wir AMIGA-Anwender davon halten, wenn AMIGA International und
AMIGA, Inc. (der ICOA eingeschlossen) mit verschiedenen Zungen sprechen?
Wir alle sind begierig auf neue Informationen bez&uuml;glich der AMIGA-Zukunft.
Dabei mu&szlig; es sich jedoch um feststehende Fakten handeln, nicht um
pers&ouml;nliche Meinungen einzelner Personen, die lediglich als Fakten
dargestellt werden. Ansonsten wird auf l&auml;ngere Sicht das Vertrauen der
AMIGA-User zu den Mitarbeitern beider Firmen schrumpfen, oder noch
schlimmer, deren Mitteilungen gar nicht mehr ernstgenommen.<P>
Gateway 2000 wird seine Gr&uuml;nde gehabt haben, nicht eine, sondern zwei
AMIGA-Firmen zu schaffen. Deren Angestellten mu&szlig; aber klar sein, da&szlig; ihre
Arbeit erheblich behindert wird, wenn sie nicht gemeinsam an einem Strang
ziehen. Alle Fragen, die sowohl AMIGA International, Inc. als auch AMIGA,
Inc. ber&uuml;hren, m&uuml;ssen von den Verantwortlichen beider Unternehmen in
Einvernehmen gel&ouml;st werden. Erst dann kann die &Ouml;ffentlichkeit informiert
werden.<BR>
Wem das nicht einleuchtet, der ist bei einem Tochterunternehmen von Gateway
2000, das bei seinen eigenen Mitarbeitern auf Einhaltung gewisser
"Spielregeln" achtet, wohl fehl am Platz.
<CENTER><BR><A HREF="0300.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0302.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews1.gif" ALT="[Amiga News]" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

