<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 PowerUp-to Date</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipu.gif" ALT="Amiga-Aktuell 03/98 - PowerUp-to-Date" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Phase 5 startet Serienproduktion der Blizzard 603e(+)</H2>
Lange mu&szlig;ten die A1200-Besitzer warten - jetzt ist es endlich soweit:
Phase 5 hat die Serienproduktion der Blizzard603e(+) gestartet. Die
Spezifikationen der Boards haben sich ein weiteres Mal ge&auml;ndert. Es folgt
die offizielle Ank&uuml;ndigung des Produktionsstarts, in der auch die
Abwandlungen aufgef&uuml;hrt sind, &uuml;bersetzt von Udo Kastilan:<P>
&#187;BLIZZARD 603e Power-Board geht endlich in die Produktion, erh&auml;lt das CE-
Abzeichen<P><BR>
Oberursel, 5.2.98:<P>
Eine gute Nachricht f&uuml;r alle A1200-Benutzer, die sich schon darauf freuen,
ihren Rechner auf PowerPC-Leistung zu steigern: Das BLIZZARD 603e Power
Board ging Ende Januar endlich in Produktion und wird ab der zweiten
Februarh&auml;lfte ausgeliefert werden. Die Fertigstellung dieses Produkts, das
bereits auf der K&ouml;lner Amiga-Messe im November 1997 der &Ouml;ffentlichkeit
vorgestellt worden war, hatte sich wegen einiger kleiner, aber kniffliger
und mittlerweile gel&ouml;ster Design-Probleme verz&ouml;gert. Jetzt k&ouml;nnen sich auch
A1200-Benutzer echte Power(PC)-Pferdest&auml;rken f&uuml;r ihre Maschinen besorgen.<P>
Phase 5 Digital Products hat Produktlinie und Bezeichnungen des BLIZZARD
603e Power Boards ge&auml;ndert. Es wird jetzt in Taktraten von 160, 200
und 250 MHz erh&auml;ltlich sein. Drei gro&szlig;e Ver&auml;nderungen sollten allen Kunden
bewu&szlig;t sein:<P>

1. Es wird keine Version mit 030-Prozessor geben (urspr&uuml;nglich als
BLIZZARD 603e bezeichnet), nur die 040/060-Versionen werden erh&auml;ltlich sein
(vorher bekannt als BLIZZARD 603e+).<P>
2. Das "+"-Zeichen bleibt in Gebrauch und weist darauf hin, da&szlig; die Karte
mit einem SCSI-Controller ausgestattet ist, w&auml;hrend die Standardversion
BLIZZARD 603e &uuml;ber kein SCSI verf&uuml;gt. Diese Entscheidung wurde getroffen,
um ein kosteng&uuml;nstiges Einsteigerprodukt anbieten zu k&ouml;nnen. Der SCSI-
Controller kann jedoch sp&auml;ter nicht mehr nachger&uuml;stet werden; dieser
Kompromi&szlig; resultiert aus den Design-Vorgaben.<P>
3. Die BLIZZARD-Karten 603e und 603e+ werden wahlweise mit einem 68LC040/25
MHz (ohne FPU), einem 68040/25 MHz (mit FPU) oder einem 68060 ausger&uuml;stet
sein.<P>
Die neue Produktlinie sieht folgenderma&szlig;en aus, mit empfohlenem
Verkaufspreis in Pfund [UKP] und US-Dollar [USD] (Preise f&uuml;r Gro&szlig;britannien
einschlie&szlig;lich Mehrwertsteuer):<P><BR>

BLIZZARD 603e Power Board (ohne SCSI-Controller)
<PRE>
                   68LC040-25  68040-25  68060-50

BLIZZARD 603e      UKP 239     UKP 249   UKP 489
160 MHz            USD 379     USD 399   USD 769 

BLIZZARD 603e      UKP 299     UKP 309   UKP 539
200 MHz            USD 469     USD 499   USD 869 

BLIZZARD 603e      UKP 359     UKP 369   UKP 599
250 MHz            USD 589     USD 609   USD 979


BLIZZARD 603e+ Power Board (mit SCSI-Controller)

                   68LC040-25  68040-25  68060-50

BLIZZARD 603e+     UKP 289     UKP 299   UKP 529
160 MHz            USD 469     USD 499   USD 879 

BLIZZARD 603e+     UKP 349     UKP 369   UKP 599
200 MHz            USD 569     USD 599   USD 969 

BLIZZARD 603e+     UKP 409     UKP 429   UKP 649
250 MHz            USD 669     USD 689   USD 1049

</PRE>
Phase 5 Digital Products setzt den Marketingschwerpunkt auf die Low-end-
Karten mit g&uuml;nstigem 68040 und einem PowerPC-Prozessor mit 160 oder 200
MHz.<BR>
"Diese Einsteigerprodukte werden das beste Preis-Leistungs-Verh&auml;ltnis haben
und den A1200-Anwendern zu einem g&uuml;nstigen Preis eine betr&auml;chtliche
Steigerung an Leistung und Funktionalit&auml;t bieten", sagt Wolf Dietrich von
Phase 5.<BR>
"Deshalb werden wir die Auslieferung mit der 160 MHz-Version beginnen und
mit den 200 und 250 MHz-Versionen sp&auml;ter fortfahren, denn wir haben bei den
schnelleren PowerPC-Chips momentan eine Lieferzeit von etwa 9-10 Wochen."
Das BLIZZARD 603e Power Board wird mit einem Komplettpaket an
Demonstrations-Software ausgeliefert, das neben anderen interessanten
Programmen einen MPEG-Abspieler beinhaltet, der in kleiner Aufl&ouml;sung selbst
auf dem Amiga-Grafikstandard AGA das Abspielen von MPEG erm&ouml;glicht.<P>
Phase 5 Digital Products wird Anwendern der Turbokarten BLIZZARD 1240 T/ERC
und BLIZZARD 1260 spezielle Upgrade-Konditionen anbieten. Das Upgrade-
Angebot wird im Februar auf den Internetseiten von Phase 5 ver&ouml;ffentlicht
und ebenfalls im Laufe des Februars per E-Mail an registrierte Anwender
geschickt.<P>
Besitzer von 68040/060-Turbokarten eines anderen Herstellers, die ein
BLIZZARD 603e Power Board erwerben m&ouml;chten, werden auf den Internetseiten
von Phase 5 auch entsprechende Kaufinformationen finden.<P>
Auch Anwender der BLIZZARD 1230-IV-Karten, die sich auf das Upgrade auf
eine 68030-basierende PowerUp-Karte gefreut hatten, werden besondere
Upgrade-Konditionen f&uuml;r die BLIZZARD 603e Power Boards mit 68040-
Prozessoren erhalten. Das Upgrade-Angebot wird im Februar auf den
Internetseiten von Phase 5 ver&ouml;ffentlicht und ebenfalls im Laufe des
Februars per E-Mail an registrierte Anwender geschickt.
Anwender ohne Internet-Zugang k&ouml;nnen f&uuml;r die Upgrade-Konditionen auch ihren
H&auml;ndler vor Ort kontaktieren.<P><BR>
Power Boards BLIZZARD 603e und BLIZZARD 603e+ erhalten das CE-Abzeichen<P>
Die Power Boards BLIZZARD 603e und BLIZZARD 603e+ f&uuml;r den Einbau in ein
standardm&auml;&szlig;iges A1200-Desktop-System haben die Genehmigung erhalten, das
CE-Abzeichen f&uuml;r Ger&auml;te der Klasse A nach dem Standard EN 55022 zu tragen.
Das bedeutet, da&szlig; beide Produkte in einem standardm&auml;&szlig;igen A1200-Desktop-
System betrieben werden k&ouml;nnen -- unter der Voraussetzung, da&szlig; der Anwender
im Fall von beispielsweise gest&ouml;rtem Radio- oder Fernsehempfang in seiner
n&auml;chsten Umgebung notwendige Ma&szlig;nahmen einleitet. Eine solche Ma&szlig;nahme w&auml;re
der Gebrauch eines abgeschirmten Geh&auml;uses, z.B. eines &uuml;blichen Tower-
Geh&auml;uses f&uuml;r den A1200.<BR>
In diesem Fall entspricht die Kombination der A1200-Hauptplatine mit den
Power Boards BLIZZARD 603e oder BLIZZARD 603e+ v&ouml;llig dem Standard EN 55022
Klasse B. Phase 5 Digital Products weist darauf hin, da&szlig; der Betrieb eines
BLIZZARD 603e oder BLIZZARD 603e+ Power Boards in einem Desktop-A1200
ein anderes Netzteil erfordern kann, was bei Tower-Geh&auml;usen &uuml;blicherweise
mitgeliefert wird.&#171;<P><BR>
(Quelle des Originaltexts: Phase 5 digital products)<P><BR><BR>
Soweit zur Ank&uuml;ndigung des Produktionsstarts, nun folgen die
Spezifikationen der Boards im einzelnen:<P><BR>
&#187;BLIZZARD 603e Power Board -160, -200, -250<P>
PowerPC 603e Beschleunigerkarte f&uuml;r den AMIGA 1200(T)<P>
Das BLIZZARD 603e Power Board ist das leistungsstarke, aber kosteng&uuml;nstige
PowerUP-Beschleunigersystem f&uuml;r den Amiga 1200(T). Das BLIZZARD 603e Power
Board verf&uuml;gt &uuml;ber einen PowerPC 603e RISC Prozessor in verschiedenen
Taktraten und einen 68LC040-, 68040- oder 68060-Companionprozessor.Der
Speicher des BLIZZARD 603e Power Boards kann auf bis zu 128 MByte Fast RAM
aufger&uuml;stet werden. Als besonderes zus&auml;tzliches Feature verf&uuml;gt die
BLIZZARD 603e &uuml;ber einen Steckplatz f&uuml;r die BVisionPPCGrafikkarte, die beim
Betrieb der BLIZZARD 603e in einem Tower-Geh&auml;use - ohne zus&auml;tzliche
Busadapter - eingesetzt werden kann und durch direkte Anbindung an den
Prozessorbus mehrfach schneller ist als jede Zorro-Karte.<P>
Das BLIZZARD 603e Power Board verf&uuml;gt &uuml;ber keinen integrierten Fast-SCSI-II
Controller. Ein SCSI-Controller kann bei dieser Karte nicht nachger&uuml;stet
werden.<P>
Technische Daten BLIZZARD 603e Power Board:
<PRE>

PowerPC Prozessor  PowerPC603e
Taktrate           160, 200 und 250 MHz

Companion CPU      68LC040, 68040, 68060
                   25-50 MHz

PPC Leistung       bei 200 MHz
MIPS               ca. 282
SpecFP95           ca. 4.9

Speicheraufr&uuml;stung    max. 128 MB
SIMM Sockel              2

SCSI on board      Ohne SCSI
                   (nicht nachr&uuml;stbar!)

Passend f&uuml;r   A1200(T)

Verf&uuml;gbarkeit 1. Quartal 1998

</PRE>
Die unverbindlich empfohlenen Verkaufspreise (inkl. MwST) f&uuml;r das BLIZZARD
603e Power Board betragen:<P>
BLIZZARD 603e Power Board (ohne SCSI)
<PRE>
inklusive      mit PowerPC   mit PowerPC  mit PowerPC 
Companion      603e          603e             603e
CPU:           160 MHz       200 MHz          250 MHz
 
68LC040-25 MHz DM 649,-      DM 799,-     DM 999,-
(Ohne FPU!)

68040-25 MHz   DM 679,-      DM 849,-     DM 1029,-
(mit FPU)

68060-50 MHz   DM 1329,-     DM 1479,-    DM 1669,-

</PRE>
NEU! Trade-In M&ouml;glichkeit f&uuml;r Besitzer eines
BLIZZARD 1230-IV Turbo Boards<P>
NEU! Trade-In  M&ouml;glichkeit f&uuml;r Besitzer eines
BLIZZARD 1240T/ERC bzw. BLIZZARD 1260 Turbo Boards<P>
Sie erhalten unsere Produkte im gutsortierten Fachhandel (Beachten Sie
hierzu bitte auch unsere H&auml;ndlernetz-Seiten).&Auml;nderungen in Technik oder
Lieferumfang vorbehalten. Verwendetete Produktnamen sind Handelsmarken oder
Warenzeichen Ihrer Hersteller.&#171;<P><BR>
(Quelle: Phase 5 digital products)<P><BR><BR>
&#187;BLIZZARD 603e+ Power Board -160, -200, -250<P>
PowerPC 603e Beschleunigerkarte f&uuml;r den AMIGA 1200(T)<P>
Das BLIZZARD 603e+ Power Board ist die preisg&uuml;nstige High-End
PowerUP-Beschleunigerkarte f&uuml;r die Amiga 1200-Systeme. Das BLIZZARD 603e+
Power Board verf&uuml;gt &uuml;ber einen Hochleistung PowerPC603e RISC Prozessor in
verschiedenen Taktraten, einen 68LC040-, 68040- oder
68060-Companionprozessor und kann mit bis maximal 128 MByte Ultra-Fast RAM
aufger&uuml;stet werden.Auch ein schneller moderner Fast SCSI-II Controller ist
bereits auf dem BLIZZARD 603e+ Power Board installiert, der den Anschlu&szlig;
umfangreicher SCSI-Peripherie wie Festplatten, Streamern, Wechselmedien
oder Scannern erlaubt. Als besonderes zus&auml;tzliches Feature verf&uuml;gt die
BLIZZARD 603e+ &uuml;ber einen Steckplatz f&uuml;r die BVisionPPCGrafikkarte, die
beim Betrieb der BLIZZARD 603e+ in einem Tower-Geh&auml;use - ohne zus&auml;tzliche
Busadapter - eingesetzt werden kann und durch direkte Anbindung an den
Prozessorbus mehrfach schneller ist als jede Zorro-Karte.<P><BR>
Technische Daten BLIZZARD 603e+ Power Board:<P>
<PRE>
 
PowerPC Prozessor         PowerPC603e
Taktrate                  160, 200 und 250 MHz

Companion CPU             68LC040, 68040, 68060
                          25-50 MHz

PPC Leistung              bei 200 MHz
MIPS                      ca. 282
SpecFP95                  ca. 4.9

Speicheraufr&uuml;stung        max. 128 MB
SIMM Sockel               2

SCSI on board             Fast SCSI-II

Passend f&uuml;r               A1200(T)

Verf&uuml;gbarkeit             1. Quartal 1998

</PRE>
Die unverbindlich empfohlenen Verkaufspreise (inkl. MwST) f&uuml;r das BLIZZARD
603e+ Power Board mit Fast SCSI-II Controller betragen:<P>
BLIZZARD 603e+ Power Board (mit Fast-SCSI-II Controller)
<PRE>
inklusive      mit PowerPC  mit PowerPC  mit PowerPC
Companion      603e         603e         603e
CPU:           160 MHz      200 MHz      250 MHz
 
68LC040-25 MHz DM 799,-     DM 969,-     DM 1149,-
(Ohne FPU!)

68040-25 MHz   DM 849,-     DM 999,-     DM 1169,-
(mit FPU)

68060-50 MHz   DM 1499,-     DM 1649,-   DM 1799,-

</PRE>
NEU! Trade-In M&ouml;glichkeit f&uuml;r Besitzer eines
BLIZZARD 1230-IV Turbo Boards<P>
NEU! Trade-In  M&ouml;glichkeit Besitzer eines
BLIZZARD 1240T/ERC bzw. BLIZZARD 1260 Turbo Boards<P>
Sie erhalten unsere Produkte im gutsortierten Fachhandel (Beachten Sie
hierzu bitte auch unsere H&auml;ndlernetz-Seiten). &Auml;nderungen in Technik oder
Lieferumfang vorbehalten. Verwendetete Produktnamen sind Handelsmarken oder
Warenzeichen Ihrer Hersteller.&#171;<P>
(Quelle: Phase 5 digital products)<P><BR>
Wichtig sind auch die Infos zur Inzahlungnahme der Blizzard 1230-IV bzw.
Blizzard 1240T/ERC und 1260:<P>
&#187;Trade In-M&ouml;glichkeit f&uuml;r
BLIZZARD 1230-IV Turbo Board-Besitzer<P>
Besitzer eines BLIZZARD 1230-IV Turbo Board haben die M&ouml;glichkeit, ein
Trade In-Angebot auf das BLIZZARD 603e+ Power Board zu nutzen. Das Trade In
wird innerhalb der Staaten der EU von phase 5 digital products oder durch
lokale Distributoren oder Fachh&auml;ndler durchgef&uuml;hrt. Au&szlig;erhalb der EU wenden
Sie sich bitte an Ihren Fachh&auml;ndler oder den Importeur/Vertrieb in Ihrem
Land.<P>
Im Trade In-Programm geben Sie Ihr BLIZZARD 1230-IV Turbo Board bei phase 5
digital products oder Ihrem Fachh&auml;ndler in Zahlung, und erhalten einen
Nachlass beim Kauf des BLIZZARD 603/603e+ Power Boards. Es stehen folgende
Trade In-M&ouml;glichkeiten zur Verf&uuml;gung:<P>
<PRE>
Trade-In  gegen:
von:

BLIZZARD   BLIZZARD 603e oder BLIZZARD
1230-IV    603e+ mit 160, 200 oder 250 MHz
           603e und Companion CPU
           68LC040-25 Mhz (ohne Coprozessor)

BLIZZARD   BLIZZARD 603e oder BLIZZARD 603e+
1230-IV    mit 160, 200 oder 250 mit Coprozessor
           MHz 603e und Companion CPU 68040-25 MHz
           (mit math. 68882-50 Mhz Coprozessor)

BLIZZARD   BLIZZARD 603e+ mit 160, 200 oder 250 MHz
1230-IV    603e und Companion CPU 68LC040-25 MHz
mit SCSI   (ohne Coprozessor)
Kit IV                  

BLIZZARD   BLIZZARD 603e+ mit 160, 200 oder 250 MHz
1230-IV    603e und Companion CPU 68040-25 MHz (mit
mit SCSI   math. Coprozessor) und Coprozessor
Kit IV     68882-50 Mhz

</PRE>
Der von phase 5 digital products angebotene Preisnachlass f&uuml;r das Trade-In
betr&auml;gt DM 100,- bei Inzahlungnahme eines BLIZZARD 1230-IV (mit oder ohne
Coprozessor 68882-50), und DM 140,- bei Inzahlungnahme eines BLIZZARD
1230-IV mit SCSI Kit IV (mit oder ohne Coprozessor 68882-50). Der
Preisnachlass wird ausschlie&szlig;lich beim Kauf eines im Trade In-Programm
angebotenen Produkts auf den unverbindlich empfohlenen Verkaufspreis
gew&auml;hrt.Voraussetzung f&uuml;r die Inzahlungnahme ist, das die zur&uuml;ckgegebenen
Ger&auml;te hundertprozentig funktionsf&auml;hig sind, inklusive ggfs. Zubeh&ouml;r und
Kabeln, und keinerlei &auml;u&szlig;erliche Beeintr&auml;chtigung aufweisen.Bitte beachten
Sie, da&szlig; es sich bei den von phase 5 digital products angegebenen
Preisnachl&auml;ssen um unverbindliche Empfehlungen handelt; bitte erfragen Sie
daher ggfs. bei Ihrem H&auml;ndler abweichende Konditionen.<P>
Wenn Sie das Trade In-Programm &uuml;ber phase 5 digital products direkt nutzen
wollen, so gehen Sie bitte folgenderma&szlig;en vor:<P>
1. Drucken Sie das BLIZZARD 1230-IV Trade In  Bestellformular aus, w&auml;hlen
Sie darin die von Ihnen gew&uuml;nschte  BLIZZARD 603e-Version aus, f&uuml;llen Sie
alle sonstigen Angaben aus und  senden Sie uns die Bestellung per Fax oder
per Post.<P>
Alternativ k&ouml;nnen Sie auch diesen EMail-Bestelltext kopieren, alle Angaben
einsetzen, und uns die Bestellung per e-mail senden. WICHTIG: verwenden Sie
ausschlie&szlig;lich die email-Adresse sales@phase5.de und geben Sie als
Betreff/Subject UNBEDINGT das K&uuml;rzel "B1230IV TradeIn Order" an, da Ihre
Bestellung sonst m&ouml;glicherweise nicht korrekt bearbeitet wird.<P>
Als Zahlungsm&ouml;glichkeit k&ouml;nnen Sie innerhalb Deutschlands Post-Nachnahme
(zuz&uuml;glich DM 12,50 Versandkosten) oder Vorkasse per EC-Scheck (zuz&uuml;glich
DM 8,- Versandkosten) w&auml;hlen, innerhalb aller anderen EU-Staaten Vorkasse
per EURO-&Uuml;berweisung (zuz&uuml;glich DM 44,- Versandkosten).<P>
WICHTIG: Senden Sie mit der Bestellung auf keinen Fall Ihre B1230-IV Karte
ein, und geben Sie unbedingt eine Telefonnummer und/oder email-Adresse an,
unter der wir Sie bei Verf&uuml;gbarkeit Ihres Upgrades benachrichtigen k&ouml;nnen.<P>
2. Ihre Trade In-Bestellung wird von phase 5 innerhalb der &uuml;blichen
Bearbeitungszeit best&auml;tigt; mit der Auftragsbest&auml;tigung erhalten  Sie den
voraussichtlichen Liefertermin mitgeteilt. Die Liefertermine f&uuml;r  die
verschiedenen Versionen sind derzeit (Stand 10.02.1998):<P><BR>
<PRE>
BLIZZARD 603e mit 160 Mhz 603e-Prozessor:
beginnend mit dem 20.02.98 ca. 1-2 Wochen

BLIZZARD 603e mit 200 Mhz 603e-Prozessor:
beginnend mit dem 20.02.98 ca. 1-2 Wochen

BLIZZARD 603e mit 250 Mhz 603e-Prozessor:
beginnend mit dem 20.02.98 ca.10 Wochen

Die BLIZZARD 603e+-Version mit SCSI hat
&uuml;blicherweise eine Woche mehr
Lieferzeit.
</PRE>
Da der Liefertermin unter Umst&auml;nden von dem von uns best&auml;tigten Termin
abweichen kann, z.B. bei Produktionsengp&auml;ssen, warten Sie bitte mit der
Einsendung Ihres BLIZZARD 1230-IV bis zur Benachrichtigung (siehe unter
3.).<P>
3. Eine Woche vor Lieferbarkeit des von Ihnen bestellten BLIZZARD  603e
bei phase 5 digital products erhalten Sie telefonisch oder per email  eine
Mitteilung, da&szlig; Sie Ihr BLIZZARD 1230-IV an uns einsenden. Wir  empfehlen,
das BLIZZARD 1230-IV dann schnellstm&ouml;glich mit der von  uns vergegebenen
Auftragsbest&auml;tigungs-Nummer einzusenden, um unn&ouml;tige  Wartezeiten auf Ihr
neues BLIZZARD 603e zu vermeiden. Nach Eingang und  &Uuml;berpr&uuml;fung Ihres Trade
In-Boards wird dieses unverz&uuml;glich an Sie verschickt.&#171;<P>
(Quelle: Phase 5 digital products)<P><BR>
&#187;Upgrade-M&ouml;glichkeit f&uuml;r Besitzer eines BLIZZARD 1260 oder eines BLIZZARD
1240T/ERC Turbo Boards<P>
Besitzer eines BLIZZARD 1260 Turbo Board oder eines BLIZZARD 1240T/ERC
Turbo Board haben die M&ouml;glichkeit, ein Trade In-Angebot auf das BLIZZARD
603e/603e+ Power Board zu nutzen. Das Trade In wird innerhalb der Staaten
der EU aus technischen Gr&uuml;nden ausschliesslich direkt von phase 5 digital
products durchgef&uuml;hrt. Au&szlig;erhalb der EU wenden Sie sich bitte an Ihren
Fachh&auml;ndler oder den Importeur/Vertrieb in Ihrem Land.<P>
Im Trade In-Programm geben Sie Ihr BLIZZARD 1260 Turbo Board oder Ihr
BLIZZARD 1240T/ERC Turbo Board bei phase 5 digital products in Zahlung, und
erhalten einen speziellen PowerUP Upgrade-Preis beim Kauf des BLIZZARD
603e/603e+ Power Boards. Bei der Auswahl des BLIZZARD 603e-Upgrade m&uuml;ssen
Sie lediglich beachten, da&szlig; der 68k-Prozessor der von Ihnen eingesandten
Karte weiterverwendet wird (d.h. das Sie keine alternative
68k-Konfiguration w&auml;hlen k&ouml;nnen), und da&szlig; bei Inzahlungnahme eines SCSI Kit
IV auch eine BLIZZARD 603e-Version mit SCSI-Kit bestellt werden mu&szlig;.<P>
Die Preise f&uuml;r BLIZZARD 1260 bzw. BLIZZARD 1240T/ERC-Besitzer im PowerUP
Upgrade Programm sind wie folgt:<P>

UpGrade von BLIZZARD 1240/1260 ohne SCSI Kit IV auf:

<PRE>
BLIZZARD 603e mit 160 Mhz 603e-Prozessor: DM 569,-
BLIZZARD 603e mit 200 Mhz 603e-Prozessor: DM 719,-
BLIZZARD 603e mit 250 Mhz 603e-Prozessor: DM 899,-

BLIZZARD 603e+ mit 160 Mhz 603e-Prozessor: DM 719,-
BLIZZARD 603e+ mit 200 Mhz 603e-Prozessor: DM 889,-
BLIZZARD 603e+ mit 250 Mhz 603e-Prozessor: DM 1049,-

UpGrade von BLIZZARD 1240/1260 mit SCSI Kit IV auf:

BLIZZARD 603e+ mit 160 Mhz 603e-Prozessor: DM 679,-
BLIZZARD 603e+ mit 200 Mhz 603e-Prozessor: DM 849,-
BLIZZARD 603e+ mit 250 Mhz 603e-Prozessor: DM 999,-
</PRE>
Das Upgrade-Angebot gilt ausschlie&szlig;lich f&uuml;r voll funktionsf&auml;hige BLIZZARD
1260 bzw. BLIZZARD 1240T/ERC-Karten. Voraussetzung f&uuml;r die Inzahlungnahme
eines SCSI Kit IV ist, da&szlig; das zur&uuml;ckgegebene Ger&auml;t hundertprozentig
funktionsf&auml;hig ist, inklusive ggfs. Zubeh&ouml;r und Kabeln, und keinerlei
&auml;u&szlig;erliche Beeintr&auml;chtigung aufweist.<P>
Wenn Sie das Upgrade-Programm nutzen wollen, so gehen Sie bitte
folgenderma&szlig;en vor:<P>
1. Drucken Sie das BLIZZARD 1240/1260 Upgrade  Bestellformular aus, w&auml;hlen
Sie darin die von Ihnen gew&uuml;nschte  BLIZZARD 603e-Version aus, f&uuml;llen Sie
alle sonstigen Angaben aus und  senden Sie uns die Bestellung per Fax oder
per Post.<P>
Alternativ k&ouml;nnen Sie auch diesen E-Mail-Bestelltext kopieren, alle
Angaben einsetzen, und uns die Bestellung per e-mail senden. WICHTIG:
Verwenden Sie ausschlie&szlig;lich die email-Adresse sales@phase5.de und geben
Sie als Betreff/Subject UNBEDINGT das K&uuml;rzel "B1260 Upgrade Order"an, da
Ihre Bestellung sonst m&ouml;glicherweise nicht korrekt bearbeitet wird.<P>
Als Zahlungsm&ouml;glichkeit k&ouml;nnen Sie innerhalb Deutschlands Post-Nachnahme
(zuz&uuml;glich DM 12,50 Versandkosten) oder Vorkasse per EC-Scheck w&auml;hlen
(zuz&uuml;glich DM 8,- Versandkosten), innerhalb aller anderen EU-Staaten
Vorkasse per EURO-&Uuml;berweisung (zuz&uuml;glich DM 44,- Versandkosten).<P>
WICHTIG: Senden Sie mit der Bestellung auf keinen Fall Ihre BLIZZARD 1260
bzw. BLIZZARD 1240T/ERC-Karte ein, und geben Sie unbedingt eine
Telefonnummer und/oder email-Adresse an, unter der wir Sie bei
Verf&uuml;gbarkeit Ihres Upgrades benachrichtigen k&ouml;nnen.<P>
2. Ihre Upgrade-Bestellung wird von phase 5 innerhalb der &uuml;blichen
Bearbeitungszeit best&auml;tigt; mit der Auftragsbest&auml;tigung erhalten Sie den
voraussichtlichen Liefertermin mitgeteilt. Die Liefertermine f&uuml;r die
verschiedenen Versionen sind derzeit (Stand 10.02.1998):
<PRE>
BLIZZARD 603e mit 160 Mhz 603e-Prozessor:
beginnend mit dem 20.02.98 ca. 1-2 Wochen

BLIZZARD 603e mit 200 Mhz 603e-Prozessor:
beginnend mit dem 20.02.98 ca.1-2 Wochen

BLIZZARD 603e mit 250 Mhz 603e-Prozessor:
beginnend mit dem 20.02.98 ca.10 Wochen

Die BLIZZARD 603e+-Version mit SCSI hat
&uuml;blicherweise eine Woche mehr
Lieferzeit.
</PRE>
Da der Liefertermin unter Umst&auml;nden von dem von uns best&auml;tigten Termin
abweichen kann, z.B. bei Produktionsengp&auml;ssen, warten Sie bitte mit der
Einsendung Ihrer BLIZZARD 1260 bzw. BLIZZARD 1240T/ERC-Karte bis zur
Benachrichtigung (siehe unter 3.).<P>
3. Eine Woche vor Lieferbarkeit des von Ihnen bestellten BLIZZARD 603e
bei phase 5 digital products erhalten Sie telefonisch oder per email  eine
Mitteilung, Ihre BLIZZARD 1260 bzw. BLIZZARD 1240T/ERC-Karte an uns
einzusenden. Wir empfehlen, Ihre BLIZZARD 1260 bzw. BLIZZARD
1240T/ERC-Karte  dann schnellstm&ouml;glich mit der von uns vergegebenen
Auftragsbest&auml;tigungs-Nummer  einzusenden, um unn&ouml;tige Wartezeiten auf Ihr
neues BLIZZARD 603e zu  vermeiden. Nach Eingang und Umbau des Prozessors
von Ihrer BLIZZARD 1240/1260-Karte  wird dieses unverz&uuml;glich an Sie
verschickt.&#171;<P>
(Quelle: Phase 5 digital products)<P><BR>
[Anmerkung:
Die erw&auml;hnten Upgrade-Formulare sind in dieser AMIGA aktuell
nicht vorhanden, da registrierte Besitzer der betreffenden
Blizzard-Karten den ben&ouml;tigten Bestellschein bereits per Post
von Phase 5 erhalten haben.<BR>
Wer sich noch nicht registrieren lie&szlig;, sollte dies z&uuml;gig machen
oder das richtige Upgrade-Formular von der Phase5-Homepage im
Internet (<A HREF="http://www.phase5.de">http://www.phase5.de</A>) downloaden.]<P><BR>
<B>Fazit:</B><BR>
Langsam aber stetig komplettiert Phase 5 die PowerUp-Reihe. Nach der
Premiere der CyberstormPPC im September letzten Jahres, m&uuml;ssen sich nun die
A1200-Anwender entscheiden, ob ihr Rechner drei (020/14MHz), drei&szlig;ig
(040/40MHz) oder dreihundert (603e/200MHz & 040/25MHz) Millionen
Instruktionen pro Sekunde verarbeiten k&ouml;nnen soll.<P>
Phase 5 macht den A1200-Usern die Entscheidung "pro PowerUp" einfach, nicht
jedoch die Wahl des "richtigen" Modells. In sage und schreibe 18
verschiedenen Varianten ist die Blizzard 603e(+) erh&auml;ltlich, bei Preisen
von beinahe sensationellen 649 Mark f&uuml;r das Einstiegsmodell bis zu 1799
Mark f&uuml;r die HighEnd-Version mit einer Geschwindigkeit von mehr als 400
MIPS und integriertem SCSI-Controller.<P>
Um Euch die Wahl des richtigen Modells etwas zu vereinfachen, habe ich den
folgenden Fragenkatalog erstellt:<P><BR>
<B>Frage:</B><BR>
Ich m&ouml;chte mir eine Version mit 040-Prozessor zulegen. Sollte ich
den vollwertigen 68040 nehmen oder lieber auf den billigeren
68LC040 setzen?<P>
<B>Antwort:</B><BR>
Ich rate dringend dazu, die 68LC040-Varianten der Blizzard
603e(+) "links liegenzulassen". Man spart dabei nur 20 bis 50
Mark, mu&szlig; aber auf die leistungsf&auml;hige Flie&szlig;kommaeinheit (FPU) des
68040 verzichten. Selbst wenn man nicht vorhat, FPU-unterst&uuml;tzende
Programme zu benutzen, so macht sich der vollwertige Prozessor
sp&auml;testens bei einem m&ouml;glichen Gebraucht-Verkauf der Karte
bezahlt, da sie leichter und zu einem h&ouml;heren Preis abzusetzen
sein wird als das entsprechende 68LC040-Modell.<P><BR>
<B>Frage:</B><BR>
Da ich mir nicht das HighEnd-Modell leisten kann/will, m&ouml;chte ich
einen guten Kompromi&szlig; eingehen. Sollte ich das gr&ouml;&szlig;ere Gewicht auf
die Leistung des 68k-Prozessors (also Wahl des 68060) oder auf die
der PowerPC-CPU (Wahl eines mit 200 oder 250 MHz getakteten PPC603e)
legen?<P>
<B>Antwort:</B><BR>
Im Normalfall, und vor allem auf l&auml;ngere Sicht, ist es ratsam,
einen m&ouml;glichst schnellen PowerPC-Prozessor zu verwenden. &Auml;ltere
AMIGA-Programme ben&ouml;tigen oft nicht die Leistung eines 68060 bzw.
haben sogar Kompatibilit&auml;ts-Probleme mit dieser CPU. Neuere
Software dagegen wird in aller Regel sowieso f&uuml;r PowerPC
optimiert. Im Laufe der Zeit wird die Bedeutung des 68K-Prozessors
zudem immer weiter zur&uuml;ckgehen, bis er einmal beinahe
ausschlie&szlig;lich f&uuml;r die Ansteuerung der Customchips (Grafik, Sound
etc.) und kaum Rechenzeit beanspruchende Programme zust&auml;ndig sein
wird.<BR>
Gerade f&uuml;r Anwendungen, bei denen es auf eine m&ouml;glichst hohe
Geschwindigkeit ankommt, wie z.B. MPEG-Decoding, Emulation anderer
Computersysteme usw., wird ein leistungsf&auml;higer PowerPC-Prozessor
von gro&szlig;em Vorteil sein: Je st&auml;rker, desto besser.<P><BR>
<B>Frage:</B><BR>
Mein Rechner l&auml;uft im Moment mit einem 68030/50MHz samt FPU
68882/50MHz. Ist es nicht ein R&uuml;ckschritt, wenn ich mir nun einen
68k-Prozessor mit der halben Taktfrequenz zulegen w&uuml;rde?<P>
<B>Antwort:</B><BR>
Nein. Der 68040 mag zwar nur halb so hoch getaktet sein, erreicht
aber im Integer-Bereich eine etwas h&ouml;here Geschwindigkeit als ein
68030/50MHz. Bei Flie&szlig;komma-Operationen dagegen ist die
Leistungssteigerung, verglichen mit einem 68882/50MHz, dramatisch:
Hier ist der 68040 etwa sechsmal schneller.<P><BR>
<B>Frage:</B><BR>
Warum bietet Phase 5 keine Versionen mit 68040/40MHz an?<P>
<B>Antwort:</B><BR>
Laut Phase 5 sind 68040-Prozessoren mit dieser Taktrate nicht mehr
erh&auml;ltlich; Motorola plane auch nicht, die Produktion wieder
aufzunehmen.<P><BR>
<B>Frage:</B><BR>
Aus welchem Grund sind die 68060-Varianten so teuer (ca. 650 Mark
Aufpreis im Vergleich zu Karten mit 68040/25MHz)?<P>
<B>Antwort:</B><BR>
Wenn man Phase 5 Glauben schenkt, will das Unternehmen gerade die
LowEnd-Versionen der Blizzard 603e(+) besonders preisg&uuml;nstig
anbieten, was am anderen Ende nat&uuml;rlich zum gegenteiligen Effekt
f&uuml;hrt.<P><BR>
<B>Frage:</B><BR>
Wieviel Arbeitsspeicher sollte ich auf der Blizzard 603e(+)
verwenden?<P>
<B>Antwort:</B><BR>
Grunds&auml;tzlich gilt: Je mehr, desto besser. Ein 32 MB-PS/2-RAM-
Modul kostet derzeit gerade einmal 130 Mark. Weniger
Arbeitsspeicher sollte man sich - auch in Hinblick auf
speicherhungrige PowerPC-Programme - auf keinen Fall kaufen.<P><BR>
<B>Frage:</B><BR>
Mu&szlig; ich beim Speicherkauf irgend etwas beachten?<P>
<B>Antwort:</B><BR>
Heutzutage gl&uuml;cklicherweise kaum noch. In der Regel bieten die
H&auml;ndler EDO-RAM von Markenherstellern mit einer Refresh-Rate von
60ns an. Solche Module d&uuml;rften der Blizzard 603e(+) keine
Probleme bereiten, (seltene) Ausnahmen best&auml;tigen jedoch die
Regel.<P><BR>
<B>Frage:</B><BR>
Gibt es sonst noch etwas zu beachten?<P>
<B>Antwort:</B><BR>
Ja, f&uuml;r Nutzer eines A1200 im Tastaturgeh&auml;use. Nach Angaben von
Phase 5 kann es passieren, da&szlig; das Standard-Netzteil des A1200 zu
schwach ist. In diesem Fall empfiehlt sich der Kauf eines
sogenannten "Power"-Netzteils, wie sie von vielen AMIGA-H&auml;ndlern
angeboten werden. Das Netzger&auml;t eines alten A500 tut's eventuell
auch, da dieses in der Regel belastbarer ist als das des A1200.<P><BR>
<CENTER><BR><A HREF="0400.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0402.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup1.gif" ALT="[PowerUp-to-date]" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

