<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 PowerUp-to Date</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipu.gif" ALT="Amiga-Aktuell 03/98 - PowerUp-to-Date" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Phase 5, Index Information und Blittersoft vereinbaren Kooperation</H2>
&#187;Index Information Ltd, Blittersoft und phase 5 digital products
melden Zusammenarbeit an der Power-PC-Technologie f&uuml;r den Amiga.<P><BR>
19. Februar 1998:<P>
Index Information Ltd., ein Entwickler und Hersteller von auf Amiga
basierenden Computer-Produkten, Blittersoft, ein Amiga-Vertrieb in England,
und phase 5 Digital Products, ein deutscher Entwickler und Hersteller von
Erweiterungen f&uuml;r den Amiga, freuen sich, ihre Zusammenarbeit bei der
PowerPC-Technologie f&uuml;r das bei Index Information Ltd/Blittersoft
entstehende Amiga-kompatible BoXeR-System bekanntgeben zu k&ouml;nnen.<P>
Als Ergebnis dieser Zusammenarbeit wird das BoXeR-System mit einem PowerPC-
Erweiterungs-Steckplatz ausgeliefert werden, in welchen ein auf PowerPC
basierender Beschleuniger eingesetzt werden kann, der vollkommen Software-
kompatibel mit den PowerUP-Beschleunigern von phase 5 Digital Products sein
wird. "Wir freuen uns, da&szlig; unsere Zusammenarbeit noch st&auml;rker die
Entwicklung des Amiga zum PowerPC f&ouml;rdern wird und da&szlig; wir eine
einheitliche Schnittstelle f&uuml;r Software-Entwickler und Anwender
bereitstellen k&ouml;nnen."<P>
Durch die Benutzung eines kompatiblen API (Application Programmers
Interface= Anwendungsschnittstelle f&uuml;r Programmierer) wird sichergestellt,
da&szlig; Software-Entwicklungen f&uuml;r PowerUP auch auf dem PowerPC-Beschleuniger
f&uuml;r den BoXeR arbeiten und es dadurch noch attraktiver f&uuml;r Amiga-Software-
Vertriebe wird, diesen Standard zu unterst&uuml;tzen. "Diese Kooperation hilft
verst&auml;rkt dem entstehenden Standard f&uuml;r einen weiten Bereich
atemberaubender neuer Produkte", sagt Wolf Dietrich von phase 5 Digital
Products. Er weist darauf hin, da&szlig; die PowerUP-Technologie, die bei den
PowerPC-Beschleunigern f&uuml;r den BoXeR angewendet wird, die Grundlage f&uuml;r
eine neue Generation hochwertigster Produkte, wie z.B. CPU-Karten mit
mehrfachen PowerPC-Prozessoren und uneingeschr&auml;nkter Unterst&uuml;tzung von
Multiprozess-Software ist, die noch 1998 erscheinen wird.<P>
Au&szlig;erdem enth&auml;lt der BoXeR auch einen Erweiterungs-Steckplatz f&uuml;r Grafik-
Karten, der mit dem auf den CyberstormPPC- und MkIII-Beschleunigungskarten
von phase 5 vorhandenen kompatibel ist. Dies bietet den Zugriff auf
m&auml;chtige und preiswerte hochaufl&ouml;sende 3D-Grafikkarten auch f&uuml;r den BoXeR.
"Dadurch, da&szlig; wir gemeinsam einen allgemeing&uuml;ltigen Leistungs-Pegel f&uuml;r die
n&auml;chste Generation von Grafik-Karten w&auml;hlen, k&ouml;nnen wir einen einheitlichen
Minimal-Standard setzen, auf den sich die Software-Entwickler verlassen
k&ouml;nnen", f&uuml;gt Wolf Dietrich hinzu. "Dadurch wird sich schnell die Zahl der
Anwendungen erh&ouml;hen, die die h&ouml;chste Aufl&ouml;sung und die Hardware-3D-
Beschleunigung ben&uuml;tzen, einschlie&szlig;lich einer ganzen Menge faszinierender
neuer Spiele."<P>
Eng in die Zusammenarbeit ist auch Blittersoft als weltweiter Vertrieb f&uuml;r
das BoXeR-System eingebunden. "W&auml;hrend der BoXeR vor allem ein Produkt ist,
das andere Wege zum Amiga-System bietet, glauben wir doch, da&szlig; es wichtig
ist, die Kompatibilit&auml;t mit den f&uuml;hrenden Peripherie-Ger&auml;ten beizubehalten.
Die Erzeugnisse von phase 5 geh&ouml;ren ganz besonders in diese Kategorie und
wir hoffen, diese Zusammenarbeit ist die erste von vielen, die es der
Amiga-Gemeinde erlauben werden, dem Entwurf des BoXeR noch mehr Vertrauen
entgegenzubringen", sagt Paul Lesurf von Blittersoft.<P>
"Wir freuen uns sehr, &uuml;ber die fortschreitende Arbeit zur Vergr&ouml;&szlig;erung der
Anwendungsbreite des BoXeR berichten zu k&ouml;nnen. Die Zusammenarbeit mit
phase 5 wird es uns m&ouml;glich machen, dem Kunden einen noch gr&ouml;&szlig;eren Bereich
von Anwendungs-M&ouml;glichkeiten  zu bieten", sagt Mick Tinker von Index.
"Das BoXeR-System beginnt mit F&auml;higkeiten eines 68040 bei 25 MHz, bietet
alle Geschwindigkeits-Optionen bis zum 68060 mit 66 MHz und weiter mit
Einfach- und Mehrfachprozessor-PowerPC-Systemen mit au&szlig;erordentlicher
Leistungsf&auml;higkeit.<P>
All dieses wird beim Erstkauf oder als Aufr&uuml;stung durch den Anwender zur
Verf&uuml;gung stehen. Der moderne Entwurf der BoXeR-Hauptplatine bietet volle
Unterst&uuml;tzung des PowerPC dadurch, da&szlig; eine 64 Bit breite Verbindung zum
Speicher auf der Platine vorhanden ist."&#171;<P>
(Quelle des Originaltexts: Phase 5 digital products)<BR>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<P><BR>
<B>Fazit:</B><BR>
In den letzten Wochen haben gleich zwei wichtige Firmen ihre PowerUp-Pl&auml;ne
bekanntgegeben bzw. korrigiert:<P>
<UL>
<LI>DCE setzt in seinen A5000/A6000, wie bereits in der vorigen AMIGA aktuell
berichtet, keine spezielle PowerPC-Schnittstelle ein, sondern verwendet
den Standard-Prozessorslot des A4000, so da&szlig; die Ger&auml;te nat&uuml;rlich von
vornherein zu PowerUp-AMIGAs aufger&uuml;stet werden k&ouml;nnen, ohne da&szlig; extra
eine neue PowerPC-Karte entwickelt werden mu&szlig;.<P>
<LI>Bei Index Information konnte man sich bislang nicht sicher sein, ob die
Firma eine Standard-Technologie verwendet oder ihr "eigenes PowerPC-
S&uuml;ppchen kocht". Nun hat man sich f&uuml;r einen Mittelweg entschieden: Die
Verwendung eines neuartigen Steckplatzes, der eine (voraussichtlich sehr
viel) h&ouml;here Leistung als der veraltete Prozessor-Slot des A4000 bieten
wird, unter Verwendung PowerUp-kompatibler PPC-Karten - und das ganze in
Kooperation mit Phase 5.<P>
</UL>
Jetzt wird es Zeit, da&szlig; sich auch andere Firmen zu Wort melden, die den
Einsatz von PowerPC-Technologie erw&auml;gen, z.B. Village Tronic und Ateo
Concepts. Beide Firmen haben die Entwicklung solcher Erweiterungen nicht
ausgeschlossen, dies waren jedoch nur Absichtserkl&auml;rungen. Ob sie in die
Tat umgesetzt werden, steht auf einem anderen Blatt Papier.
Eines aber d&uuml;rfte sicher sein: Ein zu PowerUp und/oder WarpOS nicht
Software-kompatibles Produkt wird auf dem Markt keine Chance haben, daf&uuml;r
hat sich die PowerUp-Technologie schon viel zu sehr etabliert.<P>
<CENTER><BR><A HREF="0403.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0405.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup1.gif" ALT="[PowerUp-to-date]" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

