<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Diverse News</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amidn.gif" ALT="Amiga-Aktuell 03/98 - Diverse News" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>AMIGA Future - die Erstausgabe</H2>
Ich wei&szlig;, ich wei&szlig;, auch im Spieleteil dieser AMIGA aktuell wird das neue
AMIGA-Spielemagazin behandelt. Ich aber m&ouml;chte von einer etwas anderen
Seite an das Thema herangehen.<BR>
Kritiken gab es zuhauf - gute, aber nat&uuml;rlich auch schlechte. Ganz sicher
haben diejenigen recht, die der Meinung waren, da&szlig; sich die AMIGA Future
noch steigern k&ouml;nnte - bei der Erstausgabe einer Zeitschrift nicht
verwunderlich.<BR>
Die Zeitschrift ist faktisch innerhalb von zwei Wochen entstanden, in denen
die Artikel geschrieben werden mu&szlig;ten. Alles sich daran anschlie&szlig;ende lag
(leider) nicht im Einflu&szlig;bereich der Redakteure, dies bezieht einige mehr
oder weniger kleine M&auml;ngel mit ein, als da z.B. w&auml;ren:
<UL>
<LI>das fehlende Editorial (das jedoch geplant war und in Zukunft auch
Bestandteil der AMIGA Future sein wird)
<LI>die "schlichten" Bewertungsk&auml;sten
<LI>das nicht hundertprozentig gegl&uuml;ckte Layout
<LI>die teilweise nicht farbigen Grafiken
<LI>die Betitelung (Stichwort: "AMIGA Plus Sonderheft 11")
<LI>die lange Vorlaufzeit
</UL>
Einige der kritisierten Punkte werden bei der zweiten bzw. dritten Ausgabe
korrigiert sein, jedoch lassen sich aus unterschiedlichen Gr&uuml;nden nicht
alle Defizite kurzfristig abstellen.<P>
Bem&auml;ngelt wurde teilweise das Preis/Leistungsverh&auml;ltnis der Zeitschrift.
Dem kann ich pers&ouml;nlich nur sehr eingeschr&auml;nkt zustimmen. Sicher, eine
Zeitschrift, f&uuml;r die man fast einen Zwanziger hinlegen mu&szlig;, sollte einiges
bieten. Aber tut die AMIGA Future das nicht? Wer beklagt, da&szlig; die
Erstausgabe lediglich einen Umfang von 68 Seiten hat, sollte einmal
&uuml;berpr&uuml;fen, wie hoch der redaktionelle Anteil ist. Er betr&auml;gt beinahe 50
Seiten. Das ist mehr als bei einigen anderen Magazinen. Weiter enth&auml;lt die
Zeitschrift eine CD-ROM, die mit fast 600 MB Software, Multimedia-Material
und einem kommerziellen Spiel gef&uuml;llt ist. Zugegeben, die Aufschrift
"supergeile Vollversion" auf dem Cover h&auml;tte man sich sparen k&ouml;nnen, aber
so schlecht ist doch Trapped wirklich nicht - oder bin ich der einzige, der
das meint? Ebenso bin ich der Auffassung, da&szlig; die inhaltliche Qualit&auml;t der
CD-ROM nicht schlechter ist als bei vielen FD-CDs (die Aminet-Reihe
nat&uuml;rlich ausgeschlossen), die allein mindestens 20 Mark pro St&uuml;ck kosten.<P>
Bevor man das Preis/Leistungsverh&auml;ltnis eines Produkts kritisiert, mu&szlig; man
sich auch umschauen, was es ansonsten auf dem Markt gibt bzw. gab.
Fangen wir mit der Vergangenheit an, mit dem letzten deutschen Spiele-
Magazin, der AMIGA-Games, bevor sie in das AMIGA-Magazin integriert wurde.
Die bot f&uuml;r 12,80 Mark (CD-Version) in der Regel eher
unterdurchschnittliche, mehrere Jahre alte Vollversionen, die teilweise
nicht auf neueren AMIGAs liefen. Dazu Software und Multimedia, jedoch war
die CD-ROM oft nur zu einem kleineren Teil gef&uuml;llt. Das Heft hatte zwar
einen Umfang von 100 Seiten, allerdings war der Werbeanteil auch viel h&ouml;her
als bei der AMIGA-Future-Erstausgabe, und damit der redaktionelle Umfang
auch nicht gr&ouml;&szlig;er.<BR>
F&uuml;r knapp 20 Mark gab es die AMIGA Fun, das AMIGA-Games-Heft mit einer
meist sogar recht ansprechenden Vollversion, jedoch fehlte dort wiederum
die CD.<BR>
Die bisherigen AMIGA-Plus-Sonderhefte enthielten meist keine Vollversion,
die Artikel erschienen meist schon in den regul&auml;ren AMIGA-Plus-Ausgaben.
Ganz davon zu schweigen, da&szlig; die Heftthemen wechselten, das hei&szlig;t, es
handelte sich nicht um eine Spielezeitschrift.
Und dann gibt es noch die AMIGA-Plus-(Extra)-CDs, ganz ohne Heft. Ehrlich
gesagt frage ich mich doch des &ouml;fteren, wer diese Produkte eigentlich
kauft, denn f&uuml;r knapp 20 Mark erh&auml;lt man weder irgendeine Vollversion noch
ein Heft...<P>
Und was meint Ihr? Kommentare zu diesem Statement bzw. zur Erstausgabe der
AMIGA Future sind - wie immer- erw&uuml;nscht. Schreibt an: aakt@gmx.de
<CENTER><BR><A HREF="0702.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0704.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interview" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div1.gif" ALT="[diverse News]" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

