<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 03/98 - Interview</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">
<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amiintv.gif" ALT="Amiga-Aktuell 10/97 - Produktvorstellungen" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Interview mit MagiC64-Autor Michael Kramer (von Andreas Etzrodt)</H2>

&#187;
<I>Hallo Michael! Danke, da&szlig; Du f&uuml;r ein Interview zur Verf&uuml;gung stehst.
Wie aus meinen vorherigen Interviews bekannt, kommt nun: Erz&auml;hle uns
doch einfach mal, wer Du bist, was Du tust, usw.</I><P>
Ich bin 29 Jahre alt, habe in Aachen Informatik studiert und arbeite
im Augenblick bei einer Firma im Bereich Verkehrsinformationssysteme
als Systemanalytiker.<P><BR>
<I>Wie bist Du zum Amiga gekommen?</I><P>
Meinen ersten Computer, einen C64, habe ich Ende 1983 gekauft. Anfang
1988 habe ich mir dann einen gebrauchten Amiga 1000, damals mein
absoluter Traum-Computer, geholt. Erstmals in Kontakt mit dem Amiga bin
ich &uuml;ber einen Bekannten gekommen, der sich bereits Mitte 1986 einen
Amiga geholt hatte.<P><BR>
<I>Welche Computer-Ausstattung besitzt Du im Moment?</I><P>
Einen Amiga 4000 mit 10 MB Ram und 250 MB Festplatte. Sonst nichts.
Keine Turbokarte, keine Grafikkarte, nicht mal ein CD-ROM. Au&szlig;erdem
besitze ich einen PC, einen Pentium 133 mit 64 MB RAM und dem &uuml;blichen
Ged&ouml;ns. Eine Aufr&uuml;stung des PC ist f&uuml;r dieses Jahr nicht geplant.<P><BR>
<I>Warum hast Du angefangen, zu programmieren? Welche Sprache benutzt Du?</I><P>
Warum? Na ja, eben halt aus Spa&szlig; an der Freude. Damals auf dem C64 erst
Basic, dann Assembler. Auf dem Amiga C und Assembler. Auf dem PC jetzt
C++, wobei ich ein absoluter STL-Fan bin.<P><BR>
<I>Welche Programme stammen alle aus Deiner Feder?</I><P>
Au&szlig;er MagiC64 nichts, was in der &Ouml;ffentlichkeit bekannt w&auml;re. Auf dem
Amiga habe ich au&szlig;erdem noch ein Programm geschrieben, womit mein
Tischtennisverein (mein Hobby Nr. 1) sein j&auml;hrliches gro&szlig;es
Tischtennisturnier organisiert (Auslosung der Klassen usw.).<P><BR>
<I>Wie kamst Du auf die Idee, einen C64-Emulator  zu  schreiben,  wo  es
damals doch schon The A64 Package und Frodo gab?</I><P>
Die Idee f&uuml;r einen C64-Emulator hatte ich schon sehr fr&uuml;h, irgendwann
Anfang der 90'er. Ich habe das dann mal durchgerechnet und bin zu dem
Ergebnis gekommen, da&szlig; es mit den damaligen Prozessoren (68000er, h&ouml;here
waren noch absoluter Luxus) keinen Sinn machte. Konkret angefangen habe
ich dann 1994 mit MagiC64, die ersten Programmzeilen entstanden an dem
Tag, als Commodore Pleite machte. A64 fand ich viel zu inkompatibel,
Frodo entstand wohl in etwa parallel, von daher hat er die Entwicklung
von MagiC64 nicht beeinflu&szlig;t.<P><BR>
<I>Kann man noch mit anderen Programmen/Emulatoren von Dir rechnen?</I><P>
<I>Auf dem Amiga wohl eher nicht.<P><BR>
Wann wird die n&auml;chste Version von MagiC64 erscheinen? Warum hat sich
das Erscheinungsdatum immer wieder (jetzt schon seit fast einem Jahr)
verschoben?</I><P>
Ich sage jetzt mal Anfang M&auml;rz. Aber aus beruflichen Gr&uuml;nden habe ich
kaum noch Zeit f&uuml;r die MagiC64-Entwicklung.<P><BR>
<I>Welche Neuerungen kann man erwarten?</I><P>
Font-sensitives GUI. Komplett &uuml;berarbeitete 6510-Emulation. Native
Unterst&uuml;tzung f&uuml;r Grafikkarten, also keine Chunky-Planar-Umwandlung
mehr n&ouml;tig.<P><BR>
<I>Welche Features konntest Du aus Zeit-/Geld-Mangel nicht einbauen?</I><P>
Die zus&auml;tzliche 1541-Floppy-Emulation.<P><BR>
<I>Ist es Dir - Deiner Meinung nach - gelungen, Deine Ideen in MagiC64
einzubauen?</I><P>
Ja. Mit einer 1541-Emulation m&uuml;&szlig;ten wohl nahezu 95% aller Programme
lauff&auml;hig sein.<P><BR>
<I>Was ist der Vorteil von MagiC64 gegen&uuml;ber z.B. Frodo 2/4?
Warum sollte man sich also f&uuml;r MagiC64 registrieren, wo Frodo doch
kostenlos ist?</I><P>
MagiC64 ist auf Amigas ohne Grafikkarte einfach schneller. Frodo
4 ist ja wohl komplett in C geschrieben und macht deshalb auf
Amigas eigentlich keinen Sinn, auf einem schnellen PC ist es
wohl einer der besten C64-Emulatoren &uuml;berhaupt.<P><BR>
<I>L&auml;uft eigentlich auch GEOS auf MagiC64?</I><P>
Glaube nicht. Habe es aber noch nicht ausprobiert.<P><BR>
<I>Kann man einen Amiga mit MagiC64 als den "besseren C64" bezeichnen?</I><P>
In gewissen Bereichen ja. Der in MagiC64 eingebaute Monitor bietet
M&ouml;glichkeiten, von denen ein Programmierer auf einem echten C64 nur
getr&auml;umt h&auml;tte. Der Monitor ist meiner Meinung nach der beste, den
es bei C64-Emulatoren momentan gibt, leider habe ich hier speziell
sehr wenig Feedback von den MagiC64-Usern erhalten.<P><BR>
<I>Wie Du mir schon vorher in einer E-Mail anvertraut hast, wirst Du die
PowerPC-Boards von Phase5 NICHT mit einer optimierten Version
von MagiC64 unterst&uuml;tzen. Allerdings ist ein C64-Emulator sehr
rechenintensiv, und die PPC-Karten bieten ja eine entsprechende
Leistung. Was k&ouml;nnte Deine Meinung &auml;ndern?</I><P>
Gen&uuml;gend Leute, die eine solche Version auch registrieren w&uuml;rden. Da
sehe ich eigentlich momentan keinen Markt.<P><BR>
<I>W&auml;re eine PPC-Unterst&uuml;tzung besonders schwierig zu implementieren?
Mit StormC kann man ja laut Haage&Partner mit einer simplen
Neukompilierung des Codes eine PPC-Unterst&uuml;tzung "herbeizaubern".</I><P>
Kann ich nicht beurteilen. Der Kern von MagiC64 ist Assembler und m&uuml;&szlig;te
komplett neu geschrieben werden, was aber wohl nicht so zeitintensiv
w&auml;re.<P><BR>
<I>W&uuml;rde MagiC64 sehr von einer PPC-Unterst&uuml;tzung profitieren oder w&auml;ren
diese ber&uuml;chtigten "Context-Switches" im Weg?</I><P>
Er w&uuml;rde wohl drastisch schneller. Gegen&uuml;ber einem 68060 wohl mindestens
um den Faktor 3.<P><BR>
<I>Wie ich aus pers&ouml;nlichen E-Mails erfahren habe, programmierst Du
mittlerweile auch auf PC. Was ist da der Vorteil? Wirst Du MagiC64
auch f&uuml;r den PC schreiben? Welche Programme schreibst Du so auf PC?
Ist da die Zahlungsmoral der Benutzer von Shareware-Programmen gr&ouml;&szlig;er
als beim Amiga?</I><P>
Der PC bietet mit Visual C++ ein ausgezeichnetes integriertes
Entwicklungssystem, das es so in dieser Form auf dem Amiga nicht gibt.
(Damit sind alle Komponenten eines Systems gemeint, eine sch&ouml;ne
Benutzeroberfl&auml;che nutzt nichts, wenn der Compiler Code nach dem
Zufallsprinzip erzeugt). Eine PC-Version von MagiC64 w&auml;re interessant.<P><BR>
<I>Das Aminet w&auml;chst von Monat zu Monat rasanter. Immer mehr Software
f&uuml;r ein angeblich totes System - mittlerweile auch Tools f&uuml;r PowerPC.
Worauf f&uuml;hrst Du das zur&uuml;ck?</I><P>
Na ja, es sind eben haupts&auml;chlich kleinere Tools. Was fehlt, sind
Mainstream-Anwendungen im kommerziellen Bereich, aber daf&uuml;r ist
ja das Aminet nicht zust&auml;ndig. Die entscheidende Frage ist:<P>
Jemand vertraut Dir 1.000.000 DM an, die sinnvoll in Software-
Entwicklung investiert werden soll. Du tr&auml;gst Verantwortung f&uuml;r
Arbeitspl&auml;tze. Entwickelst Du nun eine PC- oder eine Amiga-Version
Deines Killer-Programms?<P><BR>
<I>Was h&auml;ltst Du von der Politik von Amiga International?</I><P>
Sie machen das geschickt. Sie verkaufen Lizenzen an Firmen, weil
sie wissen, da&szlig; Eigenentwicklung keinen Sinn (mehr) macht.<P><BR>
<I>Wie m&uuml;&szlig;te, Deiner Meinung nach, ein neuer Amiga ausger&uuml;stet sein, und
was sollte er kosten?</I><P>
Eine Marktnische s&auml;he ich nur noch im Bereich zwischen 800 und 1700
DM f&uuml;r ein Komplettsystem. Allerdings m&uuml;&szlig;te man dann auch im Bereich der
Ausstattung und der reinen Rechenleistung entsprechende
Leistungseinbu&szlig;en hinnehmen, so da&szlig; man sich &uuml;ber spezielle F&auml;higkeiten,
z.B. sehr gute 3D-Grafik, profilieren m&uuml;&szlig;te. Ich sehe nicht, da&szlig;
irgendeine Firma im Amiga-Bereich die n&ouml;tigen Mittel hat, ein solches
System auf die Beine zu stellen, bzw. andere Firmen dazu animieren
k&ouml;nnte, auch Software daf&uuml;r zu entwickeln.<P><BR>
<I>Kennst Du die Amiga aktuell? Was h&auml;ltst Du davon?</I><P>
Kenne ich bisher noch nicht, kann mich also nicht dazu &auml;u&szlig;ern.<P><BR>
<I>Ein letztes Wort an die Leser?</I><P>
Von Intel und Microsoft lernen hei&szlig;t Siegen lernen. H&auml;tte Commodores
Management auch nur 1/10 der entsprechenden Marketing-Kompetenz einer
dieser beiden Firmen gehabt, g&auml;be es Commodore heute noch.<P>
Sch&ouml;ne Gr&uuml;&szlig;e,<P>
Michael Kramer<P><BR>

Vielen Dank f&uuml;r dieses Interview, und ich w&uuml;nsche Dir noch viel
Erfolg und eine schnelle PowerPC-Karte, um MagiC64 DOCH noch
umzusetzen...<P>
Andreas Etzrodt<BR>
mit: Sven Kalus, Thomas Szedlak, Carsten Schr&ouml;der, Matthias Gradinger
und last not least Matthias Keller.&#171;
<CENTER><BR><A HREF="0216.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0300.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>03/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/workshp0.gif" ALT="Workshop" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv1.gif" ALT="[Interview]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

