<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. AMIGA arbeitet mit Sharp zusammen

»ZUR SOFORTIGEN VER&Ouml;FFENTLICHUNG
KONTAKT: Bill McEwen
Amiga Incorporated
Telefon: (425) 396-5660
Fax: (425) 396-5671
E-mail: bill@amiga.com

AMIGA ARBEITET MIT SHARP ZUSAMMEN, UM KERNSYSTEME F&uuml;R ZAURUS UND WEITERE
NEUE GER&Auml;TE ZU ENTWICKELN


Handger&auml;te auf der "Freien" Linux/Java-Plattform werden mit von AMIGA
entwickelter Software ihren ersten Auftritt erleben

ST. LOUIS, MISSOURI (USA), 30. M&auml;rz 2001 - AMIGA Incorporated, ein Pionier
bei der Entwicklung des Multimedia und entsprechender Programmsysteme, gab
heute eine Langzeit-Partnerschaft mit der Sharp Corporation, einem weltweit
t&auml;tigen Entwickler innovativer Produkte und von Schl&uuml;sseltechnologien der
Elektronik, bekannt, in welcher AMIGA Kernsyteme f&uuml;r die n&auml;chste Generation
der Computer-Handger&auml;te von Sharp entwickeln wird.

Im M&auml;rz gab Sharp seine Pl&auml;ne zur Markteinf&uuml;hrung des Zaurus PDA in den USA
und in Europa als eines der weltweit ersten Handger&auml;te auf Linux-Basis
bekannt. Das Betriebssystem Linux gewinnt immer weitere Akzeptanz auf dem
Computer-Server-Markt, weil der zu Grunde liegende Code frei im Internet
vertrieben wird. Da sie leicht an die verschiedensten Ger&auml;te anzupassen
ist, wird das Handheld von Sharp mit der Software laufen k&ouml;nnen, die in
der vielseitig verwendbaren, auf vielen Betriebssystemen eingesetzten
Software-Sprache Java von Sun Microsystems geschrieben ist.

In dieser Partnerschaft k&uuml;ndigte AMIGA an, dass seine Entwickler-
Gemeinschaft sowohl neue Programme schreiben, aber auch existierende 
Programme als PDA-Anwendungen anpassen w&uuml;rde und dabei ihren Ruf f&uuml;r 
Innovation und F&uuml;hrerschaft bei Anwendungen f&uuml;r Spiele, 2D-, 3D-
Animationen, Video und Musik einsetzen w&uuml;rde. Amiga-entwickelte Programme 
k&ouml;nnen &uuml;ber drahtlose Netzwerke bei Verwendung von Desktop-Computern oder 
direkt in die neuen Ger&auml;te herunter geladen werden.

"Durch die Zusammenarbeit mit AMIGA als einem unserer System-Partner sind
wir in der Lage, den Umfang der f&uuml;r unsere neuen Ger&auml;te erh&auml;ltlichen
Anwendungen und Inhalte zu erweitern," sagte Dr. Hiroshi Uno, Ph.D.
Abteilungs-Generaldirektor - Abteilung Mobile Systems, Gruppe f&uuml;r 
Kommunikationssysteme, Sharp Corporation Japan.

"AMIGA hat einen hervorragenden Ruf bei der Software-Entwicklung. Wir sehen
voraus, dass die Verbindung mit AMIGA einen starken Impuls f&uuml;r den Zaurus
PDA liefern wird."

"AMIGA ist sehr erfreut, ein Teil des Taurus-Projektes zu sein und wir
erwarten, den Reiz, die brillanten F&auml;higkeiten und die Magie der Amiga-
Gemeinschaft zu Sharp hin&uuml;ber transportieren zu k&ouml;nnen," sagte Bill McEwen,
Pr&auml;sident/CEO von AMIGA Incorporated. "AMIGA bietet neue Dimensionen an
M&ouml;glichkeiten f&uuml;r computergesteuerte Ger&auml;te der n&auml;chsten Generation und wir
sehen die neue PDA-Plattform als einen wichtigen Bereich im Wachstum der
strategischen Gesch&auml;fte und der Anwendungen f&uuml;r die Amiga-Gemeinschaft.
Wir wollen einige wirklich gro&szlig;artige Anwendungen entwickeln, damit die
Anwender das gro&szlig;e Potential und Geschick der Amiga-Gemeinschaft erkennen."


&Uuml;ber die Sharp Corporation

Sharp Corporation ist ein weltweit t&auml;tiger Entwickler f&uuml;r 
Schl&uuml;sseltechnologien der Elektronik, die eine wesentliche Rolle bei der 
Ausformung der n&auml;chsten Generation mobiler computerisierter Produkte f&uuml;r 
private und gesch&auml;ftliche Anwendungen spielen. Seit der Entwicklung des 
Wizard(R), eines elektronischen Planers, im Jahre 1989 hat Sharp den Markt 
bei der Einf&uuml;hrung innovativer computerisierter Handger&auml;te angef&uuml;hrt. Sharp 
liegt auch weltweit an der Spitze bei der LCD-Technologie, welche bei LCD-
Monitoren und -Projektoren der Spitzenklasse eingesetzt wird. Vom kleinen 
Heimb&uuml;ro (small office/home office: SOHO) bis zum gro&szlig;r&auml;umigen 
Firmeneinsatz bietet Sharp eine Menge verschiedener innovativer Computer-
bezogener L&ouml;sungen, um die Produktivit&auml;t zu steigern, wobei ihre 
Funktionsvielfalt zweckm&auml;&szlig;ig den W&uuml;nschen des Kunden entspricht. Gewidmet 
der Verbesserung der Lebensqualit&auml;t der Menschen durch die Anwendung 
fortschrittlicher Technologie und der Verpflichtung zur Innovation, 
Qualit&auml;t, Wertigkeit und Gestaltung besch&auml;ftigt Sharp Corporation etwa 60 
200 Mitarbeiter weltweit in 30 L&auml;ndern. Weitere Informationen finden Sie 
unter http://sharp-world.com/index.html


&Uuml;ber AMIGA

AMIGA Inc. bietet den Entwicklern die Technologie zum Schreiben und 
Portieren von Anwendungsprogrammen auf ein Betriebssystem mit Multimedia-
Eigenschaften, welches unabh&auml;ngig von der Hardware ist. AmigaDE ist eine 
gemeinsame Entwicklungs-Leistung der Tao Group in Reading, England, und 
AMIGA Incorporated.
Auf AmigaDE basierend Anwendungen k&ouml;nnen ohne &Auml;nderung auf Prozessoren x86,
PowerPC, M Core, ARM, StrongARM, MIPS R3000, R4000, R5000, SH 3, SH4 und
NEC V850 laufen. Das Amiga OS kann auf Linux, Embedded Linux, Windows 95,
98, 2000, NT, CE und QNX4 aufgesetzt arbeiten. Der Standort von AMIGA ist
in Snoqualmie, Washington (USA), 28 Meilen &ouml;stlich von Seattle und hat 
B&uuml;ros weltweit. AMIGA kann &uuml;ber (425) 396-5660 erreicht werden, oder 
besuchen Sie uns im Netz bei http://www.amiga.com


Sun Microsystems und Java sind Warenzeichen oder eingetragene Warenzeichen
von Sun Microsystems, Inc. AMIGA ist Warenzeichen von AMIGA Inc. intent(TM)
ist eineWarenzeichen von Tao Group Ltd. Digital Heaven(TM) ist ein
Warenzeichen von Tao Group Ltd. Linux(R) ist eingetragenes Warenzeichen
von Linus Torvalds. Windows(R) ist ein eingetragenes Warenzeichen der
Microsoft Corporation. QNX ist ein eingetragenes Warenzeichen von QNX
Software Systems Ltd. OS-9(R) ist ein eingetragenes Warenzeichen der
Microware Systems Corporation. NEC V850(R) ist eingetragenes Warenzeichen
der NEC Corporation in den Vereinigten Staaten und anderer L&auml;nder. MIPS
ist ein eingetragenes Warenzeichen und MIPS-based ist ein Warenzeichen von
MIPS Technologies, Inc. ARM und StrongARM sind eingetragene Warenzeichen
von ARM Limited Motorola. PowerPC und M-Core sind Warenzeichen von 
Motorola,
Inc.«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
