<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Kurzmeldungen (von Oliver Tacke)

---------------------------------------------------------------------------
 Software (kommerziell)
---------------------------------------------------------------------------

 Das erste Update (Boing Bag) f&uuml;r OS3.9 ist erschienen und umfasst neben
 Bugfixes auch diverse neue Funktionen. Es ist z.B. nun endlich m&ouml;glich,
 w&auml;hrend eines Kopier- oder L&ouml;schvorgangs parallel weiterzuarbeiten.
 [http://www.amiga.com/3.9/download/BoingBag39-1.lha]

 Die Treibersoftware MediatorUP steht in Version 1.8 zur Verf&uuml;gung.
 [http://www.elbox.com]

 F&uuml;r GoldED Studio 6 ist ein neuer Systaxparser erschienen. Neben Bugfixes,
 die am alten vorgenommen wurden, unterst&uuml;tzt der neue nun u.a. PHP und
 JavaScript.
 [http://www.aminet.net/pub/aminet/text/edit/html-php.lha]

 Die Treibersoftware f&uuml;r den FastATA Controller ist als V2.4 erh&auml;ltlich.
 [http://www.elbox.com]

 ProStation Audio ist in der neuen Version 4.05 erschienen und bietet u.a.
 einen nativen Treiber f&uuml;r die Repulse Soundkarte.
 [http://www.audiolabs.it]

 Neue Treiber f&uuml;r TurboPrint sind erschienen f&uuml;r Canon S400, 450, 4500 und
 800, Epson Stylus Color 680, 880 und 980 sowie f&uuml;r Epson Photo 790, 890,
 und 1290.
 [http://www.irseesoft.de]

 Eine &ouml;ffentliche Betaversion von MakeCD (V3.2 beta 6) ist erschienen und
 bietet u.a. VideoCD-Unterst&uuml;tzung.
 [http://makecd.core.de]

---------------------------------------------------------------------------
 Software (nicht kommerziell)
---------------------------------------------------------------------------

 PlayGUI ist in Version 3.1 erschienen und enth&auml;lt diverse Bugfixes.
 [http://narr.tsx.org]

 Der Grafiktabletttreiber FromAldiHyd ist in Version 2.2 erschienen. Neue
 Features sind die Unterst&uuml;tzung von Makrotasten und das Abspielen von
 Sounds beim Dr&uuml;cken einer Taste.
 [http://www.platon42.de/]

 Der Bootvorgang-Versch&ouml;nerer Rainboot ist in Version 3.2 ver&ouml;ffentlicht
 worden und ist u.a. bessere Unterst&uuml;tzung von Grafikkarten bereichert wor-
 den.

 Eine neue Version der asyncio.library f&uuml;r WarpOS ist erschienen.
 [http://members.tripod.de/achimste/download/asyncioppc.lha]

 Der MPEG Player Frogger ist als Version 1.64 ver&ouml;ffentlicht worden und
 soll um 25% schneller sein als die Vorg&auml;ngerversion.
 [http://frogger.rules.pl]

 Das Grafikprogramm Perfect Paint ist in Version 2.5 erschienen.
 [http://gothic.fr.free.fr/amiga/download/PfPaint_V25.lha]

 Das CDTV Developer Kit ist ab sofort f&uuml;r jedermann zu haben.
 [http://home.t-online.de/home/amiga-freak/cd32developer.html]

 Das JFIF Datatype von Andreas Kleinert, akJFIF, steht in Version 44.96 zum
 Download bereit.
 [http://www.ar-kleinert.de]

 Ebenfalls von Andreas Kleinert stammt die neue Version des MPEG Players
 akMPEG V4.60.
 [http://www.ar-kleinert.de]

 F&uuml;r Scalos existiert eine neue Version des Persistant Windows PlugIn.
 [http://scalos.striatum.org/products/scalos/modules/Scalos-Plugin_PWindows
 .lha]

 Version 14.0 des Diskettenspiele-auf-Festplatten-Installers WHDLoad ist
 erschienen.
 [http://www.whdload.org]

 Ein Programm der gleichen Art, n&auml;mlich JST, ist in Version V4.7 verf&uuml;gbar
 und ab sofort Freeware. Au&szlig;erdem steht der Quellcode bereit.
 [http://jffabre.free.fr/amiga/patches.html]

 Von Oliver Roberts stammt ein Datatype f&uuml;r Adobe Photoshop Files.
 [http://www.nanunanu.org/~oliver]

 Das Wav-Datatype von Stephan Rupprecht ist in Version 41.10 erh&auml;ltlich.
 [http://home.wtal.de/stephanr/]

 Amster, der Client zum umstrittenen mp3-Dienst Napster, ist in Version
 0.8a ver&ouml;ffentlicht worden.
 [http://212.10.48.147/amster/files/0.8a/Amster-main.lha]

 Eine neue Version von EZP@gerNG steht bereit.
 [http://www.sfxsoft.de/de/]

---------------------------------------------------------------------------
 Hardware
---------------------------------------------------------------------------

 Die G-Rex 1200 PCI ist lieferbar. Das Board bietet BlizzardPPC Besitzern
 f&uuml;nf PCI 2.1 Steckpl&auml;tze.
 [http://www.dcecom.de]

 Von Grzegorz Jureszek wurde ein weiteres PCI-Board namens "Prometheus"
 angek&uuml;ndigt. Das Board soll f&uuml;r ZorroIII-Slots ausgelegt sein und vier
 PCI-Slots bieten.
 [http://www.matay.pl]

---------------------------------------------------------------------------
 Verschiedenes
---------------------------------------------------------------------------

 Der Amiga Markt ist wieder einmal um diverse Merchandiding Artikel
 bereichert worden. Neben CD-Beh&auml;ltern gibt es auch noch Tassen und Becher
 aus Edelstahl.
 [http://www.amiga.com/amigamall/index.php?cart_id=01259371408&type=accesso
 ries]

 Dem deutschen Teil des ESCENA Website wurde ein neues Layout verpasst, je-
 doch gibt es noch diverse leere Seiten. Neue Informationen zum AmigaOne
 gibt es noch nicht.
 [http://www.escena.de]

 Die Dokumentation zum einst geplanten PIOS One sind nun f&uuml;r jedermann zu-
 g&auml;nglich.
 [http://www.amigadev.net/index.php?&subpage=home&function=docs]

 Thomas Raukamp hat den Posten als Chefredakteur der AmigaPlus (ehemals
 amigaOS) an Nico Barbat abgegeben und widmet sich k&uuml;nftig nur noch der
 Atari Zeitschrift st-computer sowie der mac life.

 In der Mailinglist zum AmigaOne beantwortet Fleecy Moss Fragen zur Kurs-
 korrektur von AMIGA, Inc. sowie zum AmigaDE und zum AmigaOS 4+.
 [http://groups.yahoo.com/group/amigaone]

Oliver Tacke &lt;oliver@aakt.de&gt; - schickt mir eure News!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
