<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga Arena News
(03.03.2001)

Amiga Arena - DITO Passwort Freigabe!
Mit der Genehmigung von Dirk Holtwick 
liegt zum freien Download der Registrations Code 
f&uuml;r die Vokabelsystem Software DITO bereit!
DITO ist Modular aufgebaut und verf&uuml;gt &uuml;ber viele
Features!
(Flexibles W&ouml;rterbuch,L&uuml;ckentexte,Zahlenkonverter,Vokabeltrainer)
Folgende Sprachen werden unterst&uuml;zt:
Englisch,Spanisch und Italienisch!
DITO und alle Zusatzmodule sind im Aminet erh&auml;ltlch.
Besonderen Dank Dirk Holtwick f&uuml;r die Freigabe
und Erik Z. der die Freigabe erm&ouml;glichte und
der Amiga Arena zur Verf&uuml;gung gestellt hat!

Amiga Arena - Aufruf! 
Wer weitere Vorschl&auml;ge,Tips etc. hat um nicht weiter
Entwickelte Shareware Software freizugeben setzt
sich bitte mit olaf.koebnik@online-club.de in Verbindung! 
Dies gilt auch f&uuml;r Entwickler die Sonderpreisaktionen durchf&uuml;hren wollen!


틻miga Arena News

Amiga Arena - Sonderpreis Aktion!
In Zusammenarbeit mit Thorsten Hansen erm&ouml;glicht die Amiga Arena
einen Sonderpreis f&uuml;r AMPlifier.
AMPlifier ist ein MPEG-Audio Abspielprogramm der
aber auch 16-bit Sound in verschiedenen Formaten
abspielen kann.
AMPlifier unterst&uuml;tzt sowohl Hardware basierende
MPEG Audio Dekoder als auch Softwaredekodierung
mittels mpega.library.
Einige Features:
* Unterst&uuml;tzt Musicam bis Layer III und auch AIFF,MAUD, WAVE und RAW.
* Grundlegende Funktionalit&auml;t, die von CD-Playern bekannt ist  
    (play, pause, stop, forward,backward, skip back, skipforward)
* Leistungsf&auml;higes Plugin System - f&uuml;r externe Visualisierungs Plugins
* WinAMP skins (verschiedene Grafikdesigns)
* &Ouml;ffnet und wechselt auf jeden "public screen" nach Wahl des Anwenders
* ID3-Tag Unterst&uuml;tzung f&uuml;r genauere und bessere Informationen zu den Songs
* ARexx port

Hinweis in eigener Sache
Liebe Amiga Freunde,
Ich freue mich nach langer Zeit ,wieder eine neue Sonderpreis Aktion
pr&auml;sentieren zu k&ouml;nnen.
Zusagen f&uuml;r weitere Sonderpreise liegen mir vor doch die Entwickler
arbeiten an neue Versionen so das ich ebenso warten muss.
Ich hoffe Ihr nutzt diese Sonderpreise und unterst&uuml;zt die Entwickler damit.
Die Registartion geht zu 100% an die Entwickler die Amiga Arena erm&ouml;glicht
dies als Non - Profit Aktion!
Glaubt mir  Euer Feedback bewegt an Motivation sehr viel!


틻miga Arena News
(08.03.2001)

Amiga Arena - Vollversion!
In Zusammenarbeit mit Guido Mersmann liegt Exklusiv 
f&uuml;r die Amiga Arena der Keyfile zur besten BoulderD&auml;sh 
Konvertierung des C64 Orginals BoulderD&auml;sh zum Download bereit!
Einige Besonderheiten:
&#176 1:1 Clone des Originals!
&#176 L&auml;uft im Multitasking!
&#176 Online Hilfe!
&#176 Locale Unterst&uuml;tzung
&#176 Nach Commodore Styleguide programmiert
&#176 Volle Grafikkarten kompatiblit&auml;t
Das Programm BoulderD&auml;sh befindet sich im Aminet
Hinweis
Das Keyfile ist Exklusiv von Guido M. auf die
Amiga Arena Registriert und darf nicht weiter zum
Download oder als Kopie angeboten werden!

Amiga Arena  - Toadies Aktion!
Toadies der Worms Clone von Thilo K&ouml;hler 
liegt in der Version 8.0 zum Download bereit!
Neu
* now you can`t fall as deep as you like with your toadie
* fixed some serious bugs that could crash the machine
* added those nice bubbles when something drops into the water
* added option to select the number of particles an explosion causes
* sounds are a bit more dynamic, they vary randomly in their pitch
* improved behaviour of Toadies and mines again
* improved the edit teams option slightly
* improved some weapons and optimized their prices
* improved the levels again
* new skin "Jungle"
Toadies Umfrage!
Die Toadies Umfrage zwecks Entwicklung eines
Computergegners ist noch bis zum 25.03.2001 Online!
Die Deutschsprachige Umfrage befindet sich in der
Amiga Arena,die Englischsprachige auf der Toadies Homepage!

Amiga Arena Homepage: www.online-club.de/ARENA/
Toadies Homepage: www.hd-rec.online.de/toadies/index.html


틻miga Arena News
(12.03.2001)

Vorwort
Da ich alleine weniger bewegen kann als ich m&ouml;chte habe ich mich dazu
entschlossen
eine Partnerschaft mit der Fun Time  World einzugehen!
Die Amiga Arena Homepage bleibt weiterhin das was sie ist und ich hoffe
somit noch  effektiver sein zu k&ouml;nnen!

Olaf K&ouml;bnik - Amiga Arena

Amiga Arena - Fun Time Partnerschaft
Der Shareware Markt hat aufgrund der Entwicklungen der letzten Jahre sehr
gelitten. 
Die Anzahl von Neuerscheinungen ist mit jedem Jahr sehr stark gesunken. 
Um diese Entwicklung aufzuhalten bilden die Seiten Fun Time World
(www.funtime-world.de) und Amiga Arena (online-club.de/~ARENA/) eine
Partnerschaft zur F&ouml;rderung des Shareware Marktes.
Ziel der Partnerschaft ist es die Amiga Anwender auf die Entwicklungen im
Shareware Markt aufmerksam zu machen. 
Dies soll h&ouml;heren Verkaufszahlen dienen und gleichzeitig die Entwickler
motivieren weiterhin an neuen und besseren Programmen zu arbeiten.
Zuk&uuml;nftig sollen durch eine engere Zusammenarbeit mit den Programmierern
Anwenderw&uuml;nsche bei der Entwicklung st&auml;rker ber&uuml;cksichtigt werden.
In weiteren Schritten soll auch die Registrierung ausl&auml;ndischer Programme
erleichtert werden. 
Anhand von Umfragen wird ermittelt welche Software besonders gefragt ist. 
Besondere W&uuml;nsche k&ouml;nnen ab sofort an Fun Time World und Amiga Arena
gerichtet werden.
Programmierer die eigene Entwicklungen gerne kosteng&uuml;nstiger f&uuml;r einen
bestimmten Zeitraum zur Verf&uuml;gung stellen w&uuml;rden, k&ouml;nnen sich gerne an
Amiga Arena jederzeit wenden.
Amiga Arena - www.online-club.de/~ARENA/
Die Amiga Arena ist eine Shareware/Freeware Support Seite mit Sonderpreisen
f&uuml;r Shareware, Links ,Interviews und Vollversionen eingestellter Shareware
Software.
Fun Time World - www.funtime-world.de
Die Fun Time World Seite versorgt seit mehreren Jahren die Amiga Anwender
mit aktuellen Nachrichten, Soft- und Hardware Test, sowie anderen wichtigen
Informationen. Inzwischen wurde der Service um einen Online-Shop sowie
Auktion- und Forenbereich erweitert.


틻miga Arena News
(13.03.2001)

Amiga Arena - Vollversion

In Zusammenarbeit mit Andreas Regul liegt exklusiv die Registrierte Amiga
Arena Vollversion f&uuml;r den Routenplaner AmiATLAS in der Version 2.0
zum Download bereit.


틻miga Arena News
(19.03.2001)

Amiga Arena - Sonderpreis Aktion!
Die Amiga Arena erm&ouml;glicht in Zusammenarbeit mit Sebastian J. einen
Sonderpreis f&uuml;r den MPEG Video Player "Frogger" (68k/PPC) und 
dem Movie Player "SoftCinema" (PPC).
Lange hat es gedauert, aber ich freue mich Euch endlich diese Sonderpreis
Aktion  anbieten zu k&ouml;nnen, Ich hoffe Ihr unterst&uuml;zt weiterhin die
Entwickler!
Frogger - Features:
 - Video layer 1/2 decoding.
 - Audio layer I, II and III decoding.
 - built in AC3 decoder.
 - Intelligent frame skipping.
 - Overlay support.
 - Fast C2P for AGA.
 - Direct CGFX video memory access routines.
 - Asynchronous disk reading.
 - Video scaling on both CGFX and AGA.
 - Support for reading VideoCD disks.
 - Support for PSX movie and audio files.
SoftCinema - Features:
 - Unterst&uuml;zt QuickTime Movie (QT/MOV) und Video Formate f&uuml;r Windows (AVI)
 - Unterst&uuml;zt viele Audio und Video Codes (Intel Indeo bis 5.0 wird
unterst&uuml;zt!)
Frogger und SoftCinema sind auch im Bundle zum Sonderpreis erh&auml;ltlich!

Toadies Umfrage 
Die Umfrage zum Computergegener f&uuml;r
Toadies dem Worms Clone ist noch bis zum 25.03.01 Online!

Amiga Arena 30000 Besucher
Der 30.000 Zugriff erfolgte am Sonntag!
Vielen Dank daf&uuml;r und die Amiga Arena
wird weiterhin noch aktiver werden!
Die Homepage wurde &Uuml;berarbeitet und f&uuml;r AWeb und Ibrowse
optimiert!
  

틻miga Arena News

Amiga Arena - Sonderpreis Aktion

Frogger/Softcinema
Frogger und Softcinema lassen sich jetzt zum
Sonderpreis direkt &uuml;ber Reg.net Registrieren!

T.U.M.M.Y / T.U.R.R.D

Die Datenbank Tummy f&uuml;r Magic Sammelkarten und die 
Relaisekarten Steuerungssoftware Turrd sind nur noch 
bis zum 31.03.2001 zum Sonderpreis erh&auml;ltlich!
 

틻miga Arena pr&auml;sentiert:
Um Shareware Programme besser unterst&uuml;zen zu k&ouml;nnen ist die
Amiga Arena eine Partnerschaft mit der Fun Time World eingegangen!
Ich freue mich diese Ank&uuml;ndigung bekannt zu geben und hoffe in Zukunft
weitere Titel in zusammenarbeit mit der Fun Time World pr&auml;sentieren zu
k&ouml;nnen!
Vorschl&auml;ge,Anregungen und Ideen sind immer willkommen!

Amiga Arena und Fun Time World bringen Frogger / Softcinema nach
Deutschland!
Frogger ist einer der besten MPEG Video-Playern f&uuml;r den Amiga.
Das Programm unterst&uuml;tzt alle verf&uuml;gbaren Amiga Systeme.
So existieren Versionen f&uuml;r 030er, 040er, 060er und PowerPC
Prozessoren. Dabei werden WarpOS, PowerUP und MorphOS
unterst&uuml;tzt.

  Hier einige der Feautres:
  Frogger:

   Video layer 1/2 Decoding.
   Audio layer I, II und III Decoding.
   AC3 Audio Decoder.
   Schnells Video & Audio Playback.
   Intelligentes Frame-Skipping.
   Overlay Unterst&uuml;tzung.
   Fast C2P f&uuml;r AGA.
   Routinen f&uuml;r direktes CGFX Videospeicher Zugriff.
   Video scaling on both CGFX and AGA.
   Unterst&uuml;tzung von VideoCD's.
   Unterst&uuml;tzung f&uuml;r PSX Movies und Audio.

  Nur f&uuml;r PPC Softcinema

   Unterst&uuml;zt QuickTime Movie (QT/MOV) und Video Formate f&uuml;r Windows (AVI)
   Unterst&uuml;zt viele Audio und Video Codes
   (Intel Indeo bis 5.0 wird unterst&uuml;zt!)

  Bisher war nur eine Registrierung &uuml;ber RegNet m&ouml;glich, wof&uuml;r
  eine Kreditkarte ben&ouml;tigt wird. Da dies viele Anwender vor
  ein Problem stellt, haben wir uns von Fun Time World und Amiga Arena
  entschlossen eine andere L&ouml;sung zu finden. Ab sofort
  k&ouml;nnen Sie das Programm &uuml;ber uns erwerben. Sie bekommen das
  Programm auf einer CD-Rom inklusive einem f&uuml;r Sie registrierten
  Keyfile. Darauf befinden sich alle verf&uuml;gbaren Frogger / Softcinema
  Versionen und  einige Beispielvideos. Die CD-Rom kostet bei beiden
  Programmen nur 45,- DM (nur bis zum 8 April, danach 50,- DM), Frogger
  oder SoftCienema jeweils einzeln f&uuml;r
  30,- DM (+Versandkosten).
  Aufgrund des personalisierten Keyfiles kann die Lieferung bis
  zu zwei Wochen dauern.

  Bestellungen k&ouml;nnen vorerst nur per e-Mail angenommen werden.
  Sobald das Problem mit dem Server behoben wird auch auf
  folgender Seite:http://www.funtime-world.de/shop/produkte/vt0001.shtml    
  Fun Time World
  Eine Bestellung schicken Sie an folgende e-Mail: funtime@t-online.de
  Geben Sie Ihre vollst&auml;ndige Adresse an sowie die Versandart
  (Nachnahme oder Vorkasse)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
