<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Messebericht
------------

1. Bericht von der »Gateway Computer Show - Amiga 2001« (von Jerry Withers)

Wie die letzten sieben Jahre zuvor schon fand in St. Louis auch dieses Jahr 
vom 30.3. bis zum 2.4. wieder eine Gateway-Amiga-Messe 2001 statt. Man muss 
Bob und Diana Sharp sehr f&uuml;r ihren Einsatz danken, da sie auch dieses Mal 
wieder eine sehr gelungene Messe organisiert haben.

Es gab viele nennenswerte Ereignisse auf der diesj&auml;hrigen Messe. Zwischen 
den Abschiedsfeierlichkeiten f&uuml;r Petro und der angespannten Stimmung in 
Erwartung auf Bill McEwens Rede waren zahlreiche Amigah&auml;ndler dabei, ihre 
Ware an den Mann zu bringen.

Neue Hardware gab es von Individual Computers zu sehen. Jens Sch&ouml;nfeld 
stellte seine neue VarIO-Karte vor, eine ZorroII-Karte, die eine serielle, 
eine parallele und eine PS/2-Schnittstelle hat, sowie Erweiterungsports, um 
z.B. eine Silversurfer anzuschlie&szlig;en. 

Mr. Hardware zeigte einen "PC auf 'ner Steckkarte", der einen kompletten PC 
mit 3D-Grafikkarte, Soundkarte, USB, Ethernet und vieles mehr auf einer 
einzigen Steckkarte vereint. Als Demo hatte er "Unreal" geladen, was auch 
sehr flie&szlig;end lief. Die Karte ist besonders f&uuml;r diejenigen geeignet, die 
wenig Platz im Zimmer haben, aber nicht auf einen PC verzichten wollen. 

Petro hat sich bei der anwesenden Amiga-Gemeinde f&uuml;r ihr Vertrauen bedankt 
- mit einem LKW voller Pizzas verschiedenster Sorten. Es ist das erste Mal, 
seit ich mich erinnern kann, dass man sich bei einer Messe satt essen 
konnte. Vielen Dank, Petro!

Sp&auml;ter am Samstag Abend ging es zum Bankett, und Petro wurde nach guter 
alter amerikanischer Tradition "ger&ouml;stet". Es gab viel zu lachen, und 
einige Amiga-Entwickler, besonders Bohus Blahut, haben wohl eine Karriere 
als Komiker verpasst. Kermit Woodall zeigte einen Film-R&uuml;ckblick &uuml;ber 
Petro, den er mit Hilfe seiner Produkte ImageFX und Aladdin4D gedreht 
hatte. Der H&ouml;hepunkt seines Films, der ein echter Kn&uuml;ller wurde, war das 
"Tanzende Baby" mit Petros Gesicht. Keiner - auch Petro nicht - konnte sich 
das Lachen verbei&szlig;en.

Dann kamm die langersehnte Pr&auml;sentation von Bill McEwen &uuml;ber die 
erdersch&uuml;tternden Neuigkeiten, die Amiga Inc. bekannt geben wird. Bill 
McEwen gab eine Partnerschaft mit Sharp bekannt, die f&uuml;r das 
Weihnachtsgesch&auml;ft Programme f&uuml;r ihre neuen PDA-Ger&auml;te haben wollen. Laut 
Gary Peake war Sharp sehr vom Aminet beeindruckt. Entwickler, die also ein 
SDK haben, k&ouml;nnen Programme aus dem Aminet portieren und Amiga Inc. wird 
sie &uuml;ber Online-Stores Sharp zur Verf&uuml;gung stellen. Eine echte Chance f&uuml;r 
Entwicker, mit Amiga-Programmen in einem v&ouml;llig neuen Markt Geld zu 
verdienen. Solche Programme f&uuml;r PDAs sind klein, haben also sehr geringe 
Entwicklungskosten, und laut dem Abkommen mit Sharp gehen 60% des 
Verkaufspreises direkt an den Entwickler. Eine echte Verdienstm&ouml;glichkeit, 
wenn mann bedenkt, dass Millionen von PDA-Besitzern t&auml;glich Millionen von 
kleinen Programmen runterladen.

Dann gab Bill McEwen die Entscheidung bekannt, dass AmigaOS 4.0 auf nativer 
PPC-Basis weiter entwickelt wird. Diese Entscheidung kam bei fast allen in 
der Halle sehr gut an. AmigaOS und DE werden parallel entwickelt, bis sie 
beide miteinander verschmelzen. AmigaOS 4.0 wird nicht auf der bestehenden 
PPC-L&ouml;sung von Phase5 laufen, sondern wird eine neue Hardware - das 
AmigaOne-Board von Eyetech - erfordern. Laut Alan Redhouse wird das 
AmigaOne-Board Ende Juli lieferbar sein, mit der ersten Version von OS 4.0, 
welches bis dahin nur teilweise auf PPC portiert werden wird. Und nach und 
nach werden weitere Teile des OS in Form von Boing Bags auf den PPC-
Prozessor &uuml;bertragen, bis zur vollst&auml;ndigen Portierung. Laut Haage und 
Partner ist die Emulation bereits fertig. Es muss nur noch eine Anpassung 
an die entg&uuml;ltige Hardware erfolgen, die schnell vonstatten gehen wird.

Bill McEwen gab am n&auml;chsten Tag zu, dass die Entscheidung, AmigaOS auf den 
PPC-Prozessor zu portieren, nicht einfach war. Er wies sich als 
"Kapitalist" aus und stellte fest, dass kaum Geld damit zu verdienen sei, 
aber er sagte auch, dass er erkenne, dass er die Amiga-Gemeinde brauche. Es 
gibt viele H&auml;ndler und Entwickler, die kaum noch etwas Neues zu verkaufen 
haben, und es werde immer weniger. Der bestehende Amiga-Markt braucht neue 
Produkte. Mit der Portierung von AmigaOS auf den PPC werden neue 
M&ouml;glichkeiten f&uuml;r H&auml;ndler und Entwickler geschaffen, was inzwischen 
dringend notwendig ist.

The Amiga is dead, long live the Amiga...

Jerry Withers &lt;amiga@mediaone.net&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
