<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,wyvern,defiance of fate">
<title>Wyvern: No Defiance Of Fate</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Wyvern: Defiance Of Fate</font></h1><BR> (46:48 / No Fashion)</center></P>

<p>Auf dem Debutalbum (mit einem absolut bescheuerten Coverartwork) &quot;The Wildfire&quot; wurden Wyvern noch in die True Metal Schubalde gesteckt und diese Platte erhielt seinerzeit - v&#246;llig zu Recht - maximal durchschnittliche Kritiken, wobei auch Verrisse h&#228;ufiger zu finden waren. Wohl auch aus diesem Grunde suchte sich die Band nicht nur eine neue Plattenfirma, sondern auch Line-up technisch ging es drunter und dr&#252;ber: Thryfing S&#228;nger Thomas V&#228;&#228;n&#228;nen, der bei Wyvern seinerzeit f&#252;r die Drums verantwortlich war, verlie&#223; die Band genauso wie der damalige S&#228;nger, wobei beide Positionen adequat neubesetzt wurden und mit S&#228;nger Toni Kocmut sogar ein richtig guter seines Faches gefunden wurde. Auch in Sachen Songwriting haben die Jungs h&#246;rbar an sich gearbeitet und pr&#228;sentieren uns auf &quot;Defiance Of Fate&quot; melodischen Power Metal, wobei man deutlich varibaler zur Sache geht, als andere Bands aus diesem Genre. So gibt es mit dem super eing&#228;ngigen und mit leichten Folk Elementen versetzten &quot;Morningstar&quot;, dem sieben Minuten Epos &quot;Like Dogs Climbing Up To The Moon&quot;, dem coolen Opener &quot;Horizon Of Glory&quot; und dem True Metal 
orientierten &quot;Starborn&quot; einige Highlights auf dieser Platte. Dem restlichen Material fehlt es noch ein klein wenig an wirklich z&#252;ndenden Ideen, aber das diese da sind, beweisen die oben genannten St&#252;cke auf jeden Fall. Im Vergleich zum Debutalbum &quot;The Wildfire&quot; hat die Band aber auf jeden Fall einen gro&#223;en Schritt nach vorne gemacht und wenn man sich noch weiter auf die eigenen St&#228;rken konzentriert und diese weiter ausbaut, ist auch ein Album mit ausschlie&#223;lich Highlights m&#246;glich. Vorerst reicht es nur f&#252;r eine gute Benotung, aber ich bin mir sicher, dass in Wyvern noch genug Potential steckt und die Band mit dem n&#228;chsten Album einen weiteren Schritt nach vorne machen kann. Fans vom abwechselungsreichen melodischem Power Metal sollten den Longplayer zumindest mal antesten, denn in diesem Sektor gibt es weitaus schlechtere Platten.</P>

<p>Fazit: 7 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd11.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
