<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,elvenking">
<title>Elvenking: Heathenreel</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Elvenking: Heathenreel</font></h1><BR> (56:19 / AFM)</center></P>

<p>Mit Elvenking macht sich eine weitere italienische Band daran, die Herzen der Fans auch in Deutschland zu erobern. Wer jetzt spontan erstmal an Rhapsody und Co. denken muss, der liegt nicht ganz so falsch, spielen Elvenking doch eine Mischung aus melodischen Speed Metal und Klassik und reichern diese Mischung mit einigen Barock- und massiven Folkelementen an. Um sich die Mukke von Elvenking vorstellen zu k&#246;nnen, sollte man also Skyclad und Rhapsody einfach kreuzen und schon erh&#228;lt man Elvenking - zumindest prinzipiell, denn leider vers&#228;umen es die Italiener von Elvenking auch das hohe Niveau der genannten Band zu &#252;bernehmen und somit pl&#228;tschert der Silberteller die gesamte Spielzeit absolut belanglos vor sich hin. So wollen die verschiedenen Ideen, die mit einer absoluten Hektik auf Teufel komm raus in einem Song untergebracht wurden, absolut nicht zusammenpassen, was sich nicht zuletzt an den absolut unpassenden Black Metal Schreien (die zum Gl&#252;ck nur sp&#228;rlich eingesetzt wurden) und dem Einsatz einer weiblichen Stimme (die leider immer dann eingesetzt wurde, wenn es gerade nicht passt...) &#228;u&#223;ert. Hinzu kommen zudem leichte stimmliche Defizite von S&#228;nger Damnagoras, der die ohnehin schwachen Refrains noch weiter verw&#228;ssert. Folgerichtig gibt es auf der Platte mit &quot;Pagan Purity&quot; und &quot;Hobs An` Feathers&quot; gerade mal zwei wirklich angenehme St&#252;cke, bei denen man nicht sofort das Gef&#252;hl hat, die &quot;Stop&quot; Taste des CD Players dr&#252;cken zu m&#252;ssen. Die weiteren Kompositionen kann man demhingegen - trotz einiger guter Ans&#228;tze - eigentlich vergessen und somit ist ein h&#246;ren von &quot;Heathenreel&quot; am St&#252;ck einfach kein Genuss bzw. schlicht und einfach nicht m&#246;glich. Absolute Folk Metal Fanatiker k&#246;nnen ja mal einen Testdurchlauf riskieren, aber alle anderen Leute sollten diese Platte beim H&#228;ndlers des Vertrauens lieber links liegen lassen und das Geld in andere Highlights dieses Monats investieren. Tut mir zwar leid f&#252;r Elvenking, aber auch die amtliche Produktion kann &#252;ber die M&#228;ngel einfach nicht hinwegt&#228;uschen...</P>

<p>Fazit: 3 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
