<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,power of metal">
<title>Compilation: Power Of Metal III - Symphonies Of Steel</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Power Of Metal - Symphonies Of Steel</font></h1><BR> (67:53 / Sanctuary)</center></P>

<p>Der erste Teil des Power Of Metal Samplers aus dem Jahre 1993 mit Live Aufnahmen von Gamma Ray, Hellion, Conception und Rage ist mitlerweile l&#228;ngst vergriffen und hat mit dem vorliegenden dritten Teil auch eher wenig zu tun. Der 1998 erschienene zweite Teil der &quot;Power Of Metal&quot; Reihe d&#252;rfte aber einigen - vornehmlich j&#252;ngeren - Fans ein Begriff sein, befanden sich darauf doch zu einem &#228;u&#223;erst g&#252;nstigen Preis von 10 DM zahlreiche bekanntere Act`s wie etwa Helloween, Stratovarius, Vrigin Steele oder auch Running Wild. In die selbe Kerbe schl&#228;gt auch der mit &quot;Symphonies Of Steel&quot; betitelte dritte Teil, auf dem sich 9 recht bekannte Acts die Ehre geben und jeweils einen oder teilweise auch zwei Song beisteuern. Die Namen der Acts sind dabei auch recht hochkar&#228;tig und reichen von Stratovarius (&quot;Kiss Of Judas&quot; / &quot;Father Time&quot;), Helloween (&quot;Future World&quot;), Iron Savior (&quot;Predators&quot;) &#252;ber Namensgeber Virgin Steele (&quot;A Symphony Of Steele&quot; / &quot;Noble Savage&quot;), Running Wild (&quot;Under Jolly Roger&quot; / &quot;Black Hand Inn&quot;), Kamelot (&quot;Arabian Nights&quot;), Gamma Ray 
(&quot;Rebellion In Dreamland&quot; / &quot;Valley Of The Kings&quot;) bis hin zu h&#228;rterem Stoff der Marke Celtic Frost (&quot;Circle Of Tyrants&quot;) und Kreator (&quot;Pleasure To Kill&quot;). Wie man also unschwer erkennen kann, handelt es sich um komplett ver&#246;ffentliches Material, welches in allen F&#228;llen mit zu dem besten Material der jeweiligen Band geh&#246;rt. Problem an diesem Sampler ist aber die Zielgruppenbestimmung: Fans dieses Genres haben ohnehin schon die CD`s der hierauf vertretenen Bands im heimischen Schrank stehen und brauchen dieses Teil wirklich nicht, Leute die melodischen Power Metal und die angegliederten Genres hassen, werden mit dieser Compilation wohl auch nicht gl&#252;cklich werden - bleiben also nur noch die Kiddis &#252;brig, die diese Mukke erst gerade dank Acts wie HammerFall &amp; Co. f&#252;r sich entdeckt haben und sich einen kleinen &#220;berblick &#252;ber einige der f&#252;hrenden Bands in diesem Genre machen wollen. Ist prinzipiell auch okay, zumal das Teil f&#252;r knappe 10 Ocken &#252;ber den Ladentisch wandert.</P> 

<p>Fazit: ---</P>  
<center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
