<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0E - ZIP und Amiga</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0107.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0106.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0108.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0107.html">ZIP und Amiga</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0102.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0103.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0104.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0105.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0107.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0108.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x010E.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0110.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0111.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0112.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0113.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>ZIP und Amiga - Iomega Zip-Laufwerke am Amiga</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Bei den Zip-Laufwerken von Iomega handelt es sich um
Wechseldisklaufwerke mit einer Kapazit&auml;t von 100 bzw. 250 MB pro
Medium. In diesem Artikel werden wir uns ausschlie&szlig;lich mit dem
kleineren, weiter verbreiteten Zip 100 befassen.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das Zip 100 gibt es jetzt schon einige Jahre auf dem Markt und hat eine
recht gro&szlig;e Verbreitung sowohl auf der Amiga, PC als auch MAC
Rechnerplattform gefunden, soda&szlig; man es schon recht gut zum Austausch
gr&ouml;&szlig;erer Datenmengen, die nicht mehr auf einer Floppy Platz
finden, verwenden kann. Wir werden sehen, da&szlig; es sich sowohl zum
Datenaustauch innerhalb einer Rechnerfamilie als auch &uuml;ber
verschiedene Rechnerfamilien hinweg eignet.<BR>

<BR>Aber auch CDs sind in letzter Zeit durch das Aufkommen billiger Brenner
und Rohlinge als Datentransportmedium immer beliebter. Hierbei gibt es
sogar noch weniger Probleme beim Datenaustauch aufgrund des
standardisierten ISO 9660 Dateiformates, das von allen Rechnerfamilien
verstanden wird. Weiters fassen CDs wesentlich mehr Daten, zudem zu viel
geringeren Kosten pro MB als Zip-Disks.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Wozu ist also dann das Zip gut?</B></H3>&nbsp;

<BR>Als tempor&auml;res Transportmedium, wenn man nur einmal schnell etwas
von einem auf einen anderen Rechner transportieren will, ist man mit Zip
sicher besser bedient, als mit gebrannten CDs, die man nacher nur mehr
wegschmei&szlig;en kann. Au&szlig;erdem ist das Schreiben auf Zip-Disks
viel problemloser als das Brennen von CDs. Ein normaler Kopiervorgang
gen&uuml;gt. Auch zur Erweiterung der Disk-Kapazit&auml;t eines Rechners
sind sie geeignet, oder wenn mehrere Leute auf einem Rechner arbeiten; dann
kann man die Daten, die nicht unbedingt jeder sehen soll, einfach auf
seiner pers&ouml;nlichen Zip-Diskette ablegen. Das erm&ouml;glicht dann
zus&auml;tzlich das Arbeiten auf unterschiedlichen Rechnern, vorausgesetzt
sie besitzen alle ein Zip-Laufwerk. Noch viele andere individuelle
Einsatzm&ouml;glichkeiten sind denkbar. Man hat damit einfach ein Laufwerk
&auml;hnlich einem Diskettenlaufwerk, das aber viel schneller ist und
wesentlich gr&ouml;&szlig;ere Datenmengen speichern kann.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die Technologie</B></H3>&nbsp;

<BR>Die Zip-Laufwerke arbeiten im Gegensatz zu z.B. Syquest Wechselplatten
nach dem Floppy-Disk Prinzip. Das bedeutet, da&szlig; der Schreib-/Lesekopf
auf dem Medium aufliegt. Das beschr&auml;nkt nat&uuml;rlich die damit
erreichbare Gechwindigkeit. W&auml;hrend die Lese-/Schreibgeschwindigkeit
noch mit &auml;lteren Festplatten vergleichbar ist, ist die
Positioniergeschwindigkeit doch um einiges geringer. Als reinen
Festplattenersatz sollte man sie deshalb also nicht unbedingt
verwenden.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die verschiedenen Ausf&uuml;hrungen</B></H3>&nbsp;

<BR>Das Zip 100 gibt es in verschiedenen Ausf&uuml;hrungen. Alle
k&ouml;nnen die selben Medien lesen und schreiben. Sie unterscheidenen sich
nur an der Schnittstelle &uuml;ber die sie mit dem Rechner verbunden
werden, sowie durch ihre Bauform (intern oder extern).<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die SCSI-Ausf&uuml;hrung gibt es in einer internen Version, die in
einen von au&szlig;en zug&auml;nglichen 3,5&quot; bzw. 5,25&quot;
Laufwerksschacht eingebaut wird, sowie in einer externen Version. An einem
A3000, A3000T oder A4000T, welche alle standardm&auml;&szlig;ig &uuml;ber
eine SCSI-Schnittstelle verf&uuml;gen, k&ouml;nnen diese Laufwerke direkt
verwendet werden. Man kann davon sogar den Rechner booten. F&uuml;r alle
anderen Amigas braucht man entweder eine Turbokarte mit SCSI-Kontroller
oder eine eigene Einschubkarte mit einem SCSI-Kontroller. Dabei reicht ein
einfacher Kontroller, da das Zip-Laufwerk nur SCSI-1 ben&ouml;tigt.
Zus&auml;tzliche Treiber f&uuml;r das Zip-Laufwerk sind nicht erforderlich.
Einfach anstecken (wie bei allen SCSI-Ger&auml;ten auf die SCSI-Id und
Terminierung achten) und es kann schon los gehen.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Parallel-Ausf&uuml;hrung gibt es nat&uuml;rlich nur als externe
Variante und ist dazu gedacht, an den Druckerport eines PCs angeschlossen
zu werden. Da die parallelen Schnittstellen des Amiga und des PC im
bidirektionalen Betrieb (also wenn Daten &uuml;ber diese Schnittstelle auch
gelesen werden sollen) nicht zueinander kompatibel sind, ist der Berieb
eines solchen Laufwerks am Amiga nicht ohne weiteres m&ouml;glich. Da
solche Laufwerke am PC jedoch relativ weit verbreitet sind und man sie so
auch einmal schnell f&uuml;r den Amiga ausborgen kann, werden wir uns auch
mit den M&ouml;glichkeiten, diese Laufwerke am Amiga zu betreiben,
besch&auml;ftigen, obwohl die Anschaffung eines solchen Laufwerks speziell
f&uuml;r den Amiga nicht anzuraten ist.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die interne ATAPI-Ausf&uuml;hrung kann an der IDE-Schnittstelle
betrieben werden. Die Amiga Modelle A600, A1200 und A4000 sind zwar
standardm&auml;&szlig;ig mit einer IDE-Schnittstelle ausgestattet, jedoch
unterst&uuml;tzen die alten Treiber im Betriebsystem noch keine
ATAPI-Laufwerke. Deshalb mu&szlig; man in diesem Fall auf zus&auml;tzliche
Software wie das IDEfix97 zur&uuml;ckgreifen. Diese kann aus dem Aminet
bezogen werden, ist jedoch Shareware. Ein Nachteil dieser Variante
gegen&uuml;ber der SCSI-Version am Amiga ist die Tatsache, da&szlig;
aufgrund des fehlenden Treibers im ROM nicht vom ZIP gebootet werden kann.
Weiters handelt es sich immer um eine interne Version des Laufwerks. Das
Mitnehmen des Laufwerks zu einem anderen Rechner wird somit erschwert.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Wie bekommt man ein paralleles Zip-Laufwerk am Amiga zum Laufen.</B></H3>&nbsp;

<BR>F&uuml;r die Schnittstellenkarte IOBlix, die in allen Amigas mit
Zorro-II-Bus eingesetzt werden kann, gibt es einen Treiber, der es
erm&ouml;glicht, auf der parallelen Schnittstelle der Karte ein solches
Laufwerk zu betreiben. Einen Test dieser Variante konnte ich f&uuml;r
diesen Artikel aufgrund fehlener IOBlix nicht durchf&uuml;hren, wird jedoch
sp&auml;ter erfolgen.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die zweite M&ouml;glichkeit, die auf allen Amigas (bei CD32 nur mit
SX32 oder &auml;hnlicher Erweiterung) anwendbar ist, wurde von Bruce Abbott
entwickelt und besteht aus einer kombinierten
Hardware-Software-L&ouml;sung. Dazu sollte man sich das Archiv
<TT>ppazip.lha</TT> vom Aminet herunterladen. Darin ist einerseits
beschrieben, wie man sich einen entsprechenden Adapter baut und
andererseits findet sich dort der notwendige Treiber f&uuml;r den Betrieb
des Laufwerkes. Bei dem Adapter f&uuml;r den Amiga handelt es sich einfach
um ein Kabel (optional mit einem Treiber-Chip), das die an der
Amiga-Parallelen fehlenden Signale vom zweiten Joystick-Port abnimmt. Am
Amiga wird also sowohl die parallele als auch die zweite
Joystick-Schnittstelle belegt. Die Software besteht aus dem ppazip.device
und den Mount-Listen. Das <TT>ppazip.device</TT> bildet ein
<TT>scsi.device</TT> nach, wodurch es m&ouml;glich ist, die HDToolbox zum
Partitionieren der Zip-Disk zu verwenden.<BR>

<BR>Grunds&auml;tzlich funktioniert zwar die Verwendung des parallelen Zip
mit dieser L&ouml;sung, es gibt jedoch ein paar Nachteile. Erstens ist die
Prozessorbelastung deutlich h&ouml;her als bei der SCSI-Variante und
au&szlig;erdem sind die damit erzielbaren Geschwindigkeiten auch um einiges
geringer als bei SCSI oder ATAPI. Ein weiteres Problem, das mit dem derzeit
verf&uuml;gbaren Treiber (v0.8) auftritt, ist die Tatsache, da&szlig; er
bei manchen Prozessorkarten mit dem Prozessorcache seine Probleme hat. So
funktionierte der Treiber auf einem A4000/040 mit originaler A3640
Prozessorkarte (MC68040 mit 25 MHz) nur, nachdem der CPU-Cache mittels
<TT>cpu nocache</TT> ausgeschaltet wurde. Das verringert jedoch die gesamte
Leistung des Systems enorm. Diese Parallel-L&ouml;sung kann also (wie auch
in <TT>ppazip</TT> empfohlen) nur sinnvoll f&uuml;r den Datentransport
verwendet werden. Ein direktes Ausf&uuml;hren von Programmen von der
Zip-Disk ist hier nicht so sinnvoll.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Einrichten von Zip-Disks</B></H3>&nbsp;

<BR>Zip-Disks k&ouml;nnen am Amiga wie Festplatten mittels des Programmes
HDToolbox partitioniert werden. Jedoch hat das Amiga-System gewisse
Probleme, wenn bei einem Wechsellaufwerk die Medien unterschiedlich
partitioniert sind. Deshalb ist es empfehlenswert, die gesamte Zip-Disk als
eine Partition einzurichten. Man erh&auml;lt dabei eine Partition von rund
95 MB Gr&ouml;&szlig;e. Au&szlig;erdem sollten alle Disks mit den gleichen
Parametern bez&uuml;glich Cylinder-, Head- und Track-Anzahl eingerichtet
werden. Grunds&auml;tzlich sind hier verschiedene Kombinationen
m&ouml;glich. F&uuml;r Amiga-Zip-Disks hat sich jedoch folgende Einstellung
etabliert:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Cylinders:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2891
<BR>Heads:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1
<BR>Blocks per Track:&nbsp;&nbsp;&nbsp;&nbsp;68
<BR>Blocks per Cylinder: 68
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Diese Parameter bekommt man auch, wenn man in der HDToolbox die
Parameter des Zip-Laufwerkes auslesen l&auml;&szlig;t. Grunds&auml;tzlich
w&uuml;rde es reichen, wenn man dann alle seine Zip-Disks mittels der
HD-Toolbox auf eine Partition mit den folgenden Parametern einrichtet:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Start Cyl: 2
<BR>End Cyl:&nbsp;&nbsp;&nbsp;2890
<BR>Total Cyl: 2889
<BR>Buffers:&nbsp;&nbsp;&nbsp;30
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Jedoch ist es sinnvoll, f&uuml;r das Zip-Laufwerk auch eine Mountlist
zu erstellen und diese nach <TT>Devs/DosDrivers</TT> zu kopieren. Das hat
den Vorteil, da&szlig; das Zip-Laufwerk auch dann erkannt wird, wenn beim
Starten des Rechners gerade keine Disk eingelegt ist. Au&szlig;erdem kann
man dann neue Zip-Disks, die ja entweder f&uuml;r den PC oder den MAC
formatiert geliefert werden, einfach wie auch eine Diskette f&uuml;r den
Amiga formatieren.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Arbeiten mit PC- und MAC-formatierten Zip-Disks</B></H3>&nbsp;

<BR>&Auml;hnlich wie bei herk&ouml;mmlichen Disketten k&ouml;nnen am Amiga
auch Zip-Disks, die f&uuml;r den IBM-PC oder MAC formatiert sind, gelesen
und geschrieben werden. F&uuml;r Disks mit dem FAT-Dateisystem, das von
IBM-PCs verwendet wird, kommt auch hier, wie bei den Disketten, das
CrossDOSFileSytem zum Einsatz, das ab der Betriebsystemversion 2.0
standardm&auml;&szlig;ig dabei ist. Jedoch k&ouml;nnen damit keine
Zip-Disks formatiert werden, was aber nicht weiter tragisch ist, da diese
beim Kauf ohnehin schon formatiert sind. Au&szlig;erdem mu&szlig; man, wenn
man nur das mitgelieferte CrossDOSFileSytem verwendet und sich nicht das
kommerzielle leistet, mit den kurzen Dateinamen (8.3) auskommen.<BR>

<BR>F&uuml;r das Arbeiten mit MAC-Formatierten ZIP-Disks wird beim Amiga
standardm&auml;&szlig;ig nichts mitgeliefert. Hier kann man aber das
AmiCDFS (eigentlich ein CD-ROM-Filesystem) vom Aminet verwenden. Oder man
greift auf das kommerzielle CrossMacFileSystem zur&uuml;ck.<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Grunds&auml;tzlich mu&szlig; jedoch, um diese Funktionalit&auml;ten
nutzen zu k&ouml;nnen, eine Mount-Liste erstellt werden. Man kann das Zip
auch ruhig mit dem Amiga-Format und dem IBM-PC-Format gleichzeitig mounten.
Das verh&auml;lt sich dann gleich wie bei den Disketten. Bei eingelegter
Zip-Diskette erscheinen dann zwei Piktogramme auf der Workbench, wobei nur
eines davon g&uuml;ltig ist, je nachdem wie die eingelegte Zip-Disk
formatiert ist. Die Mount-Listen, die Sie entweder in die
<TT>Devs/DOSDrivers</TT> (um sie bei jedem Start des Rechners gleich zu
aktivieren) oder in die <TT>Storage/DOSDrivers</TT> Schublade kopieren
sollten, finden sie am Ende des Artikels zum Herunterladen. Bei diesen
m&uuml;ssen Sie jedoch gegebenenfalls das zu verwendende SCSI-Device bzw.
die UNIT-Nummer (entspricht &uuml;blicherweise der SCSI-Id, die Sie beim
Zip-Laufwerk eingestellt haben) an Ihre Gegebenheiten anpassen. Dazu
m&uuml;ssen die Piktogrammmerkmale der Mount-Dateien mit Hilfe des
Workbench-Men&uuml;punktes &quot;Informationen...&quot; ge&auml;ndert
werden.<BR>

<BR><CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Zip-Tools</B></H3>&nbsp;

<BR>F&uuml;r den IBM-PC und Macintosh wird mit dem Zip-Laufwerk eine
Zip-Disk mit Hilfsprogrammen mitgeliefert. Diese erm&ouml;glichen es, eine
Zip-Diskette schreibzusch&uuml;tzen oder mit einem Pa&szlig;wort zu
versehen. Diese Funktionalit&auml;t wird f&uuml;r den Amiga von den aus dem
Aminet beziebaren Zip-Tools wie z.B. <TT>ZJTools</TT> oder <TT>Z100</TT>
erreicht.<BR>

<BR><CENTER><A NAME="14" HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#15"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die erreichbaren Geschwindigkeiten</B></H3>&nbsp;

<BR>Das parallele Zip auf einem A4000/040 mit MC68040, 25 MHz (A3640):<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>MKSoft DiskSpeed 4.2&nbsp;&nbsp;Copyright &copy; 1989-92 MKSoft Development
<BR>------------------------------------------------------------
<BR>CPU: 68040&nbsp;&nbsp;AmigaOS Version: 39.106&nbsp;&nbsp;Normal Video DMA
<BR>Device:&nbsp;&nbsp;zip0:	&nbsp;&nbsp;Buffers: 30
<BR>Comments: DiskSpeed 4.2
<BR>
<BR>CPU Speed Rating: 428
<BR>
<BR>Testing directory manipulation speed.
<BR>File Create:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;18 files/sec&nbsp;&nbsp;|	CPU Available: 31%
<BR>File Open:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20 files/sec&nbsp;&nbsp;|	CPU Available: 42%
<BR>Directory Scan:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;24 files/sec&nbsp;&nbsp;|	CPU Available: 51%
<BR>File Delete:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;24 files/sec&nbsp;&nbsp;|	CPU Available: 46%
<BR>
<BR>Seek/Read:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;29 seeks/sec&nbsp;&nbsp;|	CPU Available: 50%
<BR>
<BR>Testing with a 512 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;&nbsp;23865 bytes/sec&nbsp;&nbsp;|	CPU Available: 20%
<BR>Write to file:	&nbsp;&nbsp;&nbsp;&nbsp;22542 bytes/sec&nbsp;&nbsp;|	CPU Available: 23%
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;12137 bytes/sec&nbsp;&nbsp;|	CPU Available: 52%
<BR>
<BR>Testing with a 4096 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;&nbsp;69458 bytes/sec&nbsp;&nbsp;|	CPU Available: 27%
<BR>Write to file:	&nbsp;&nbsp;&nbsp;&nbsp;85983 bytes/sec&nbsp;&nbsp;|	CPU Available: 20%
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;81033 bytes/sec&nbsp;&nbsp;|	CPU Available: 28%
<BR>
<BR>Testing with a 32768 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;107894 bytes/sec&nbsp;&nbsp;|	CPU Available: 23%
<BR>Write to file:	&nbsp;&nbsp;&nbsp;155628 bytes/sec&nbsp;&nbsp;|	CPU Available: 7%
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;135619 bytes/sec&nbsp;&nbsp;|	CPU Available: 15%
<BR>
<BR>Testing with a 262144 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;130523 bytes/sec&nbsp;&nbsp;|	CPU Available: 17%
<BR>Write to file:	&nbsp;&nbsp;&nbsp;157160 bytes/sec&nbsp;&nbsp;|	CPU Available: 2%
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;170168 bytes/sec&nbsp;&nbsp;|	CPU Available: 5%
<BR>
<BR>Average CPU Available: 28%&nbsp;&nbsp;|&nbsp;&nbsp;CPU Availability index: 120
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="15" HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das SCSI-Zip auf einem A4000/040 mit MC68060, 50 MHz (Cyberstorm
MK-II):<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>MKSoft DiskSpeed 4.2&nbsp;&nbsp;Copyright &copy; 1989-92 MKSoft Development
<BR>------------------------------------------------------------
<BR>CPU: 68040&nbsp;&nbsp;AmigaOS Version: 40.68&nbsp;&nbsp;Normal Video DMA
<BR>Device:&nbsp;&nbsp;ZIP0:	&nbsp;&nbsp;Buffers: 30
<BR>Comments: DiskSpeed 4.2
<BR>
<BR>CPU Calibration shows that CPU availability tests
<BR>would be inaccurate in the current system state.
<BR>No CPU Speed Rating -- CPU % not available.
<BR>
<BR>Testing directory manipulation speed.
<BR>File Create:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;29 files/sec
<BR>File Open:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;34 files/sec
<BR>Directory Scan:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;48 files/sec
<BR>File Delete:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;55 files/sec
<BR>
<BR>Seek/Read:	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;68 seeks/sec

<BR>
<BR>Testing with a 512 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;&nbsp;24962 bytes/sec
<BR>Write to file:	&nbsp;&nbsp;&nbsp;&nbsp;24722 bytes/sec
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;24342 bytes/sec
<BR>
<BR>Testing with a 4096 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;163860 bytes/sec
<BR>Write to file:	&nbsp;&nbsp;&nbsp;171731 bytes/sec
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;167600 bytes/sec
<BR>
<BR>Testing with a 32768 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;427833 bytes/sec
<BR>Write to file:	&nbsp;&nbsp;&nbsp;490233 bytes/sec
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;485119 bytes/sec
<BR>
<BR>Testing with a 262144 byte, MEMF_FAST, LONG-aligned buffer.
<BR>Create file:	&nbsp;&nbsp;&nbsp;623410 bytes/sec
<BR>Write to file:	&nbsp;&nbsp;&nbsp;970903 bytes/sec
<BR>Read from file:&nbsp;&nbsp;&nbsp;&nbsp;970903 bytes/sec
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0107.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/zip-mountlists.lha">ZIP-Mountlists</A> (LHA; 4K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/boot_zip.gif">Boot-ZIP in der HDToolBox</A> (GIF; 7K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/zip.jpeg">Das ZIP-Laufwerk von iomega</A> (JPEG; 50K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/ziptn.jpeg">ZIP-Laufwerk Thumbnail</A> (JPEG; 19K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/drivetype.gif">Drive Type</A> (JPEG; 19K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0106.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0108.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
