<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0E - NAPALM</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0110.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x010F.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0111.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0110.html">NAPALM</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0102.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0103.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0104.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0105.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0107.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0108.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x010E.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0110.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0111.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0112.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0113.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>NAPALM - Einfach gnaaadenlos!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Seit <I>Dune 2</I> fragen sich die Amigianer: wo bleibt
denn der n&auml;chste Echtzeit-Strategie-Schlachtenkn&uuml;ller? Die
MS-Dosenfreunde erg&ouml;tzen sich schon lange an <I>Command &amp;
Conquer</I> und Konsorten, und wir m&uuml;ssen dahinschmachten und uns mit
friedlichen Varianten wie <I>Die Siedler</I> oder neuerdings
<I>Foundation</I> zufriedengeben? So ein Dasein darf doch nicht wahr sein!
Aber Gottseidank gibt es da ein paar Leute, die sich unserer (und unserer
Geldb&ouml;rse) schon einige Male durch Portierung genialer PC-Games und
Produktion eigener Hits angenommen haben: <B>ClickBOOM</B> ...</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Jeder Mensch meckert gerne, und ich ganz besonders, hehe. Na gut, das
stimmt eigentlich gar nicht, aber das kann mich nicht davon abhalten, hier
und jetzt und auf der Stelle zu meckern. Denn ich mecker', wenn <I>ich</I>
will! Vor allem &uuml;ber Intros. Zuletzt meckerte ich kr&auml;ftig
&uuml;ber das <I>Eat The Whistle</I>-Intro, weil es doch wirklich eine
gnadenlose Frechheit darstellte. Aber wenigstens war es vorhanden. Obwohl
man jetzt dar&uuml;ber streiten k&ouml;nnte, ob es nicht besser gewesen
sei, es uns &uuml;berhaupt zu ersparen.<BR>

<BR>Ein Intro hat ja gewisse Aufgaben zu erf&uuml;llen: einerseits soll es
das Spiel schmackhaft machen, was durch Witz, geile Grafik/Anims und Sound
oder sonstige Genialit&auml;t und Kreativit&auml;t zu erreichen ist.
Andererseits soll es m&ouml;glicherweise eine Vorgeschichte zum Spiel
liefern, um eine besondere Atmosph&auml;re zu erzeugen, so da&szlig; der
Spieler wie hypnotisiert erkennt: &quot;Ja, ich mu&szlig; jetzt f&uuml;r
das Gute k&auml;mpfen und die fiesen Feinde vernichten. Ich werde Stunden
meiner kostbaren Zeit f&uuml;r diese heilige Mission aufwenden. Ich darf
nicht lockerlassen, werde nicht ans Telefon gehen und auch nicht
au&szlig;er Haus; mein Hund mu&szlig; ebenso hungern und d&uuml;rsten, wie
ich nach dem Sieg der Gerechtigkeit hungere und d&uuml;rste. Dies und
nichts anderes will ich tun von nun an bis zu jenem Zeitpunkte, an
welchselbigem ich den Abspann erblicke.&quot; Nat&uuml;rlich kann eine
solche Vorgeschichte auch in das Handbuch oder andere Packungsbeilagen
eingebettet werden, und M&ouml;glichkeiten zur Gestaltung und
Pr&auml;sentation der Story sowie dem fesselnden Handlungsrahmen gibt es
viele.<BR>

<BR>Tja, und vor allem Spiele, bei denen man Schlachten gegen fiese Feinde
schlagen soll, ist so eine Vorgeschichte ungeheuer wichtig. Denn ohne sie
kann man sich ja gar nicht moralisch verpflichtet dazu f&uuml;hlen, hier
auf oben beschriebene, selbstlose und aufopfernde Weise ins Geschehen
einzugreifen und dem Verlauf der Dinge eine entscheidende und rettende
Wendung zu verleihen. Aber nun zu der Frage, die sich jeder Leser schon
seit etwa 20 S&auml;tzen fragt: &quot;Was bitte hat das alles mit
<I>Napalm</I> zu tun?&quot; - Die Antwort wird nun ganz dramatisch in eine
Subheadline verpackt...<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>NAPALM hat kein Intro! (Sakrileg!)</B></H3>&nbsp;

<BR>Ja, unglaublich, nicht wahr? Was die sich da erlaubt haben.
<I>Napalm</I> hat n&auml;mlich nicht mal irgendwo im Handbuch eine geniale
Story verpackt. Der traurige Witz ist: sie fehlt v&ouml;llig! Fast schon
grotesk mutet da der winzige Absatz &quot;The Plot&quot; an, den ich nun
zitiere:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR>Robots trying to overthrow the Human rule. You can play either as a
Human, defending the Earth from Robots, or as a Robot trying to destroy the
Human<BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Das ist starker Tobak f&uuml;r unsere so empfindlichen Nerven. Aber mit
einer Portion Wut im Bauch lassen sich die Missionen vielleicht noch
heftiger und hemmungsloser gewinnen. Ich kann also mitnichten dazu raten,
die Installation des Spieles nun aus Trotz zu verweigern. Im Gegenteil: es
wird sich lohnen!<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>NAPALM ist leicht zu installieren.</B></H3>&nbsp;

<BR>Zumindest wenn man mindestens 20 MB auf der Festplatte frei hat. Und
ohne 16 MB FastRam und einer 020er-CPU braucht man gar nicht erst loslegen,
sondern sollte schleunigst zum Amiga-H&auml;ndler des Vertrauens rennen und
sich eine ordentliche Maschine zulegen. Das w&auml;re ja sonst so, als
w&uuml;rde man mit einer Vespa bei den Motocross-Rennen vorne mitmischen
wollen. Und wer traut sich das schon? Die empfohlene Mindestkonfiguration
beinhaltet schon eine 030-CPU, aber so ganz wird sich auch hier das Spiel
nicht entfalten k&ouml;nnen, wie ich bereits vorwegnehmen will. F&uuml;r
den optimalen Genu&szlig; sollte der Amiga mit einer 060er, 32 MB Ram und
Grafikkarte ausgestattet sein. Ja, ich habe den Unterschied gesehen und
mu&szlig; sagen: er ist gewaltig. Aber dazu sp&auml;ter mehr.<BR>

<BR>Um <I>Napalm</I> zu installieren, bedarf es wenig, ganz wie man es von
Amiga-Installern gew&ouml;hnt ist. Bald schon bev&ouml;lkern viele kleine
und gro&szlig;e Files die Harddisk. Darunter auch ein Napalm-Setup-File,
welches getrennt vom Spiel diverse Einstellungen zu den Themen Grafik,
Sound, CD-Musik, Chat-Makros (f&uuml;r den Multiplayer-Modus) und Network
erm&ouml;glicht.<BR>

<BR>NapalmBOOT ist ein File, welches das Spiel nach einem Reset autobooten
lassen sollte (f&uuml;r alle, die zuwenig freien Speicher besitzen und
nicht extra alles umkonfigurieren wollen). Ich habs probiert und bin
kl&auml;glich gescheitert: au&szlig;er einem Sofort-Absturz tat sich nix.
Allerdings war es danach gar nicht so einfach, die Sache wieder
abzustellen, die sich auf gemeinste Weise irgendwo im System fix
eingenistet hatte. Dar&uuml;ber fand sich aber sowieso nix im Handbuch. Und
auf der CD sowieso nicht. Ich mu&szlig; schon sagen, die Dokumentation
rei&szlig;t mich nicht unbedingt vom Hocker.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>NAPALM ist einfach geil.</B></H3>&nbsp;

<BR>Nun ist es mal an der Zeit, das Spiel selbst zu beschreiben. (Meine
Artikel m&uuml;ssen ja sch&ouml;n frustrierend sein, wenn ich nie zum
Wesentlichen komme! Aber das ist bei mir auch sonst so - meine Mitmenschen
k&ouml;nnen ein Lied davon singen...) Es &auml;hnelt in vielerlei Hinsicht
sehr stark dem guten alten <I>Dune 2</I>. Es ist eine Reihe von Missionen zu
bew&auml;ltigen, deren Schwierigkeitsgrad genauso w&auml;chst wie die
M&ouml;glichkeiten. Anfangs stehen nur wenige Einheiten und Geb&auml;ude
zur Auswahl, in der ersten Mission &uuml;berhaupt nur ein paar mickrige
Truppen, aber mit der Zeit kommen neue hinzu und machen das Spiel von
Mission zu Mission interessanter und abwechslungsreicher. Das Geschehen
wird praktisch aus der Vogelperspektive betrachtet (ein wenig schr&auml;g
wie bei <I>Dune 2</I>). Der Bau von Geb&auml;uden oder Einheiten und deren
Reparaturen kostet Credits, und die sind begrenzt. Aber es existieren
&Ouml;lvorkommen, die durch eine Spezialeinheit angebohrt werden
k&ouml;nnen. Diese verwandelt sich dann in einen &Ouml;lbohrturm, und ein
Tanker bef&ouml;rdert das &quot;schwarze Gold&quot; in eine Raffinerie, wo
es in Credits umgewandelt wird. Alle Geb&auml;ude ben&ouml;tigen Strom, vor
allem das Radar; au&szlig;erdem verlangsamt sich die Produktion bei
unzureichender Energieversorgung. Geb&auml;ude k&ouml;nnen prinzipiell nur
an bestehende Komplexe angebaut werden, also quasi um das HQ herum. Doch
nun zu den genialen Features: erstens kann man &quot;fake buildings&quot;
bauen, also sozusagen billige Kartenh&auml;user, die billig und robust sind
und den Feind kr&auml;ftig ins Bockshorn jagen, weil seine Einheiten
sinnlos herumballern; zweitens kann man Geb&auml;ude und Einheiten
unsichtbar machen (solange sie nicht feuern). Drittens gibt es die
gnadenlose Erfindung des Tunnels, dessen Ende irgendwo aufgebaut werden
kann. Durch ihn gelangen Einheiten in kurzer Zeit, und an seinem Ende darf
auch weitergebaut werden, was dem Spiel &quot;neue Dimensionen
er&ouml;ffnet&quot;, um das Handbuch zu zitieren.<BR>

<BR>Das Kommandieren der Einheiten gestaltet sich nach kurzer
Gew&ouml;hnungsphase genial einfach und einfach genial. Die Maus alleine
tut&acute;s nicht, echte Strategen benutzen auch das Keyboard auf exzessive
Weise. Die Kombination ist allerdings unschlagbar, ich habe selten eine so
umfangreiche und zugleich so komfortable Tastaturbelegung gesehen. Multiple
select, Definieren, Rufen und Schicken verschiedener Gruppen, Selektieren
von allen sichtbaren Tanks, Soldaten, (Nicht-)Kampf- bzw.
(un-)besch&auml;digten Einheiten, Formationsbewegung, Zerstreuen,
Definieren von und Springen zu Orten auf der Karte, automatisches Senden
von neuen Einheiten zu Zielorten und noch zig weitere komfortable Angriffs-
und Bewegungskommandos lassen, soferne man sich einmal daran gew&ouml;hnt
hat und wei&szlig;, was wie funktioniert, echte Freude aufkommen.<BR>

<BR>Unter Beschu&szlig; sinkt die Energieanzeige jeder Einheit bis hin zur
Explosion. Dasselbe gilt auch f&uuml;r die Geb&auml;ude, aber bei denen
kracht es dann ordentlich: jede Menge feurige Detonationen und fliegende
Tr&uuml;mmer, die alle umliegenden Einheiten noch mal ordentlich
sch&auml;digen. Die letzten Sch&uuml;sse sind also mit Bedacht und aus
sicherer Entfernung abzugeben! Allerdings tendieren Spieler und Computer
gleicherma&szlig;en dazu, angeknackste Geb&auml;ude zu reparieren, so
da&szlig; oft eine ganze Armee zur Vernichtung derselben vonn&ouml;ten ist.
Da&szlig; dabei der eine oder andere Panzer dran glauben mu&szlig;,
l&auml;&szlig;t sich nicht immer verhindern. Unangenehm sind immer wieder
die Invasionen des Gegners, und es hilft gegen seine rollenden Angriffe
sehr stark, einen Panzer-Schutzschild zu errichten. Denn alle Einheiten
bewegen sich parktisch auf Feldern, und eine geschlossene Reihe von
Einheiten l&auml;&szlig;t sich somit nicht passieren. Aber Vorsicht: das
Fu&szlig;volk wird gerne &uuml;berfahren! Sei es nun Infanterie, Bazooker,
Pyro-Unit oder Engineer (der theoretisch feindliche HQs, Radarstationen
etc. einnehmen und unsch&auml;dlich machen kann, aber nur wenn man ihn
l&auml;&szlig;t...). Aber auch das gilt nur solange, bis fliegende
Einheiten ins Spiel kommen, und derer gibt es einige! Bald fliegen
Helikopter und bringen Fallschirmspringer mitten ins feindliche Territorium
(surprise, surprise), bald machen UFOs die menschlichen Gefilde unsicher.
Und sobald einmal Nuklearwaffen im Einsatz sind, macht es nach einem kurzen
&quot;Click&quot; ohnehin &uuml;berall nur noch &quot;BOOM&quot;! (wau, auf
dieses geniale Wortspiel bin ich jetzt aber m&auml;chtig stolz ;-))<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>NAPALM hat auch geile Grafiken &amp; Sounds.</B></H3>&nbsp;

<BR>Und das nicht nur in den Men&uuml;screens, sondern auch im Spiel
selbst. Dummerweise sind die hei&szlig;en CD-Tracks den Usern mit besserer
Konfiguration vorbehalten, zumindest mir hat sich dieser Genu&szlig;
statthaft und hartn&auml;ckig verweigert. Und dummerweise ist das Spiel bei
halbwegs annehmbarer Aufl&ouml;sung (PAL Hi-Res, 640x512) l&auml;hmend
langsam, aus jeder angezeigten Realtime-Sekunde werden dann
tats&auml;chlich mindestens drei, sobald sich der Screen einigerma&szlig;en
bev&ouml;lkert. Und in Lo-Res (320x256) stimmt zwar die Geschwindigkeit,
aber grafischer Genu&szlig; und &Uuml;bersicht leiden doch sehr. Da sieht
man wieder: die Zeiten, da <I>Turrican II</I> auf einem nackten 500er zu
begeistern wu&szlig;te, sind vorbei. Jetzt ist auch bei uns Amigianern
langsam das Aufr&uuml;sten angesagt. Sogar mein 1200er mit Blizzard 1230/IV
(030/50) und 16 MB FastRam ist ein alter Opa geworden, und dabei war ich
eben erst noch recht stolz auf ihn. Aber mein Bruder hat es ja immer schon
gewu&szlig;t: selber mit einem 4000er, full of Schnickschnack, prahlend und
mir ewig weismachend, da&szlig; man mit einer 170-MB-Harddisk und ohne
Grafikkarte, Modem etcetera nirgends mehr hinkommt. Modem hab ich aber eh
schon eins, hehe! - Aber hoppla, mir scheint, ich schweife wieder mal vom
Thema ab. :-)<BR>

<BR>Spielt man <I>Napalm</I> aber auf einem flinkeren Rechner, dann kommt
wieder wahre Freude auf: herrliche Aufl&ouml;sungen, grafische Freuden,
flie&szlig;ender Echtzeit-Stre&szlig;. Man k&ouml;nnte fast meinen, das
Spiel sei ein guter Grund daf&uuml;r, kr&auml;ftig aufzur&uuml;sten, denn
der Spielspa&szlig; vervielfacht sich dann betr&auml;chtlich, und sogar bei
mir daheim (wie oben beschrieben) macht es bereits m&auml;chtig Spa&szlig;,
trotz mickriger Aufl&ouml;sung.<BR>

<BR>Und der Hammer ist ja sowieso das Gegeneinander-Spielen von mehreren
Menschleins, egal ob &uuml;ber das Modem oder per Nullmodemkabel.
Allerdings mu&szlig; ich hiermit auf gewisse Unzul&auml;nglichkeiten
hinweisen, derer ich beim Versuch, gegen den J&uuml;rgen zu spielen, gewahr
wurde. Sogar bei niedrigen Datenraten, die an sich kaum Probleme machen
sollten, brach jedesmal schon nach wenigen Minuten die Verbindung ab. Wir
konnten zwar weiterspielen, aber beide mit einem &quot;toten&quot; Gegner.
Vielleicht lag dies daran, da&szlig; einer der beiden Rechner kurzfristig
ein wenig l&auml;nger brauchte und der andere (flinkere) auf seinen
langsamen Kumpel nicht warten wollte, obwohl er eigentlich sollte. Naja, so
ist das Leben. Ich hoffe doch, da&szlig; dieser Fehler sich umgehen oder
eliminieren l&auml;&szlig;t, habe es aber nicht ausreichend ausgetestet.
Vielleicht sollte ich demn&auml;chst ein Napalm-Test-Update schreiben und
dieses Geheimnis l&uuml;ften, f&uuml;r alle, die sich daf&uuml;r
interessieren.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>NAPALM hat auch seine schlechten Seiten.</B></H3>&nbsp;

<BR>Traurig, aber wahr. Besagtes Multiplayer-Problem zum Beispiel. Oder die
Sache mit dem Autobooten, die nur zum Crash f&uuml;hrte (jedenfalls bei
mir). Oder die mangelhafte Dokumentation. Weder eine spannende
Hintergrundgeschichte noch genauere technische Informationen oder
detaillierte Troubleshooting-Hilfe sind vorhanden (bis auf den Verweis auf
Updates und Support auf der Homepage von ClickBOOM). Sogar bei der
Formatierung der Daten zur Beschreibung der Einheiten und Geb&auml;ude
unterliefen den Leuten einige Fehler, und das bei einem so kleinen
Handbuch, das man bestenfalls noch mit &quot;B&uuml;chlein&quot; bezeichnen
k&ouml;nnte.<BR>

<BR>Das macht die abschlie&szlig;ende Bewertung nat&uuml;rlich nicht
einfach. Das Spiel ist einfach ein absoluter Kn&uuml;ller und Knaller und
ein herrlichers Geballer. Ein wahres Feuerwerk im wahrsten Sinne des
Wortes! Es gibt derzeit nichts Vergleichbares f&uuml;r unsere
&quot;Freundinnen&quot;, und auch wenn ich die PC-Konkurrenz nicht gut
kenne, so m&ouml;chte ich doch meinen und behaupten, da&szlig;
<I>Napalm</I> nun seinerseits f&uuml;r Konkurrenz sorgt. Sooo viele
Pluspunkte! Jeder Leser, der nicht wenigstens das Demo testet oder kurz in
das Spiel von <A HREF="http://www.clickboom.com/">ClickBOOM</A>
hineinschnuppert, ist definitiv selber schuld.<BR>

<BR>Die Anforderungen habe ich bereits bekanntgegeben, hier sind sie aber
nochmal. Mindestens: 020 / 16 MB fast / 20 MB hd-space ... mindestens
empfohlen: 030 ... mindestens f&uuml;r Hi-Res-Freuden: 060 / 32 MB fast /
Grafikkarte.<BR>

<BR>Das Spiel kommt wie bereits angedeutet auf einer CD daher, in
ansprechendem Design, aber leider mit einem nicht ganz so tollen Handbuch,
wie ich es mir gew&uuml;nscht h&auml;tte, ohne dabei gro&szlig;e
Anspr&uuml;che zu stellen (zumal ja auch doc-files auf der CD fehlen). Der
Kostenpunkt liegt bei etwa 700 ATS. Und nun die abschlie&szlig;ende
Empfehlung: kaufen, heimgehen, die T&uuml;re versperren, das Zimmer
abdunkeln, das Telefon ignorieren und durchzocken, bis die
Dauer-Zock-Rekorde purzeln. (offiziell liegen die glaube ich weit jenseits
der 100-Stunden-Grenze)<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="../images/_box_red.gif" WIDTH=95 HEIGHT=10 ALT="[95]"><IMG SRC="../images/_box_black.gif" WIDTH=5 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=89 HEIGHT=10 ALT="[89]"><IMG SRC="../images/_box_black.gif" WIDTH=11 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="../images/_box_red.gif" WIDTH=91 HEIGHT=10 ALT="[91]"><IMG SRC="../images/_box_black.gif" WIDTH=9 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="../images/_box_red.gif" WIDTH=88 HEIGHT=10 ALT="[88]"><IMG SRC="../images/_box_black.gif" WIDTH=12 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=95 HEIGHT=10 ALT="[95]"><IMG SRC="../images/_box_black.gif" WIDTH=5 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="../images/_box_red.gif" WIDTH=60 HEIGHT=10 ALT="[60]"><IMG SRC="../images/_box_black.gif" WIDTH=40 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=87 HEIGHT=10 ALT="[87]"><IMG SRC="../images/_box_black.gif" WIDTH=13 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0110.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_001.jpeg">Napalm Welcome Screen</A> (JPEG; 78K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_002.gif">Napalm Menu</A> (GIF; 36K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_008.jpeg">Eigene Basis unter Beschu&szlig;</A> (JPEG; 93K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_010.gif">Mission completed</A> (GIF; 52K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_014.gif">Crash!</A> (GIF; 49K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_015.gif">Boom!</A> (GIF; 56K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_016.gif">Bang!</A> (GIF; 57K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0E/napalm_briefing.gif">Briefing Screen</A> (GIF; 49K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x010F.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0111.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
