<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0E - Backspace Pedal</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0111.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0110.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0112.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0111.html">Backspace Pedal</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0102.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0103.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0104.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0105.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0107.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0108.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x010E.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0110.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0111.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0112.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0113.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Backspace Pedal - Cursor, komm zur&uuml;ck!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Ein weiser Mann hat einmal gesagt: &quot;H&auml;tte
Gott gewollt, da&szlig; Menschen Computer bedienen, so h&auml;tte er uns
mindestens mit einer seriellen Schnittstelle ausgestattet.&quot; Leider ist
dem nicht so, und deshalb war die Kommunikation zwischen Mensch und
Maschine immer schon ein Flaschenhals in der Computerei. Viele Computer
verbringen einen gro&szlig;en Prozentsatz ihres Lebens damit, auf den
Anwender zu warten. Ist dieser nicht gerade dabei, mit der Maus Kilometer
zu fressen, so hackt er planlos auf der Tastatur herum. Eine simple
Hardware-Erweiterung verspricht, die Produktivit&auml;t an dieser Stelle
mindestens zu verdoppeln.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Das Kreuz mit der Tastatur</B></H3>&nbsp;

<BR>Von der Maus wollen wir ja gar nicht reden. Die Grundidee w&auml;re
seinerzeit gewesen, da&szlig; der Anwender den Mauszeiger als eine
Verl&auml;ngerung der eigenen Hand sieht. Kaum einer wird abstreiten,
da&szlig; es sich hier bestenfalls um die Verl&auml;ngerung der Hand eines
Drogens&uuml;chtigen auf Entziehungskur handelt, dem man vier Finger
abgehackt hat und der nebenbei Epileptiker ist.<BR>

<BR>Jeder Mensch, der letztendlich halbwegs etwas weiterbringen will,
greift deshalb so oft es geht auf die Tastatur zur&uuml;ck (von der
Einlernphase in eine neue Applikation und Anwendungen wie Zeichprogrammen
einmal abgesehen). Vor allem Leute aus dem Bereich der Software-Entwicklung
vertreten diese Position.<BR>

<BR>Wie die Erfahrung aber zeigt, sind die Fehlerraten horrend.
Untersuchungen haben ergeben, da&szlig; bei text-lastigen Anwedungen wie
Programmieren und Textverarbeiten etwa 1/8 der ausgef&uuml;hrten
Operationen &quot;L&ouml;schen&quot; sind (<A
HREF="#Whiteside-1982">Whiteside et.al. 1982</A>). Logischerweise ist eine
der wichtigsten Tasten daher die R&uuml;cktaste, besser bekannt als
<I>Backspace</I> - neben Dingen wie den Cursortasten, Enter und der
Leertaste.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Zehn kleiner Fingerlein...</B></H3>&nbsp;

<BR>Der Mensch hat zehn Finger. Theoretisch k&ouml;nnte er alle davon
f&uuml;r die Eingabe per Tastatur benutzen, und Sekret&auml;rinnen tun
sogar. Das einzige, was das sogenannte Zehnfingersystem auf lange Sicht
bringt, ist eine Sehnenscheidenentz&uuml;ndung. Sekret&auml;rinnen haben
die andauernd, Programmierer so gut wie nie. Warum? Klar, weil kein
Programmierer das Zehnfingersystem beherrscht. Wozu auch, wenn bei (leider
popul&auml;ren) Unsprachen wie C, Perl und Java Buchstaben ohnehin die
Ausnahme sind und man die meiste Zeit in den Bereichen der Tastatur
herumkreist, von denen die meisten Sekret&auml;rinnen gar nicht wissen,
da&szlig; es sie gibt. Geschweige den, da&szlig; ihre Finger lange genug
w&auml;ren, um dort hinzukommen.<BR>

<BR>Das Meiden von reflexartig eingetrichterten Mustern wie dem
Zehnfingersystem f&uuml;hrt aber zu der horrenden oben erw&auml;hnten
Fehlerrate und dem zwangsl&auml;ufig oftmaligen Druck auf Backspace, um die
letzte Eingabe zu l&ouml;schen.<BR>

<BR>Betrachten wir nun einmal die Positionen der beliebtesten Tasten:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=302 HEIGHT=67 ALT="[Tastatur]" SRC="../images_0E/tastatur.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=302>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Positionen der am h&auml;ufigsten gedr&uuml;ckten Tasten
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Gegen die Lage der Leertaste ist nichts einzuwenden. Man kann sogar
sagen, da&szlig; wir unsere beiden Daumen kaum f&uuml;r etwas anderes
verwenden. Enter geht auch in Ordnung, denn obwohl die Taste etwas kleiner
ist, so reduziert die &auml;u&szlig;ere Lage die Wahrscheinlichkeit des
unabsichtlichen Bet&auml;tigens. Ein Segen in Zeiten, wo &quot;Undo&quot;
immer noch eher die Ausnahme ist.<BR>

<BR>Als ersch&uuml;tternd kann man die Plazierung von Backspace bezeichnen.
Denn obwohl die mit Abstand wichtigste Taste, ist sie winzig und liegt an
der entlegensten Ecke. Will man sie bet&auml;tigen, so ist man praktisch
gezwungen, die Hand vom &quot;konstruktiven&quot; Teil der Tastatur
wegzubewegen. Denn kein normaler Finger ist lange genug, um dort aus
eigener Kraft hinzugelangen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Outsourcing</B></H3>&nbsp;

<BR>F&uuml;r untragbar hielt diesen Zustand DI D.R&uuml;cker, seines
Zeichens Entwicklerchef der unl&auml;ngst von ihm gegr&uuml;ndeten Firma
Druck-Zruck. Statt in alt&ouml;sterreichischer Manier nur zu jammern hat er
einen L&ouml;sungvorschlag ausget&uuml;ftelt und gleich in die Tat
umgesetzt: das Backspace-Pedal.<BR>

<BR>Die Idee ist einfach: Backspace ist nicht mehr eine entlegene
verkr&uuml;ppelte Taste, die man nur unter erheblichen Aufwand und mittels
Unterbrechung des Tippflu&szlig;es bet&auml;tigen kann. Nein, Backspace ist
jetzt ein Pedal, da&szlig; sich unter dem Schreibtisch befindet, wo man es
mit dem Fu&szlig; bedienen kann.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=203 HEIGHT=204 ALT="[Backspace Pedal]" SRC="../images_0E/pedal.jpeg"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=203>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Das Backspace-Pedal
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Ich hatte das Pedal in den letzten Wochen im Einsatz und kann sagen
da&szlig; die Produktivit&auml;t deutlich steigt. Am besten dann, wen man
im Hintergrund Musik jenseits der 100 BPM laufen hat. Dann geht es sich
gerade sch&ouml;n aus, auf dem Pedal mitzuwippen.<BR>

<BR>Dazu D.R&uuml;cker: &quot;Es ist ja eine weithin bekannte Tatsache,
da&szlig; die Tastatur in der Form, wie sie heute im Einsatz ist, nach wie
vor einem Design aus der Anfangszeit der Schreibmaschine entspricht. Damals
ging es nicht nur darum, schnell zu tippen, sondern vielmehr, das
Verklemmen der mechanischen H&auml;mmer zu verhindern. Das klassische
QWERTZ/QWERTY-Layout machte genau da&szlig;, weil der Tippflu&szlig; hier
k&uuml;nstlich erschwert wird.&quot;<BR>

<BR>Der Erfinder weiter: &quot;Daher sind diese hohen Raten f&uuml;r
Tippfehler bzw. Sehenscheidenentz&uuml;ndungen gar keine Wunder. Das
Problem mit den Verklemmen haben wir im Zeitalter der Elektronik
nat&uuml;rlich schon lange nicht mehr. Verbesserte Layouts wie das von
Dvorak wurden aber immer boykottiert - vor allem von alten
Sekret&auml;rinnen. Unser Backspace-Pedal heilt also nicht die Krankheit
ansich. Es ist leider nur eine Art Schmerzmittel. Aber bis auf weiteres
wohl das Beste, das wir kriegen.&quot;<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Technische Daten</B></H3>&nbsp;

<BR>Das Pedal ist stabil gebaut und sollte locker einige J&auml;hrchen
seine Dienste tun. Das Handbuch empfiehlt von Zeit zu Zeit einen Tropfen
&Ouml;l in eine &Ouml;ffnung neben der Feder einzutr&ouml;pfeln.<BR>

<BR>Die Installation ist einfach: zwischen Tastaturstecker und
Computerbuchse wird ein &quot;Zwischenstecker&quot; eingef&uuml;gt. Der
Rechner sieht keinen Unterschied in einem Backspace vom Pedal oder der
Tastatur. Deshalb ist auch keine eigene Treibersoftware oder &Auml;hnliches
n&ouml;tig. Und die alte Taste tut nach wie vor ihren Dienst. Das ist
praktisch, weil die Umgew&ouml;hnung aus eigener Erfahrung etwa eine Woche
dauert.<BR>

<BR>Der Preis von ATS 300 geht in Ordnung, zieht man die stabile
Verarbeitung unter Betracht. Beziehen kann man das gute St&uuml;ck entweder
bei PointDesign oder von Druck-Zruck, 0104 Wien-Apriling.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Fazit</B></H3>&nbsp;

<BR>Das Backspace Pedal ist f&uuml;r praktsch jeden Anwender rundum zu
empfehlen. Verarbeitung und Preis sind erstklassig, und die
Produktivit&auml;tssteigerung enorm. Es ist immer wieder erstaunlich, mit
welchen scheinbar kleinen Details Menschen mit Visionen den Alltag so viel
angenehmer machen k&ouml;nnen.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0111.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.druckzruck.co.at/">http://www.druckzruck.co.at/</A> - Druck-Zruck, der Hersteller aus eigenem Lande<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.aw.com/DTUI">Designing the User Interface</A> - Buchtip f&uuml;r jene, die mehr &uuml;ber Dvorak-Keyboards, fu&szlig;bedienbare M&auml;use etc wissen wollen: <A HREF="http://www.aw.com/DTUI/">http://www.aw.com/DTUI</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A NAME="Whiteside-1982">Literatur zum Thema welche Tasten h&auml;ufig gedr&uuml;ckt werden</A>: <I>How Do People Really Use Text Editors?</I> John Whiteside, Norman Archer, Dennis Wixon und Michael Good. Proceedings of the Conference on Office Automation Systems 1982. S.29-40.<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0110.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0112.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
