<HTML>
<HEAD>
<TITLE>AMIGA TIMES 03/97 - Editorial</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/edit2.gif" ALT="Editorial" BORDER=0 WIDTH=248 HIGHT=50>
</CENTER>

<H1>Halli Hallo und Willkommen bei der 3. Ausgabe der Amiga Times!</H1>

<P>
Zwei Monate sind rum und ich wei&szlig; garnicht wo die hin sind! Die Zeit vergeht
einfach viel zuschnell. Doch auch wenn die Zeit (f&uuml;r uns) schnell
verging, so hatten wir doch immer noch genug davon, um eine weitere Ausgabe
der Amiga Times "zu machen". Und k&ouml;nnen somit eine neue pr&auml;sentieren,
welche wieder allerhand zubieten hat, doch dazu sp&auml;ter mehr.

<P>
Nach erscheinen der 2. Ausgabe geschah unglaubliches... viele viele User
schrieben uns, w&uuml;nschten uns Gl&uuml;ck und lobten unser Magazin. 2 Wochen
nachdem unsere Homepage erreichbar war... waren schon &uuml;ber 550 User drauf
und daraufhin haben wir uns auch in den "clickBOOM Amiga Web Ring" und
ins "WEB.DE" eintragen lassen und sind absofort dar&uuml;ber erreichbar.
Also so eine Resonanz h&auml;tte ich nicht erwartet. Immerhin war es gerade
mal die zweite Ausgabe und das wir so einen Erfolg haben w&uuml;rden, h&auml;tte
ich mir in meinen k&uuml;nsten Tr&auml;umen nicht erwartet! Wahnsinn!
Sogar Aminet CD User schrieben uns und einen neuen Redakteur bekamen wir
auch. Was wir schon mit Ausgabe 2 geschafft haben... dazu haben einige
andere Mags viel l&auml;nger gebraucht. Dank' an Euch alle!!!

<P>
Das war nat&uuml;rlich Motivation genug und es dauerte nicht lange, bis wir
uns wieder "in den Redaktionssessel" setzen und loslegten. Und wir k&ouml;nnen
Dir auch in dieser Ausgabe wieder einiges pr&auml;sentieren. Ein absolutes
Highlight ist unser Weihnachtsquiz, bei dem Du einen AMIGA 1200 Magic
(gesponsort von Amiga International) gewinnen kannst! 
Weiterhin gibt es interessante Artikel zu allen m&ouml;glichen Themen. Wir
berichten &uuml;ber die Probleme bei T-Online, &auml;u&szlig;ern uns zu "phase5" und
haben wieder allerhand Test`s, Berichte und Infos. Au&szlig;erdem haben wir auch
einen Mystery-Teil, mit vielen Informationen &uuml;ber UFO`s und Aliens.
Also wieder eine sehr interessante und (ich denke) auch informative
Ausgabe.

<P>
Neu ist ab dieser Ausgabe, da&szlig; wir Werbung mit reinnehmen. Dies hat
verschiedene Gr&uuml;nde, die ich hier aber nicht nenne m&ouml;chte. Das positive
daran ist aber, da&szlig; Du dich auch bei uns &uuml;ber Preise und Neuerscheinungen
informieren kannst! Ich denke das dieser Schritt kein Fehler war! Aber
keine angst, ein Werbe-Magazin wird die Amiga Times ganz sicher nicht.

<P>
Was gibt es sonst noch neues?
Die Indiana Jones Story wurde nach einigen &Uuml;berlegungen abgesetzt, da ich
als Autor kaum noch Zeit habe um die Geschichte zubeenden und leider
habe ich keinerlei Mails (Kritik, Meinungen o. Lob) erhalten, so da&szlig; ich
auch nicht wei&szlig;, ob die Story &uuml;berhaupt jemanden gefallen hat! Die Story
wird fertig geschrieben und erscheint sp&auml;ter als Guide im Aminet und auf
unserer Homepage.

<P>
Es gab allerhand Email`s mit Beschwerden, weil die Zeichen (manchmal 250)
einfach zulang bzw. zuviel waren. Nun dies haben wir ge&auml;ndert und jetzt
sind maximal 80 Zeichen auf einer Zeile, ich hoffe das damit das Problem
gel&ouml;st ist!?!

<P>
Negatives!
Eigentlich sollte es ein Interview mit J&ouml;rn-Erik Burkert vom Amiga Magazin
geben, aber das f&auml;llt leider aus, da ich keine Antwort erhalten habe, was
ich recht schade finde. Vielleicht waren die Fragen ja auch zu direkt, da
ich nicht gern um den "heissen Brei" herumrede und ganz klare Fakten und
Meinungen von mir gab! Wie gesagt... es w&auml;re sicherlich interessant
gewesen, aber es sind eben nicht alle User/Redakteure bereit, mal offen
zusagen wie es aussieht! Ich glaube &uuml;ber das Amiga Magazin kann bzw. hat
sich sowieso schon jeder User eine eigene (meist negative) Meinung gebildet.

<P>
Neu ist auch ab dieser Ausgabe, da&szlig; nach jedem Spiel- oder Programmtest
immer fett und kursiv eine Art Empfehlung dahinter steht, z.B.:
<EM><STRONG> - Gut - </STRONG></EM>. Dies ist praktisch nochmal die gesamte Wertung
in ein paar Worten zusammengefasst.

<P>
Wenn Du fragen hast oder nur mal ein wenig quatschen willst, kein Problem,
wir sind immer f&uuml;r ein paar Emails zuhaben.

<P>
Das war diesmal vielleicht ein sehr langes Editorial, aber ich denke das
es trotzdem nicht langweilig war!

<P>
<STRONG>Die Amiga Times Redaktion w&uuml;nscht Euch fr&ouml;hliche Weihnachten
und ein gesundes neues Jahr 1998! Bleibt gesund und dem Amiga treu und ich hoffe
Ihr seid wieder mit dabei, wenn in 2 Monaten die neue Amiga Times erscheint!</STRONG>

<P>
<STRONG><EM>Euer Mario</EM></STRONG>
                                           
<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><IMG SRC="../images/back1.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></TD>
<TD><A HREF="inhalt.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

