<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Spieletest: Silver</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/gtest.gif" ALT="Spieletest" BORDER=0 WIDTH=310 HIGHT=61>
</CENTER>

<H1>Silver</H1>

<P>
Wer kennt sie nicht, die unz&auml;hligen Rollenspiele um Ultima-Stil. Man durchquert
allein oder mit einer Gruppe Landschaften und erlebt die tollsten Abenteuer.
Wer schon immer mal solche Spiele selber erstellen und spielen wollte, sollte
sich das Rollenspiel-System Silver mal genauer anschauen.
Die Installation von Silver ist dank des Commodore-Installers ein Kinderspiel.
Selbst eine optimierte Version f&uuml;r 68020 Prozessoren oder h&ouml;her ist dabei. Nach
dem Start des Hauptprogramms befindet man sich im Hauptmenu. Hier kann man nun
Spielst&auml;nde laden, ein neues Spiel starten oder sich einen neuen Charakter erschaffen.
Alle verf&uuml;gbaren Abenteuer werden ebenfalls hier angezeigt, man braucht nur das
Abenteuer und einen Charakter w&auml;hlen, und schon kann das Spiel beginnen.
Bei der Charakter-Erschaffung kann man so ziemlich alles einstellen was man
will. Man kann sich von derzeit 10 Rassen eine ausw&auml;hlen, legt anschlie&szlig;end
seine Attribute wie z.B. Gewandheit, St&auml;rke und Konstitution fest und seine
F&auml;higkeiten wie z.b. im Angriff, in der Verteidigung und in der Magie.
Danach kann man sich noch ein grafisches Symbol ausw&auml;hlen, durch welches
man im Spiel representiert wird.
Das Spiel selber presentiert sich aus der Vogelperspektive. Mit den Tasten
des Nummernblocks bewegt man sich nun duch seine Umgebung. Es gibt verschiedene
Geb&auml;ude, St&auml;dte und nat&uuml;rlich Landschaften mit Fl&uuml;ssen, W&auml;ldern und Gebirgen. In
den St&auml;dten kann man verschiedene H&auml;ndler aufsuchen, um sich z.b mit Waffen,
R&uuml;stungen oder Proviant einzudecken. Ist man mal knapp bei Kasse, kann man auch
Teile seiner Ausr&uuml;stung versetzen. Auf der Reise durch alte St&auml;dte und dunkle
W&auml;lder begegnet man auch anderen Lebenwesen. Einige sind freundlich, man kann sich
sogar mir ihnen Unterhalten, und sind gern bereit sich der Gruppe anzuschlie&szlig;en.
Andere wiederum trachten einem nach dem Leben. Kommt es zum Kampf, mu&szlig; jedes
Mitglied der Gruppe seine Waffen z&uuml;cken, sofern er welche bei sich tr&auml;gt. Der Kampf
wird in Runden ausgetragen. Nat&uuml;rlich mu&szlig; die Gruppe auch regelm&auml;&szlig;ig ausruhen.
Dabei sollte man immer genug Proviant bei sich haben, und wenn m&ouml;glich ein Mitglied
Wache schieben lassen. Es kommt n&auml;mlich auch vor, da&szlig; man w&auml;rend des Schlafes
&uuml;berrascht wird. Hat man keine Lust mehr zum spielen, kann man sich auch selber
Abenteuer basteln. Man bastelt sich einfach verschiedene Karten aus vorgefertigten
Grafiken zusammen, und schon hat man seine Spielumgebung. Freundliche und gegnerische
Lebewesen mu&szlig; man noch plazieren, genau wie einige Items, wie Schwerter oder R&uuml;stungen.
Um Gespr&auml;che mit anderen Personen zu erm&ouml;glichen, wurde in Silver eine eigene
Programmiersprache eingebaut. So werden komplexe Gespr&auml;che zum Kinderspiel. F&uuml;r
eine leichte Erschaffung von solchen computergesteuerten Lebewesen gibt es zus&auml;tzlich
noch den Editor OSCAR. Mir ihm kann man ganz leicht solche Lebewesen zum Leben erwecken.

<H3>Fazit:</H3>

<P>
Silver ist ein komplexes Rollenspiel-System, da&szlig; auch Spa&szlig; macht. Nur die
Dokumentation zum erstellen eigener Abenteuer k&ouml;nnte noch viel besser sein.
Das einzige was mich noch wundert, wieso braucht man f&uuml;r 32 farbige
Grafiken AGA ? Ein Amiga mit ECS-Chipsatz kann ebenfalls bei einer Aufl&ouml;sung von
640 x 256 Punkten 32 Farben darstellen. Nur Amigas mit OCS schaffen das nicht.
Aber sonst ist Silver zu empfehlen.

<P><STRONG>Quelle:</STRONG>

<P>
<TABLE BORDER=0>
<TR><TD>Aminet unter</TD><TD>/game/role/Silver_1.lha</TD><TD> - 68000er Version</TD></TR>
<TR><TD></TD><TD>/game/role/Silver_2.lha</TD><TD> - 68020er Version (braucht aber Silver_1.lha)</TD></TR>
<TR><TD></TD><TD>/game/role/OSCAR.lha</TD><TD> - neue Version von OSCAR</TD></TR>
</TABLE>

<BR>
<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="games04.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="prev01.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

