<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Spieletest: Flyin'High Data Disks &amp; Patch</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/gtest.gif" ALT="Spieletest" BORDER=0 WIDTH=310 HIGHT=61>
</CENTER>

<H1>Flyin'High Data Disks &amp; Patch</H1>

<P>
<H2>The Data Disks</H2>

<P>
"Flyin'High" mu&szlig; wohl doch ein gr&ouml;&szlig;erer Erfolg gewesen sein, als manch'
einer geglaubt hat, denn jetzt gibt es auch noch 2 Data Disketten mit
neuen Levels und neuen Modulen.

<P>
Um das Data Pack zu nutzen braucht man die Vollversion von "Flyin'High"
und diese mu&szlig; auf der Festplatte installiert sein. Nun, das kopieren
von CD auf HDD dauert nun wirklich nicht lange, so da&szlig; dies kein Problem
darstellen sollte.

<P>
Das Data Pack beinhaltet, wie gesagt, 2 Disketten mit 2 neuen Welten
(Laval und Space = 10 neue Strecken) und 4 neuen Modulen.

<P>
Nach dem Start h&ouml;rt man schon neue Kl&auml;nge, ein ganz anderes Modul kam
zum Einsatz, welches melodisch und (einigerma&szlig;en) langsam ist.

<P>
Nach den Einstellungen ("Teste Strecke") suchte ich mir eine Welt aus und
los gings. Ich begann mit der Lava-Welt.
Hui... wirklich gut gemacht, da&szlig; ganze. Man f&auml;hrt unter Totenk&ouml;pfen durch
springt wieder sch&ouml;n hoch und kann allerhand Items einsammlen. Die Strecken
sind in "rot" gehalten, wie das bei Lava so &uuml;blich ist und sehen ziemlich
gut aus. Nachdem ich auch die dritte Strecke absolviert hatte, wechselte
ich kurzerhand in die "Space-Welt".

<P>
Auch diese wurde sehr gut umgesetzt. Meteoriten versperren dir ein Teil
der "Stra&szlig;e" oder schweben &uuml;ber ihr. Es kommt einem vor, als w&uuml;rde man
auf irgendeiner Schnellstra&szlig;e durchs All fahren, da &uuml;berall Planeten oder
andere Dinge zusehen sind, die man im allgemeinem im All vorfindet!
Selbst im Space Level kann man auf Planeten fahren und sich zwischen
Hochh&auml;usern hei&szlig;e und spannende K&auml;mpfe liefern. Die abstrakten Grafiken
kommen sehr gut zur Geltung und es macht echt Spa&szlig;, am Abgrund langzu-
fahren und neben sich das All zusehen! Echt Klasse.

<P>
Begleitet werdem die neuen Strecken mit Techno oder Rock Sound, welche gut
ins Geschehen passen.

<P>
Alles in allem, ist die Data Disk(s) sehr zuempfehlen, da nicht nur neue
Strecken sondern auch neue Module und Einstellungen (in Verbindung mit dem
Patch) vorhanden sind!

<P>
Negativ ist aber, da&szlig; sich die alten Module nicht ganz mit den neuen
Strecken vetragen. Denn leider h&ouml;rt die Musik ab und zu (in den neuen
Levels) auf und beginnt dann erst nach 3-5 Sekunden weiterzuspielen.
Das ist das einizig negative.

<P>
Die Data Disketten sind bei APC&amp;TCP f&uuml;r 29.95 DM zubekommen! Andere
H&auml;ndler werden sie aber sicher auch anbieten!

<P ALIGN=CENTER>
<IMG SRC="../images/fhdd.gif" ALT="Wertung" BORDER="0" WIDTH="422" HEIGHT="162">
 


<H2>The Patch</H2>

<P>
Die Kritik der Leser scheint geholfen zu haben, denn seit k&uuml;rzester Zeit
gibt es endlich einen Patch f&uuml;r "Flyin'High", welcher - so APC&amp;TCP -
die Steuerung stark verbessert, und bei dem der Schwierigkeitsgrad
einstellbar ist. Ob das alles stimmt, werden wir Euch gleich verraten... !

<P>
Als erstes installierte ich den Patch, was aber -dank Installsript- sehr
schnell geht. Als das erledigt war, bootete ich neu und startete das Spiel.
Nun ja... Ver&auml;nderungen gab es nicht gleich zusehen. Ich klickte auf
"Neues Spiel starten" und da waren sie... die neuen Einstellm&ouml;glichkeiten
... nun ja... es war nur eine, aber die wichtigste. Hier konnte man n&auml;mlich
den Schwierigkeitsgrad einstellen, welcher im Original Spiel sehr hoch
angesetzt war. Man hat die Wahl zwischen "Schwach, Durchschnittlich und
Schwer". Hat man einen ausgew&auml;hlt und das Rennen dann gestartet, f&auml;llt
schon nach mindestens 1 Runde die Ver&auml;nderung auf, entweder ist man schon
erster ("Schwach" eingestellt), oder man k&auml;mpft sich schnell auf den ersten
Platz vor, oder man versagt kl&auml;glich ("Schwer" eingestellt), also hier
merkt man die Ver&auml;nderung. Das ist sehr positiv. Als zweites wird einem
sicherlich auch die leichte Steuerung auffallen, diese ist stark verbessert
worden, man braucht jetzt nicht mehr der Joystick mit voller Kraft
nach links/rechts dr&uuml;cken um an einem Hindernis vorbeizukommen, sondern
kann mit einem leichten "Druck" sein Ziel erreichen. Weiterhin kann man die
Joystick Steuerung einstellen. Man kann w&auml;hlen, ob man mit dem Feuerknopf Gas
geben oder schie&szlig;en m&ouml;chte. Und anderesrum auch, ob man mit dem Joystick nach
vorn (dr&uuml;cken) Gas geben oder schie&szlig;en will. Die Einstellung ist recht gut, weil
es die Hand nicht so belastet, (wenn man mit dem Feuerknopf Gas gibt) als wenn
man immer starr den "Kn&uuml;ppel" nach vorn dr&uuml;ckt!

<P>
Alles in allem ist dieser Patch sehr hilfreich! Man bekommt ihn kostenlos
aus dem Aminet, von diversen CD (vorangig APC&amp;TCP CD`s), aus der Support
Mailbox von APC&amp;TCP oder gegen Leerdisk und R&uuml;ckporto!

<P>
Mit diesem Patch macht "Flyin'High" noch mehr Spa&szlig;, da wie gesagt, das
gro&szlig;e Steuerungs Problem ausgemerzt wurde. Alle K&auml;ufer von FH sollten sich
diesen Patch unbedingt zulegen! 

<P>
<H3>Fazit:</H3>

<P>
"Flyin'High" wird durch die Daten Disks und dem Patch sehr interessant
und sollte auch nochmal zum Kauf des Originals anreizen (wer es noch
nicht hat!).Die einfache Steuerung, die neuen Module und Levels, machen
echt Spa&szlig; und locken richtig zu einem "Flyin'High" Cup... allein oder
mit Freunden.

<P>
<EM><STRONG>- Empfehlenswert -</STRONG></EM>

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="games02.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="games04.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

