<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Spieletest: Uropa 2</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/gtest.gif" ALT="Spieletest" BORDER=0 WIDTH=310 HIGHT=61>
</CENTER>

<H1>Uropa 2</H1>

<P>
Neu oder alt? Nun das ist bei diesem Spiel die Frage. Vulcan Software
hat k&uuml;rzlich bekanntgegeben, dieses Game zuver&ouml;ffentlichen und f&uuml;r ca.
90 DM zuverkaufen. Nun, aber das Spiel gibt es doch schon! Und wesent-
lich billiger! Laut Copyright von Austex Software, gibt es dieses Game
schon seit 1996! Mmhhhmmm !???!
 
<P>
"Uropa2" umfa&szlig;t derzeit 7 MB und ben&ouml;tigt keine Festplatte (wenn man
die "VAK Action..." sein eigen nennt) und l&auml;uft mit 2 MB Ram.
Gesteuert wird das Spiel &uuml;ber die Tastatur, Maus und Joystick.

<P>
Das Intro von Uropa2 (welche grafisch mehr &uuml;berzeugt, als das Spiel)
versetzt einen in die richtige Stimmung und erkl&auml;rt das Spiel.

<H2>Die Handlung:</H2>

<P>
Uropa ist ein Mond in der N&auml;he des Jupiter. Derzeit befinden sich 2209 Kolonisten
auf Uropa. Nach der Erkundung des Mondes, wurde ein Verteidigungssystem von der
Intercop errichtet.

<P>
Intercop wurde gewarnt, da&szlig; von der dunklen Seite des Jupiters die Streitkr&auml;fte
von Kapone, dem B&ouml;sen, angreifen w&uuml;rden. Daraufhin versetzten die Kolonisten
die Basis in Alarmbereitschaft. Und nicht lange dauerte es, bis Kapone wirklich
angriff.

<P>
Die Kolonisten bereiteten daraufhin ihre Evakuierung vor.

<P>
Von der Intercop wurden drei Kriegsphasen entschieden, Phase 1 konnte
erfolgreich abgeschlo&szlig;en werden, doch nun folgt Phase 2...

<P>
Naja... schlauer bin ich dadurch auch nicht gerade geworden. 
Im Grunde ist die Geschichte sowieso nebens&auml;chlich, man mu&szlig; alle
Gegner t&ouml;ten... SIEGEN! Als Robotor rast man durch die einzelnen
G&auml;nge der Basis und mu&szlig; halt alle Gegner besiegen. Man hat auch
die M&ouml;glichkeit in einem "Fahrzeug" auf der Planetenoberfl&auml;che
auf Jagd zugehen und alles niedermetzeln was einem in die Quere
kommt.

<P>
Uropa 2 ist ein Action Game mit Adventure Elementen mit einem
isometrischen 3D-Look, wie wir es schon von "UFO-Enemy Unknown"
kennen. Das Spiel ansich ist recht fl&uuml;ssig und die Grafik ist in
Ordnung, haut aber keinen vom Hocker. Die Animationen sind gut,
aber gerade im Kampfmodus auf dem Planeten kommt es einem vor,
als w&uuml;rde man sich durch eine tote Welt k&auml;mpfen, da dort keinerlei
Animationen drin sind, gut "Gegner", wenn man sie so nennen kann,
rasen an einem vorbei und beschie&szlig;en Dich, aber dies geht viel
zuschnell, so da&szlig; man die sie kaum richtig erkennt.

<P>
<H3>Fazit:</H3>
Das Spiel ist nicht schlecht und l&auml;st ab und zu nochmal "Stellar7" (ob
dieses Spiel &uuml;berhaupt noch jemand kennt?, ich habe es vor Jahren mal auf einem
PC gespielt) Stimmung aufkommen. Es kann doch schon f&uuml;r einige Zeit an den
Bildschirm fesseln. Leider wei&szlig;t die von mir getestete Version noch ein paar
Bugs auf, bei mir st&uuml;rzte es &ouml;fters ab oder es ging einfach garnichts mehr!

<P><EM><STRONG>- Interessant -</STRONG></EM>

<P ALIGN=CENTER>
<IMG SRC="../images/urop.gif" ALT="Wertung" BORDER="0" WIDTH="422" HEIGHT="162">

<P>
<H3>Vulcan Software</H3>

<P>
Nun, wenn Vulcan Software diese Game wirklich (nochmal) rausbringen
sollte, und only CD w&auml;re, m&uuml;&szlig;te es schon (dt.) Sprachausgabe, FMV-Sequencen,
AGA / GraKa Unterst&uuml;tzung und mehr Sounds aufweisen, ansonsten w&auml;re diese
Investition (von knapp 90 DM) sinnlos.

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="games01.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="games03.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

