<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Spieletest: Das Tor der Minerva</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/gtest.gif" ALT="Spieletest" BORDER=0 WIDTH=310 HIGHT=61>
</CENTER>

<H1>Das Tor der Minerva</H1>

<P>
"Das Tor der Minerva" ist ein Spiel, da&szlig; einwenig an "MYST" errinnert.
Zu Beginn betritt man einen Park und wenn man nach rechts geht,
gelangt man auf einen H&uuml;gel, wo sich das "Goldene Tor der Minerva" befindet.
Das Ziel des Spieles besteht darin, dieses Tor zu &ouml;ffnen! Doch daf&uuml;r braucht
man 4 verschiedene Schl&uuml;ssel, welche in verschiedenen Welten versteckt sind.
Soviel zur Geschichte.

<P>
Die Steuerung ist genauso wie bei MYST, klickt man nach vorn, geht man vor
und so weiter. Das Inventar wird via Tastatur aufgerufen, was ich aber unhandlich
finde. Gegenst&auml;nde k&ouml;nnen aufgesammelt und genutzt werden.
Vielmehr ist nicht vorhanden. Man trifft keine Personen, so da&szlig; Gespr&auml;che
wegfallen (ich habe jedenfalls keine gesehen!) und auch Hintergrundanimationen
gibt es auch nicht. Man klickt sich praktisch durch "tote"
Screens umd mu&szlig; allerlei R&auml;tsel l&ouml;sen - wem es gef&auml;llt!?!

<P>
Die Grafik ist sehr gut geworden, sie wurden gerendert und wirken sehr
detailgetreu. Die Hintergr&uuml;nde wurden sch&ouml;n gestaltet und langsam
kommt es einem vor, vor einem PC zu sitzen, da die Grafiken immer besser
werden und fast schon PC Standard erreichen. Animationen gibt es auch, 
jedoch braucht man einen schnellen Rechner, da sie ansonsten sehr langsam
ablaufen. 

<P>
Der Sound beschr&auml;nkt sich auf SoundFX. Das &ouml;ffnen von T&uuml;ren oder das
klicken von Schaltern ist meist das einzigste was man h&ouml;rt. Eine direkte
Titelmusik gibt es auch nicht. Hier h&auml;tte man wirklich mehr machen
k&ouml;nnen.

<P>
»Realisiert wurde "Das Tor der Minerva" von dem Autor Stephan Stoske an
einem Power Macintosh 7500/100 mit 64MB Speicher, in rund 3 Monaten von
der Konzeption &uuml;ber die Modellierung der 3D-Welten bis zur Programmierung
des fertigen Spiel's mittels Macromedias Director. Das &Uuml;bungsprojekt
enstand haupts&auml;chlich, um einen &Uuml;berblick &uuml;ber Zeitplanung, Rechenprobleme
und Projektaufteilung bei der Realisierung von 3D-Adventures zu
bekommen.«... so erfuhr ich aus beigelegten "readme"-File.

<P>
Das knapp 86 MB gro&szlig;e Adventure ist auf der APC&amp;TCP Volume 5 enthalten.
Das Spiel an sich ist Public Domain und frei kopierbar, was aber kaum
jemand machen wird, da es ja einwenig gro&szlig; ist!

<P>
Ansonsten macht das Spiel eigentlich eine Menge Spa&szlig;. Zwar sind die R&auml;tsel
etwas knifflig, aber besser so, als wenn man "Das Tor der Minerva" an einem
Tag oder in ein paar Stunden durchgespielt.

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR><TD>
<TABLE BORDER BGCOLOR=#FFFFFF>
<TR><TH COLSPAN=2>System Anforderungen:</TH></TR>
<TR><TH ROWSPAN=3>Minimal:</TH></TD>
<TD>Amiga 1200/4000, 4MB Fastram</TD></TR>
<TR><TD>CD32 mit 4MB Fastram</TD></TR>
<TR><TD>Alle Amigas, 68020+ und Grafikkarte,</TD></TR>
<TR><TH ROWSPAN=4>Empfohlen:</TH></TD>
<TD>68040+</TD></TR>
<TR><TD>Zorro3 Grafikkarte</TD></TR>
<TR><TD>8MB freier Fastram</TD></TR>
<TR><TD>4x CDROM</TD></TR>
</TABLE>
</TD>

<TD VALIGN=TOP>
<TABLE BORDER BGCOLOR=#FFFFFF>
<TR><TH>"Minerva" Aufl&ouml;sungen:</TH></TR>
<TR><TD>PAL HighRes, PAL HighRes Interlace</TD></TR>
<TR><TD>NTSC HighRes, NTSCS HighRes Interlace</TD></TR>
<TR><TD>DoublePAL HighRes Flimmerfrei</TD></TR>
<TR><TD>Multiscan Productivity</TD></TR>
</TABLE>
</TD></TR></TABLE>

<BR>
<P ALIGN=CENTER>
<IMG SRC="../images/mine.gif" ALT="Wertung" BORDER="0" WIDTH="422" HEIGHT="162">

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="gnews01.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="games02.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

