<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Mal in eigener Sache </TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/atintern2.gif" ALT="AT-Intern" BORDER=0 WIDTH=292 HIGHT=48>
</CENTER>

<H1>Mal in eigener Sache!</H1>

<P>
Die Amiga Times bekommt langsam eine feste Leserschaft, was uns freut
und vorallem stark motiviert. Viele Glauben, da&szlig; wir unbeachtet bleiben
und irgendwann verschwinden... FALSCH GEDACHT!!!
 
<P>
Wir bekommen viele Emails mit Lob und Kritik! Wir nehmen alles ernst
und antworten zu 150 %! Die User sind (denk ich mal) zufrieden und das
freut uns umsomehr. Ich m&ouml;chte hier nicht rumschleimen oder arrogant
wirken. Nein das w&auml;re sinnlos....
 
<P>
Jedoch mu&szlig; auch gerade bei dem kritisieren mal etwas klargestellt
werden. Als erstes, wir nehmen jede Kritik an und k&ouml;nnen auch einiges
Vertragen (obwohl ich kaum noch Taschent&uuml;cher habe!), aber einige
Grunds&auml;tzliche Dinge m&uuml;ssen jedem Kritiker klar sein.
 
<P>
<OL>
<LI>Wir beachten jede Kritik, jedoch mu&szlig; sich jeder darin im klaren sein,
    das wir nicht unser Konzept bzw. Mag umstellen, wegen <STRONG>einem</STRONG>
    User, der kritisiert!</LI>
<P>
<LI>Emails mit Inhalten wie:"...wollt Ihr nicht lieber ein anderes Mag
    unterst&uuml;tzten..." sind unangebracht! Jede neue Zeitung bringt irgendwie
    auch neue Ideen, neue Ansichten und M&ouml;glichkeiten. Jedes neue Mag belebt
    und erfrischt den Markt. Wir wollen uns keinem bestehenden Mags
    anschliessen, da wir einiges sagen bzw. noch sagen werden, was andere
    Mags nie tun w&uuml;rden! Es gibt auch vieles mehr, was wir bzw. ein
    neues Mag anders macht oder vorhatt! Au&szlig;erdem steckt viel Arbeit in
    einen Mag, was die mei&szlig;ten nicht wissen und die soll nicht umsonst gewesen
    sein. Im Endeffeckt, hat doch der User "den Spa&szlig;"... mehr Mags, gr&ouml;&szlig;ere
    Auswahl, unterschiedliche Auffassungen u.v.m.! Also solche Emails sollte
    nicht den Weg in unsere Redaktion finden!</LI>
<P>
<LI>Leider gab es in der Vergangeheit einige Probleme mit unseren Guides.
    Daran wird gearbeitet, und vieles ist schon getan worden. Ein Tool wurde
    eigens f&uuml;r die AT entworfen, damit auf IconX verzichtet werden kann, was
    Probleme bereitet haben soll.
    Daf&uuml;r m&uuml;&szlig;en aber auch unsere Leser etwas in Kauf nehmen. Wir k&ouml;nnen nicht
    auf A500/Kick1.3/1MB R&uuml;cksicht nehmen! Vorausgesetzt wird mindestens Kick
    2.04 oder h&ouml;her f&uuml;r die AmigaGuide Version, zwar wird auf AGA Grafik
    verzichtet, aber das sollte doch drin sein! Die HTML Version l&auml;uft auf
    allen Amiga`s, auf denen ein WWW Browser (IBrowse &amp; Voyager empfohlen)
    startbar ist!</LI>
<P>
<LI>Kritiken &uuml;ber unser Layout werden gerne angenommen, aber ein-zwei Tage
    vor der Ver&ouml;ffentlichung, werden diese nicht mehr ber&uuml;cksichtig, da wir
    in dieser Zeit sowieso unter Stre&szlig; stehen! Du kannst aber auch "ein
    Layout" entwerfen und uns zusenden, denn wir sind &uuml;ber jede Hilfe
    froh!</LI>
</OL>
 
<P>
Mehr ist dazu nicht zusagen, nur da&szlig; Du mal bescheid wei&szlig;t!
 
<P>
Ansonst bekommen wir immer &ouml;fter positive Mails und unser Mailbox Support wird
auch mehr und mehr in Anspruch genommen! Unser Abo ist weiterhin m&ouml;glich und
auch weiterhin kostenlos, nur eine Email mit Versionsangabe senden!
 
<P>
Lob kann jeder an uns schicken, Geschenke, Backwaren oder Computer werden
gerne entgegengenommen. Schleim(ereien) vertragen wir recht viel, da wir
uns auch regelm&auml;&szlig;ig Waschen, hat dieser keinen schlechten Einflu&szlig; auf uns!
 
<P>
<H2>Die AT-Homepage!</H2>

<P>
Also, es ist nicht so, wie bei anderen Homepages, das anfangs etwas neues
erscheint (neuste Ausgabe) und dann auch schon wieder schlu&szlig; ist!
Ich bin schon &ouml;fters auf Hompeages gegangen und habe auch nach Wochen keine
Neuigkeiten mehr erfahren, es gab keine Ver&auml;nderungen!

<P>
So ist das bei uns nicht, es ist fast jede Woche etwas neues drauf, denn
sobald es wieder wichitge Sachen gibt, erscheint dies zuerst auf unserer
Homepage und bei Bedarf in der n&auml;chsten Ausgabe! Also ein Besuch lohnt sich
immer! Falls jemand Werbung macht, erscheint diese dann auch meist 1-2 Tage
sp&auml;ter auf unserer Homepage! Also... "Homepage-Pflege" nehmen wir sehr ernst!!!

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="help01.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="int02.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

