<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - An Firmen, Mailboxen und Clubs </TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/atintern2.gif" ALT="AT-Intern" BORDER=0 WIDTH=292 HIGHT=48>
</CENTER>

<H1>An alle Firmen, Distributer, Versandh&auml;user, Computerclubs &amp; Mailboxen!!!</H1>

<P>
<STRONG>Sehr geehrte Damen und Herren,</STRONG>

<P>
Sie werden es sicherlich auch schon mitbekommen haben, Amiga Zeitschriften
verlassen nach und nach den Markt und wir User m&uuml;ssen uns notgedrungen neue
Mags am Kiosk suchen. Im Internet sieht dies wieder ganz anders aus.
Hier gibt es allerhand neue und alte Magazine, die gro&szlig;e Nachfrage bei den
Lesern finden. Jedoch ist es auch f&uuml;r uns, von der Amiga Times, recht
schwer gerade im Anwendungs- und Spielebereich zuberichten, da auch wir
kaum an neue Software kommen, was einerseits daran liegt das wir ein
Freeware-Mag sind und somit alle Kosten die bei einer Ausgabe entstehen
(zwischen 50 DM und 150 DM!!!) selber tragen und andererseits dadurch kein
Geld mehr da ist, um auch noch die neuste Software zukaufen.
Im Hardwarebereich sieht es da nicht anders aus.
Wir kaufen zwar ab und zu neue Software und Hardware, aber trotzdem sind
wir meist auf Ger&uuml;chte und Demos angewiesen, doch Sie k&ouml;nnen das &auml;ndern.
Unterst&uuml;tzen Sie ein aufstrebendes Magazin welches schon jetzt
(nach der zweiten Ausgabe) einen relativ guten Erfolg verbuchen kann.
Die Statistiken haben uns &uuml;berzeugt, denn schon nach zwei Wochen waren
&uuml;ber 550 User auf unserer Homepage, unsere Supports werden regelm&auml;&szlig;ig in
Anspruch genommen und unser Abo l&auml;uft auch recht gut. Nutzen Sie dies,
um Ihre Produkte an die K&auml;ufer zu bringen, werben Sie »KOSTENLOS« bei
uns!!! Laut allen anderen Ger&uuml;chten und Fakten welche wir schon in
&auml;lteren Ausgaben verbreitet haben, k&ouml;nnen Sie absofort in » 3 « der
kommenden Ausgaben »KOSTENLOS« bei uns werben! Danach werden wir aber
(gezwungenderma&szlig;en) einen kleinen Beitrag von Ihnen verlangen, welcher
aber unter der 20 DM Grenze (f&uuml;r einen ganzen Link) liegen wird.

<P>
Nat&uuml;rlich freuen wir uns &uuml;ber jede Einsendung von Testexemplaren und werden
diese nat&uuml;rlich auf jedes Byte pr&uuml;fen. Auch &uuml;ber Hardwareeinsendungen
freuen wir uns und werden auch diese sehr genau testen und dann einen
umfassenden Bericht schreiben. Firmen die uns (regelm&auml;&szlig;ig) mit
Software oder Hardware versorgt(en), werden immer KOSTENLOS werben
k&ouml;nnen und bekommen auch einen Link zu ihrer Homepage! Wir glauben an
Sie und wir freuen uns &uuml;ber jeden neuen Hersteller, der den Amiga
unterst&uuml;tzen will.

<P>
<STRONG>An die Computerclubs und Mailboxen!</STRONG>

<P>
Sie k&ouml;nnen bei uns kostenlos f&uuml;r Ihre Box/Ihren Club werben und werden
zuk&uuml;nftigt keinen Pfenning bezahlen m&uuml;&szlig;en. Wir w&uuml;rden uns aber
freuen, wenn sich Mailboxen dazu entschlie&szlig;en, f&uuml;r die Amiga Times
ein Support Brett einzurichten, auf welchen dann die bereits bestehenden
und die neusten Ausgaben verf&uuml;gbar sind.

<P>
Ich danke Ihnen f&uuml;r Ihre Aufmerksamkeit.

<P>
Ihr Mario Nitschke

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="int03.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="int05.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

