<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Preview: Foundation</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/prev.gif" ALT="Preview" BORDER=0 WIDTH=251 HIGHT=48>
</CENTER>

<H1>Foundation - Aminet Demo im Test</H1>

<P>
"Foundation", das neue Stratgiespiel von Sadeness Software, sorgte schon
vor Monaten f&uuml;r Furore, da damals ein Editor namens Battlekraft erschien,
der eigentlich schon ein kleine Demoversion von "Foundation" war. So
k&ouml;nnte man es jedenfalls bezeichnen. Dieser Editor, erinnerte stark an PC
Spiele wie "Siedler2" oder "Warkraft" und konnt schon in dieser "Version"
begeistern. Nun nicht mehr lange dauert es und dieses Game wird auch seinen
Platz in den Verkaufsregalen finden.

<P>
Doch was ist "Foundation" eigentlich? "Foundation" kann man getrost als
Siedler 2 bezeichnen, da es vom Aufbau fast gleich ist. Ich betone
»fast«, denn es bietet allerhand unterschiede.

<P>
Die Story: Nun ja eine richtige Story gibt es noch nicht, nur ein kleines
Info. Aufgebaut ist Foundation wie Colonization und Siedler. Man mu&szlig;
Geb&auml;ude bauen, Nahrung schaffen und sein Land verteidigen. Mehr kann ich
zum jetzigen Zeitpunkt noch nicht sagen! 

<P>
Kommen wir jetzt zum Spiel!<BR>
Hat man erstmal die 5 Archive runtergeladen, was bei ca. 8 - 9 MB dauern
kann, kann es nach einem kurzen entpacken auch gleich losgehen. 
Achso... zum download noch etwas, wer das Spiel noch nicht gespielt hat,
es aber unbedingt haben will, dem rate ich es sich aus einer Mailbox
zu laden (in der FANTASY BBS ist es zum Bsp.), da dies viel schneller
geht, als aus dem Aminet, und somit viel g&uuml;nstiger f&uuml;r Dich wird.
Das aber nur nebenbei. Kommen wir jetzt wieder zum Spiel.
Nachdem es entpackt und das "Foundation"-Icon angeklickt wurde, erscheint
erstmal ein kleines Shellfenster, wo Deine Config getestet wird.
Durch ein Update, welche nebenbei erschien (knapp 300 KB gro&szlig;) kann man
nun seine Screenmode gr&ouml;&szlig;e einstellen. Ich habe mal die Ausl&ouml;sung 720x550
(VGA Monitor) benutzt und es sieht einfach super aus, leider ist es aber
vieeel zulangsam, weshalb ich nach einem Neustart die Aufl&ouml;sung 320x256
nutzte. 
Nach einer kurzen Ladepause erscheint schon das Hauptmen&uuml;, allerdings
sind die meisten Optionen noch gesperrt. Da ich gleich losspielen will,
klicke ich auf "Start" und es kann beginnen. Nicht allzulange dauerte es
bis der Spielscreen erschien. Das erste was mir da einfiehl, als ich
den Screen sah war,... "aha... ein Siedler-Clone". Zwar ist dies indirekt
richtig, doch "Foundation" ist viel mehr als nur ein Clone. Aufgabe der
ersten Mission ist es, 3 neue Geb&auml;ude zuentwickeln. Dies ist schon der
erste positive Unterschied zwischen "Siedler" und "Foundation", denn so
ist der Spieler von Anfang an gefordert und steigt gleich voll ins Geschehen
ein. Man kann zuerst 2 Geb&auml;ude bauen, einmal ein Forsthaus und eine R&uuml;stung,
besser gesagt eine Festung zur Verteidung. Hat man eines der beiden erstmal
irgendwo hingesetzt, dauert es nicht lange, bis ein kleiner ... nein... kein
Siedler, sondern ein Zauberer aus dem Hauptgeb&auml;ude herauskommt. Ist er bei
dem "Grundstein" angekommen, fuchtelt er ein bischen mit seinen H&auml;nden rum und
schon ist das Geb&auml;ude fertig. Dies ist schon eine wirkliche Erleichterung, da
eine eventuelle Bauzeit somit wegf&auml;llt und man gleich mit dem fertigen Geb&auml;ude
arbeiten kann. Nicht lange dauert es, bis man aufgefordert wird, mehr Stahl,
Wasser und Nahrung anzuschaffen. Dies zul&ouml;sen macht einfach Spa&szlig; und sorgt f&uuml;r
stundenlange Motivation!

<P>
Insgesamt gibt es 3 Levels/Missionen, die man erfolgreich bestehen sollte.
"Foundation" wird sicherlich wieder ein voller Erfolg im Genre "Strategie"
werden und ich glaube das Sadeness Software damit ein guter Start in den
Amiga Bereich m&ouml;glich ist, zumahl auch schon "onEscapee" sehr &uuml;berzeugend
wirkt(e).

<P>
Doch leider gibt es auch negatives zuberichten.
Die Demoversion hat noch allerlei Kinderkrankheiten, so st&uuml;rtzte mir
der Rechner fast bei jedem spielen ab und hat mir meine Festplatte
einmal ziemlich durcheinander gebracht. Dies wurde aber durch ein
k&uuml;rzlich erschienene BugFix behoben. Weiterhin finde ich am Demo negativ,
da&szlig; es noch keinen InGame-Sound gibt und es sich meist auf SoundFX
(V&ouml;gel u.a.) beschr&auml;nkt. Dieser ist zwar gut, kann aber keine richtige
Musik ersetzten.
Die Animationen waren noch ziemlich langsam, zwar sollte man schon
mindestens einen 68030 mit viel RAM haben, aber etwas schneller k&ouml;nnte
es schon sein. Mir ist auch aufgefallen, da&szlig; die Figuren und Geb&auml;ude,
sowie alles andere (Wasser, B&auml;ume, Wiese u.a.) noch sehr pixelig sind
und somit nicht gerade sch&ouml;n aussehen, man bekommt das zwar mit dem
richtigen Screenmode (je gr&ouml;&szlig;er, desto besser) hin, aber dadruch wird
das Spiel langsamer.

<P>
Wie gesagt, ein AGA Rechner wird ben&ouml;tigt, sowie mindestens ein 68030
Prozessor mit 30 MHZ (zu empfehlen ist aber mehr) und mit viel RAM.
"Foundation" soll auf CD erscheinen, was auch anzuraten ist, da das Demo
ja schon 12 MB gro&szlig; ist und noch nicht mal alle Features, Levels und
Sounds hat! Tja, ... AUFR&Uuml;STEN!!!

<P>
Ansonsten, sieht man mal von den "Krankheiten" ab, ist das Spiel einfach
super und f&uuml;r Strategen ein Mu&szlig;! Seit langen gibt es wieder mal ein
Strategie Spiel, bei dem sich das Warten lohnt! 

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="games01.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="prev02.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

