<HTML>
<HEAD>
<TITLE>AMIGA TIMES 03/97 - Schlu&szlig;wort</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/ende2.gif" ALT="Schlu&szlig;wort" BORDER=0 WIDTH=344 HIGHT=50>
</CENTER>

<H1>Ein abschlie&szlig;ender Kommentar!</H1>

<P>
Tja... schon zuende, das ist die "letzte Seite"! F&uuml;r uns hei&szlig;t das eine
kurze Pause einzulegen und wenn diese 5 Minuten rumm sind, wieder
ab in den "Redaktionssessel" und an Ausgabe 4 arbeiten. Ihr habt es da
nat&uuml;rlich besser! Ihr m&uuml;&szlig;t nur 2 (kurze) Monate warten und dann erscheint
schon wieder eine Ausgabe.

<P>
Ich denke, qualit&auml;tsm&auml;&szlig;ig haben wir auch wieder etwas zugelegt und k&ouml;nnen
eigentlich mit gutem Gewissen diese Ausgabe abschlie&szlig;en.

<P>
Eigentlich war ich ganz sch&ouml;n erstaunt als ich die "Amiga Times 3/97"
packte um ins Aminet zuladen, denn ganze 239 KB (Guide) war sie gro&szlig;, wenn man
bedenkt, das unsere 2 Ausgabe nur 135 KB (ohne Story) gro&szlig; war, ist dies
schon ein gewaltiger Schritt nach vorn.  

<P>
Ich hoffe, da&szlig; unsere dritte Ausgabe Euch gefallen hat, und nochmals zeigte,
da&szlig; wir es mit der "Amiga Times" sehr ernst meinen!

<P>
Im Verh&auml;ltnis, sind ja unsere letzen Ausgaben doch schon recht "voll"
gewesen und damit das so bleibt, hoffe ich, da&szlig; noch mehr User/innnen
sich zur Mitarbeit bereiterkl&auml;ren!

<P>
Leider gibt es auch etwas negatives zuberichten, denn leider... leider
mu&szlig; unser Grafiker (Matthias) aus beruflichen Gr&uuml;nden unser Team
verlassen, was ich recht schade finde. Trotzdem Matthias, Danke f&uuml;r
Deine (spontane) Mitarbeit und vielleicht liest man mal wieder was
von Dir (eMail)!

<P>
Ich m&ouml;chte abschlie&szlig;end noch auf etwas hinweisen. Euch wird sicher
aufgefallen sein, da&szlig; ein Text bzw. ein paar Zeilen aus Texten etwas gegen
"phase5" gerichtet sind. Ich pers&ouml;nlich und die Redaktion hat nichts
gegen "phase5" ansich, nur deren Strategie und vorallem Preise sind nicht
vertretbar und reizen bzw. reizten einfach dazu, einen Artikel zuschreiben
der dies darlegt, indem mal eine Meinung gesagt wird und der Euch
(hoffentlich) zum nachdenken anregt! Also... nicht das jetzt einer denkt
wir haben etwas gegen "phase5" und wollen sie runtermachen! Das stimmt
n&auml;mlich nicht.

<P>
Bedanken m&ouml;chte ich mich noch bei allen Mitarbeitern und hoffe das die
Zusammenarbeit weiterhin so gut klappt wie bis jetzt. Ich freue mich
auch dar&uuml;ber das sich noch drei User gefunden haben, welche uns
unterst&uuml;tzen m&ouml;chten.

<P>
Bis zum n&auml;chsten mal... bye bye!

<P ALIGN=CENTER><EM><STRONG>Mario</EM></STRONG>

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="impressum.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><IMG SRC="../images/next1.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

