<HTML>
<HEAD>
<TITLE>AMIGA TIMES 03/97 - APC&amp;TCP - CD Volume 5 im Test </TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/softw2.gif" ALT="Software" BORDER=0 WIDTH=291 HIGHT=50>
</CENTER>

<H1>Die APC&amp;TCP Volume 5-CD ist da...</H1>

<P>
Nicht lange dauerte es, bis die neue APC&amp;TCP CD den Weg in unsere Redaktion
fand und darauf wartete getestet zu werden. Nun diesen Wunsch erf&uuml;llen wir
jeder CD und so startete ich meinen Rechner, legte die CD ein und lies mich
&uuml;berraschen...
 
<P>
Kaum hatte ich das APC&amp;TCP Volume 5 Icon angeklickt, wurde ich nach einem
kurzen Blick auf die obere Infoleiste positiv &uuml;berrascht. Den satte 636 MB
fanden auf der CD Platz. Unterteilt ist die CD in verschiedene Unterver-
zeichnisse, u.a. Games, Text und Multimedia.
 
<P>
Da es nicht gerade gut ist, eine Sammel CD im Gesamten zu testen und zu
bewerten, werde ich jedes einzelne Verzeichnis auf "Tauglichkeit" pr&uuml;fen.
Die Reihenfolge werde ich wie bei der CD beibehalten...
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>Copyright</H2>

<P>
Falls jemand denkt dieses Verzeichnis w&auml;re mist, da nur wieder Copyrights
und Danksagungen drin sind, der hat sich get&auml;uscht. Den dem Copyright Verzeichnis
liegen drei Vollversionen von Programmen bei, da w&auml;ren NL-Copy, NL-Toolbox und
Textwandler.
 
<P>
<STRONG>NL-Copy</STRONG> ist ein wirklich gutes Kopierprogramm, welches
unterschiedliche Treiber unterst&uuml;tzt und sehr leicht zubedienen ist.

<P>
<STRONG>NL-Toolbox</STRONG> ist eine kleine Sammlung von Tools, wie ein Musicprogramm
oder Programmmaster.
 
<P>
Und mit <STRONG>Textwandler</STRONG> kann man verschiedene Texte in andere Formate
bringen z.B.: Amiga in MS-Dos oder umgekehrt, sowie Amiga in Atari ist m&ouml;glich.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des Copyright-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF><IMG SRC="../images/wert01.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>85 %</STRONG></TD</TR>
</TABLE>
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>NoCover</H2>

<P>
Diesem Verzeichnis liegen alle NoCover Ausgaben von 1 - 44 bei. Wem einige
fehlen findet sie hier sicher, aber leider sind schon auf vielen CD-ROM`s
diese Ausgaben erschienen und somit gibt es kaum etwas neues, da&szlig; einzige was
an diesem Verz. noch interessant ist, ist die Tatsache, da&szlig; in den NoCover
Ausgaben immer viele Spielecheats beiliegen und diese sehr n&uuml;tzlich sein
k&ouml;nnen, wenn man gerade bei alten Spielen Probleme hat.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des NoCover-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF><IMG SRC="../images/wert02.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>80 %</STRONG></TD</TR>
</TABLE>
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>AmigaGadget</H2>

<P>
Dieses Verz. enth&auml;lt die AmigaGadget Ausgaben 26 - 32. F&uuml;r jeden Amiga Mag
Fan ist auch dieses Verz. ein genu&szlig;, wer die Ausgaben aber schon hat, bekommt
auch hier noch mehr geboten. Das Magazin ansich ist gut und man erf&auml;hrt
relativ viel neues, aber im Aminet, sind die neusten und alten Ausgaben sowieso
drin, so da&szlig; dieses Verz. nur f&uuml;r Amiga`s ohne Modem/ISDN interessant sein
d&uuml;rfte.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des AmigaGadget-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF><IMG SRC="../images/wert02.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>80 %</STRONG></TD</TR>
</TABLE>
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>Nordlicht</H2>

<P>
Unterteilt ist dieses Verz. in die Unterverzeichnisse "Listen" und "Intern".
Nun ja bei "Listen" sind eben allen Programme/Spiele/Tools in mehreren Guides
aufgelistet , die zwischen 20 und 700 KByte gro&szlig; sind... wen es interessiert
findet hier die n&ouml;tigen Infos, ansonsten ist dieses Verzeichnis recht lahm
und man beendet schon nach den ersten Zeilen das Guide.
 
<P>
Das Verzeichnis "Intern" beinhaltet die Nordlicht-Intern Guides 1-15.
Nun diese einzelnen Guides sind schon interessanter, da man Hilfen und
wichtige Informationen bekommt. Aber auch in diesen Verzeichnissen, werden
noch mal Nordlichts PD Listen aufgef&uuml;hrt, was ziemlich nerven kann...
nichts gegen Werbung, aber &uuml;bertreiben sollte man es nicht.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des Nordlicht-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF><IMG SRC="../images/wert03.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>69 %</STRONG></TD</TR>
</TABLE>

<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>Multimedia</H2>

<P>
Dieses Verz. enth&auml;lt die Verzeichnisse Picture, Sound und Workbench.
Dem Picture Verz. liegen alle m&ouml;glichen Bilder bei, meist in ".gif" und
".iff". Diese Schublade ist echt super, da jeder der Grafiken mag, hier gut
bedient wird und auf seine Kosten kommt.
 
<P>
Das Sound Verz. ist ebenfalls ein Gl&uuml;cksgriff, zwar sind einige Module
schon alt, aber es sind auch allerlei neue dabei. Und bevor ich es mir
lange aus dem Aminet oder der Mailbox zerre, komme ich mit der CD besser
weg. &Uuml;ber 50 Module sind dabei und mit dem richtigen Programm und guten
Boxen, kann man schon einige Zeit beim h&ouml;ren verbringen.
 
<P>
Das Workbench Verz. ist nur etwas f&uuml;r Leute, die nie mit ihren Icons,
sowie Patterns zufrieden sind. Unz&auml;hlige Icons aller Art und in verschiedenen
Farben (4-256) geben dem User viele M&ouml;glichkeiten, die Workbench aufzupeppen.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des Multimedia-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF><IMG SRC="../images/wert04.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>90 %</STRONG></TD</TR>
</TABLE>
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>Tools</H2>

<P>
Ob Preview oder Public Domain, alles ist enthalten. Ob Demos wie VideoTitler
oder Wildfire und PD Programme wie Madhouse, vieles ist dabei und kann
gut genutzt werden. Viele Tool`s wie Lha, LZX, DMS oder verschiedene
Grafikformate (iff,gif,jpeg) liegen (meist) in der aktuellen Version bei.
Viel kann ich zur Toolsschubalde nicht sagen, da ich gerade mal ein drittel
getestet habe und &uuml;ber 80 Tools/Prg. auf die CD gepresst wurden.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des Tools-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF><IMG SRC="../images/wert01.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>85 %</STRONG></TD</TR>
</TABLE>
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>Games</H2>

<P>
Diese Schublade ist sicherlich f&uuml;r die meisten User die wichtigste, da die
Spiele immernoch eine sehr gro&szlig;e Rolle beim Amiga spielen. Und so freut es
einen umsomehr, das man Verzeichnisse wie Previews, PD und Save sieht.
 
<P>
Als erstes sehe ich mir nat&uuml;rlich das Saves-Verzeichnis an und bin begeistert.
Zu 40 Spielen sind hier Spielst&auml;nde, L&ouml;sungen und Tips vorhanden, die
wirklich helfen. Am besten hat mir ein Spielstand von Biing! gefallen,
da man bei diesem mit knapp 6000 L&uuml;mmel anf&auml;ngt! Weiterhin gibt es Spielst&auml;nde
zu: Ufo, Siedler, Reunion, PizzaConnection, Monkey Island 2, Winzer, Theme Park
und viele viele mehr!
 
<P>
Als n&auml;chstes ist das Preview Verzeichnis dran. "Gerade mal" 50 Demos sind
vorhanden, obwohl die meisten Spiele PD sind. Aber auch Schubladen von
APC&amp;TCP Games kann man finden, doch nach einenm Doppelklick auf die
jeweilige Schublade, wird man schon entt&auml;uscht. Denn leider sind oft nur
Screenshots statt Demos drauf. Auch ein langersehntes Demo zu "Ph&ouml;nix"
kann man nicht bewundern, nur Screenshots die fast alle schon bekannt sind.
Die Demos sind durchnittlich gut bis super, aber Schrott ist auch dabei.
 
<P>
34 PD Spiele findet man im Public Domain Verzeichnis.
Vieles ist schon alt und sorgt kaum noch f&uuml;r Spielspa&szlig;, aber wer PD mag
und nicht viel im Aminet bzw. Internet surft, wird hier im Verh&auml;ltnis
gut bedient, aber ein Hit ist es nicht gerade.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des Games-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF>saves<BR>
<IMG SRC="../images/wert04.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>90 %</STRONG><BR>
preview<BR><IMG SRC="../images/wert05.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>86 %</STRONG><BR>
pd<BR><IMG SRC="../images/wert06.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>84 %</STRONG></TD</TR>
</TABLE>

<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>Text</H2>

<P>
Dieses Verz. ist eine wahre Fundgrube, den ob Cheats, Info`s oder Install-
Hilfen, alles ist enthalten. Sogar ein HTML Cheat mit downloadbaren Archiven
ist enthalten und auch sonst hat dieses Verzeichnis viel zu bieten. Ob ein
Guide &uuml;ber Nirvana oder Heavy Metal... auch Guides &uuml;ber Modems und Bauhilfen
von CPU und so... auch ein Akte X - Guide ist vorhanden und auch &uuml;ber
Multimedia mit dem Amiga wird berichtet. Rund um ein sehr gelungendes Verz.
f&uuml;r jederman!
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des Text-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF><IMG SRC="../images/wert07.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>92 %</STRONG></TD</TR>
</TABLE>
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>InfoDisk</H2>

<P>
Wie der Name schon sagt, ist in diesem Verzeichnis alles rund um den
APC&amp;TCP Computerclub enthalten. Clubantrag, Softwarelistenm Infos,
Adressen und eine Preisliste findet man hier. Nun ja... meiner Meinung nach
w&auml;re dieses Archiv in der Copyright Schublade besser aufgehoben. Ein Wertung
vergebe ich hier nicht, da dies ja nur f&uuml;r Clubmitglieder bzw. die die es werden
m&ouml;chten da ist (denke ich jedenfalls).
 
<P>
<H2><IMG SRC="../images/drawer.gif" BORDER=0 WIDHT=32 HIGHT=32 ALIGN=MIDDLE HSPACE=5>SuchTool</H2>
                                           
<P>
In dieser Schublade ist nur das Programm "CDCat" enthalten und man kann mit
diesem einerseits die neuste APC&amp;TCP Volume (5), als auch &auml;ltere Volumes
durchst&ouml;bern oder direkt per Suchmuster, ein bestimmtes Programm/Spiel/Tool
finden. Nett gemacht, aber meiner Meinung nicht gerade notwendig.
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TD ALIGN=CENTER BGCOLOR=#FF0000><FONT COLOR=#FFFFFF>
<STRONG>Wertung des SuchTool-Verz.:</STRONG></FONT></TD></TR>
<TR><TD ALIGN=CENTER BGCOLOR=#FFFFFF>CDCat<BR>
<IMG SRC="../images/wert05.gif" ALT="Balken" BORDER=0 WIDTH=213 HIGHT=34 ALIGN=MIDDLE>
<STRONG>86 %</STRONG></TD</TR>
</TABLE>

<P>
<HR WIDTH=60% ALIGN=CENTER>

<P>
So und jetzt noch mal alles zusammengefasst:
 
<P>
<TABLE BORDER ALIGN=CENTER>
<TR><TH>Verzeichnisname</TH><TH>Wertung in %</TH></TR>
<TR><TD>Copyright</TD><TD ALIGN=CENTER>85</TD></TR>
<TR><TD>NoCover</TD><TD ALIGN=CENTER>80</TD></TR>
<TR><TD>AmigaGadget</TD><TD ALIGN=CENTER>80</TD></TR>
<TR><TD>Nordlicht</TD><TD ALIGN=CENTER>69</TD></TR>
<TR><TD>MultiMedia</TD><TD ALIGN=CENTER>90</TD></TR>
<TR><TD>Tools</TD><TD ALIGN=CENTER>85</TD></TR>
<TR><TD>Games</TD><TD ALIGN=CENTER>90/86/84</TD></TR>
<TR><TD>Text</TD><TD ALIGN=CENTER>92</TD></TR>
<TR><TD>InfoDisk</TD><TD ALIGN=CENTER>keine</TD></TR>
<TR><TD>SuchTool</TD><TD ALIGN=CENTER>86</TD></TR>
<TR BGCOLOR=#FFFF40><TD><STRONG>Gesamt</STRONG></TD><TD ALIGN=CENTER><STRONG>84</STRONG>
</TABLE>

<P>
<H3>Fazit:</H3>

<P>
Die APC&amp;TCP Volume 5 hat eigentlich f&uuml;r jeden was zubieten und ist f&uuml;r den
Preis von knapp 25 DM nicht gerade teuer. Konkurrenz kann die APC&amp;TCP
Volume 5 zwar keiner anderen  Sammel CD machen, z.B.: Aminet CD`s oder Saar
Amok, da auf diesen CD`s einfach vielmehr Daten drauf sind, aber Unterhaltsam ist
die APC&amp;TCP Vol. 5 trotzdem und die Tatsache, das alle Daten schon entpackt
und gleich startbar sind, ist doch schon mal positiv. Wenn man bedenkt, da&szlig;
diese CD eigentlich von APC&amp;TCP Clubmitglieder f&uuml;r Clubmitglieder
gemacht wurde, ist es schon erstaunlich was manche User so alles "auf die Beine
stellen" k&ouml;nnen.

<P><EM><STRONG>- Reinschauen lohnt sich - </STRONG></EM>


<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="lastm01.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="softw02.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

