<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Mystery</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<H2>Ufos-Sichtungen - Teil Eins</H2>

<H2>Roswell die bekannteste Ufogeschichte der Welt oder die gr&ouml;&szlig;te
Vetuschung.</H2>
                                           
<P>
Am 08. Juli 1947 soll in der N&auml;he von Corona ein Ufo abgest&uuml;rtz sein.Endeckt
wurden die Tr&uuml;mmer von Einem Farmer namens Mac Brazel da er kein
Telefon hatte fuhr er zum &ouml;rtlichem Sheriff (Georg Wilcox)
dieser informierte dann die US-Luftwaffe die in der N&auml;he ein St&uuml;tzpunkt
hat. Der Nachrichtenoffizier Major Jesse A. Marcel nahm den Bericht vom
Sheriff in Empfang.

<P>
<H3>Die Vorgeschichte:</H3>

<P>
Zur vorgeschichte am 02. Juli`47 um etwa 22.10 Uhr sa&szlig;en Dan Wilmot und
seine Frau Noch auf der Veranda ihres Hauses in der South Penn Street in
Roswell. Pl&ouml;tzlich sauste ein gro&szlig;es, gl&uuml;hendes Ding von S&uuml;dosten &uuml;ber denn
Himmel und raste mit enormer Geschwindigkeit nach Nordwesten (AUF CORONA,NEW
MEXICO,ZU). Verbl&uuml;fft rannten die Wilmots auf ihren Hof und beobachteten ein
ovales Objekt,das aussah, wie zwei aneinandergepre&szlig;te Untertassen. Es
leuchtete gleichsam von innen heraus und lautlos nach etwa vierzig bis
f&uuml;nfzig Sekunden war es au&szlig;er Sicht. Frau Wilmot sagte sp&auml;ter sie habe
einleichtes ziscendes Ger&auml;usch geh&ouml;rt als das Objekt genau &uuml;ber ihnen war.
aus Furcht sich l&auml;cherlich zu machen schwiegen die Wilmots und dann?

<P>
<H3>Pressemitteilung:</H3>

<P>
Am 08. Juli`47 gab das Public Information Office des Armeeflugplatzes
Roswell eine Presseerkl&auml;rung heraus die Lautet. Das es der Bombergruppe 509
das erste Atombombengeschwader der Welt.
der US-Luftwaffe gelungen sei ein UFO zu bergen und das damit die EXistenz
fliegender Untertassen an der so lange gezweifelt wurde endlich bewie&szlig;en
sei. Diese Meldung wurde vom Pressedienst der NEW YORK Times &uuml;bernommen und
erschien in zahlreichen Zeitungen in allen Teilen der USA sowie in Europa zB.
London Times von nun an H&auml;uften sich die Ufo Meldungen aus allen Teilen der
USA. Da die Airforce jedem Hinweiss was UFos betrift nachgeht fuhr Major
Marcell mit einem Trupp seiner Abteilung zu der besagten Ranch und
untersuchten die Tr&uuml;mmer die auf einer fl&auml;che von circa 1.5 km L&auml;nge und
100 Meter verstreut waren.

<P>
<H3>Das bekannte Pressedementi:</H3>

<P>
Am 09. Juli`47 erschien eine Weitere Pressemitteilung das die Tr&uuml;mmer nicht
von einem Ufo seihen sondern von einem Wetterballon. von jetzt an wird die
Geschichte spannent. &uuml;ber ganz Roswell wurde eine Nachrichtenspeere verh&auml;ngt

<P>
<H3>Nicht ver&ouml;ffenliche Augenzeugenberichte:</H3>

<P>
Schon bei der ersten Meldung( UFOtr&uuml;mmer gefunden) wurden Zeugenaussagen
unterschlagen wie Zum Beispiel &Uuml;berreste  von mnschenahnlichen Lebewesen mit
blasser Hautfarbe etwa 1.20 Meter gro&szlig; mit einer Art Fallschirmspringer-
overall bekleidet und das auf eingen der Tr&uuml;mmer seltsame Zeichen waren,
da sich das Material nicht verbiegen lie&szlig;.

<P>
<H3>Air Force Aktivit&auml;ten:</H3>

<P>
Hinweisen Zufolge soll der Generalleutant Hoyt Vandenburg stellvertretender 
Chef der Air Force den Brigadegeneral Roger M. Ramey Kommandant des Eighth
Air Force District in Fort Worth Telefonisch informiert das sich Teile des
Ufos im Lufwaffenst&uuml;zpunkt Roswell befanden. General Ramey befahl das
Material zum Hauptquartier des Generals dem Luftwaffenst&uuml;tzpunkt Carswell,
Fort Worth, Texas zu fliegen wo man es kurz untersuchte und dann nach
Wright-Patterson-Flugplatz in Dayton,Ohio weitertransportiert um weitere
Analysen durchzuf&uuml;hren.Major Marcel f&uuml;hrte diesen Befehl aus.

<P>
<H3>Ziviler Beauftragter der Air Force:</H3>

<P>
Der Ortsans&auml;ssige Leichenbestatter wurde von der Air Force beauftragt Einige
Kinders&auml;rge zu liefern und man fragte ihn wie man am besten Leichen f&uuml;r einen
Transport konserviert. Der Bestatter meinte die beste M&ouml;glichkeit sei mit Trockeneis.

<P>
<H3>Interview mit Major Jesse A. Marcel:</H3>

<P><STRONG>Frage:</STRONG><BR>

Stammen die Tr&uuml;mmer wirklich von einem Wetterballon.
 
<P><STRONG>Antwort:</STRONG><BR>

Ich kannte so ziemlich alles was seiner Zeit in der Luft herum-
schwirrte sowohl von unseren Dingern wie auch von der Gegenseite.
<P>
Ich kannte auch praktisch jeden einzelnen Typ von Wetterbeobachtuns- und
Radarzielger&auml;ten sowohl milit&auml;rischer als auch ziviler Herkunft. Das Wrack
war nichts dergleichen und ebensowenig war es irgeneine Art Flugzeug oder
Rakete. Wir wu&szlig;tennicht was es war. Wir sammelten nur die &Uuml;berreste ein.
Es war etwas das ich wedervorher noch nachher je gesehen habe es war
hundertprozentig kein Wetterballon.

<P><STRONG>Frage:</STRONG><BR>

Auf die Frage ob er das Material beschreiben k&ouml;nne sagte er folgendes:

<P><STRONG>Antwort:</STRONG><BR>

Das war allerhand verschiedenartiges Zeug - kleine St&auml;be von vielleicht
eineinhalb Zentimeter Durchmesser mit so Hieroglyphen darauf, die kein
Mensch entziffern konnte. Die St&auml;be sahen aus als w&auml;ren sie aus Balsaholz
und sie waren auch so leicht nur das es kein Balsaholz war. Sie waren sehr
hart und doch biegsam und nicht brennbar. Dann war da noch eine Menge
pergamentartiges Zeug,br&auml;unlich und sehr fest, und eine gro&szlig;e Anzahl von
hauchd&uuml;nnen Metallst&uuml;cken, die an Alufolie erinnerten, aber es war keine
Alufolie. Da ich mich f&uuml;r Elektronik interessiere,hielt ich Ausschau nach
Instrumenten oder elektronischen Einrichtungen aber ich habe nichts
dergleichen gefunden.

<P><STRONG>Frage:</STRONG><BR>

Was war so besonders interessant an diesem Material:

<P><STRONG>Antwort:</STRONG><BR>

Was mich besonders beeindruckte, war die Tatsache, da&szlig; eine Menge davon wie
Pergament aussah: Es waren kleine Ziffern mit Symbolen drauf, die wir
Hieroglyphen nannten, weil ich sie nicht verstehen konnte. Man konnte sie 
nicht lesen, es waren einfach Symbole, die etwas bedeuteten, und sie waren
nicht alle gleich, aber alle von der gleichen Art, w&uuml;rde ich sagen. Sie
waren roso und purpurrot und sahen aus wie aufgemalt. Diese kleinen
Ziffern waren weder zerbrechlich noch brennbar. Ich habe sogar versucht,
mit meinem Feuerzeug etwas von dem pergament- und balsaholz&auml;hnlichen
Material anzuz&uuml;den,aber es brannte nicht- es qualmte nicht einmal. Aber
noch erstaunlicher war, da&szlig; die Metallbl&auml;tter, die wir dann mitnahmen,
so d&uuml;nn waren, genauso d&uuml;nn wie die Folie in Zigarettenpackungen. Zuerst
habe ich gar nicht so sehr darauf geachtet, bis einer der Jungs zu kamm
und sagte: kennen Sie das Metall, das da drin war? Ich habe versucht,
das Zeug zu verbiegen, und es l&auml;&szlig;t sich nicht verbiegen. Ich habe sogar
mit einem Vorschlaghammer probiert, und der hatte nicht einmal eine 
elle hinterlassen...." Dieses spezielle Metallst&uuml;ck war etwa sechzig
Zentimeter lang und drei&szlig;ig Zentimeter breit. Es war so Leicht das es
praktisch nichts wog, und das traf auch auf all das andere Matrial zu -
es war praktisch gewichtslos, so d&uuml;nn war es. Also versuchte ich auch
das Zeug zu verbiegen. Wir haben es mit allen Mitteln versucht. Es lie&szlig;
sich einfach nicht verbiegen, und wir konnten es auch zerei&szlig;en oder
zerschneiden. Schlie&szlig;lich schlugen wir mit einem acht Kilo schweren
Hammer drauf, und dieses Teufelszeug bekamm nicht einmal eine Delle..
... Es war mir ein R&auml;tsel, was das f&uuml;r ein Ding war.
&Uuml;brigens, wenn ich verbiegen sage meine ich, so verbiegen da&szlig; es verbogen
bleibt. Es war schon M&ouml;glich das Zeug hin- und herzubiegen, man konnte es
sogar knittern, aber es war einfach nicht m&ouml;glich bleibende Kr&uuml;mmungen
oder Kniffe oder Dellen hineinzubiegen, die auch drinnen blieben. Ich 
m&ouml;chte es fast als Metall mit Eigenschaften von Plastik bezeichnen.

<P><STRONG>Frage:</STRONG><BR>

Was haben sie mit dem sichergestellten Material gemacht:

<P><STRONG>Antwort:</STRONG><BR>

Wir haben es eingesammelt, soviel wir konnten. Nachdem der Lastwagen beladen
war,lud ich noch den Kofferraum und den R&uuml;cksitz des Buick voll. Wir fuhren
noch am gleichen Nachmittag ( 7 Juli ) wieder ab und kamen am fr&uuml;hen Abend
in Roswell an. Am n&auml;chsten Nachmittag haben wir auf Befehl von Colonel
Blanchard alles in eine B-29 geladen und nach Fort Worth geflogen. Eigenlich
war ja vorgesehen, da&szlig; ich alles nach Wright-Field in Ohio bringen sollte,
aber als wir in Forth Worth-Carswell ankamen, warf der General alles &uuml;ber
den Haufen. Er ri&szlig; sofort das Kommando an sich, erz&auml;hlte der Presse da&szlig; das
Ding nur ein Wetterballon gewesen sei, und befahl mir, unter keinen
Umst&auml;nden mit der Presse zu reden, und ein anderer bekam den Befehl, das
Zeug nach Wright (Patterson) Field zu fliegen. So kam also alles zur 
Untersuchung nach Wright-Patterson. Gleich als wir in Fort Worth-Carswell
ankamen, wurden wir angewiesen, dem General einen Teil von dem Zeug in sein
B&uuml;ro zu bringen, weil er sich das genauer ansehen wollte. Das taten wir
also und breiteten alles auf braunem Packpapier auf dem Boden aus. 
Wir hatten da nat&uuml;rlich nur einen ganz kleinen Teil der Tr&uuml;mmer, es gab
ja noch jede Menge mehr davon. Die halbe B-29 drau&szlig;en war voll damit.
General Ramey lie&szlig; dann ein paar Presseleute herein, und die durften das
Zeug fotografieren. Von mir haben sie auch ein Bild gemacht, wie ich auf
dem Boden knie und einige weniger interessante Metallfetzen hochhalte.
Die Presseleute durften zwar alles fotografieren, aber sie durften nicht
nahe genug heran, um irgend etwas ber&uuml;hren zu k&ouml;nnen.
Das Zeug auf dem einen Foto geh&ouml;rte wirklich zu dem Material, da&szlig; wir ge-
funden hatten. Das war kein gestelltes Foto. Sp&auml;ter wurden dann die Tr&uuml;mmer,
die wir gebracht hatten, wegger&auml;umt und daf&uuml;r andere hingelegt. Dann durften
weitere Fotos gemacht werden. Diese Bilder wurden aufgenommen, als die
wirklichen Wrackteile sch&ouml;n l&auml;ngst nach Wright Field unterwegs waren. Ich
war da nicht mit drauf. Ich glaube, der General und einer seiner Adjutanten
waren auf diesen Fotos mit drauf. Ich habe schon eine Menge Wetterballons
gesehen aber so einen wie den bestimmt noch nicht. Und ich glaube die auch
nicht. 

<P><STRONG>Frage:</STRONG><BR>

Kommen wir nochmals darauf zur&uuml;ck, wie die Presse- und Radioleute da
hineingezogen wurden. K&ouml;nnen wir das noch einmal durchgehen?

<P><STRONG>Antwort:</STRONG><BR>

Da war also dieser Presseverbindungsoffizier. Haut hie&szlig; er, glaube ich. Der
hatte die AP angerufen und sp&auml;ter dann die Presseinformation herausgegeben.
Wie ich h&ouml;rte, war er dazu nicht befugt gewesen, und ich glaube, er wurde
deswegen auch schwer gema&szlig;regelt ganz von oben, von Washington sogar, glaube
ich. Wir bekamen Anrufe von &uuml;berallher, aus der ganzen Welt. General Ramey
war derjenige, der die Geschichte vom Ballon aufbrachte, blo&szlig; um die Presse
wieder loszuwerden. Den Reportern wurde klargemacht, da&szlig; es sich blo&szlig; um
einen Wetterballon handelte und da&szlig; der Flug nach Wright-Patterson
abgeblasen war. In Wirklichkeit aber flog jemand andderer an meiner Stelle
dorthin. Ich durfte nicht einmal mit den Presseleuten reden - au&szlig;er um das
zu sagen, was der General mir zu sagen befohlen hatte. Alle wollten sie
mir nat&uuml;rlich Fragen stellen, und ich konnte ihnen &uuml;berhaupt nichts
erz&auml;hlen.

<P><STRONG>Frage:</STRONG><BR>

Sie wollen damit also sagen, da&szlig; die ganze Wetterballongeschichte nichts als
ein  M&auml;rchen war und nur der Verschleierung diente?

<P><STRONG>Antwort:</STRONG><BR>

Also, eines m&ouml;chte ich da noch besonders betonen n&auml;mlich da&szlig; die Reporter
herzlich wenig von dem Material zu sehen bekamen - und &uuml;berhaupt nichts von
diesen wichtigen Dingern mit den Hieroglyphen oder Zeichen drauf. Die haben
sie nicht gesehn, weil sie gar nicht mit dort waren. Sie wollten da&szlig; ich
ihnen etwas dar&uuml;ber erz&auml;hle, aber ich durfte ja nichts sagen. Als der
General die Sache in die Hand nahm, befahl er mir &uuml;berhaupt nichts zu
reden, er w&uuml;rde die Sache in die Hand nehmem. Und den Reportern erkl&auml;rte
er: Ja das ist ein Wetterballon. Also mu&szlig;ten die Reporter sein Wort f&uuml;r
bare M&uuml;nze nehmen, denn wonach sollten sie sich sonst richten? Sie haben
versucht, mich zum Sprechen zu bringen, aber der General hat mir verboten
irgend etwas zu sagen, und so konnte ich ihnen nichts erz&auml;hlen.
Der General hat zu mir gesagt: Sie fahren am besten gleich wieder zur&uuml;ck
nach Roswell. Sie werden dort dringend gebraucht. Ich werde das hier schon
erledigen......" Gehorsam folgte Major Marcel dem befehl des Generals
kehrte sofort nach Roswell zur&uuml;ck und bewahrte ein bewunderungsw&uuml;rdiges,
jahrelanges Schweigen.

<P><STRONG>Ende des Ersten Teils</STRONG>
                                           
<P>Im zweiten Teil sind folgende Themen geplant:

<P><UL>
<LI>Beschreibung der Aliens</LI>
<LI>Undichte Stellen</LI>
<LI>Der Pr&auml;sident und die erbeutete Untertasse</LI>
</UL>
                                           
<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk25.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk27.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>
