<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Mystery</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<H1>Mystery</H1>

<P>
<OL>
<LI><A HREF="#vwort">Vorwort</A></LI>
<LI><A HREF="#kap1">Allgemeines zum Thema UFOs</A></LI>
<LI><A HREF="talk25.htm">Wie sehen Aliens aus?</A></LI>
<LI><A HREF="talk26.htm">Rosswell - Teil 1</A></LI>
<LI><A HREF="talk27.htm">Mars</A></LI>
<LI><A HREF="talk28.htm">Der ultimative UFO-Fragebogen</A></LI>
</OL>

<P><HR>

<P>
<H2><A NAME="vwort">Vorwort</A></H2>

<P>
Hallo und willkommen bei MYSTERY. UFOs sind ja derzeit Mode, auch Aliens und
alles was dazu geh&ouml;rt, doch nicht vielle wissen etwas genaues oder meist nur
das was es im Fernsehen, z.B.: Akte-X, zusehen gibt. Damit soll Schlu&szlig; sein!
Ab dieser Ausgabe gibt es immer einen MYSTERY - Teil, indem Fakten und
Erkenntnisse, sowie Meinungen und "Begegnungen" genannt werden.

<P><STRONG>Viel Spa&szlig; und gute Unterhaltung bei...MYSTERY</STRONG>

<P><HR>

<P>
<H2><A NAME="kap1">Allgemeines zum Thema UFOs</A></H2>

<P>
<H3>UFOs in der Bibel</H3>

<P>
Im Alten Testament beschreibt der Prophet Hesekiel (Ezechiel) genau ein UFO und
die dazugeh&ouml;rende Basis. Der pensionierte NASA-Chefingenieur Josef Blumrich hat
aufgrund dieser Bibelberichte ein UFO konstruiert. Unabh&auml;ngig davon entwickelte
der deutsche Ingenieur Herbert Beier eine UFO-Basis. Obwohl beide ihre Modelle
ohne Wissen des anderen konstruierten, pa&szlig;ten sp&auml;ter beide Modelle haargenau
zusammem. Nicht so spektakul&auml;r, aber vielleicht noch aussagekr&auml;ftiger ist die
Tatsache, da&szlig; in dem Bibeltext ausf&uuml;hrlich die Radkonstruktion beschrieben wurde.
Diese hat die NASA nachgebaut. Sie funktionierte nicht nur tadellos, sondern war
auch vollkommen ´neuartig´, so da&szlig; die NASA hierf&uuml;r ein Paten anmeldetet.
                                           
<P>
<H3>Roswell, 1947</H3>

<P>
Am 4.Juli 1947 st&uuml;rzte in Roswell, USA ein Objekt ab. Die U.S.Airforce best&auml;tigte
am ersten Tag den Absturz eines UFOs, am zweiten Tag sollte es dann nur noch ein
Wetterballon gewesen sein. Danach kamen viele Augenzeugen, u.a. ein Offizier und
ein Arzt, auf mysteri&ouml;se Art und Weise ums Leben. 1995 tauchte ein Film auf, der
die Autopsie eines dort abgest&uuml;rzten Aliens zeigen soll. Wissenschaftler haben
diverse Anzeichen daf&uuml;r gefunden, das er unecht ist, allerdings auch genausoviele,
das er doch echt ist. Es ist also noch nichts gekl&auml;rt. Laut v.Butlar allerdings
handelt es sich bei dem Film um eine F&auml;lschung.
                                           
<P>
<H3>Die Mars-Gesichter</H3>

<P>
Die NASA-Viking-Sonden haben den Mars gr&uuml;ndlich fotografiert, dabei entstanden
auch Fotos von Pyramiden und riesigen Gesichtern. Computeruntersuchungen der
Kopfbilder ergaben, da&szlig; diese Gesichter Augen mit Aug&auml;pfeln und Pupillen,
Haarlinie, Mund, Nase und Kinn besitzen. Viele der weiteren amerikanischen und
auch russischen Marssonden kamen nie bei dem roten Planeten an. Aus nicht gekl&auml;rten
Gr&uuml;nden verschwanden sie im All.
                                           
<P>
<H3>Au&szlig;erirdische = G&ouml;tter?</H3>

<P>
Immerwieder finden Arch&auml;ologen Bilder, die auch einem Science Fiction-Film
entsprungen sein k&ouml;nnten. W&auml;hrend es f&uuml;r die ´seri&ouml;sen´ Wissenschaftler sich immer
um Gottesbilder handelt sehen UFO-Forscher hier grunds&auml;tzlich immer Au&szlig;erirdische.
Dieses Kastendenken l&auml;&szlig;t leider zu wenig Platz f&uuml;r andere Denkans&auml;tze. Wie w&auml;re es
wenn jemand in tausenden von Jahren unsere Ruinen ausgraben w&uuml;rde? Sind Helmut Kohl,
Michael Jackson oder Donald Duck G&ouml;tter? Was w&auml;re wenn jemand sich eine uralte
Star Trek-Folge ansehen w&uuml;rde? Noch immer gibt uns unsere Geschichte R&auml;tsel auf,
vielleicht waren es G&ouml;tter, vielleicht waren es Au&szlig;erirdische, vielleicht war es auch
ganz anders.
                                           
<P>
<H3>Was wissen afrikanische Eingeborene?</H3>

<P>
Ein afrikanischer Eingeborenenstamm der Dogonen wei&szlig; erstaunlicherweise die
genaue Umlaufbahnen von Sirius A und Sirius B. Europ&auml;ische Wissenschaftler konnten
erst mit der Umlaufbahnbschreibung nichts anfangen, da Sirius B (ein wei&szlig;er Zwerg)
erst sp&auml;ter in unserem Jahrhundert entdeckt wurde. Die Maueren einer Ruine in
Simbabwe zeigen erneut die &Auml;hnlichkeit der Sirius-Umlaiufbahnen.
                                           
<P>
<H3>UFO-Prototypen</H3>

<P>
Immerwieder gibt es Berichte, da&szlig; die amerikanische Airforce abgest&uuml;rzte UFOs
nachgebaut hat. So soll z.B. der Stealt-Fighter auf au&szlig;erirdische Technologien beruhen.
                                           
<P>
<H3>UFOs auf dem Radar</H3>

<P>
In der heutigen Zeit kann man Fotos nahezu perfekt f&auml;lschen. Was ist aber mit dem
UFO-Erscheinungen auf (Milit&auml;r-) Radars? Durch das ungew&ouml;hnliche Flugverhalten ist
eine nat&uuml;rliche Erscheinung auszuschlie&szlig;en.
                                           
<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk23.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk25.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>
