<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - phase5 im Kreuzfeuer</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<H1>"phase5" im Kreuzfeuer !</H1>

<P>
"phase5"... hochgelobt oder tiefgehasst? Zu diesem kleinen Thema m&ouml;chte ich
mich jetzt mal &auml;u&szlig;ern. "phase5" ist ja eine Firma die immer an den Amiga
geglaubt hat und auch in schweren Zeiten zum Amiga hielt und f&uuml;r ihn
entwickelte und produzierte. Die damalige Strategie ging auf und die Firma
wuchs und wuchs. Doch damit kann bald schlu&szlig; sein. Grund daf&uuml;r sind die
Preise von "phase5". Diese sind n&auml;mlich zu hoch. Ihre Palette ist recht
gro&szlig;, doch die Preise steigen und steigen. Bestes Beispiel sind die neuen
PPC Karten. Diese gibt es ab 700 DM aufw&auml;rtz und dies ist einfach zuhoch!
"phase5" hat derzeit noch keine Konkurennz und kann somit die Preise selber 
festlegen, aber eine Umfrage von mir (unterhaltungen mit Leuten via Mail)
habe ergeben, da&szlig; kaum jemand interresse hat, da einerseits die Preise
zu hoch sind und andererseits kaum Software daf&uuml;r vorhanden ist. Okay
letzteres kann und wird sicherlich bald behoben. Aber die einzelnen
Hardwarepreise sind einfach &uuml;ppig! Die Preise m&uuml;ssen fallen, ansonsten
bleiben sie sicherlich auf ihren Produkten sitzen. 

<P>
Ich gehe jetzt mal von mir aus. Wenn eine Firma sagt, da&szlig; ihre Produktionskosten
sehr hoch w&auml;ren und deshalb die Preise auch steigen, so ist mir das echt
scheiXXXegal. Was geht mich fremdes Elend an? Ich will ein Produkt kaufen um
meinen Amiga aufzur&uuml;sten und wenn dies zu teuer wird, na dann lasse ich es!
Wenn die Preise fallen, verkauft sich das Produkt doch auch viel besser und die
Verkaufszahlen w&auml;ren auch zufriedenstellend! Ich als Verbraucher m&ouml;chte doch ein
Produkt kaufen, welches einerseits auf dem neusten Stand ist und dann noch g&uuml;nstig
zuerwerben ist! Wenn ich dies nicht bekomme, dann warte ich und kaufe nichts, denn
schlie&szlig;lich m&ouml;chte nicht ich meine Produkte loswerden, sondern der einzelne Hersteller,
in diesem Fall "phase5"!

<P>
Wie ich schon mal gesagt habe, wir leben nicht mehr in einer Zeit, wo
etwas entwickelt wird und dies dann f&uuml;r die n&auml;chsten 5 Jahre Standard ist,
sondern wir leben in einer Zeit wo im Monatsschema gedacht wird bzw. gedacht
werden sollte!!!

<P>
Meine Preisvorstellungen f&uuml;r die PPC Boards w&auml;ren folgende:

<UL>
<LI>Cyberstorm PPC (250Mhz) mit 68060/50 Mhz f&uuml;r 900 DM</LI>
<LI>Blizzard PPC 603e (200 Mhz) mit 68060/50 MHz f&uuml;r 600 DM</LI>
<LI>Blizzard PPC 603e+ (250 Mhz) mit 68060/50 Mhz f&uuml;r 750 DM</LI>
<LI>und die PPC Grafikkarte(n) h&ouml;chstens zwischen 400 - 700 DM!</LI>
</UL>

<P>
Meiner Meinung nach mu&szlig; der 68060 Prozessor mit 50 Mhz serienm&auml;&szlig;ig bei
den (heutigen) Boards dabei sein und die Preise d&uuml;rfen nicht so hoch
sein. Was n&uuml;tzt heute noch ein 68030/68040 Prozessor? Kaum noch was!
Vielleicht haltet Ihr mich f&uuml;r verr&uuml;ckt, aber ich kaufe mir bestimmt keine
PPC Karte f&uuml;r 800 DM, oder mehr, ohne 68k Prozessor!

<P>
Wie seht Ihr das? Schreibt doch mal Eure Meinung dazu! Wenn ich ein paar 
Mails bekomme (mindestens 15!!!) werde ich auch eine Mail an "phase5"
schreiben mit Euren Meinungen und Vorschl&auml;gen, denn wir sind doch die
Verbraucher und kaum "phase5" selbst!!

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk15.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk21.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

