<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - R&uuml;ckblick auf die "AMIGA GAMES"</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<TABLE BORDER=0>
<TR><TD><H1>CSS - Computer Shopper Show in K&ouml;ln!</H1></TD>
<TD><IMG SRC="../images/aglogo.gif" ALT="Amiga Games Logo" BORDER=0 WIDTH=304 HIGHT=117 ALIGN=MIDDLE></TD>
</TR></TABLE>

<P>
Vom 8. bis 11. October`92 ist in K&ouml;ln die CSS Messe, die diesesmal
einen ziemlichen Konkurrenten hat, denn im selben Jahr ist
auch die WOC - World of Commodore Messe in Frankfurt.
30.000 qm Ausstellerfl&auml;che und nur 120 Austeller wollen ihre
Produkte anbieten, die aber eh kaum neu sind.
Die Preise liegen zwischen 12 und 17 DM.
Unteranderem stellt Seat ihren Fahrsimulator vor und Ferrari
stellt ebenfalls ihre Testarrosa-Rennsimulation vor.
Das neue Amiga Modell soll auch hier noch nicht vorgestellt werden
und somit sieht es nicht gerade rosig aus.

<P>
<H1>World of Commodore, Frankfurt</H1>

<P>
Noch eine Messe und zwar die WOC, die vom 26.-29. November`92 in
Frankfurt stattfinden wird. Die WOC soll f&uuml;r alle Shopilger
die richtige Erlebnismesse werden. Gr&ouml;&szlig;ter Austeller ist <EM>Untited Software</EM> mit
immerhin 600 qm. Spiele am laufenden Band sollen vorgestellt werden und der neue
Amiga soll auch noch gezeigt werden, was will man denn mehr? Es wird einen
getailgetreuen Airbus geben, mit dem man per Simulator fliegen kann und auf dem
Amiga Stand kann man mit Amiga-Gurus plauschen. John Madden Football wird erscheinen
und noch vieles vieles mehr. Es gibt einen Programmierer Wettbewerb bei dem
es Preise im Wert von 25.000 DM zugewinnen gibt. Hautpreis ist ein Seat Ibiza.

<P>
Die Entrittspreise liegen zwischen 10 und 15 DM und sind somit g&uuml;nstiger als bei
der CSS!

<P>
<H1>Spielenews - Knightmare gewinnt Golden Chalice Award</H1>

<P>
Knightmare - das Rollenspiel wurde als bestes Spiel 1991/92 mit dem 
Golden Chalice Award in London ausgezeichnet. Dieser Award ist vom
Adventure &amp; Strategy Club- London.
Knightmare kam bis jetzt nur f&uuml;r den Amiga und Atari ST auf den Markt
und beinhaltete komlexe Puzzels und viele (logische) Probleme und wird
im October`92 f&uuml;r den PC erscheinen.

<P>
<H1>Unternehmen - Kingsoft ist kein Newcomer</H1>

<P>
Kingsoft, welche derzeit mit 160 Produkten auf dem Markt, eine der umsatz-
st&auml;rksten Firmen ist, hatte schon 1982 erfolge mit Spielen f&uuml;r den C64
und f&uuml;r die &auml;lteren Modelle PET 2001, CBM 8032 und VC-20. Sie waren damals
eines der ersten deutschen Softwareh&auml;user im Entertainmentbereich und
selbst heute findet man bei "Vobis" und "Toys`r`Rus" ihre Produkte.
Weiter Spiele sind im Anmarsch und lassen nat&uuml;rlich auf mehr hoffen.

<P>
<H1>Unternehmen - LORICIEL im Glashaus</H1>

<P>
Die zweite Jahresh&auml;lfte hat Einzug gehalten und LORICIEL haben ihre
B&uuml;ro`s gewechselt und hier die Adressen:

<P>
7 rue du Fosse' Blanc<BR>
F-92624 Gennevilliess cedex
<P>
Telefon: (1) 46882838

<P>
<H1>Programmierer gesucht</H1>

<P>
Defcom, ein Rechlinghausener Softwarehaus veranstaltet einen gro&szlig;en
Programmierwettbewerb an dem PC und Amiga User teilnehmen k&ouml;nnen.
Zu gewinnen gibt es unteranderem einen Amiga3000/25 MHz/ 52 MB HD oder
einen 80486/33 MHz/ 4 MB / 52 MB HD.

<P>
<H1>Elektronic Arts bei Amiga Games</H1>

<P>
In unserer Redaktion konnten wir Fiona Murphy von der englischen Software-
schmiede Electronic Arts (EA) begr&uuml;&szlig;en. Sie hatte zwar jede Menge Spiele
mit, aber leider nur eines f&uuml;r den Amiga. Sie brachte eine Demoversion
von "Sherlock Holmes" mit, welches demn&auml;chst erscheinen soll. Zuerst gibt
es das Game f&uuml;r den PC, aber danach auch f&uuml;r den Amiga. Die ersten
Bilder sahen sehr gut aus und konnten aufgrund ihres Detailreichtums
begeistern. In einer der n&auml;chsten Ausgaben gibt es einen Umfassenden Test,
solange m&uuml;ssen alle "Detektive" sich noch gedulden!

<P>
<H1>Unternehmen - Nachwuchs im Hause Coktel Vision</H1>

<P>
Dies ist zweideutig zubetrachten, da einerseits die Pressesprecherin
von Coktel Sabine David erneuten Nachwuchs erwartet und zum anderen
man dadurch einen entsprechenden Ersatz finden mu&szlig;te. Dieser hei&szlig;t
Emmanuelle Kreuz (vorher Loricial) und wird k&uuml;nftigt diese Aufgabe
&uuml;bernhemen!

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk05.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk07.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

