<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Abgezockt!</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<H1>Abgezockt! - Warum verarscht man uns???</H1>

<P>
Wenn man es recht bedenkt, sind wir Amiga User doch arm dran.
Jeder m&ouml;chte, daﬂ wir aufr&uuml;sten, doch gerade hier werden wir ziemlich
abgezockt. Hat man sich erstmal entschlossen, einen neuen Computer
oder andere Hardware zukaufen, so muﬂ man meist tief in die Tasche
greifen. Grund daf&uuml;r sind oft listige Werbungen, welche einem viel
Versprechen, aber wenig bieten. Ich diesem Artikel m&ouml;chte ich keine
Firmen namentlich benennen oder anschw&auml;rtzen, sondern mal darauf hinweisen,
was man so alles mit einem Amiga User macht um an sein Geld zu kommen.

<P>
Ich selbst hatte mich vor einiger Zeit dazu entschlossen, meiner Freundin
etwas gutes zu tun und wollte mir einen Tower bestellen. Da die PPC Aktion
ja derzeit l&auml;uft, w&auml;re dies ja auch notwenig. Nun gut, also bl&auml;tterte
ich in verschiedenen Magazinen und fand schlieﬂlich ein, meiner Meinung
nach, gutes Angebot. F&uuml;r knapp 300 DM, k&ouml;nnte ich einen Tower bekommen.
Nun das ist wirklich nicht teuer und so h&auml;ngte ich mich ans Telefon
um mir noch die restlichen Informationen zu holen. Das Ende vom Lied...
die anfangs 300 DM wurde sehr schnell zu 500 DM! Das ist doch ein echter
Witz! Was soll denn das? Wenn die H&auml;ndler dieses weiter so machen, brauch
sich keiner wundern, wenn die Verkaufszahlen im Keller sind!  

<P>
Leider ist dies sehr h&auml;ufig so, da braucht man dies und jenes, ohne dem
da, geht es schon garnicht und so weiter und so weiter!
Ich kann doch auch nicht sagen:" Ein Fernseher f&uuml;r 150 DM, ganz neu mit
...! Wo Sie aber die Bildr&ouml;hre bekommen ist Ihre Sache!"

<P>
So geht das nicht! In dieser Hinsicht muﬂ sich noch sehr viel tun und
vorallem d&uuml;rfen keine Versprechungen gemacht werden, die nicht eingehalten
werden k&ouml;nnen!

<P>
Genauso gibt es sehr oft Probleme beim Einbau von Hardware, normalerweise
soll dieser ja sehr leicht sein, aber am heimischen Rechner sieht dies anders aus.
Dort qu&auml;lt man sich stundelang, bis man es endlich geschafft hat, seinen Computer
"auf den neusten Stand zu bringen".

<P>
Dadurch, daﬂ Amiga International viele Lizenzen vergibt, spaltet sich der
Amiga Markt und es wird immer schwerer und teurer, den eigenen Rechner aufzur&uuml;sten.
Einheitliche Standards, normale Preise und passende Hardware, w&auml;ren schon
nicht schlecht.

<P>
Gerade auch bei den einzelnen Preisen, bezahlen wir uns dumm und d&auml;mlich.
Mal ehrlich, ein PPC Board f&uuml;r bzw. zwischen 700 und 2000 DM, ohne 68k
Prozessor, ist ein weinig teuer und ich bezweifle, daﬂ "phase5" den 
Erfolg haben wird, den sie vielleicht angestrebt haben. Es ist schon lange
nicht mehr so, daﬂ etwas entwickelt wird und dies dann f&uuml;r 5 Jahre Standard
ist, heute wird im Monatsschema gedacht. "phase5" hat nur das Gl&uuml;ck, daﬂ
derzeit keine Konkurrenz da ist, ansonsten w&uuml;rden sie echt Probleme haben
ihre Boards loszuwerden.

<P>
Wir werden sehen, was die Zeit bringt! Aber die hohen Preise und die
damit meist verbundenen Zusatzkosten, reizen nicht gerade um aufzur&uuml;sten!
(!!!Achtung: Ich meine nicht den Wechsel von A500 auf A1200 oder h&ouml;her,
sondern den Kauf von zus&auml;tzlicher Hardware (Turboboards oder Grafikkarten!)

<P>
Ich kann nur eines sagen, wenn Du aufr&uuml;sten willst, dann informiere Dich
richtig und bestelle nicht gleich beim besten Werbeangebot, sondern
informiere Dich bei mehreren Anbietern, damit Du dann nicht ins "Fettn&auml;pfchen"
trittst!

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk20.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk22.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>
