<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Mystery</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<H2>Neues zum Marsgesicht</H2>
                                           
<P>
Vor 2 Tagen (8. Okt. 96) ereichte mich eine Nachricht von Christian Antolic
aus Salzgitter. Er h&auml;tte das in den 70 Jahren von den Voyager-Sonden der
Nasa zur Erde gesendete Bildmaterial, auf dem u.a. ein menschliches Gesicht
und Pyramden - zum erstaunen der Wissenschaftler - zu sehen sind, einer
neuen Computer-Analyse unterzogen. Er berichtet von neuen Details und will
auch in Zukunft weitere der erstaunenden Bilder einer genaueren, durch die
heutige Computertechnik m&ouml;glich gemachten, Untersuchung unterziehen.
Hier nun sein Bericht.

<P>
<STRONG>Betrifft: Marsgesichter</STRONG>

<P>
Neue Details sind auf dem Bild in so fern vorhanden, da&szlig;; der Abschnitt, indem sich
die Pupille der Formation befindet in mehrere Schichten eingeteilt werden konnte,
die sich dann in der Natur als eine H&ouml;hendifferenz zeigen w&uuml;rden. Die bestehende
M&ouml;glichkeit, da&szlig; die Formation vom Wind geschaffen wurde wird damit nahezu
g&auml;nzlich eingestellt, da sonst n&auml;hmlich das hervorstehende Innere der Pupille
auch abgetragen worden w&auml;re und dies noch eher als die umliegende Schicht. Das
diese rote Schicht h&ouml;her ist als die wei&szlig;e erkennt man daran, da&szlig; sie an einer
Stelle die wei&szlig;e &uuml;berdeckt.

<P>
Davon abgesehen zeigt das Bild, da&szlig; die Z&auml;hne der Formation so angeordnet sind,
da&szlig; der Unterkiefer weiter hervor steht, als der Oberkiefer. Dies ist daran zu
erkennen, da&szlig; der gr&uuml;ne Zahn den blauen zu &uuml;berdecken scheint und au&szlig;erdem einen
anderen Farbton hat, obwohl der Schatteneinfall an dieser Stelle noch h&auml;tte gleich
sein m&uuml;ssen, w&uuml;rden sie in der selben H&ouml;he stehen.

<P>
Wie Sie sicher wissen ist es Vincent DiPietro und Gregory Molennar mit einem
heute inzwischen' weit &uuml;berholten Computer gelungen die Pupille  ebenfalls
sichtbar zu machen. Was aber auf dem DiPietro Computerbild nie zusammen sichtbar
war sind Z&auml;hne und Pupille. Dieses Verfahren entwickelte sp&auml;ter n&auml;mlich erst
Doktor M. J Carlotto. Ich bin mir sicher, da&szlig; Experten von der Fotoanalyse mit
ihren geschulten Augen aus dem Bild noch wesentlich mehr Fakten lesen k&ouml;nnten.

<P>
Das Bild wurde &uuml;brigens nach der SPIT Methode der NASA Leute DiPietro und Molenaar
analysiert, nur mit dem Vorteil, da&szlig; die Software, die ich benutzte nat&uuml;rlich
heute wesentlich fortschrittlicher ist. Nachdem die SPIT Methode angewandt wurde,
verbesserte ich mit Kontrastmitteln und Sch&auml;rfeeinstellungen noch die Aufl&ouml;sung
der Formation und bearbeitete die Farben mit einer Falschfarbmethode. Dies ist
&uuml;brigens nicht das einzige Bild, da&szlig; ich anfertigte und in naher Zukunft werde ich
die Gesichtformationen in der Utopiaregion mit der gleichen Methode bearbeiten.

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk26.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk28.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>
