<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - R&uuml;ckblick auf die "AMIGA GAMES"</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<TABLE BORDER=0>
<TR>
<TD><H1>"Trauer machte sich in den Gesichtern breit..."</H1></TD>
<TD><IMG SRC="../images/aglogo.gif" ALT="Amiga Games Logo" BORDER=0 WIDTH=304 HIGHT=117 ALIGN=MIDDLE></TD>
</TR></TABLE>

<P>
Seit ca. 1 Jahr mu&szlig;ten wir Abschied von einem der besten Amiga Spiele Magazine nehmen.
Es war f&uuml;r viele Userdas beste deutsche Mag, da&szlig; es &uuml;berhaupt gab... doch
leider ist nichts f&uuml;r immer! Sicherlich wissen viele welche Zeitung ich meine...
ganz klar, die: AMIGA GAMES! Eine Zeitung die allen sicher bekannt ist!

<P>
Die Ausgabe 12/96 war die letzte richtige der Amiga Games, denn einen Monat sp&auml;ter
existierte sie nicht mehr als eigenst&auml;ndiges Mag, sondern wurde zum Spieleteil einer
anderen Amiga Zeitschrift! Dieser Schritt bedeutete eigentlich schon das Ende!
Die Leserbriefecke viel weg und mehr und mehr wurde die Amiga Games zum "2 Seiten
Spiele Ereignis". Fr&uuml;her hatte ich mich immer auf die neuste Ausgabe gefreut und
wartete ungeduldig auf das Postauto, aber seit dieser Zeit war das vorbei! Uns Usern
blieb nichts anderes &uuml;brig, als Abschied zunehmen. Allen Abonnomenten wurde die
M&ouml;glichkeit geboten in das Amiga Magazin Abo zuwechslen - ein kleiner Trost! Und als
dann, nach Ausgabe 8/97 auch noch die AG CD eingestellt wurde, wurde auch dem letzten
Optimisten klar, da&szlig; es jetzt vorbei war! Ein Mag das uns knapp 5 Jahre mit Infos und
Test`s versorgt hatte mu&szlig;te den Amiga Markt verlassen. Zuwenig Neuerscheinungen,
zuwenig Firmen... zuwenig Hoffnung auf eine Wende?

<P>
Ich selbst habe alle Ausgaben von 10/92 - 12/96 (und danach bis 9/97) und habe keine
einzelne bereut, denn die Amiga Games war in Sachen Test`s nun mal f&uuml;hrend und
verschaffte sich bei den Usern einen festen Stand! Alle waren begeistert, als endlich
eine CD mit Demos und vielem anderm erschien! Doch leider machten 2 Konkurse die
Softwarehersteller m&uuml;rrisch und wenn nichts erscheint, kann niemand dar&uuml;ber berichten.

<P>
Heute sind manche Disk/Freeware Mag`s aktueller und berichten mehr &uuml;ber Spiele als
ein komerzielles Mag! Was ist nur los mit unserer Szene? So kann es nicht weiter
gehen! Was wir dagegen tuen k&ouml;nnen ist nicht Sinn und Inhalt dieses Artikels, Gedanken
sollte man sich aber trotzdem machen!
 
<P>
In dieser Ausgabe, m&ouml;chten wir nochmal zur&uuml;ck in die Vergangenheit
gehen und werden von der ersten Ausgabe nochmals den Inhalt
auff&uuml;hren mit kleinen Ausz&uuml;gen! Werden wir nocheinmal nostalgisch
und lesen in der ersten Ausgabe, denn so ein Mag wie die Amiga Games wird
es so schnell nicht mehr geben (wenn &uuml;berhaupt)!
 
<P><STRONG>
"Wir bedauern sehr, da&szlig; so ein tolles Magazin den Markt verlassen mu&szlig;te und w&uuml;nschen
uns eine baldige R&uuml;ckkehr! Mit einem Hans Ippisch, Rainer Rosshirt, Oliver Prei&szlig;ner
und all den anderen die diese Zeitung zudem gemacht haben, die sie einmal war und
die sie f&uuml;r einige User immer bleiben wird..."</STRONG>

<P>
<EM>Die Redaktion</EM>

<P ALIGN=CENTER>
<A HREF="talk05.htm">Amiga Games 10/92</A>

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk03.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk05.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

