<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Amiga in den Medien</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<H1>Amiga in den Medien</H1>
                                           
<P>
Komischerweise oder sollte man sagen positiverweise, findet man
immer &ouml;fter Artikel &uuml;ber den Amiga in anderen Computerzeitschriften.
Jedoch sind diese meist echt mist. Das zeigt auch das Beispiel
"Computerbild", diese berichten zwar ab und zu vom Amiga, jedoch kann
man diese Artikel vergessen, da man sich dort gar nicht richtig informiert.
Doch lies den letzten Artikel selbst...

<BLOCKQUOTE>
"Amiga ist wieder da !

<P>
Der Amiga Computer ist wieder da. Multimedia konnte dieser
Rechner schon, als bewegte Bilder und Sound anderswo noch
als pure Spielerei galten .
Eine eingeschworene Fangemeinde h&auml;lt den Computern, die
mit PCs nicht kompatibel sind, bis heute die Treue.
Das bewegte Leben der Amiga's begann 1985. Zehn Jahre sp&auml;ter
kaufte Escom Amiga auf. Im Juli 1996 schlie&szlig;lich mu&szlig;te
Escom konkurs anmelden. Jetzt bringt der US-Konzern Gateway 2000
den "Amiga 1200" wieder auf den Markt - zum Weihnachtsgesch&auml;ft und
speziell f&uuml;r ganz junge Leute, die die Computerwelt kennenlernen
m&ouml;chten . Dazu geh&ouml;rt ein Software-Paket mit Textverarbeitung,
Datenbank, Tabellenkalkulation, Malprogramm und Spielen.
Sogar die Preise erinnern an fr&uuml;her: 699 Mark soll das
Basispaket ohne Festplatte kosten .
F&uuml;r 300 Mark mehr gibt es den "Amiga 1200 HD" mit 170 MB-Festplatte.
Der Preis f&uuml;r den Monitor allerdings ist mit 599 Mark fast so hoch
wie der des Rechners. Der Amiga l&auml;uft aber auch am Fernseher."
</BLOCKQUOTE>

<P>
Wer diesen Artikel liest, kann nur lachen, denn eine 170 MB Festplatte
f&uuml;r 300 DM zuverkaufen ist eine Frechheit. Und das dies nur die Preise
von AI sind, schreibt Computerbild nicht mit rein, denn die Einzel-
h&auml;ndler bieten oft f&uuml;r den gleichen Preis mehr! Zwar ist der Preis
von 699 DM f&uuml;r den A1200 nicht ganz so teuer, aber eine Festplatte f&uuml;r
300 DM und einen Monitor f&uuml;r 600 DM sind Preise die einfach nicht ver-
tretbar sind.

<P>
Alles gut und sch&ouml;n, wenn andere Magazine &uuml;ber den Amiga berichten, aber
richtig informieren sollten diese sich schon, ansonsten sind diese
Artikel sinnlos und k&ouml;nnen eine echte Blamage sein!

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk21.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk23.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>
