<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - R&uuml;ckblick auf die "AMIGA GAMES"</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<TABLE BORDER=0>
<TR><TD></TD>
<TD><IMG SRC="../images/aglogo.gif" ALT="Amiga Games Logo" BORDER=0 WIDTH=304 HIGHT=117 ALIGN=MIDDLE></TD>
</TR></TABLE>

<P>
Ein neues Amiga Magazin erscheint auf dem Markt, doch wie reagiert die
Branche? Lesen Sie jetzt exclusive Meinungen zur Amiga Games von den 
wichtigsten Firmen!

<P>
<H1>Blue Byte</H1>

<P>
Der Amiga hat derzeit schlechte Karten. Der PC auf der einen und
die Konsolen auf der anderen Seite. Eine langzeitige Zukunft ist nicht mehr
in Sicht, so hart das auch klingt, doch es gibt Sachen die Ihm ein &Uuml;berleben
sichern k&ouml;nnten. 1.: Die Konvertierung guter Software von anderen
Plattformen, sowie die Entwicklung neuer Programme und 2.: die W&uuml;rdigung
von Computerzeitschriften, wie z.B.: der Amiga Games. Wie auch in der Vergangenheit,
wird Blue Byte die Leistungen des Amigas voll ausnutzten und neben Turbokarten und
HD Unterst&uuml;tzung auch Grafische Spezialtit&auml;ten bieten. History Line ist somit auch
f&uuml;r uns nicht nur eine einfache Konvertierung sondern wird bei uns mit der gleichen
Sorgfalt entwickelt wie die PC Version.

<P>
<TABLE BORDER=0>
<TR>
<TD VALIGN=TOP>AT-Kommentar:</TD>
<TD>Dies stimmt, "History Line" war ein voller Erfolg f&uuml;r den Amiga und bekam 89%
bei der Amiga Games Wertung. Die Verkaufszahlen war ebenfalls mehr als
zufriedenstellend und trugen nicht weniger dazu bei, da&szlig; "Die Siedler" (95% laut AG)
f&uuml;r unsere Freundin umgesetzt wurde und ebenfalls ein voller Erfolg war!!!</TD>
</TR></TABLE>

<P>
<H1>KAIKO</H1>

<P>
Das ist keine Frage, der Amiga ist der beliebteste Homecomputer
in Europa, denn trotz gro&szlig;er Konkurrenz behauptet er sich Landesweit!
Der Amiga hat unz&auml;hlige Spiele und die Auswahl ist so gro&szlig; wie es kein
anderer Computer/Konsole hat. Doch leider gibt es auch einige Nieten.
Also sollte man doch informiert werden, damit man nicht in den "faulen
Apfel" bei&szlig;t. Daf&uuml;r sind Computermagazine, wie die AG, da um Hits von
den Nieten zutrennen und zu informieren. Wir von KAIKO werden auch mit
qualitativ guten Games den Amiga Markt unterst&uuml;tzen!

<P>
<H1>LEISURESOFT</H1>

<P>
Wir stehen dem Erscheinen der Amiga Games sehr positiv gegen&uuml;ber,
da spezielle Amiga Zeitschriften dem Amiga ein &Uuml;berleben verschaffen k&ouml;nnen
und wir, die seit 1986 schon mit dem Vertieb von Unterhaltungs- und An-
wendungssoftware und Computerzubeh&ouml;r begonnen haben, werden allen Amiga
Usern ein reichhaltiges Angebot an Software bieten. Solange es Nachfrage
an Software besteht, werden Sie Produkte von LeisureSoft &uuml;ber Einzel-
h&auml;ndler bekommen. Die Amiga Games wird Ihnen dabie sicher helfen, und
Sie gezielt und ausf&uuml;hrlich informieren.

<P>
<H1>Ascon</H1>

<P>
Der Amiga geh&ouml;rt sei Jahren zu einem der weitverbreitesten
Computern, jedoch wird durch die Software-Piraterie das Interesse von
vielen Herstellern nachlassen. Deshalb ist es wichtig, da&szlig; alle wichtigen
Informationen (insbesondere des breiten Softwareangebotes) an die User
gelangen. Somit ist es nat&uuml;rlich sehr zu begr&uuml;&szlig;en, wenn ein neues Magazin
den Anforderungen vieler User gerecht werden m&ouml;chte. Und wir als Software-
hersteller m&ouml;chte dies unterst&uuml;tzen.

<P>
<TABLE BORDER=0>
<TR>
<TD VALIGN=TOP>AT-Kommentar:</TD>
<TD>Dies taten sie auch, Spiele wie "Ansto&szlig;" und "Patrizier" waren echte Erfolge,
aber leider Verabschiedete sich Ascon relativ schnell vom Amiga, zwar sollte
noch eine Formel 1 Rennsimulation erscheinen, aber dies war nur eines von vielen
Spielen (Ascon ist nicht gemeint, sondern alle anderen Firmen, welche vom Amiga
pl&ouml;tzlich verschwanden), die nie den Weg in mein bzw. ins Disk-Laufwerk
fanden!</TD>
</TR></TABLE>

<P>
<H1>Thalion</H1>

<P>
Und wieder ein neues Amiga Magazin, wieso eigentlich nicht?
Der Markt boomt und die Chancen f&uuml;r ein neues Magazin stehen gut.
Der Zeitpunkt ist gut, die Redaktion ebenfalls und wenn die Amiga Games
ihre Chance wahrnimmt und das Informationsbed&uuml;rfnis der User deckt,
steht diesem Magazin nichts entgegen. Wir werden es nat&uuml;rlich unterst&uuml;tzen
und w&uuml;nschen Ihnen alles Gute!

<P>
<H1>United Software</H1>

<P>
Wir von United Software sind entgegen aller Ger&uuml;chte der Auffassung, da&szlig; der
Amiga noch eine lange Zukunft hat. Wenn die Amiga besitzer weiterhin flei&szlig;ig
Spiele kaufen und nicht kopieren, wird der Amigamarkt weiterhin bestehen.
Die Amiga Games wird auch einen entscheidenden Teil dazu beitragen, da&szlig; der Markt
bestehen bleibt, da sich die User umfassend informieren k&ouml;nnen und wer sich an
United Software und an Amiga Games h&auml;lt, barucht sich um sein Spielgef&auml;hrten (Amiga)
keine Sorgen zu machen!

<P>
<H1>Selling Points</H1>

<P>
Mit der Amiga Games wird der Markt um ein weiteres Magazin
erweitert, welche &uuml;ber den derzeitigen Spielemarkt informiert. Der Amiga
hat seine Rolle im Computermarkt stetig ausgebaut und wird in Zukunft
dies auch als "Einsteiger-Computer" behalten. Mit der Amiga Games bekommt der
Benutzer ein weitere Alternative geboten um informiert zuwerden.
Denn wer sachlich informiert, der wird auch Erfolg haben.

<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk06.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk20.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>

</BODY>
</HTML>

