<HTML>
<HEAD>
<BASE TARGET"_self">
<TITLE>AMIGA TIMES 03/97 - Der AT-Weihnachtsbackofen</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#C4C4C4" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<A NAME="rez1"></A>

<CENTER>
<IMG SRC="../images/talk2.gif" ALT="Fun &amp; Talk" BORDER=0 WIDTH=328 HIGHT=50>
</CENTER>

<H1>M&uuml;rbe Rahmpl&auml;tzchen</H1>
                                           
<P>
<H2>Die Zutaten f&uuml;r etwa 50 St&uuml;ck:</H2>
<UL>
<LI>500g Mehl</LI>
<LI>375g Butter</LI>
<LI>4 Eigelb</LI>
<LI>3 EL Zucker</LI>
<LI>5 EL dicker Rahm</LI>
<LI>100g Zucker</LI>
<LI>1 TL Zimt</LI>
</UL>

<P>
<H2>Wie lange dauert es?</H2>
<UL>
<LI>Zubereitung: 40 Minuten</LI>
<LI>K&uuml;hlen: 60 Minuten</LI>
<LI>Backen: etwa 12 Minuten bei 175°</LI>
</UL>

<P>
<H2>So wird es gemacht:</H2>

<P><OL>
<LI>Mehl sieben, eine Mulde hineindr&uuml;cken. Butterflocken auf den Rand
setzen, Eigelb, 3 EL Zucker und Rahm in die Mitte geben.</LI>

<P><LI>Alles mit bemehlten Messer hackend bearbeiten, bis feine Kr&uuml;mel
entstanden sind. Mit k&uuml;hlen H&auml;nden kurz zusammenkneten, zudecken und
k&uuml;hlen.</LI>

<P><LI>Den Teig in 2 Portionen nacheinander kurz geschmeidig kneten, auf
Mehlstaub d&uuml;nn ausrollen, zu Pl&auml;tzchen ausradeln oder ausstechen.</LI>

<P><LI>Pl&auml;tzchen mit Zimtzucker bestreuen, auf das Backblech legen,
auf Mitte in den Ofen schieben und hellgelb backen. Abk&uuml;hlen lassen,
in die Geb&auml;ckdose schichten, 4 Wochen daran zehren.</LI>
</OL>

<P>
<TABLE BORDER=0>
<TR><TD VALIGN=TOP><STRONG>Wichtig:</STRONG></TD>
<TD>Wichtig f&uuml;r dieses Geb&auml;ck ist dicke Sahne, die sich bei Sahne und Creme
Fraiche an der Oberfl&auml;che abgesetzt hat, wenn sie 1 bis 2 Wochen im K&uuml;hlschrank
geruht hat. Was &uuml;brig bleibt, ist fein f&uuml;r Saucen aller Art!</TD></TR>
</TABLE>

<BR>
<P>
<TABLE BORDER=0>
<TR><TD VALIGN=TOP><STRONG>Wichtig 2:</STRONG></TD>
<TD>Ein St&uuml;ck hat 114 Kalorien oder 478 Joule.</TD></TR>
</TABLE>

<BR>
<P>
<TABLE BORDER=0>
<TR><TD VALIGN=TOP><STRONG>Tip:</STRONG></TD>
<TD>Der m&uuml;rbe und bl&auml;ttrig backende Teig ist auch erstklassig f&uuml;r eine gedeckte
Apfeltorte. Daf&uuml;r 750g kleingeschnittene Cox oder Boskop nehmen, mit 4 EL
Korinthen und Zucker mischen. Boden und Decke mehrmals einstechen. Vanillezucker
und Butterflocken vor dem Backen aufstreuen.</TD></TR>
</TABLE>

<P><HR>

<P>
<A NAME="rez2"</A>
<H1>Mail&auml;nder Pl&auml;tzchen</H1>
                                           
<P>
Mail&auml;nder Pl&auml;tzchen ist ein zartes Knuspergeb&auml;ck, welches auch gut
mit Magarine gelingt und mit Magarine auch l&auml;nger haltbar ist.
Nehmen Sie eine Sorte, die zum Backen empfohlen wird - es steht auf
jeder Packung.

<P>
<H2>Die Zutaten f&uuml;r etwa 30 St&uuml;ck:</H2>
<UL>
<LI>250g weiche Butter oder Magarine</LI>
<LI>150g Zucker</LI>
<LI>1 EL Zitronenschale</LI>
<LI>2 Eier, 1 Eigelb</LI>
<LI>500g Mehl</LI>
<LI>30 Mandeln</LI>
<LI>etwas Salz</LI>
</UL>

<P>
<H2>Wie lange dauert es?</H2>
<UL>
<LI>Zubereitung: 45 Minuten</LI>
<LI>K&uuml;hlen: 20 Minuten</LI>
<LI>Backen: etwa 15 Minuten bei 200°</LI>
</UL>

<P>
<H2>So wird es gemacht:</H2>

<P><OL>
<LI>Butter in die R&uuml;hrsch&uuml;ssel geben, mit dem R&uuml;hrbesen schaumig r&uuml;hren, dabei
Zucker, geriebene Zitronenschale und Eier einr&uuml;hren. Auch etwas Mehl.</LI>

<P>
<LI>Weiteres Mehl mit dem Knethaken einr&uuml;hren. Oder den Teig auf das Mehl geben
und von Hand unterkneten. K&uuml;hlen.</LI>

<P>
<LI>Teig auf Mehlstaub ½ cm dick ausrollen. zu beliebigen Formen ausstechen.
Mit Mandeln belegen.</LI>

<P>
<LI>Eigelb, 2 EL Wasser und Salz verquirlen, die Pl&auml;tzchen damit bestreichen,
auf das Backblech legen und auf Mitte in den hei&szlig;en Ofen schieben. Backen, bis
die Kanten hell gebr&auml;unt sind. Warm vom Blech l&ouml;sen, auf einem Gitter abk&uuml;hlen
lassen.</LI></OL>

<P>
<TABLE BORDER=0>
<TR><TD><STRONG>Wichtig:</STRONG></TD>
<TD>Ein St&uuml;ck hat 159 Kalorien oder 669 Joule.</TD></TR>
</TABLE>

<BR>
<P>
<TABLE BORDER=0>
<TR><TD VALIGN=TOP><STRONG>Tip:</STRONG></TD>
<TD>Geb&auml;ck in der Keksdose aufbewahren. Buttergeb&auml;ck bewahrt mindestens 4 Wochen
seine Frische, Geb&auml;ck mit Magarine doppelt so lange.</TD></TR>
</TABLE>

<BR>
<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
<TD><A HREF="talk02.htm"><IMG SRC="../images/back2.gif" ALT="Zur&uuml;ck" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
<TD><A HREF="talk04.htm"><IMG SRC="../images/next2.gif" ALT="Weiter" BORDER=0 WIDTH=32 HIGHT=32></A></TD>
</TR></TABLE>

<HR>
                                           
</BODY>
</HTML>

