<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,midnight sun,metal machine">
<title>Midnight sun: Metal Machine</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Midnight Sun: Metal Machine</font></h1><BR> (45:57 / LMP)</center></P>
<p>Hmm, das ich nix gegen gut gemachten True Metal habe d&#252;rfte hinl&#228;nglich bekannt sein 
- was Midnight Sun auf ihrem neuesten Album &quot;Metal Machine&quot; abliefern, geht aber sogar 
mir auf den Senkel. So fabrizieren Midnight Sun besten Kinderlied Metal, der die 
Burschen vom HammerFall im direkten Vergleich wie eine extreme Grindcore Band 
aussehen l&#228;sst. Songtitel wie &quot;Dungeons Of Steel&quot;, &quot;Steel To Steel&quot;, &quot;Metal Will Stand Tall&quot; und 
&quot;Metal Gods&quot; zeugen schonmal nicht von intellektuellen Lyrics, k&#246;nnen aber - wie man nicht nur 
am Beispiel HammerFall erkennen kann - trotzdem Spass machen. Es liegt vielmehr am 
billigen und unterirdisch schlechten Songwriting der Jungs von Midnight Sun, das die 
Mischung aus melodischen Power Metal und einigen Hardrock Elementen zur Realsatire 
verkommen l&#228;sst. Durch die st&#228;ndigen unfreiwilligen (?) Lacheinlagen, die diese CD so 
hervorruft, will auch keiner der Songs so wirklich im Geh&#246;rgang h&#228;ngen bleiben und es 
wundert mich echt, dass sich Flower Kings Mukker Jaime Salazar sowie Last Tribe Member 
Magnus Karlsson f&#252;r diese Combo aufopfern. Na ja, immerhin wird dadurch sichergestellt, 
dass spielerisch zumindest alles im gr&#252;nen Bereich ist, auch wenn das nat&#252;rlich viel zu 
wenig ist, um die CD ernst zu nehmen oder gar empfehlen zu k&#246;nnen. Wer mir das bis 
dato einfach nicht glaubt, der m&#246;ge sich nur den abschlie&#223;enden Rauskicker &quot;Metal Will 
Stand Tall&quot; anh&#246;ren und wird mir sp&#228;testens danach ohne Einschr&#228;nkungen zustimmen k&#246;nnen. Tja, insgesamt dr&#228;ngt sich mir doch arg der Verdacht auf, dass die Musiker von 
Midnight Sun es mit ihrem extrem berechenbaren und ohne Funken von Spielfreude 
vorgetragenen Metal eher auf die schnelle Mark abgesehen haben, denn das dieser Stil 
nach wie vor angesagt ist, d&#252;rfte sich inwzischen bis in den letzten Winkel Alaskas 
herumgesprochen haben. Wenn man zudem bedenkt, dass Midnight Sun fr&#252;her 
ernstzunehmende Musik auf die Headbanger losgelassen haben, wirkt dieser Vorwurf 
umso schwerer. Also, selbst wenn ihr zu den beinharten True Metallern auf diesem 
Planeten geh&#246;rt m&#246;chte ich Euch inst&#228;ndig bitten diese halbgare Platte links liegen zu 
lassen und die gespaarte Knete lieber anderweitig zu investieren. Denn es gibt aber auch 
gar nichts, was den Kauf dieser Platte rechtfertigen w&#252;rde. Ach doch: Das Cover kann f&#252;r 
so manche Belustigung sorgen, passt allerdings ansonsten qualitativ zum Niveau der 
Musik.</P>  

<p>Fazit: 1.5 von 10 Punkten</P>

<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>






<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
