<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,thought sphere,gold">
<title>Thought Sphere: Gold</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Thought Sphere: Gold - Maxi CD</font></h1><BR> (12:53 / B.Mind Records)</center></P>

<p>Das 2000er Album &quot;A Vague Horizon&quot; geh&#246;rte f&#252;r mich pers&#246;nlich mit zu den Highlight`s im progressive Bereich des letzten Jahres und seit geraumer Zeit warte ich auf ein neues Lebenszeichen von Thought Sphere. Selbiges bekam ich dann schlie&#223;lich in Form der Maxi CD &quot;Gold&quot;, die vor kurzem erschienen ist und das Warten auf das n&#228;chste Album &quot;Eos&quot; angenehm verk&#252;rzen soll. Und diesen Zweck erf&#252;llt diese Maxi CD vollauf: Neben einer Live Version von &quot;Thought Sphere 2000&quot; vom letzten Album gibt es mit &quot;Eos (The Nightingale`s Last Flight)&quot; noch einen superben Track von der neuen Scheibe zu h&#246;ren, der die Vorfreude auf die n&#228;chste Langrille wieder in absolut hohe Dimensionen anwachsen l&#228;sst. Das Titelst&#252;ck der Maxi - die Coverversion des Spandau Ballet Hit`s &quot;Gold&quot; - wurde komplett umarangiert und in eine richtig geile Hymne verwandelt, die die Jungs mehr von ihrer melodischen Seite zeigt und absolut Spass macht. Tja, und abgerundet wird die Single dann noch von der einmin&#252;tigen Death Metal Verarsche &quot;Mom`s Gonna Be Pissed&quot; - vom Spa&#223;faktor h&#228;tte das Teil auch auf der letzten Edguy Single oder dem n&#228;chsten J.B.O. Album stehen k&#246;nnen und hat somit seinen Zweck erf&#252;llt. Ergo: Die Maxi CD macht  auf jeden Fall Bock auf mehr und kann von allen Fans der Band und jenen, die die Zeit bis zum Release von &quot;Eos&quot; &#252;berbr&#252;cken m&#246;chten, blind abgegriffen werden.</P>

<p>Fazit: ---</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd7.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
