<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>
<p><li>Erwartungsgem&#228;&#223; gibt es in diesem Monat nat&#252;rlich auch einen Nachschlag zum 
<b>Helloween</B> Split: Laut Gitarrist Roland Grapow seien er und Uli Kusch von der Entscheidung 
genauso &#252;berumpelt worden, wie die zahlreichen Helloween Fans. Es habe vorher kein 
Bandmeeting gegeben und Roland Grapow wurde offensichtlich nur von seiner Frau von 
dem Rausschmiss informiert. Aus dem verbleibenden Helloween Lager kommt derweil von 
Michael Weikath die Meldung, dass es schon zu &quot;Time Of The Oath&quot; Zeiten (also 1996) 
Spannungen in kreativer Hinsicht gegeben h&#228;tte, da man einfach nicht wie ein fest 
verschwei&#223;tes Team gearbeitet h&#228;tte. Die zahlreichen Nebenprojekte waren ein weiterer 
Grund f&#252;r den Rausschmiss. Im gleichen Atemzug zeigt sich Herr Weikath auch mit dem 
aktuellen Longplayer &quot;The Dark Ride&quot; nicht mehr so zufrieden und m&#246;chte mit dem n&#228;chsten Studioalbum ein wenig zu den Helloween Roots zur&#252;ckkehren. Immerhin haben 
die K&#252;rbisk&#246;pfe schonmal einen neuen Drummer an Bord geholt: Die Rede ist von Mark 
Cross, der bis dato bei Metalium die Schie&#223;bude beackert hatte. Ersatz f&#252;r Gitarrist Roland 
Grapow gibt es aber bisher noch keinen.</LI></P>

<p><li> Mit dem Ausstieg von Drummer Mark Cross bei <b>Metalium</B> - der &#252;brigens freundschaftlich 
verlaufen sein soll - ist bei dieser Band mal wieder das alte Line-up Problem aufgetaucht, 
zumal ja auch noch der nach Savatage abgewanderte Gitarrits Jack Frost ersetzt werden 
muss. Diese Line-up Probleme, die sich seit dem 1999 erschienenen Debutalbum wie ein 
roter Faden durch die History dieser Band ziehen, halten Metalium aber offenbar nicht 
davon ab, neues Material zu schreiben. So steckt die Band gerade in den Songwriting 
Sessions f&#252;r das dritte Album Chapter III. Um den Fans die Wartezeit etwas zu verk&#252;rzen, 
erscheint im November ein Boxset mit Video (DVD / VHS) und einer Live CD mit sechs 
Tracks. Vertrieben wird das ganze unter dem Titel &quot;Metallian Attack - Part I&quot;, was nahelegt, 
dass es auch in absehbarer Zeit einen zweiten Teil geben wird.</LI></P>

<p><li> Zur Abwechselung gibt es von der <b>Manowar</b> Front auch mal wieder gute News zu 
vermelden: So soll bereits im Januar 2002 eine neue Single ver&#246;ffentlicht werden und der 
vollst&#228;ndige Longplayer soll dann auch nicht mehr lange auf sich warten lassen. Falls dies 
wirklich der Fall ist, z&#228;hle zumindest ich schonmal die Tage bis Januar. Somit d&#252;rfte das 
Release der Manowar DVD Hell On Earth - Part I f&#252;r die Fans, die das Video schon 
besitzen, eher uninteressant sein, auch wenn die DVD 15 Minuten Bonusmaterial enthalten 
soll und zudem mit den Worten &quot;v&#246;llig &#252;berarbeitet&quot; angepriesen wird.</LI></P>

<p><li>Im Fr&#252;hjahr des n&#228;chsten Jahres soll es endlich mal wieder eine Live Platte von <b>Savatage </B>
geben, was aufgrund des neuen Line-ups auch Sinn macht. Bleibt nur zu hoffen, dass sich 
das Release dieser Platte nicht genauso ewig hinzieht wie das des letzten Studioalbums 
&quot;Poets And Madmen&quot;.</LI></P>

<p><li> F&#252;r den Herbst n&#228;chsten Jahres ist das n&#228;chste Sologeschoss von Iron Maiden Frontmann 
<b>Bruce Dickinson</B> angesetzt. Sobald sein Producer / Co-Songwriter / Kumpel Roy Z. die 
Arbeiten zur neuen Halford Platte abgeschlossen hat (selbiger soll bereits im Fr&#252;hjahr / 
Sommer in den L&#228;den stehen), wollen die beiden mit den Aufnahmen beginnen. 
Allerdings wird aus dem urspr&#252;nglichen angedachten Trinity Projekt von Bruce Dickinson, 
Rob Halford und Geoff Tate nichts mehr werden, da die vier Songs, die Bruce bisher 
komponiert hat, nicht zu den drei unterschiedlichen Stimmen passen und wahrscheinlich 
auf seinem n&#228;chsten Longplayer landen werden.</LI></P>

<p><li>Die dreifach <b>Dream Theater</B> Liveplatte Live Scenes From New York musste erneut auf 
unbestimmte Zeit verschoben werden. Am Tag der Terrorakte in Amerika ver&#246;ffentlicht, 
zeigte das Artwork eine brennende New York City Skyline inkl. des World Trade Centers. 
Nach dem Bekanntwerden der Attentate wurde die Scheibe nat&#252;rlich sofort wieder aus 
den L&#228;den genommen. Ein neuer Termin f&#252;r das Release steht bisher noch nicht fest (Nachtrag: Ist inzwischen aber regul&#228;r im Handel erh&#228;tlich...). </LI></P>

<p><li> Nachdem die langj&#228;hrigen Mitglieder, Dirk und Micha im September ihre
Zusammenarbeit mit <b>Custard</B> beendet haben sind nun f&#252;r beide Positionen
ad&#228;quate Nachfolger gefunden. Der neue Mann an der Axt ist Holger Simon (ex-Phalanx) und der neue 
4-Saiter h&#246;rt auf den Namen Jens Schr&#246;der. Was das neue Line-up bringt, wird sich anhand der n&#228;chsten Scheibe zeigen m&#252;ssen. Derweil wurde die l&#228;ngts 
vergriffene &quot;God Of Storm&quot; EP (Eigenregie) mit dem erstan Album &quot;Kingdoms Of Your Life&quot; zusammengelegt und mit einem leicht modifizierten Cover wieder
ver&#246;ffentlicht.  </LI></P>

<p><li>Der Wattenscheider Gitarren Hero <b>Axel Rudi Pell</B> entert im Dezember erneut mit seiner bew&#228;hrten Band das Studio um sein n&#228;chstes Album mit dem Arbeit
stitel &quot;Shadow Zone&quot; aufzunehmen. Ein Release ist f&#252;r Mai 2002 angedacht, kann sich aber nat&#252;rlich noch nach hinten verschieben.</LI></P>

<p><li> Ganz aktuell gibt es noch einen Nachschlag zu <b>Helloween</B>: Da sich die Ger&#252;chte in letzter Zeit verdichten und zudem aus ansonsten recht seri&#246;sen Quellen stammen, komme ich nicht umhin, diese zumindest auch in der Metal Corner zu ver&#246;ffentlichen, wobei betont sei, dass es noch keine offiziellen Info`s dazu gibt: So soll Gamma Ray Gitarrist Henjo Richter bei den K&#252;rbisk&#246;pfen einsteigen. M&#246;gliche Erkl&#228;rungen gibt es dazu viele, wobei ich an dieser Stelle verzichte, diese aufzuf&#252;hren, da sich evtl. alles als heisse Luft herausstellt.</LI></P> </UL>


<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
