<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Vorwort</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><b>Metallische Gr&#252;&#223;e!</B><br>
Vor Euch liegt wieder einmal eine neue Ausgabe der Metal Corner, die mal wieder 
randgef&#252;llt ist mit Interviews, CD Kritiken, News und den anderen Rubriken. Das diese 
Ausgabe mal wieder so gut gef&#252;llt ist hat nat&#252;rlich seine Gr&#252;nden, streben die 
Plattenfirmen momentan anscheinend dem absoluten Release Overkill an. Nicht anders 
kann ich mir erkl&#228;ren, dass so viele Platten auf den potenziellen K&#228;ufer losgelassen 
werden. Klar, darunter befinden sich zahlreiche Highlights, aber die eine oder andere Ver
&#246;ffentlichung h&#228;tte man sich auf der anderen Seite auch mal wieder durchaus klemmen k
&#246;nnen. Da aber bald schon wieder die Weihnachtszeit anf&#228;ngt, wird dieser Trend wohl 
eher noch fokussiert werden und ich gehe einfach mal davon aus, dass mal wieder 
zahlreiche Special Editions, Best Of`s und Rereleases in den Weihnachtstagen den Weg in 
die Verkaufsregale finden werden - und nicht nur im Musik Bereich d&#252;rfte sich dieser 
kommerzielle Trend in der eigentlich beschaulichen Jahreszeit bemerkbar machen; auch 
alle anderen Bereiche quellen nur gerade so &#252;ber vor Angeboten. Aber gerade nach den 
letzten Wochen w&#228;re es doch mal wieder sch&#246;n, wenn man Weihnachten mal wieder auf 
das reduzieren w&#252;rde, was es urspr&#252;nglich einmal war - dies wird aber mitnichten der Fall 
sein und insofern stellt sich doch die Frage, was all die Aktionen nach den Terroranschl
&#228;gen von Amerika einige Wochen sp&#228;ter noch wert sind. Denkt mal dr&#252;ber nach und Euch 
wird wohl klar werden, dass hier mal wieder mit zweierlei Mass gemessen wurde. 
Allerdings liegt es mir an dieser Stelle auch fern den gro&#223;en Moralapostel zu spielen und 
deswegen beende ich dieses kleine Gedankenspiel an dieser Stelle mal, um Euch nicht nur 
in die aktuelle Ausgabe, sondern auch die Vorweihnachtszeit zu verabschieden. Sp&#228;testens 
wenn ihr in &#252;berf&#252;llten Kaufh&#228;usern in langen Schlangen voller Menschen steht, k&#246;nnt ihr 
ja nochmal &#252;ber die obigen Worte nachdenken.</P>

<p>Stay heavy,</P>

<p>Kilian<blink> &quot;The Bruce&quot;</blink> Servais</P>
<p>P.S.: Da das Nachwort ersatzlos gestrichen wurde, weise ich an dieser Stelle nochmal 
darauf hin, dass auch im n&#228;chsten Monat die Metal Corner wieder p&#252;ntklich Anfang des 
Monats erscheinen wird. Neuerdings biete ich auch die M&#246;glichkeit an, die Metal Corner 
per E-Mail Abo zu beziehen. Wer Interesse hat, der soll mich einfach unter 
kilianservais@gmx.de anmailen und wird dann automatisch in die Liste aufgenommen!</P>

<p>P.S. 2: Auf der Powerplant Homepage hat sich in Sachen Interviews auch mal wieder 
einiges getan. Ihr k&#246;nnt ja mal unter <a href="http://www.radio-powerplant.de.vu " target="_blank">http://www.radio-powerplant.de.vu</A> nachschauen!</P>


<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
