<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, helloween, hansen, walls, of, jericho">
<title>Oldie Review: Helloween`s Walls Of Jericho</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="gray">Oldie Review: Helloween`s Walls Of Jericho</font></center></h1></P>

<p>Helloween geh&#246;ren seit jeher zu einer meiner Lieblingsbands im Metal Bereich und wer regelm&#228;&#223;ig die Metal Corner lie&#223;t, der d&#252;rfte das auch wissen. Ein entsprechendes Album der Hamburger herauszusuchen war zwar alles andere als einfach, aber mit &quot;Walls Of Jericho&quot; habe ich mich schlie&#223;lich doch noch f&#252;r eines entscheiden k&#246;nnen. Vorneweg eine kleine Anmerkung: Die CD &quot;Walls Of Jericho&quot;, die man heute im Laden kaufen kann, setzt sich aus der offiziellen Debut EP &quot;Helloween&quot;, dem Album &quot;Walls Of Jericho&quot; sowie der Mini LP &quot;Judas&quot; zusammen.</P>

<p>Geboten wird auf der gut 70 min&#252;tigen CD feinster Heavy Metal mit dem einen oder anderen kleinen Speed Metal Splitter - mit den heutigen Helloween haben die fr&#252;heren Helloween zwar nur noch sehr sekund&#228;r zu tun, was u.a. auch daran liegt, da&#223; damals noch ein gewisser Kai Hansen, der heute mit Gamma Ray einen Erfolg nach dem anderen feiert, f&#252;r Helloween als S&#228;nger, Gitarrist und Songwriter t&#228;tig war, aber das ist keineswegs nagativ gemeint, zumal ich ohnehin der Meinung bin, da&#223; die alten Helloween qualitativ besser sind als die heutigen. Insgesamt wirkt &quot;Walls Of Jericho&quot; wie aus einem Guss und Hymnen f&#252;r die Ewigkeit finden sich nat&#252;rlich auch zuhauf: Neben den Speed Nummern &quot;Starlight&quot;, &quot;Murderer&quot; und &quot;Metal Invaders&quot; ragen insbesondere 
noch die umfangreicheren Kompositionen &quot;Victim Of Fate&quot; sowie &quot;How Many Tears&quot;, die beide obendrein durch interessante Thematiken bestechen, hervor. Nicht vergessen werden darf an dieser Stelle nat&#252;rlich die Kai Hansen Jahrhundertkompositionen &quot;Ride The Sky&quot;, die auch heute noch zahlreiche Fans auf Gamma Ray Konzerten wahnsinnig werden l&#228;sst und wohl das eindeutige Highlight auf &quot;Walls Of Jericho&quot; ist. Ach ja: True Metal Maniacs bekommen das volle Brett mit der Hymne &quot;Heavy Metal Is The Law&quot; - alleine schon der Name d&#252;rfte selbsterkl&#228;rend sein.</P>

<p>Schwache Songs oder gar Ausf&#228;lle findet man auf &quot;Walls Of Jericho&quot; garantiert nicht und ich kann jedem Heavy Metal Fan nur empfehlen, &quot;Walls Of Jericho&quot; beim CD H&#228;ndler nicht links liegen zu lassen, denn es geh&#246;rt wohl mit zu den 10 besten deutschen Heavy Metal Alben &#252;berhaupt und somit auch in jede gut sortierte Metal Sammlung. Fans des aktuellen True Metal Trends kommen mit &quot;Walls Of Jericho&quot; - ebenso wie mit den beiden Nachfolgealben &quot;Kepper Of The Seven Keys-Part I + II&quot;- auf jeden Fall auf ihre Kosten und werden diese unbeschreibliche CD nicht mehr missen wollen. Wetten?</P>

<p>Fazit: 10 von 10 Punkten</P>
 <center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
