<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. Eyetech k&uuml;ndigt Auslieferung des AmigaOne an

Die folgende &Uuml;bersetzung von Christoph Gutjahr wurde uns freundlicherweise 
von unserem Partner amiga-news.de zur Verf&uuml;gung gestellt:

»AmigaOneG3-SE and AmigaOne-XE Earlybird Systeme jetzt erh&auml;ltlich! 

Wir sind endlich am Ziel. Seit dem letzten Update der AmigaOne-Sektion 
[unserer Webseite] vor &uuml;ber sechs Monaten befanden sich die AmigaOne Boards 
in den H&auml;nden unserer Entwickler und - als ein Resultat ihres Feedbacks - 
die urspr&uuml;nglich vorgesehene Firmware (von Softex) wurde durch ein speziell 
angepasstes PPCBoot BIOS ersetzt. Dies und die Identifikation - und 
Beseitigung - eines kleinen Problems mit dem Articia Northbridge Chip sind 
daf&uuml;r verantwortlich, dass wir die Auslieferung der Endkunden-Version des 
AmigaOneG3-SE verschoben haben. Bis jetzt! 

In diesem Zeitraum wurde auch am AmigaOne-XE Design (welches austauschbare 
CPU-Module besitzt) weitergearbeitet. Dieses Design ist nun ebenfalls 
soweit, dass es zusammen mit dem AmigaOneG3-SE in Produktion gehen kann. 
Und vielleicht die besten Neuigkeit von allen ist, dass die G4 CPU jetzt in 
kleineren St&uuml;ckzahlen, zu akzeptierbaren Lieferbedingungen und Preisen 
erh&auml;ltlich ist, so dass wir in der Lage sind, G4-basierte AmigaOne-XE 
Modelle zum selben Zeitpunkt anzubieten, zu dem auch der Verkauf des 
AmigaOneG3-SE startet. 

Das Ergebnis ist, dass wir ab der WoA-SE Show am 2. November Bestellungen 
sowohl f&uuml;r den 600MHz G3-basierten AmigaOneG3-SE als auch f&uuml;r den 800MHz 
G4-basierten AmigaOne-XE annehmen - mit Auslieferung vor Weihnachten (und 
f&uuml;r die Zyniker da drau&szlig;en, ja wir sprechen von Weihnachten 2002). Eine 700 
MHz G3 Version (750FX CPU) des AmigaOne-XE wird - zu reduzierten Preisen - 
zu Beginn des Jahres 2003 erh&auml;ltlich sein. 

"Aber was ist mit OS4" h&ouml;re ich Sie fragen - "ist das schon soweit?". OS4 
ist bereits weit fortgeschritten, aber nein, es ist derzeit noch nicht 
marktreif - haupts&auml;chlich da Hyperion einen betr&auml;chtlichen Teil ihrer Zeit 
in die Anpassung der AmigaOne PPCBoot Firmware investieren mussten. Wir 
sch&auml;tzen, dass OS4 f&uuml;r den AmigaOne Anfang 2003 ausgeliefert werden wird. 

Also warum sollten Sie bereits jetzt einen AmigaOne bestellen? Nun, wir 
hatten in den letzten sechs Monaten eine &uuml;berw&auml;ltigende Nachfrage, sowohl 
von H&auml;ndlern als auch von Endkunden, den AmigaOne (sowohl Motherboards als 
auch komplette Systeme) bereits jetzt mit LinuxPPC und UAE auszuliefern, 
noch bevor OS4 erh&auml;ltlich ist. Au&szlig;erdem hilft uns dieses "Earlybird" 
Angebot, das Testen, Herstellen und Ausliefern der AmigaOne Boards und 
Systeme &uuml;ber mehrere Monate zu verteilen, was es uns wiederum erm&ouml;glicht, 
die Kosten niedrig zu halten. Deswegen bieten wir allen Kunden, die unser 
"Earlybird" Angebot wahrnehmen m&ouml;chten, eine kostenlose, registrierte Kopie 
von OS4 f&uuml;r den AmigaOne an, sobald diese Version des OS verf&uuml;gbar ist. 
Diese "kostenlose OS4 Version" entspricht einer Ersparnis von ungef&auml;hr 12% 
beim Kauf eines AmigaOneG3-SE Motherboards. 

Dieses Angebot wird nat&uuml;rlich nicht jeden ansprechen, und wer ein 
"Einschalten und Loslegen" AmigaOne-Komplettsystem haben m&ouml;chte, sollte von 
unserem "Earlybird" Angebot keinen Gebrauch machen. Es tut uns leid, aber 
in diesem Fall m&uuml;ssen Sie sich noch ein paar Wochen gedulden. Wenn Sie das 
Angebot allerdings anspricht, dann z&ouml;gern Sie nicht l&auml;nger - dieses Angebot 
gilt f&uuml;r Motherboards und Komplettsysteme, die bis einschlie&szlig;lich 31. 
Dezember 2002 bestellt werden - oder bis OS4 erh&auml;ltlich ist, je nachdem was 
zuerst eintrifft. Danach wird OS4 ein separat erh&auml;ltliches Produkt werden. 

Die Preise wurden angepasst um die W&auml;hrungsverschiebungen seit den 
urspr&uuml;nglichen Ank&uuml;ndigungen im M&auml;rz auszugleichen, speziell die Schw&auml;che 
des US Dollars. Ihr lokaler H&auml;ndler wird Ihnen die lokalen Preise f&uuml;r den 
AmigaOne au&szlig;erhalb des UK oder der Eurozone nennen k&ouml;nnen. Die 
Preisempfehlungen f&uuml;r Europa - in UKP [britische Pfund] und Euro - sind wie 
folgt: 

Board           CPU                 UKP        Euro 
AmigaOneG3-SE   G3 750CXe@600MHz    360.00     580.00 
AmigaOne-XE     G3 750FX@700MHz     450.00     725.00 
AmigaOne-XE     G4 7451@800MHz      500.00     800.00 

Diese Preisangaben beinhalten weder Steuern, noch Versandkosten oder 
(abgesehen vom "Earlybird" Angebot) OS4. 

Was Komplettsysteme angeht, wird Ihnen Ihr lokaler H&auml;ndler n&auml;here Angaben 
zu standardisierten oder selbst zusammengestellten Systemen machen k&ouml;nnen. 
Beispielpreise und -konfigurationen f&uuml;r Komplettsysteme, die wir selbst in 
Gro&szlig;britannien anbieten werden sind hier zu finden. 

Die unten stehende Tabelle ist ein Vergleich der Features des AmigOneG3-SE 
und der G3- und G4-Versionen des AmigaOne-XE. 

Item                AmigaOneG3-SE     AmigaOne-XL (G3)     AmigaOne-XL (G4) 

CPU                 750CXe            750FX                7451 
CPU speed           600MHz            700MHz                   800MHz 
CPU upgradable      No                Yes                  Yes 
CPU socket          No                Yes                  Yes 
Max memory          2GB               2GB                  2GB 
Memory type                  jeweils DIMM Registered 133
Northbridge                  jeweils Articia 'S' with fix 
Southbridge         VIA 82C686B       VIA 82C686B          VIA 82C686B 
PCI 33MHz           3 Slots           3 Slots              3 Slots 
PCI 66MHz           1 Slot            1 Slot               1 Slot 
AGP speed           2x                2x                   2x 
Ethernet chip       3COM 820C         3COM 820C            3COM 820C 
USB ports                    jeweils 2 back plate+2headers 
PS2 ports                    jeweils Keyboard + mouse 
Serial ports                 jeweils 2 x 16650 equivalent 
Parallel port       1 x EPP/ECP       1 x EPP/ECP          1 x EPP/ECP 
IRDA port           On header         On header            On header 
Firmware                     jeweils PPCBoot + OS4 enabler
O/S capability               jeweils LinuxPPC + OS4«

(Quelle des englischen Originals: Eyetech)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
