<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

*Vollversion - "FileX"*
Mit der Gehnemigung von "Klaas Hermanns" erm&ouml;glicht die "Amiga Arena",die
Vollversion des Bin&auml;reditors "FileX".
/Folgende Features bietet FileX:/
 - Mehrere Files k&ouml;nnen in mehreren Edierfenster und/oder Edieransichten
gleichzeitig bearbeitet werden.
 - Die Edierfenster k&ouml;nnen auf jedem &ouml;ffentlichen Bildschirm ge&ouml;ffnet
werden
 - Clipboardkonverter
 - Fontsensitiv
 - Undo und Redo (nur durch vorhandenen Speicher begrenzt)
 - Umfangreiche Blockfunktionen
 - ARexxschnittstelle mit 77 Befehlen und asynchroner Kommandoshell
 - Drucken als Hexdump
 - 'Grab memory' zum Anzeigen und Ver&auml;ndern des Speichers
 - AppWindow.


*"Aqua" Deutsche Version erschienen*

Emerald Imaging, Fun Time World und Amiga Arena freuen sich Ihnen erstmals
die komplett deutsch lokalisierte Version des Adventurespiels Aqua
pr&auml;sentieren zu d&uuml;rfen. Zusammen mit dem Entwickler und mit Hilfe von 
Christian Busse ist es uns gelungen das Myst &auml;hnliche Spiel vollst&auml;ndig zu 
&uuml;bersetzen. Aqua ist ab sofort erh&auml;ltlich. Im vergleich zu der englischen 
Version wurden bekannte Fehler behoben. Das Spiel wird in einer v&ouml;llig neu 
gestalteten DVD-Verpackung ausgeliefert. Sie erhalten das Spiel bei Fun 
Time World f&uuml;r nur 17,- EUR + Versandkosten.

Vertrieb&Verkauf:

Fun Time World c/o Sebastian Brylka
Wiehagen 78
45879 Gelsenkirchen

Tel.: 0209-14 85 620 (nach 17 Uhr) Fax: 0209-14 85 720
e-Mail: funtime@t-online.de - www.funtime-world.de


Aqua - Info
-----------

Systemanforderungen:

AmigaOS mit 68020 Prozessor, 8 MB RAM, AGA oder
Grafikkarte und ein CD-ROM-Laufwerk.


Story:

Sie haben von dem mysteri&ouml;sen Untergang einer Bohrinsel geh&ouml;rt und glauben
dass wertvolle Gegenst&auml;nde das Ungl&uuml;ck &uuml;berstanden haben k&ouml;nnnten.
Sie stehen nun auf dem zum Boot f&uuml;hrenden Landungssteg, bereit, Ihre grosse
Schatzsuche zu beginnen.
Ein Geheimnis, das Sie auf die Reise Ihres Lebens f&uuml;hren wird.
Eine Reise in eine der Menschheit unbekannte Welt.
Eine Welt  voller Magie, Sch&ouml;nheit, Wunder, Mysterien, und einer
zerst&ouml;rerischen Macht, die &uuml;ber all ihre K&ouml;nigreiche herrscht.
M&uuml;hsal, Intrigen und grosser Lohn erwarten denjenigen,
der mutig genug ist, sich der Herausforderung zu stellen.
Haben Sie das Zeug dazu?


Features:

- hochaufl&ouml;sende Grafik
- 3D Raytracing-Optik
- animierte &Uuml;bergangs-Szenen
- gesamplete Kl&auml;nge
- einfache Zeige und Klick-Steuerung
- Speichern und Laden jederzeit im Spiel
- jede Menge Interaktion
- Ich-Perspektive
- ScreenMode-Requester
- Multitasking
- AGA- und RTG-kompatibel
- AHI-Sound
- UAE-kompatibel


Weiter Infos zum Spiel,Story und Screenshots finden Sie auf der Homepage
von:

Amiga Arena - http://www.online-club.de/~ARENA
Emerald Imaging -  http://www.telusplanet.net/public/samel

Eine spielbare Demoversion wird in k&uuml;rze ver&ouml;ffentlicht.


*"Hilt II" - Deutschsprachige Version (final)*
Die Amiga Arena pr&auml;sentiert in zusammenarbeit mit Christian Busse "Hilt II"
Deutschsprachige Version - Final.
Hilt II ist ein Strategiespiel mit RPG Merkmalen.
Sie m&uuml;ssen mit Ihrem Team verschiedene Operationen erf&uuml;llen.
Sie k&ouml;nnen Ihr Team selber zusammenstellen, wobei jede Einheit 
verschiedene F&auml;higkeiten aufweist.
Eine Umfrage zu Hilt II finden Sie auf der partnerseite von
http://www.amiga-news.de
Hilt II liegt zum Download im Bereich "Full versions / Arena Games" 
bereit.


*"FileX" Nachtrag*
Nachdem die Amiga Arena die Vollversion des Bin&auml;reditors "FileX"
ver&ouml;ffentlicht hat, besteht nun die m&ouml;glichkeit den Code 
vom Entwickler "Klaas Hermanns" bei Interesse zu erhalten.
Wer "FileX" also weiter entwickeln m&ouml;chte schreibt bitte an
klaas.hermanns@hybris.de


*"Hilt2" Mission Editor Online!*
Mit der Gehnemigung von "Mark Sheeky" ver&ouml;ffentlicht die "Amiga Arena"
den Mission Editor f&uuml;r das Strategy Spiel "Hilt2".
Mit dem Mission Editor lassen sich eigene Missionen sowie maps f&uuml;r das
Spiel erstellen.
Mit "Deapsea" und "Domeraid" liegen zudem zwei neue Misssionen in Deutscher
sprache bereit, sowie eine &uuml;berarbeitete Anleitung.

*FileX Info*
Duch die "Amiga Arena" Freigabe des Bin&auml;rEditors "FileX" haben sich
Interressenten gefunden die an m&ouml;glichen neuen Versionen entwickeln.


*Hilt2 News*

Auf der Hilt2 Homepage der "Amiga Arena"
(http://www.online-club.de/~ARENA/hilt.html
sind drei neue Missionen (Deapsea,Domeraid,Dreatnought)
hinzugef&uuml;gt worden sowie eine &Uuml;berarbeitete
Anleitung mit Screenshots.


*Hilt2 News*

*"Hilt II" - Deutschsprachige Disk Version Online*
Hilt2 Deutsche Version ist nun auch als eigenst&auml;ndige Disk Version Online.
In Zukunft brauchen Sie nur noch die "Mission Disk" f&uuml;r neue Missionen
downloaden.
Die Missionen "Reactor" und "Catacomb" wurden auf der Hilt2 Seite neu
ver&ouml;ffentlicht. (Mission Disk)
Hilt2 l&auml;st sich dirket von Disk oder HD spielen!
Bitte beachtet Sie dazu die Hinweise in der Deutschen Anleitung
die nun seperat zum download bereit liegt.


*"Hollywood Pictures" - Vollversion*
Mit dem Manager Spiel "Hollywood Pictures" erm&ouml;glicht die Amiga Arena eine
weitere Vollversion aus dem Hause "Sayonara Software".
Hierbei handelt es sich um die damals neu aufgelegte Version von "Starbyte
Software".
 
*"Hilt II" - Missionen final*
Die letzten Missionen Retrieve,Starwreck und Skeleton wurden &uuml;bersetzt.
Somit sind jetzt alle Missionen in der Deutschen Fassung spielbar,
sowie die Feldz&uuml;ge Tutorial,Terrorist und Holowar.
"Hilt II" erhielt vom "CU AMIGA" Magazin eine Bewertung von 91%.


*Amiga Arena Interview mit Chis Hodges" (Poseidon USB)*
Vielen Usern d&uuml;rfte der Name "Chris Hodges" schon seit mitte der 90er Jahre
ein Begriff sein da Chris neben einigen Demos,Tools auch bekannte PD Spiele
wie z.b. "Tubes" entwickelt hat.
Sp&auml;testens mit der Einf&uuml;hrung der USB Karten "Subway" und "Highway"
entwickelt von Michael B&ouml;hmer,d&uuml;rfte den meisten User die Software 
"Poseidon USB" von "Chis Hodges" ein Begriff sein,
da diese es letztendlich erm&ouml;glicht das die User in den Genuss der
am Markt vorhandenen USB Hardware f&uuml;r Ihren Amiga kommt.
Im Interview mit der "Amiga Arena" sprach "Chris H." wie es zu der
Entwicklung kam,welches Konzept hinter "Poseidon USB" steckt 
und was die User in Zukunft noch erwarten d&uuml;rfen.


*"Interview mit Achim Stegemann" (Digital Almanac,AmiChess)*
Mitte September k&uuml;ndigte "Achim Stegemann" auf seiner Homepage ein neues
Schachprogramm f&uuml;r den Amiga an.
Nachdem "AmiChess" so der Titel des Programms auf der Party der Amiga
Freunde Pfalz erstmals pr&auml;sentiert wurde,wollte die Amiga Arena wissen wann
mit der ver&ouml;ffentlichung zu rechnen ist und wie es zu der Entwicklung kam.
Lesen Sie zudem neue Informationen zu der Astronomie Software "Digital
Almanac 4.9" und wie es um die Zukunft von der Version IV f&uuml;r AmigaOS 4.x
ausschaut.


*"Hilt II" - HD Version*
Hilt II liegt nun als HD Version inklusiver Anleitung und neuen Mission
files (Spacelab,Bughunt1) zum download bereit.


*"PuzzleBOBS Update" - MorphOS Kompatibel*
"Fun Time World" in Kooperation mit der "Amiga Arena" pr&auml;sentieren in
Zusammenarbeit mit  "Nexus Development" ein weiteres Update f&uuml;r
"PuzzleBOBS".
Dies ist ein Update des ausf&uuml;hrbaren PuzzleBOBS Programms,welches MorphOS
und die Pegasos-Maschinen unterst&uuml;tzt.
Um diese Erweiterung zu installieren, m&uuml;ssen Sie das Demo-Archiv selbst
(3.5MB) herunterladen und das erste und  zweite PuzzleBOBS-Update
installieren.

Vertrieb    Support    Entwickler
 ---------------------------------

 Vertrieb:     Fun Time World    -
http://www.funtime-world.de/puzzlebobs/index.html
 Kontakt:      Sebastian B.      - FunTime@t-online.de

 Support:      Amiga Arena       - http://www.online-club.de/~ARENA/
 Kontakt:      Olaf K.           - olaf.koebnik@online-club.de

 Entwickler:   Nexus Development - http://www.genie.it/utenti/nexusdev
 Kontakt:      Emanuele C.       - emacesa@tin.it


*Amiga Arena Interview mit "Telemar Rosentreter" (AMHuhn)*
Vor wenigen Tagen ver&ouml;ffentlichte "Telemar Rosentreter" und "Franz Schlick"
(AmiForce), das Freeware Spiel "AMHuhn".
Hierbei handelt es sich um die Umsetzung des bekannten Spiels "Moorhuhn".
Im Interview mit der "Amiga Arena" erz&auml;hlt "Telemar Rosentreter" wie es zu
der Entwicklung kam, warum das Orginal Moorhuhn nicht umgesetzt werden
konnte und in wie weit sich "AMHuhn" von seinem Vorbild  unterscheidet.


팆iltII - Deutschsprachige HD Version Final

Mit dem aktuellen Archive des Startegie Spieles "Hilt II" liegen
nun alle Missionen und Feldz&uuml;ge in Deutscher Sprache vor.
Somit sind die &Uuml;bersetzungsarbeiten an Hilt2 beendet.
In Zukunft werden m&ouml;glicherweise die 2 Spieler Missionen
noch folgen oder Updates der Missionen/Feldz&uuml;ge.
Besonderen Dank an Mark Sheeky und Christian Busse die dies
erm&ouml;glicht haben.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
