<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Oldie but Goldie: »Xenon II - MegaBlast« 

Oder: Wie bewiesen wurde, dass Bitmap-Grafik schnell sein kann

Im Jahre 1988 war der Hunger nach actionreichen Spielen enorm, viele 
Softwarefirmen nahmen sich dieses Bedarfs an und &uuml;berboten sich gegenseitig 
immer wieder mit neuen, teilweise spektakul&auml;ren, H&ouml;chstleistungen in Sachen 
2D-Grafik.

Eine kleine, aber feine Softwareschmiede jedoch hatte sich zum Ziel 
gesetzt, die Konkurrenz auf die Pl&auml;tze zu verweisen. Das Erstlingswerk, das 
noch unter der Regie anderer Programmierer entstand, konnte hier noch nicht 
&uuml;berzeugen. Lahme Grafik und noch z&auml;herer Spielfluss verhalfen Xenon I 
nicht zum erhofften Durchbruch. Es ging etwas Zeit ins Land, als sich bei 
der erw&auml;hnten Firma zwei Leute meldeten, die unter dem Namen "Bitmap 
Brothers" firmierten und nach eigener Aussage die technisch perfekteste 2D-
Grafik schaffen konnten. Nach diversen Arbeitsproben wurde man sich schnell 
handelseinig, und die Arbeiten am schnellsten und perfektesten 2D-
Ballerspiel der damaligen Zeit konnten beginnen.

Dieses Spiel sollte zwar wieder den Namen des gl&uuml;cklosen Vorg&auml;ngers tragen, 
aber vom Gameplay her mit diesem nichts mehr gemein haben. Ziel war es, 
m&ouml;glichst viele Farben, m&ouml;glichst viele bewegte Objekte und m&ouml;glichst viel 
Scrolling in alle Richtungen auf den Bildschirm zu zaubern.

Die Konkurrenz schlief allerdings auch nicht und hatte in der Zwischenzeit 
einige Meilensteine der 2D-Grafik vorgelegt, die einzuholen nicht so 
einfach werden w&uuml;rde. Davon unbeeindruckt machten sich die "Bitmap 
Brothers" ans Werk und lieferten in erstaunlich kurzer Zeit ein Spiel ab, 
das zu dieser Zeit seinesgleichen suchte. Technisch brillante Grafik, 
tadelloses Gameplay und vor allem Action bis zum Abwinken erschien damals 
auf den Bildschirmen der ersten offiziellen Tester. Auf vielen Messen war 
gebanntes Staunen zu beobachten, wenn die Demoversionen von Xenon 
vorgef&uuml;hrt wurden, und die Konkurrenz war sprachlos. Was hier geboten 
wurde, &uuml;bertraf die Erwartungen in die vorhandene Technik bei weitem.

Da w&auml;re als erstes die Grafik zu nennen, die den Eindruck erweckte, aus 
wesentlich mehr als 32 Farben zu bestehen. Es waren nat&uuml;rlich nur 32 
Farben, aber dank geschickter Wahl der Grundfarben und gewitztem Einsatz 
des Coppers hatte man die M&ouml;glichkeit, sehr sanfte Farbabstufungen f&uuml;r die 
meisten wichtigen Objekte zu verwenden. Die Grafik war wirklich bombastisch 
f&uuml;r die damalige Zeit, sehr detailreich und vor allem immer in Bewegung. 
Dazu trugen gerade die Massen an bewegten Objekten bei, die gleichzeitig 
auf dem Bildschirm zu sehen waren. Genaue Zahlen sind nicht bekannt, aber 
es geht das Ger&uuml;cht um, es w&auml;ren zeitweise &uuml;ber 150 bewegte Objekte zu 
sehen. Viele dieser Objekte waren dazu noch brillant animiert und schufen 
die Illusion massenhafter Bewegung.

Der Sound des Spiels war ebenfalls eine Ohrenweide. Musik und Soundeffekte 
&uuml;berzeugten durch brillanten Klang und schufen eine unvergleichliche 
Atmosph&auml;re. W&auml;hrend des eigentlichen Spiels lief eine hitverd&auml;chtige 
Komposition, und viele Spieler lie&szlig;en das Spiel laufen, auch wenn sie keine 
Lust zum Spielen hatten, nur um dieser Musik zu lauschen. Die Effekte 
&uuml;berzeugten durch reichlich Bass und klare H&ouml;hen, und Fachleute fragten 
sich immer wieder, wie man eine derma&szlig;en gro&szlig;e Datenmenge &uuml;berhaupt mit den 
damals sehr bandbreitenbegrenzten Bussystemen bew&auml;ltigen konnte. Dass es 
ging, war ja nun bewiesen, aber niemand wusste so richtig, wie.

Die "Bitmap Brothers" hatten mit diesem Titel ein Werk geschaffen, das sie 
auf den Thron der Actionspiel-Macher hob. Auch sp&auml;ter lieferten sie Spiele 
ab, die Meilensteine werden sollten.

Leider ist dieses Spielegenre ein wenig in Vergessenheit geraten, nur 
wenige Spieler haben heute noch Lust, ein 2D-Scroll-Ballerspiel zu zocken. 
Die Meinung der wenigen &uuml;briggebliebenen Hardcore-Ballerer hat sich aber in 
einem Punkt immer noch nicht ge&auml;ndert: Xenon II Megablast ist ein Spiel, 
das auch heute noch durch seine bestechend schnelle und detailreiche Grafik 
und den bombastischen Sound &uuml;berzeugen kann.

&Uuml;berzeugen kann man sich selbst nat&uuml;rlich am besten, indem man diesen Titel 
einfach mal auf einem der verf&uuml;gbaren Emulatoren oder einem echten Amiga 
500/2000/1000 spielt. Auf den moderneren Maschinen l&auml;uft es leider nur in 
sehr wenigen F&auml;llen, denn auf Zukunftskompatibilit&auml;t hat zu dieser Zeit 
kaum einer der Produzenten Wert gelegt. Aber es gibt ja die Emulatoren. :)

Wolfgang Hosemann &lt;whose@gmx.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
