<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>AMIGA Plus CD-Rom</TITLE>
   <META NAME="AUTHOR" CONTENT="Dark Evil">
   <META NAME="DESCRIPTION" CONTENT="AMIGA Plus Test">
   <META NAME="KEYWORDS" CONTENT="AMIGA Plus">
   <META NAME="GENERATOR" CONTENT="Dark Evil with the Evil Hands">
</HEAD>
<BODY BACKGROUND="back.png" BGCOLOR="Black" TEXT="White" LINK="Red">
<CENTER>
<IMG SRC="logo.gif" ALT="LINE" WIDTH=637 HEIGHT=133 ALIGN="MIDDLE"><BR>
<IMG SRC="line.gif" ALT="LINE" WIDTH=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
</CENTER>
<H1><FONT COLOR="FFFFFF">AMIGA PLUS CD ROM Nr.3 (JUNI/JULI)</H1>
<BR><H2><FONT COLOR="AAAAAA">
Als Ich mir die Neue AMIGA PLUS CD Rom kaufte war Ich noch recht zuversichtlich
da ja meistens ein paar MB's an Programmen oder Daten dabei ist die man doch
noch gebrauchen kann, naja Kurzerhand die Schillerscheibe ins CD-Laufwerk und Los
ging es. Als erstes mal ausprobiert ob die Assign diesesmal Funktionieren und
welche &#220;berraschung es ging, als n&#228;chstes war dan das beiligende Guide File dran
welches aussah wie es immer Aussah also mal den Inhalt angeclickt und dann der 
Schock weit und breit keine Funktion zum suchen von Datein nur der Hinwei&#223; das
der Schwerpunkt der CD auf das Gebiet Online f&#228;llt und das man ja so viele tolle
Programme auf dieser CD findet hier mal kurz die Daten die auf der Verpackung 
findet in den Klammern findet man die genauen MByte Angaben.<BR><BR>
<FONT COLOR="FFFFFF">
&#220;ber 600 (595 MByte) MByte tolle Neue Software d&#252;r ihren AMIGA<BR>
Anwendugssoftware und Spiele<BR>
EXTRA: Demos und Animation<BR><BR>

<UL><LI>300 MByte (303 MByte)
<LI>PD Programme mit aktuellen und wichtigen Programmen f&#252;r ihren Amiga. Da wird jeder f&#252;ndig</UL>

<UL><LI>140 MByte (148 MByte)
<LI>Bilder, Animationen und Demos der Spitzenklasse</UL>

<UL><LI>45 MByte (42 MByte)
<LI>Online Software-ob Internet, EMail, Chaten oder Mailbox surfen-sie gehen mit der Amiga plus online</UL>

<UL><LI>30 MByte (27 MByte)
<LI>Spiele, von Klassikern bis zu aktuellen Spielen</UL>

<UL><LI>50 MByte (52 MByte)
<LI>Musik</UL>

<UL><LI>15 MByte (11 MByte)
<LI>Icons f&#252;r die g&#228;ngigen Icon Systeme</UL>

<UL><LI>30 MByte (12 MByte)
<LI>Systemdaten</UL><BR><BR>

<FONT COLOR="AAAAAA">Das h&#246;rt sich doch ganz gut an oder etwa nicht so dachte Ich endlich mal ein paar neue
Programme und Updates aber als erstes mal auf Multimedia geclickt und sich die Bilder
angeguckt wo sich wie sollte es auch anders sein nur Gerenderte Bilder befinden die so
Schlecht das Ich beinahe Kreisrunden Haaraufall bek&#246;mmen h&#228;tte und das Animations Verzeichnis
ist auch nicht gerade besser man findet hier 3 verschiedene Animations Formate IFF-Anim, CDXL und
MPG wobei die MPG animationen nicht mal ein Icon haben wie auch Zwei der IFF-Animationen
nachdem Ich mich nur noch wundern konnte wie man sowas &#252;berhaupt Verbrechen kann ging es
auf in das Demo Verzeichniss wo Ich dann die Neuen Alten Demos bewundern konnte die es allesamt
schon auf den AMINET CD's gab echt ent&#228;uschent die sache und weiter ins Musik Verzeichniss
wo es dann wieder mal ein paar Module gab mit alten Icon aber es gibt dort auch noch MP3 Files
die nat&#252;rlich keine Icons haben, wieso sollten da auch Icons sein vielleicht w&#228;hre es ja viel
zu einfach gewesen, nun auf zu den Icons wo sich zwei Schubladen finden, eine f&#252;r NewIcon WB's
und die andere f&#252;r Magic WB &#252;ber diese Verzeichnisse kann man nur sagen das man hier eigentlich
nichts Falsch machen konnte obwohle ein paar MBytes mehr auch nicht sclecht gewesen w&#228;hren.
&#220;ber das Verzeichniss Spiele lohnt sich eigentlich kein Wort zu Verlieren weil man hier auch
nur Games aus dem AMINET findet und die Auswahl ist auch mehr Schlecht als Recht es gibt da
allerdings ein Paar Spiele wie z.b. Doktor, Battle Duell, Deluxe Galage und Deluxe Pac-Man
die von Ihrer Qualit&#228;t her &#220;berzeugen k&#246;nnen. Nun aber zu den Anwendungen wo man zu 95% nur
alte Programme findet oder besser gesagt nicht die Aktuellen Versionen der Programme deswegen
werde Ich nicht weiter auf diese Verzeichnisse nich weiter eingehen, nun zum letzten Verzeichniss
n&#228;hmlich dem Schwerpunkt ONLINE wo man alles findet was man f&#252;r das internet braucht wie etwa
Verschiedene Browser, Chat, EMail und Mailbox Programme leider sind die meisten Programme
nur Demos und was Ich hier Vermisse sind die HTML Tools welche f&#252;r viele bestimmt Interessant
gewesen w&#228;hren.<BR><BR>

FAZIT:<BR>
Das war es von dieser CD welche auf ganzer Linie eigentlich nicht zu empfehlen ist, da die
Aktuallit&#228;t zu w&#252;nschen &#252;berig l&#228;sst, wenn man sich da mal die alten CU Amiga CD's anschaut
kann man nur mit dem Kopf Sch&#252;tteln und hoffen das die Leute von der AMIGA PLUS Redaktion
endlich zur bessinung kommen und etwas Vern&#252;nftiges abliefern, f&#252;r den Preis von 19,80 DM
kann man doch wohl etwas Qualit&#228;t verlangen kann und nicht nur eine CD die den Rohling nicht
Wert ist. Wenn man mal am Kiosk auf die Magazine der anderen Systeme (MAC 6 PC) schaut wird
scnell klar das die AMIGA PLUS es nur auf das Geld der ausgehungerten AMIGA User abgesehen hat,
Schade eigentlich aber macht nicht weiter so auf so eine Miese CD Serie kann man getro&#223;t Verzichten.<BR><BR></H2>
<P>
<I>Andreas: Schade das immer solche User solche Texte schreiben, die vom Tuten und Blasen nicht die geringste Ahnung ahben :(((</I>
<P>
<H1><FONT COLOR="FFFFFF">5 von 100 Punkten<BR>
</H1>
<CENTER>
<IMG SRC="line.gif" ALT="LINE" WIDHT=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
<IMG SRC="logi.gif" ALT="LINE" WIDHT=87 HEIGHT=143 ALIGN="MIDDLE"><BR>
<A HREF="Dark.html"><TD><IMG ALT="INFO" BORDER="1" SRC="click.gif" WIDHT=176 HEIGHT=24 ALIGN="MIDDLE"></A HREF><BR>
</CENTER>
</BODY>
</HTML>
