<HTML>
<HEAD><TITLE>Amiga Future 19</TITLE></HEAD>
<BODY BGCOLOR=BLACK TEXT=BLUE LINK=WHITE ALINK=RED VLINK=GREEN>
<FONT SIZE=-1>Zu kleiner Ausschnitt? <A HREF="cd_afuture19" TARGET="_NEW">Hier klicken!</A></FONT><BR>
<FONT COLOR=YELLOW><H1><U><CENTER>Amiga Future 19</CENTER></U></H1></FONT>
<P>Was hab ich mich auf diese Zeitschrift nicht gefreut! Zun&auml;chst einmal habe ich
 sie seit einigen Monaten nicht erhalten, weshalb mich etwaige Ver&auml;nderungen
 nat&uuml;rlich interessierten. Und vieleicht gibt es ja auch noch ein par
 Neuigkeiten, die ich noch nicht wei&szlig;?<BR>Aber was mich besonders bewog diese
 Ausgabe anzuschaffen war die CD. "Die CD?" Fragst du jetzt. Jepp, genau.</P><P>
 Bisher waren diese Scheiben vom ICP-Verlag ja mehr als d&uuml;rftig, wenn nicht
 absolute Sch*i&szlig;*. Aber irgendwie habe ich das Gef&uuml;hl, das sich mit dieser
 Ausgabe ein kleines bischen was &auml;ndert. Vieleicht weil ich seit ein par Tagen
 Vorahnungen habe? Vieleicht auch, weil ich vor 1. Monat
 mit Higgins geredet habe, und er sagte, da&szlig; er ab sofort die CD macht? Nun
 gut, jetzt aber genug geredet, jetzt sehen wir uns die CD an.</P><P>
 Auf den ersten Blick f&auml;llt auf, da&szlig; s&auml;mtliche Icons neugestaltet sind. Die
 alten &uuml;bergro&szlig;en Kl&ouml;tze sind rausgeschmi&szlig;en worden, stattdessen erscheinen
 jetzt kleine, Windowslike (w&uuml;rg) Aktenmappen. Und was ist DAS? Kein
 Erstelle_Assigns ged&ouml;hns? Nein, statt dessen die Wahl zwischen einem
 Quickstart, einer Introshow oder ein bischen Info &uuml;ber die CD.
 Dieses Info-file mu&szlig; aber nicht durchgelesen werden, nein- der Higgins hat
 sich tats&auml;chlich einen Ast abgebrochen und alles startfertig auf CD
 gesprochen. Erster Eindruck: Neu und nobel!</P><P>
F&uuml;r alle mit etwas schnelleren Kisten (und CD-Laufwerken) k&ouml;nnen auch
 s&auml;mtliche CD-spezifischen Info Texte gesprochen werden. Die Stimme l&auml;&szlig;t sich
 zwar w&auml;hrend des Quasselns nicht abstellen, aber das wird n&auml;chstesmal anders
 sein, da hab ich schon was gemacht.</P>
<H3><FONT COLOR=YELLOW><U>Was gibts zum Inhalt zu sagen?</B></U></FONT></H3><P>
 Hm, leider noch nicht soviel. Es wird zwar alles sehr gut pr&auml;sentiert, aber
 bis auf einige Ausnahmen sind es auch nur Aminet-Inhalte. Hier k&ouml;nnte noch
 ein bischen was verbessert werden. Auf der CD ist &uuml;brigens die
 Shareware-Version von Abuse enthalten, falls jemand sie noch braucht.
 F&uuml;r alle Nostalgiker sind auf der Scheibe eine Menge an Oldie-Sachen
 vorhanden.</P><H3><FONT COLOR=YELLOW><U><B>
Vollversion</B></U></FONT></H3><P>
 Als Vollversion liegt dieser CD Kargon bei, ein
 Pseudo-<WBR>3D-<WBR>Rollenspiel-<WBR>Dynablaster-<WBR>Verschnitt. Das Spiel
 an sich ist recht ordentlich gemacht, wenn auch die Grafik (90°/Step by Step)
 keinesfalls mit Doom und Konsorten mithalten kann. Ein Test dar&uuml;ber d&uuml;rfte
 schon vor langer Zeit in der NoCover gestanden haben.</P><H3><FONT COLOR=YELLOW><U><B>
Kritikpunkte</B></U></FONT></H3><P>
Hm, ich hab hier zwar schon ein bischen was notiert, aber das
 meiste ist interner Krempel. Was auff&auml;lt, ist da&szlig; einige Icons nicht angepa&szlig;t
 wurden, und kleinere Probleme machen. Aber so schlimm ist das nicht.
 Der gr&ouml;&szlig;te Kritikpunkt d&uuml;rfte der sein, da&szlig; ein Gro&szlig;teil der Software auf der
 CD wie &uuml;blich Aminet Soft ist. Aber an dieser Stelle sollte auch bedacht
 werden, da&szlig; es nicht immer leicht auf eine CD &uuml;ber 600 MB Krempel zu knallen,
 erst recht aktuelles. Vieleicht hat der ICP Verlag ja mal ein Einsehen, und
 gibt als Richtlinie einmal Qualit&auml;t und nicht Quantit&auml;t.<P>Vorschl&auml;ge f&uuml;r die
 CD werden &uuml;brigens unter<BR><BLINK> <A HREF="mailto:Higgins@Datatype.capella.de?subject=Amiga+Future+CD">Higgins@Datatype.capella.de</A></BLINK><BR>
 angenommen.</P><H3><FONT COLOR=YELLOW><U><B>
Kaufen?</B></U></FONT></H3><P>
 Hm, ich w&uuml;rd sagen ja. Die Zeitschrift ist dieses Mal auch recht gut geraten,
 und wenn die CD auch noch ein par Schwachstellen hat, so ist sie doch um
 Welten besser als die vorherigen.</P><P>
 
 Sorry f&uuml;r den kurzen Test, aber ich bin sp&auml;t dran mit meinen Texten
 diesesmal. Heute ist der 24. und ich habe grade erst angefangen zu
 schreiben... AHHHHH
</P>
<!--Begin Signature-->
<CENTER><P><TABLE BORDER=2 BGCOLOR=BLACK BORDERCOLOR=WHITE><TR><TD> <CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint.gif" width=142 height=51 alt="The Saint" BORDER=0></A><BR><SMALL><FONT COLOR=#FFFF00>Markus Castro</FONT></SMALL></CENTER></TD></TR></tABLE></P></CENTER>
<!--End Signature-->
</BODY></HTML>