<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Test:Amiga Times CD</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<center><h1><font colour="green">CD Test: Amiga Times
CD</FONT></CENTER></h1><P>

Das es neben der NoCover noch andere Diskmags gibt, d&#252;rfte den meisten unter
uns wohl allgemein bekannt sein. Eines davon ist die &quot;Amiga Times&quot;, die uns
gegen Ende letzten Jahres mit ihrer ersten CD begl&#252;ckt haben. Dank Yonder
(thanx) bin ich den Besitz dieser CD gelangt und m&#246;chte an dieser Stelle
gleich mal einen Test nachreichen!<p>

<h2><CENTER><FONT colour="white">Die Vollversion:</FONT></CENTER></h2><P>
Die Amiga Times Redaktion hat sich die M&#252;he gemacht und sich eine
Vollversion, AmiAtlas in Version 2.0, f&#252;r ihre CD gesichert. AmiAtlas ist
ein n&#252;tzlicher Reisef&#252;hrer und Planer, auch wenn die auf der CD vorhandene 2.0 Release
nicht mehr die aktuellste ist. F&#252;r kleinere Aufgaben wie Routenberechnung
und grobe Planungen ist er dennoch sehr gut brauchbar. Immerhin ist es
lobenswert, da&#223; &#252;berhaupt eine Vollversion organisiert wurde.<p>

<CENTER><a href="amiatlas.png"><IMG src="amiatlas.png" width=555 height=440></A></CENTER><p>
<font size=-1><CENTER>P.S.: Wer das Bild in 800 X 600 sehen will, muss einfach nur draufklicken...</FONT>
</CENTER>
<hr>
<br>
<h2><CENTER><FONT COLOUR="yellow">Da hat sich aber jemand M&#252;he gegeben...</FONT></CENTER></h2><P>
Im Gegensatz zu anderen Amiga CD`s hat sich die Amiga Times Redaktion die
M&#252;he gemacht, eine kleine (deutschsprachige) Guide zu entwerfen, in der u.a.
auf die Entstehung der Amiga Times eingegangen wird. Das ganze macht die
CD zumindest schonmal, na sagen wir, pers&#246;nlicher und zeigt, da&#223; hier
wirklich mit sehr viel M&#252;he und Liebe zum Detail gearbeitet wurde; ganz im
Gegensatz zu manch anderen CD Rom Produktionen. Komplettiert wird das ganze noch
von einem Assign Script und einem kurzem Englischen Text, der f&#252;r
nicht-Deutsche Leser auch so eine Art Vorwort darstellt; wenn auch nicht so
ausf&#252;hrlich, wie im deutschen Guide.<p>

<CENTER><h2><a href="inhat.png"><FONT colour="mangenta">Der
Inhalt:</FONT></A></CENTER></h2><p>
Die 639 MB umfassende CD teilt sich in die Schubladen &quot;Amiga Times&quot;,
&quot;Demos&quot;, &quot;Module&quot;, &quot;Spiele&quot;, &quot;Programme&quot;, &quot;Sonstiges&quot;, &quot;Internet&quot; und die
oben erw&#228;hnte &quot;Vollversion&quot; auf. Dazu kommen noch die &quot;unsichtbaren&quot; Schubladen,
die f&#252;r das korrekte laufen der CD sorgen und auch nochmal kr&#228;ftig Platz
schlucken.<p>

Sofort nach dem ersten einlegen widmet man sich am besten erstmal der
Schublade &quot;Amiga Times&quot;, in der sich alle Ausgaben der AT befinden;
zumindest die, die damals (Computer `98) schon erh&#228;ltlich waren (Nr.1-7).
Ab Ausgabe 2 liegen alle Ausgaben auch zus&#228;tzlich zum AmigaGuide Format in
HTML vor und sehen somit auch teilweise wesentlich besser aus. F&#252;r die
optimale Betrachtung hat man gleich noch eine Schublade &quot;Browser&quot; in das
Verzeichniss gepackt, die die Demos von IBrowse, Voyager und AWeb enth&#228;lt.
Ferner findet man auch noch die Archive zu jeder Ausgabe; falls etwas mal
nicht klappt, kann man sich die Ausgaben auch noch mal entpacken, auch wenn
dies wohl eher &quot;Platzschinderei&quot; zum Grund hatte. Als &quot;Schmankerl&quot; finden
sich auch noch zwei unver&#246;ffentlichte Versionen der Erstausgabe auf der CD;
eine gelungene Idee!<p>
<br>
<hr>
Im Bereich der &quot;Demos&quot; finden sich nicht etwa Grafikdemos, sondern eine
gro&#223;e Anzahl von Anwendung- und Spieledemos; jeweils in &quot;Programme&quot; und
&quot;Spiele&quot; sortiert. Leider ist diese Schubalde auch einer der Schwachpunkte
der CD: Auch wenn sich sowohl im Bereich der Anwendungen (z.B. PPaint 7.1,
Amiga Writer, StormC etc.) als auch &quot;Spiele&quot; (z.B. Flyin` High, Genetic
Species, Napalm, Myst) teilweise hochkar&#228;tige Software befindet, so bekommt
man doch alle Demos auch im Aminet. Auch K&#228;ufer der AmigaFuture CD`s werden
viele &#220;bereinstimmungen finden. F&#252;r User, die bisher noch kein CD Laufwerk
haben, ist dieser Ordner sicherlich sehr interessant; f&#252;r User, die bereits
schon die Aminet CD`s bzw. die Future CD`s haben, bietet der Ordner nichts
neues.<p>
<br>
Weiter geht`s mit der Schublade Module, die, neben &quot;DeliTracker&quot; als
Abspieltool, nat&#252;rlich auch viele Mods enth&#228;lt; gr&#246;&#223;tenteils setzen sich
diese nat&#252;rlich aus Aminet Mods zusammen. Aber ein Highlight kann diese
Schublade, gute Hardware vorrausgesetzt, dennoch bieten: F&#252;r alle, die die
offizielle Amiga Hymne noch nicht besitzen, befindet sich &quot;Back For The
Future&quot; (ersten 30 Sekunden) im MP3 Format in diesem Ordner. Auch wenn ich pers&#246;nlich weniger mit
dem Song selber anfangen kann (Dance Floor), ist es doch f&#252;r Amiga User, die
die Audio CD noch nicht haben, eine gute Gelegenheit, sich den Song mal
anzuh&#246;ren (ohne daf&#252;r gleich die 15 DM teure CD kaufen zu m&#252;ssen...). Zu den
restlichen Modulen: Auch wenn diese &#252;berwiegend aus Aminet Material
bestehen, hat man sich g&#252;tigerweise dazu entschlossen, eine selektive
Auswahl der besseren zu treffen, so da&#223; man, gen&#252;gend Zeit vorrausgesetzt,
im Grunde das ganze Verzeichniss mal angeh&#246;rt haben sollte.<p><CENTER>
<img src="attest.png"></CENTER>
<hr>
<br>
&#196;hnlich verh&#228;lt es sich bei den Spielen im n&#228;chsten Verzeichniss: Insgesamt
14 teilweise recht aktuelle Games befinden sich hier. Leider gilt auch
hierbei
genau wie f&#252;r die oben besprochenen Demos, da&#223; nahezu alle Games (u.a.
Blitz Bombers, Trauma Zero, Minerva, Battle Duel, Boulder D&#228;sh etc.) auch im
Aminet zu finden sind und somit nichts neues darstellen. Eine Ausnahme ist
die recht nett gemachte Vollversion von CyberMan, auch wenn das Game schon 6
Jahre auf dem Buckel hat. Wer alle Aminet Sets hat bzw. die Einzel CD`s
regelm&#228;&#223;ig bezieht, wird hier genau so wenig f&#252;ndig wie in der n&#228;chsten
Schublade...<p>
<hr>
<br>
Auch bei den &quot;Programmen&quot; hat man sich darauf beschr&#228;nkt, gr&#246;&#223;tenteils
Aminet Ware auf die CD zu kopieren, auch wenn es sich fast nur um die
besseren Sachen handelt: Sowohl der in der letzten Ausgabe vorgestellte CD
Abspieler OptyCDPlayer als auch der Texteditor GoldEd finden sich hier.
Auch die beiden obligatorischen SASG Pakete &quot;MUI&quot; und &quot;MagicWB&quot; (in deren
Stil leider die ganze CD gehalten ist) sind hier zu finden. Dazu gibt`s mal
wieder die allseits bekannten und mitlerweile schon so h&#228;ufig anzutreffenden
&quot;Candy Factory&quot;, &quot;Scalos&quot; und &quot;Metal Web&quot;. Auch die beiden Treibersysteme &quot;Ide-fix&quot;
(Demo) und AmiCDFS2 haben ihren Weg auf die CD gefunden.
Abgerundet wird
das ganze mit den beiden Erdkundeprogrammen &quot;GeoWorld&quot; und &quot;Amiga World&quot;.
<p>
<hr>
<br>
F&#252;r Internet Surfer ist sicherlich der Ordner &quot;Internet&quot; interessant, in dem
sich einige Programme f&#252;r`s Internet finden. Inwieweit diese ganzen Tools
(YAM, Term, mFTP, AMFTP, AmIRC, Miami, stricq, AirMailPro und T-Online PP)
n&#252;tzlich sind, kann ich schlecht beurteilen, da ich kein Internetzugang habe.
Aber auch diese Tools d&#252;rften mit ziemlicher Sicherheit im Aminet zu finden
sein. Um Platz zu schinden bzw. um das Verzeichniss voller wirken zu lassen,
hat man nochmals die Demos der WWW Browser IBrowse, AWeb und Voyager
hineingestopft, die ja in selbiger Form schon im Verzeichniss &quot;AmigaTimes&quot;
lagen....<p>

Last but definetly not least w&#228;re da noch der Ordner mit dem sehr
aussagekr&#228;ftigen Namen &quot;Sonstiges&quot;, der wiederrum 4 weitere Ordner
(&quot;Bilder&quot;, &quot;Texte&quot;, &quot;Tools&quot; und &quot;APC &amp; TCP&quot;) hervorbringt. Erfreulich ist,
da&#223; man sich bei den &quot;Bildern&quot; und &quot;Texten&quot; offenbar nicht nur auf das
Aminet beschr&#228;nkt hat, sondern auch aus anderen Quellen an die Daten gelangt ist. Wer
z.B. Lust auf Goethes Faust hat, wird hier in mehreren AG Dokumenten f&#252;ndig.
Warum man allerdings hier nochmals eine Unterschublade &quot;Tools&quot; eingerichtet
hat, wird wohl f&#252;r immer ein Geheimniss der Zusammensteller bleiben: Hier
befindet sich n&#228;mlich nichts anderes als normale Aminet Software wieder, die
man auch problemlos in den Ordner &quot;Programme&quot; h&#228;tte integrieren k&#246;nnen (z.B.
NewIcons, MCP, Rainboot, DMS etc.). Zum Abschluss w&#228;re da noch eine
Schublade mit dem Namen &quot;APC &amp; TCP&quot;: Da der APC &amp; TCP diese CD hergestellt
hat, befinden sich in diesem Ordner mal wieder die obligatorischen Clubinfos
und ein entsprechender Antrag, um in den APC &amp; TCP einzutreten. Zwar h&#228;tten
einige Ausgaben der NC auch nicht geschadet, aber auch so eine coole, knapp
10 KB umfassende Idee :-))<p>

<h2><CENTER><FONT COLOUR="purple">Fazit:</FONT></h2></CENTER><p>
Tja, selten habe ich bei einem Fazit so geschwankt, wie bei dieser CD. Auf
der einen Seite haben sich die Zusammensteller sichtlich M&#252;he gegeben (wie z.B. bei der
netten Begr&#252;&#223;ungsguide) und
auch Daten besorgt, die man sonst kaum oder schwer bekommt (z.B. Back For
The Future als MP3). Auf der anderen Seite ist auch viel Software zu finden,
die auch auf den Aminet CD`s bzw. den Future
CD`s anzutreffen ist und einen somit nicht gerade vom Hocker haut. F&#252;r User, die
erst k&#252;rzlich ein CD Laufwerk bekommen haben, mag das ja noch ganz nett
sein, aber wer regelm&#228;&#223;ig die Aminet CD`s bezieht, wird vielleicht einmal
kurz die entsprecheden Verzeichnisse angeschaut haben und kaum neues
Material
entdecken. Alles in allem also eine nette CD, die man den Future CD`s auf jeden Fall vorziehen sollte, aber mehr auch nicht....
Wenn man sich allerdings bei weiteren Ausgaben voll auf die positiven Aspekte dieser CD konzentriert und diese
noch weiter ausbaut, k&#246;nnte daraus sicherlich was werden!<p> 
<FONT COLOUR="red">
<TABLE BORDER=1 ALIGN=CENTER HEIGHT="100%" BGCOLOR="purple">
<TR ALIGN=CENTER><TD ALIGN=CENTER Colspan=2 BGColor="blue">NoCover Info & Bewertung</TH></TR>
<TR><TH ALIGN=LEFT>CD Name </TH><TH ALIGN=LEFT>Amiga Times CD </TH></TR>
<TR><TH ALIGN=LEFT>Vertrieb </TH><TH ALIGN=LEFT>APC & TCP </TH></TR>
<TR><TH ALIGN=LEFT>Anschrift Vertrieb </TH><TH ALIGN=LEFT>Postfach 83, 83236 Übersee  </TH></TR>
<TR><TH ALIGN=LEFT>Empf. Verkaufspreis </TH><TH ALIGN=LEFT>25 DM </TH></TR>
<TR><TH ALIGN=LEFT>Datenmenge </TH><TH ALIGN=LEFT>639 MB </TH></TR>
<TR><TH BGCOLOR=RED ALIGN=LEFT>Preis/Leistungsverhältnis </TH><TH BGCOLOR=RED ALIGN=LEFT>kommt ganz drauf an, ob man schon die Aminet CD`s hat oder nicht </TH></TR>
<TR><TH BGCOLOR=RED ALIGN=LEFT>Gesamtnote </TH><TH ALIGN=LEFT BGCOLOR=RED>48 % </TH></TR>
<TR><TH BGCOLOR=white ALIGN=LEFT>Artikelschreiber </TH><TH BGCOLOR=white ALIGN=LEFT>Kilian "The Bruce" Servais </TH></TR>
</TABLE>
<CENTER>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
</FONT>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
