<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Aminet31</title>
</head>
<body background="cd_aminet31.jpg" text=black link=blue alink=red bgcolor=gray><br>
<font color="#800000" size="7">
<center><b>WILLKOMMEN ZUR AMINET CD 31</b></font></center><br>
<p>
Wie seit langer Zeit eingespielt wird man in der &quot;LiesMich&quot; mit der allgemeinen &Uuml;bersicht
begr&uuml;&szlig;t:<br>
<pre>
 Aminet ist wieder voll in Betrieb und es gibt wieder eine Menge Neuheiten.
 Der Inhalt:
 1020 MB neue Software erschienen zwischen CD 30 und dem 1. Mai
    3 MB kommerzielle Software: Directory Opus 5.5

   usw. usw. usw.
</pre></p><hr>
<p>
<img hspace=10 vspace=4 src="cd_aminet31a.jpg" alt="[ CDROM Cover ]" width=232 height=232 align=right>
Wie eingangs zu lesen ist, ist diesmal als Bonus die Software: Directory Opus 5.5
auf dieser Aminet-CD enthalten.</p>

<p>Wer wei&szlig; nicht, was DOpus ist? Darauf gibt es Antworten, Antworten, Antworten
.... Eigentlich sollte doch in jedem Handbuch des betreffenden Programmes die
richtige Antwort stehen. Welche Aussage kann man im vorliegenden Falle lesen?
<blockquote><i>
Mittlerweile gibt es viele Dateimanipulationsprogramme, aber keines kann mit
Directory Opus 5 verglichen werden. Welches Programm Sie auch immer vorher
benutzten; Directory Opus 5 l&auml;utet eine neue Generation von
Dateimanipulationsprogrammen ein. Directory Opus 4 stellte das technisch
Machbare f&uuml;r ein statisches Dateimanipulationsprogramm dar und ging dort bis an
die Grenzen der Flexibilit&auml;t. Opus 5 sprengt diese statische Form ! Es benutzt
die Leistungsf&auml;higkeit des Amiga in zuvor nie gesehener Weise und gibt Ihnen das
leistungsf&auml;higste Programm zur Verwaltung ihrer Disketten und Festplatten in die
Hand, das sie jemals gesehen haben. <br><br>

Es gab Dateimanipulationsprogramme, jetzt gibt&acute;s Directory Opus 5 !
</i></blockquote>
Nun ist uns allen alles klar. Oder doch nicht? Also Directory Opus 5, kurz Opus5
genannt, kam in seiner erweiterten Version 5.5 im September 96 auf den Markt.
Der Nachfolger Magellan erschien im Juni 97 und Magellan-II im Oktober 98. Ich
pers&ouml;nlich habe die neueste Version hier auf der Platte, deshalb nur eine
theoretische Betrachtung der Version 5.5, wie sie hier vorliegt. Es ist eine
Vollversion und Schatztruhe bietet f&uuml;r 69,- DM plus Versandkosten ( 6,- DM) ein
Update (auf CD-ROM) auf die neueste Version an, aber nur in Verbindung mit dem
Originalcupon aus der Aminet-CD. </p>


<p>Was nicht sehr viele wissen, Opus5 verf&uuml;gt &uuml;ber eine versteckte M&ouml;glichkeit,
ein Bild w&auml;hrend des Ladens von Opus anzuzeigen. Dies erfolgt mit dem
Schl&uuml;sselwort <b>STARTUPPIC</b> in der Befehlszeile beim Aufruf das Programms.
Wenn Opus beispielsweise als Workbenchersatz genutzt wird, so kann in der
S:Startup-Sequence der Befehl C:LoadWB so ge&auml;ndert werden: <ul>

<li> C:LoadWB STARTUPPIC=dopus5:StartupPic </li>
oder:
<li> C:LoadWB STARTUPPIC=dopus5:StartupPic|3 </li></ul>

Die &quot;|3&quot; l&auml;&szlig;t Opus mindestens 3 Sekunden warten, bevor das Bild wieder
verschwindet. </p>

<p>Es tut niemandem weh, die Startup-Sequence so zu ver&auml;ndern, da diese
Schl&uuml;sselworte vom originalen LoadWB-Befehl einfach ignoriert werden. </p>

<p>Zwei Beispielbilder (StartupPicA und StartupPicB) sind dieser Installation
beigef&uuml;gt. Diese werden NICHT automatisch vom Installationsskript installiert,
sie m&uuml;ssen jedoch einfach in das Verzeichnis DOpus5 kopiert werden. </p>
<center>
<img hspace=10 vspace=4 src="cd_aminet31b.jpg" alt="[ StartupPicA ]" width=179 height=159>
<img hspace=10 vspace=4 src="cd_aminet31c.jpg" alt="[ StartupPicB ]" width=274 height=115>
</center>

<p>Diese beiden Bilder sind verkleinert dargestellt. - Und was gibt es zur
Einf&uuml;hrung noch Wichtiges zu sagen? Ach ja, ein separates Handbuch oder ein
riesiger Ringordner wie zu Opus4 Zeiten gibt es nicht mehr. Daf&uuml;r ist das
Handbuch zweimal als Datei vorhanden, einmal als Powerguide und einmal als
Amigaguide. Das Programm selbst kann in Deutsch oder in Englisch installiert
werden. Wer eine andere Sprache bevorzugt, das Aminet ist voll davon. Das soll
f&uuml;r&acute;s erste reichen. </p>

<hr>
<pre>
 Es folgen einige Highlights dieser CD. Mods, Spiele, Bilder und Demos
 werden nicht nicht aufgelistet, da sie eigene Bestenlisten haben.

 &quot;golded516.lha&quot;      biz/demo   2.3M &quot;GoldED Studio 5, DEMO&quot;
 &quot;HTTPlister.lha&quot;     biz/dopus   15K &quot;AmiNet-RECENT in Lister anzeigen +laden&quot;
 &quot;EvilsDoom_demo.lha&quot; biz/titan  2.3M &quot;EvilsDoom, Demo, Rollenspiel&quot;
 &quot;PalmBackup.lha&quot;     comm/misc  176K &quot;1.3 - Kopie/Wiederherst./Install PalmPil&quot;
 &quot;PalmMail.lha&quot;       comm/misc   13K &quot;EMail mit dem PalmPilot synchronisieren&quot;
 &quot;orion.lzh&quot;          comm/misc   18K &quot;Amiga<->IBM-PC, Datenuebertragungsprogr.&quot;
 &quot;micq-0.4.0.lha&quot;     comm/tcp   187K &quot;Kommandozeilen-basierter ICQ-Klient&quot;
 &quot;BoingTransf.lha&quot;    comm/www   129K &quot;24Bit/256 Farben, BoingBall-IBrowse-Trans&quot;
 &quot;HTTPResume.lha&quot;     comm/www   108K &quot;Weiterfuehren abgebrochener HTTP-Downloads&quot;
 &quot;StreamMP3.lha&quot;      comm/www     4K &quot;MP3-Dateien stroemen direkt vom Internet!&quot;
 &quot;StreamRA.lha&quot;       comm/www     3K &quot;RealAudio-Dateien direkt vom Internet&quot;
 &quot;ace_ftp.lha&quot;        dev/basic  4.1M &quot;ACE BASIC-Uebersetzer, FTP-Site-Dateien&quot;
 &quot;xfs.lha&quot;            disk/misc  260K &quot;V2.17 Mehrdateisystem-Geraet, Win95+Mac+&quot;
 &quot;Mp2anim.lha&quot;        gfx/conv   270K &quot;Konvertiert und skaliert MPEG-Animationen&quot;
 &quot;Mpeg2Anim13.lha&quot;    gfx/conv   606K &quot;Wandelt MPEG-Animationen in ANIM-Dateien&quot;
 &quot;AMP.lha&quot;            gfx/show   135K &quot;MPEG1/2-Videospieler f. PPC, V1.02 (990&quot;
 &quot;EuroChamp.lha&quot;      docs/misc   24K &quot;Statistiken von Fussball-Europameistersch.&quot;
 &quot;F1Champ.lha&quot;        docs/misc   26K &quot;Statistiken: Formel 1 (1950-1998)&quot;
 &quot;MacBin.lha&quot;         misc/emu     9K &quot;Portiert Daten von Amy zu Mac&quot;
 &quot;AMPlifier.lha&quot;      mus/play   283K &quot;Starker MPEG-Audiospieler (V1.54)&quot;
 &quot;AmigaAMP.lha&quot;       mus/play   331K &quot;MPEG-Audio-Spieler mit GUI (68K/PPC)&quot;
 &quot;AmpSkins01.lha&quot;     mus/play   3.4M &quot;Skins fuer AmigaAmp (24Bit)&quot;
 &quot;AmpSkins02.lha&quot;     mus/play   4.7M &quot;Skins fuer AmigaAmp (24Bit)&quot;
 &quot;LhA.lha&quot;            util/arc    92K &quot;Volles LhA plus LhX (nur Extraktion)&quot;
 &quot;bzip2.lha&quot;          util/arc   241K &quot;Dateikompressor fuer 68k/PowerUP/WarpOS&quot;
 &quot;NoWBStartup2.lha&quot;   util/boot   14K &quot;Haelt WBStartUp-Programme an&quot;
 &quot;Rainboot2_5.lha&quot;    util/boot  622K &quot;Ultimativer Multimedia-Aufstart V2.5&quot;
 &quot;GetType.lha&quot;        util/dir    70K &quot;V1.13, kennt 1100+ Dateitypen&quot;
 &quot;xpdf-0.8-020-b.lha&quot; util/gnu   666K &quot;Xpdf 0.8 - Portierbares Dokumentformat&quot;
 &quot;PalmLink.lha&quot;       util/libs   93K &quot;Verbindet Amiga mit 3Com Palm PDA (V1.2)&quot;
 &quot;XPKatana.lha&quot;       util/pack  103K &quot;XPK-(Ent)packer mit kompl. GUI, ARexx&quot;
 &quot;SetDST.lha&quot;         util/time   48K &quot;Pa&szlig;t Uhr an Sommerzeit an&quot;
 &quot;StopMenu.lha&quot;       util/wb    496K &quot;Nette Programmleiste mit vielen Optionen&quot;
</pre>
<hr>

<p> Was schauen wir uns auf die Schnelle einmal an? GoldEd 5 DEMO hatten wir
doch erst gerade in Aminet-29 n&auml;her betrachtet. BoingTransf klingt doch schon
mal ganz gut. Dies ist eine TransferAnimation f&uuml;r Ibrowse hergestellt mit
Torando3D v2.0. Die IBrowse Animation wird durch einen Boing-Ball ersetzt, der
sich bei der Lade-Arbeit langsam dreht und sich vom Ball in die Erde verwandelt
und wieder zur&uuml;ck. Gleichzeitig l&auml;uft ein heller Punkt von links nach rechts,
soll wohl die Sonne darstellen. Die neue Erde ist intensiver in der Farbe
gegen&uuml;ber der Erde von IBrowse. In Ruheposition ist nun aber der rot-wei&szlig;e Boing
Ball zu sehen.</p>

<p>Das Auswechseln der Animation ist sehr einfach. Die Originalanimation wird in
IBrowse/Images von def_transferanimation in def_transferanimation.bak renamed.
Und nun kann das nach RAM: entpackte def_transferanimation von dort nach
IBrowse/Images kopiert werden. Wenn man anstelle der 256 Farben Animation die
24-Bit Version haben m&ouml;chte, ist def_transferanim_24bit zu kopieren und dieses
dann in def_transferanimation zu renamen. (Diese eingedeutschen englischen
Bezeichnungen!!! Aber jeder versteht sie). Wenn einem aber der rotkarierte Ball
mit der Zeit auf den Geist geht, kein Problem. Die Originalanimation ist ja noch
da. Die neue Animation also raus aus dem Ordner und die BAK-Version wieder
zur&uuml;ckverwandeln und schon arbeitet IBrowse wieder im alten Gewande. </p>
<hr width=60%>

<p>Das neue LHA in util/arc hat einen Bug. Wurde ein lha-File mittels Shell oder
Opus5 entpackt, bleibt das Ausgabefenster stehen und l&auml;&szlig;t sich nicht mehr mit
der Maus schlie&szlig;en. Das Fenster mu&szlig; aktiv sein, dann einfach Control und
Backslash (Ctrl + \) dr&uuml;cken und das Fenster ist weg. Hat mir Carsten Schr&ouml;der
verraten. Einen weiteren Bug habe ich noch nicht entdeckt. </p>
<hr width=60%>

<p>StopMenu klingt doch auch ganz gut. Aber was es wirklich ist, habe ich leider
nicht ganz mitbekommen. Ist es nur ein neues Outfit und Anordnung der Workbench?
Die Dokumentation (AmigaGuide) liegt in vier Sprachen vor: Englisch,
Franz&ouml;sisch, Polnisch und Slowenisch. Programmierer ist ein 16 j&auml;hriger Pole und
dies ist nach seinen eigenen Angaben sein erstes Sharewareprogramm. Installiert
habe ich es nicht, denn schon beim Betrachten &uuml;ber Opus5 handelte ich mir
zweimal einen GURU ein. Bei den Systemvoraussetzungen sagte er u.a. <i> AGA or
any GFX board </i>, aber meine PicassoIV scheint nicht dazuzugeh&ouml;ren. Einen
Bezug zwischen Namen des Programmes und dem Outfit konnte ich nicht herstellen.
Das mitgelieferte Preview wollte ich eigentlich hier aufzeigen, aber der
Speicherverbrauch des Bildes scheint meines Daf&uuml;rhaltens nicht im gerechten
Verh&auml;ltnis zum Vorzeigewert zu stehen. Deshalb spare ich die 111 KB lieber f&uuml;r
andere auf. </p>
<hr width=60%>
<a name=wf1></a><br>
<p>Zum Abschluss f&uuml;r heute schauen wir schnell noch in biz/demo das Programm
Wildfire7_Demo an. Oh weh, das ist nichts f&uuml;r schnell mal so eben nachschauen.
Trotzdem verlieren wir ein paar Worte zu dieser neuen Version 7.14 inklusive
Wildfire7_PPC, Wildfire7_3D und Wildfire7_3DF. </p>

<p>Erst die obligatorische Frage: Was ist Wildfire? Schauen wir einfach in
die HTML-Dokumentation in Help hinein und lesen was unter
<a href=cd_aminet31b.html#a1> Konzept </a> steht. </p>

<p>Na h&auml;tte ich dies nun mit eigenen Worten besser ausdr&uuml;cken k&ouml;nnen? Bestimmt
nicht. K&uuml;rzer wohl, aber dann h&auml;tte niemand mehr verstanden, was ich sagen wollte.
Wer also dieses Programm nicht kennt und eine Konfiguration wie folgt hat <ul>

<li> MUI 3.8 </li>
<li> mindestens 600x400 Pixel Screen </li>
<li> 68020 oder besser mit FPU </li>
<li> mindestens 8 MB RAM </li></ul>
der kann getrost das Programm mal in Ruhe antesten. Er wird sehr erstaunt sein. Mehr
werde ich aber nun nicht dazu sagen, denn Tantiemen f&uuml;r Reklame bekomme ich nicht.
</p>

<hr>

<a name=a1>Hier eine globale &Uuml;bersicht &uuml;ber Aminet31:</a><br><center>
<table border="2" cellpadding="3" cellspacing="3" width="80%">
<tr><td> <a href=cd_aminet31a.html#a1> &quot; biz  &quot; </a></td>
<td> Business software </td><td align="right"> 62,1 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet31a.html#a2> &quot; comm &quot; </a></td>
<td> Communications </td><td align="right"> 17,3 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; demo &quot; </td>
<td> Gfx and sound demos </td><td align="right"> 97,3 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet31a.html#a3> &quot; dev  &quot; </a></td>
<td> Development software </td><td align="right"> 23,7 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet31a.html#a4> &quot; disk &quot; </a></td>
<td> Disk/Harddisk tools </td><td align="right">  1,3 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet31a.html#a5> &quot; docs &quot; </a></td>
<td> Text documents </td><td align="right"> 28,5 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; game &quot; </td>
<td> Games </td><td align="right"> 52,4 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet31a.html#a6> &quot; gfx  &quot; </a></td>
<td> Graphics </td><td align="right"> 14,6 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet31a.html#a7> &quot; hard &quot; </a></td>
<td> Hardware </td><td align="right"> 3,5 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet31a.html#a8> &quot; misc &quot; </a></td>
<td> Miscellaneous </td><td align="right"> 27,2 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; mods &quot; </td>
<td> Music modules </td><td align="right"> 111,4 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet31a.html#a9> &quot; mus  &quot; </a></td>
<td> Musical software </td><td align="right"> 13,7 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; pix  &quot; </td>
<td> Pictures </td><td align="right"> 76,6 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet31a.html#a10> &quot; text &quot; </a></td>
<td> Text related </td><td align="right"> 5,2 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet31a.html#a11> &quot; util &quot; </a></td>
<td> Utilities </td><td align="right"> 52,8 MB </td><td>&nbsp;</td></tr></table></center>
</p>

<br><br><center>
<table border="6" width=90%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
<center><font size="+1">
<a href="NoCover.html" target="_top"> Zur&uuml;ck zur NoCover </a></font>
</center></table></center></center><br>
</body>
</htlm>
