<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Test: AmigaOS Leser CD #2</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=yellow>
<CENTER>
<img src="aoslog.png">
<h1><FONT COLOUR="GREEN">CD Test: Amiga OS Leser CD #2</FONT></h1></CENTER></P>

Nach der nicht ganz so perfekten ersten Leser CD, hat der Verlag gleich
angek&#252;ndigt, die zweite Ausgabe (die &#252;brigens mit einem Monat Versp&#228;tung
erschienen ist) weiter zu perfektionieren. Ob es dem Falke Verlag gelungen
ist, soll dieser Test zeigen.</P>

<h2><CENTER><FONT COLOUR="red">Der erste Eindruck</FONT></h2></CENTER></P>

Die CD pr&#228;sentiert sich im fortschritlichen Glow Icons Design, was (meiner
Meinung nach) wesentlich professioneller aussieht, als die MWB Icons. Ferner
erwartet den User noch ein Assign Script und eine gut gemachte
Begr&#252;&#223;ungsguide, die sowohl in HTML als auch AmigaGuide vorliegt und &#228;u&#223;erst
gelungen ist; auch wenn die HTML Version noch nicht vollst&#228;ndig ist. Daneben
gibt`s noch insgesamt 8 Schubladen mit den Titeln &quot;Scene&quot;, &quot;Games&quot;,
&quot;AmigaOS&quot;, &quot;CD System&quot;, &quot;Online&quot;, &quot;Tools&quot;, &quot;Sound&quot; und &quot;Demos&quot;, auf die ich
unten noch genauer eingehen werde.</P>

<h2><CENTER><FONT COLOUR="YELLOW">Einige Extras:</FONT></h2></CENTER></P>
Viele Zeitschriften werben immer mit einer Vollversion, die meistens eher
Mittelma&#223; ist. Auch die AmigaOS CD verf&#252;gt &#252;ber eine Vollversion, die aber
nur am Rande erw&#228;hnt wird: <a href="voll.png">Visual Prefs</A>. Bei diesem Tool handelt es sich um
einen Systempatch, mit dem man das komplette Aussehen der WB an seine eigenen
Vorstellungen anpassen kann. Daneben gibt`s aber noch ein weiteres
erw&#228;hnenswertes Projekt, da&#223; mit &quot;AmiPedia&quot; betitelt wurde. Wie der Name
schon andeutet, handelt es sich dabei um ein Nachschlagewerk zum Thema Amiga
&amp; Computer, da&#223; &#228;hnlich aufgebaut ist, wie viele Lexica. Geschrieben wurde
das ganze in HTML und ist dementsprechend gut aussehend und &#252;bersichtlich.
Mit dieser Ausgabe sind zwar erst die Buchstaben A-M abgedeckt, aber der
Verlag verspricht, f&#252;r jede CD auch ein Update vorzunehmen, so da&#223; nach und
nach ein vielschichtiges Nachschlagewerk entstehen d&#252;rfte. Eine wirklich
gute Idee, die schonmal kr&#228;ftig Pluspunkte bringt.</P><CENTER>
<img src="amiped.png">

<h2><a href="aosinhat.png">Aussen hui, innen pfui?</A></h2></CENTER></P>

Zuerst widmet man sich mal der Schublade &quot;AmigaOS&quot;, in der sich wieder
einige Ordner befinden; u.a. die oben erw&#228;hnte Vollversion &quot;Visual Prefs&quot;.
&#196;hnlich dem Amiga Magazin (R.I.P.) findet man hier auch eine Datenbank, in
der alle Artikel/Covers der Zeitschrift aufgelistet sind. Realisiert wurde
das ganze mit dem Tool &quot;MUIBase&quot;, das sicherlich dem einen oder anderen
Anwender aus dem Aminet bekannt ist. Auch die Autoren der AmigaOS bekommen
in diesem Ordner Platz einger&#228;umt; zumindest zwei davon nutzten diesen
und ver&#246;ffentlichten eigene Tools (u.a. Amiga Guide Dateien und Rebol /
LaTeX Material; Listings), die teilweise auch nicht im Aminet erh&#228;ltlich sind.
F&#252;r Besitzer hoch aufger&#252;steter Amigas sind auch noch einige Highlights hier
zu finden: Neben der Rede von Jim Collas sind auch die Amiga
Radio News und der Auftritt von Petro Tyschtschenko im WDR Computerclub als
MP3 Datei auf dieser Silberscheibe verewigt. F&#252;r Besitzer hochaufger&#252;steter
Amigas ist auch der Ordner AnnexClip interessant, der diverse Quick Time
Movies zu den offiziellen Amiga Hymnen &quot;Back For The Future&quot; und &quot;Keep The
Momentum Going On&quot; enth&#228;lt. Zwar ist die Qualit&#228;t nicht die beste, aber
immerhin ist das ganze gut anschaubar; entsprechende Hardware
vorrausgesetzt.</BR>
Besonders interessant erscheint mir auch der Ordner &quot;Update Forum&quot;. F&#252;r die Zukunft sollen
die diversen Amiga Firmen hier regelm&#228;&#223;ig ihre Patches und Updates sammt
Homepage ver&#246;ffentlichen. Zus&#228;tzlich werden dort auch aktuelle
Demoversionen, sofern diese bereitgestellt werden, zu finden sein. F&#252;r die
aktuelle Ausgabe hat zwar nur die Firma Schatztruhe dieses Angebot
wahrgenommen, aber f&#252;r die kommenden Ausgaben kann man davon ausgehen, da&#223;
noch andere Firmen nachziehen. Abgerundet wird der Ordner von den beiden
Programmen &quot;TV Paint&quot; und &quot;Starbirds&quot;, die beide als Vollversion vorliegen.</P></BR>
<hr>
<br>
Der Ordner &quot;Demos&quot; ist zwar weniger gut best&#252;ckt, aber immerhin sind die
Demos von &quot;GoldEd 5&quot;, &quot;GeoWorld&quot;, &quot;Genesis&quot; und &quot;MakeCD 3.2b&quot; recht aktuell
und f&#252;r den einen oder anderen User recht interessant. Gottlob verzichtete
man darauf, &#228;ltere Demoversionen, die woanders schon genug &quot;verheizt&quot;
wurden, auch in diesen Ordner zu packen.</P>

Ganz im Gegensatz dazu steht das ordentlich bev&#246;lkerte Verzeichnis &quot;Games&quot;.
Neben altbekannten Demos wie &quot;Marbelous 2&quot;, &quot;Eat The Whistle&quot;, &quot;Trauma Zero&quot;
befinden sich auch einige Klassikerdemos (u.a. Capital Punishment, Syndicate
oder XMAS Lemmings (!)) in diesem Ordner. Richtig interessant wird das ganze
aber erst durch die ebenfalls vorhandenen Amiga Ports von &quot;Heretic&quot; und
&quot;Hexen&quot;, die vorkunfiguriert und startbereit ebenfalls hier zu finden sind.
Man muss sich also nicht mehr die M&#252;he machen, und zig verschiedene WAD
Files vom PC runterzuladen; hier ist alles direkt startf&#228;hig installiert. Zu
&quot;Hexen&quot; liegen obendrei noch duzende von Extra Leveln bereit, so da&#223; in
dieser Hinsicht f&#252;r langanhaltende Motivation gesorgt ist. Allerdings gilt
auch f&#252;r diese beiden 3D Shooter, da&#223; ohne entsprechende Hardware kein
Spielspa&#223; aufkommen will. 
Trotzdem finde ich es echt
gut, da ich nun nicht mehr darauf angewiesen bin, 10 MB gro&#223;e Dateien vom PC
auf den Amiga per Disk zu kopieren.</P><CENTER> <img src="heretic.png"></CENTER>
<hr>
<br>
Die Schublade &quot;Sound&quot; d&#252;rfte selbsterkl&#228;rend sein. Neben dem MPEG Abspieler
&quot;AmigaAMP&quot; (samt Plugin &quot;Full Spectrum&quot; und vielen (!) dazugeh&#246;rigen &quot;Skins&quot;, die teilweise nicht im
Aminet zu bekommen sind) sind auch die mehr oder minder bekannten Musiktools &quot;SamED&quot;, &quot;PlayHD&quot;, &quot;WaveTracer&quot;,
&quot;NeonBars&quot; und &quot;Wave Tracer&quot; hier zu finden. Sinnvoll abgerundet wird das
ganze von einigen MPEG Songs sowie vielen Modulen, die alle jeweils von
guter Qualit&#228;t sind. Da ich aber kein alzu gro&#223;er Computer Musik Fan bin,
kann ich zur weiteren vorhandenen Software nichts &#252;ber deren
Leistungsf&#228;higkeit bzw. Nutzen aussagen.</P>

Stattdessen widme ich mich lieber dem Ordner &quot;Tools&quot;, der sinnvoller Weise
nochmal in &quot;Shareware&quot;, &quot;Freeware&quot;, &quot;PPC&quot;, &quot;Development&quot; und &quot;Updates&quot;
aufgeteilt ist.<br>
In den beiden erstgenannten Ordnern findet man recht aktuelle Programme aus
dem Aminet, wobei man sich aber auf die wirklich guten Tools beschr&#228;nkt hat.
Unter anderem ist hier z.B. die brandaktuelle Version 4.5 der WB Erweiterung
&quot;NewIcons&quot; zu finden. Selbiges gilt auch f&#252;r den Bereich &quot;PPC&quot;, wo ich
allerdings nix zu sagen kann, da ich noch kein PPC Board mein eigen nenne.
Lediglich die Programmpakete &quot;Warp3D&quot; sowie &quot;StormMesa&quot; samt Add-ons waren
f&#252;r mich keine b&#246;hmischen D&#246;rfer.<br>
Im Verzeichniss &quot;Development&quot; findet sich der &#252;bliche Programmierkrams; u.a.
ist AmigaE in Version 3.3a und ASM Pro hier zu finden, genau wie &quot;Kaffe
1.0b3&quot; und &quot;ClassAct&quot;. Leider bin ich auch kein alzu guter Programmierer, so da&#223; diese
Schublade keinen hohen Nutzwert f&#252;r mich hat.
Selbiges kann man aber f&#252;r &quot;Updates&quot; ganz und gar nicht behaupten: Hier sind
einige Updates zu wirklich wichtiger Software vertreten: &quot;Turbo Print 7.03&quot;,
&quot;STFax&quot;, &quot;PFS2_4142&quot;, &quot;CygnusED&quot; und &quot;GeoWorld&quot;. Auch die erst k&#252;rzlich von
Phase 5 entwickelten Flash Rom Updates f&#252;r ihre Turbokarten sind, zumindest
f&#252;r einige User, sehr interessant.</P>
<hr>
<BR>
Kommen wir nun zum n&#228;chsten Ordner &quot;Online&quot;, der auch f&#252;r einige
&#220;berraschungen gut ist: Zuerst einmal sind dort die allgemein bekannten
Programme &quot;YAM&quot;, NewsRog&quot;, &quot;BlackIRC&quot;, &quot;WebCam&quot; sowie &quot;StarGate&quot; zu finden.
Wirklich interessant ist f&#252;r mich aber der Ordner &quot;WebDesign&quot;, der nicht
etwa das gleichnahmige Programm aus dem Aminet, sondern einige &quot;Schmankerl&quot;
enth&#228;lt: Neben dem ausf&#252;hrlichen HTML Tutorial &quot;SelfHTML&quot; von Stefan M&#252;ntz,
sind hier auch noch die GIF Tools &quot;WhirlGIF&quot;, &quot;GIF Composer&quot; und &quot;GIF Tool&quot;
vertreten. &#196;u&#223;erst beachtlich fand ich pers&#246;nlich aber die beiden Ordner
&quot;Backgrunds&quot; und &quot;AnimGif`s&quot;, die viel gutes Material f&#252;r eigene HTMl
Dokumente enthalten. Lobenswert ist in diesem Zusammenhang noch, da&#223; die
Hersteller sich die M&#252;he gemacht haben, und f&#252;r diese beiden Ordner jeweils
einen kleinen Index in HTMl erstellt haben, so da&#223; man spontan den &#220;berblick
&#252;ber alle Hintergr&#252;nde bzw. animierte GIF`s hat. Das erspaart das
langwierige Anzeigen jeder einzelnen Grafik.</P>
<hr>
<BR>
Im Bereich &quot;Scene&quot; tummeln sich einige recht aktuelle Demos (u.a. vom &quot;Mekka
Symposium `98) von bemerkenswert guter Qualit&#228;t (Hallo Yonder!). Dazu gibt`s
noch einen Ordner &quot;Rays&quot;, in dem sich Raytracingbilder mit schwankender
Qualit&#228;t befinden und eine Schublade &quot;Videos&quot;, der mit mehreren AVI- und MPG
Videos aufwarten kann. Ein relativ kurzweiliger Zeitvertreib!</P>

Zum Abschluss w&#228;re da noch das &quot;CD System&quot;, das bekannte Applikationen, die
daf&#252;r sorgen, da&#223; die CD korrekt l&#228;uft, enth&#228;lt. Da diese aber sowieso auf
jedem Amiga installiert sein sollten (z.B. MUI, AHI, DeliTracker, CyberQT
etc.), d&#252;rfte hier f&#252;r die wenigsten etwas dabei sein.</P>

<h2><CENTER><FONT COLOUR="WHITE">Fazit:</FONT></h2></CENTER></P>
Die CD ist echt ein wahrer Killer. Zuerst dachte ich an eine erneut aus
Aminet Stoff gebastelte CD, die nix neues enth&#228;lt. Dieses CD strafte mich
L&#252;gen und kann sowohl inhaltlich als auch durch die gut durchdachte
Struktuierung vollkommen &#252;berzeugen. Das man sich nicht aufs Aminet
beschr&#228;nkt hat, ist hoffentlich durch den obigen Text klar geworden.
Abgerundet wird das ganze durch einige frische neue Ideen (AmiPedia), die
Vollversion und durch die Benutzung der &quot;GlowIcons&quot;. Besonders durch
letzteres erinnert mich das ganze doch ein wenig an das ehemalige Englische
Mag (bzw. deren Leser CD`s) &quot;CU Amiga&quot; und deren herausragende Qualit&#228;t.
Allen Usern, die ein Abo der AmigaOS haben, sollten f&#252;r 12 DM die Leser CD
(die alle 3 Monate erscheint) gleich mitbestellen. Und f&#252;r alle anderen: Mit
15 DM ist die CD sensationell g&#252;nstig und ist den Amiga Plus CD`s / AmigaFuture CD`s (an
denen sich aber laut Andreas bald was &#228;ndern wird) allemal vorzuziehen.
Daumen hoch!</P><CENTER><BR>


<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Falke Verlag (AmigaOS)</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>15 DM (einzeln) oder 12 DM (Abo)</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Demos, Tools, Multimediadateien, Verschiedenes</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>465</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>80 %</TD>
</TR>
</TABLE>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
