

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Audio CD: Back For The Future</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOUR="green">Vorstellung Audio CD: Back For The Future (performed by Annex)</FONT></h1></CENTER></P>

Immerhin ist die offizielle Amiga Audio CD schon eine ganze Weile erh&#228;ltlich
und noch niemand hat sich dazu aufraffen k&#246;nnen, einen kleinen Text f&#252;r die
NC zu dieser CD zu schreiben. Na ja, denn werde ich mal versuchen, m&#246;glichst
objektiv &#252;ber dieses Techno Gefrikkel zu schreiben....</P>

Geliefert wird die CD in einer ganz normalen Maxi CD H&#252;lle mit einem
normalen Inlay und nat&#252;rlich der CD. Die CD selber wurde komplett im &quot;Boing
Ball&quot; Design gehalten und enth&#228;lt insgesamt 7 Tracks:</P>
<ul>
<li>1. Boing Ball (10 Sekunden)<br>
<li>2. Introduction With Petro (59 Sekunden) <br>
<li>3. Back For The Future (Radio Mix; 3 Minuten und 32 Sekunden)<br>
<li>4. Back For The Future (Extended Mix; 5 Minuten und 32 Sekunden)<br>
<li>5. Back For The Future (Classical Mix; 3 Minuten und 13 Sekunden)<br>
<li>6. Back For The Future (Instrumental Mix; 4 Minuten und 37 Sekunden)<br>
<li>7. Boing Ball (12 Sekunden)<br>
</UL>
Bei Track 1 handelt es sich um das &quot;Intro&quot; zur CD, da&#223; anscheinend den
&quot;Boing&quot; Ball, auftickend auf ein Drahtnetz, symbolisieren soll; was soll man
dazu schon sagen?</P>
Wie man dem Titel des zweiten Tracks schon entnehmen kann, lie&#223; es sich
Petro Tyschtschenko nicht nehmen, sich auch auf dieser CD in Form einer
gesprochenen Passage zu verewigen. Unterlegt wird das ganze von seichter
Musik. Nun gut, auch hier&#252;ber kann man streiten, aber wer es nicht h&#246;ren
mag, kann ja einfach weiterspulen.</P>
Nun geht`s aber ans eingemachte: Der drite Track offenbart endlich einen
Einblick in das &quot;musikalische&quot; K&#246;nnen von Annex. Bei &quot;Back For The Future&quot;
handelt es sich um einen Techno Song, wie man es haufenweise aus dem Radio
kennt. Ich glaube, da&#223; sich jeder ein Bild davon machen kann. Zu dem Song selber:
Die Lyrics sind zwar recht oberfl&#228;chlich (so f&#228;llt z.B. niemals das Wort
&quot;Amiga&quot;, so da&#223; der Song theoretisch auch von tausend anderen Dingen handeln
k&#246;nnte...), reichen aber f&#252;r diese Art von Musik sicherlich aus. Die Musik selber
harmoniert ziemlich gut mit den Lyrics, auch wenn ich unter einem richtigen
&quot;Ohrwurm&quot; etwas anderes verstehe; liegt vielleicht daran, da&#223; meine Ohren
nicht f&#252;r Techno ausgelegt sind!?!</P>
Bei dem &quot;Extended Mix&quot; handelt es sich, wie der Name schon sagt, um eine
verl&#228;ngerte Version von &quot;Back For The Future&quot;. Wer auf das &quot;Radio Mix&quot;
steht, wird auch sicherlich diese Version m&#246;gen, da man etwas mehr
musikalischen Background hineingepackt hat.</P>
Die dritte Version von &quot;Back For The Future&quot; unterscheidete sich grundlegend
von den ersten beiden: Zum einen verzichtete man auf jegliche Vocals, zum
anderen wurde das komplette Techno Gefrikkel durch etwas ruhigere, leicht
klassisch angehauchte, Musik ersetzt, was im gro&#223;en und ganzen auch gelungen
ist. Und um es zuzugeben: Das &quot;Classical Mix&quot; ist meine "Lieblingsversion" von
&quot;Back For The Future&quot;.</P>
Als letzte Version pr&#228;sentiert sich dann schlussendlich noch die
instrumentale Version des Songs. Das ganze ist schon wieder Techno lastiger
und in keinster Weise f&#252;r mich &#252;berzeugend dargestellt...</P>
Last But Not Least w&#228;re da nochmal der &quot;Boing&quot; Ball, der das ganze
ausklingen l&#228;sst (Comment siehe oben).</P>

<h2><CENTER><B>Fazit:</h2></CENTER></B></P>
Die 18 Minuten und 13 Sekunden umfassende CD,
die &#252;brigens keine Computer Daten enth&#228;lt, wurde zwar zu 100 % auf dem Amiga
erstellt (wie das Cover gro&#223;spurig behauptet), kann mich aber irgendwie doch
nicht &#252;berzeugen. Ok, da&#223; liegt mit an Sicherheit grenzender
Wahrscheinlichkeit daran, da&#223; ich kein Verfechter dieser Musikrichtung bin.
Einigen meiner Freunden, die auf diese Art von Musik stehen, fanden den Song
gar nicht mal &#252;bel. Somit kann man zum Abschluss sagen, da&#223; der Song f&#252;r
Amiga Freunde mit Techno / Dacefloor Bevorzugung sicherlich kaufenswert ist.
Allen anderen kann ich die 11 DM &quot;teure&quot; Investition nur abraten...</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
