<HTML>
<HEAD><TITLE>Es ist zum Kotzen...</TITLE></HEAD>
<BODY BGCOLOR=WHITE TEXT=BLACK BACKGROUND=back4.gif>
<H1><CENTER>Kotz dich aus!</CENTER></H1>
<FONT SIZE=-1>Zu kleiner Ausschnitt? <A HREF="disku_kotz.html" TARGET="_NEW">Hier klicken!</A></FONT><BR>
Wer kennt das nicht? Amiga-User geh&ouml;ren zu den am meisten gefrusteten Usern
 &uuml;berhaupt. Einerseits so viele M&ouml;glichkeiten, ein Super System und dann
 sowas- solche absolut &uuml;berfl&uuml;ßigen Dinge, die einen einfach ankotzen
 k&ouml;nnen.<BR>
 Ich hab mir &uuml;berlegt, schreib ich halt einfach mal alles auf, was mir nicht
 pa&szlig;t, mal sehen was ihr davon haltet.<P>
<FONT COLOR=RED> Ich m&ouml;chte an dieser Stelle noch warnen: Was ich hier geschrieben habe hat
 evtl. null Niveau, kritisiert Minderheiten, br&auml;t deine Katze, killt deine Omi
 oder sonstwas. Bitte keine Vorhalte machen wegen dem Schreibstil oder
 &auml;hnlichem.</FONT></P>
 <DL><DT><B>020/OS 2.0</B></DT><DD>
  Wenn ich diese Worte h&ouml;re k&ouml;nnte ich durchdrehen! Offentsichtlich
 sehen einige Hersteller von Spielen immer noch nicht ein, da&szlig; die Amiga
 Gemeinde nicht mehr aus "armen Schulkindern" (das kommt mir irgendwie sehr
 bekannt vor...) besteht, die nur einen nackten A1200 besitzen. Wenn einer
 kein Geld f&uuml;r neue Hardware hat, dann hat er auch kein Geld f&uuml;r ein neues
 Spiel oder sonstwas. Ich glaube, die wissen gar nicht, wie l&auml;cherlich sie
 sich selber machen.<P> Von einem guten Spiel wie Napalm, da&szlig; selbst auf 060/50
 noch nicht anst&auml;ndig l&auml;uft kann man als User wenigstens einiges an
 Erwartungen stellen. Bei einem Spiel, das laut Hersteller noch auf 020 l&auml;uft
 werde ich irgendwie immer an den A500 erinnert. Und dann wundern sie sich
 &uuml;ber mickrige Verkaufszahlen.<P>Das selbe ist es mit den
 Anwendungsprogrammen. Da kommt man sich als User doch verarscht vor, wenn des
 hei&szlig;t, das Art Effect ab 020 lauff&auml;hig ist. Das Ding kriegt man nichtmal mit
 030 zum laufen. Und dazu dann noch S&auml;tze wie: "Ist aber auf einem 060 genauso schnell
 wie Windows Programme". Was f&uuml;rn Mist. Dann sollen die auch schreiben:
 <B>»Anforderungen: min. 68060, 64 MB Ram+Graka«</B>.</DD><DT><B>
PPC</B></DT><DD> Ist euch eigentlich schonmal aufgefallen, da&szlig; noch nicht EIN
 kommerzielles Spiel den PPC benutzt (Ich sage benutzt, nicht unterst&uuml;tzt. ETW
 gibts auf dem A500 besser!). Lediglich Doom und die restlichen
 PC-Conversions. Was ist mit Quake (ich meine legal)? Was ist mit Myst? Was
 ist mit dem ganzen restlichen Mist, der irgendwann angek&uuml;ndigt und dann
 krepiert ist? Dasselbe wie oben, anstatt mal ein geiles Spiel zu machen, das
 auf dem PPC abgeht mauscheln sie immer noch an der 030`er Grenze. Ich wette
 da kommen bald Spiele auf uns zu, die vieleicht PPC aber keine Grafikkarte
 unterst&uuml;tzen. Das ist doch krank sowas. Doom l&auml;uft bei mir auf Lowres mit dem
 060 bei etwa 20 fps. Mit PPC sind es knapp das doppelte. Also entweder ist
 AGA dran schuld, oder die PowerUP Boards sind absolute Schei&szlig;e. </DD><DT><B>
Werbespr&uuml;che</B></DT><DD>
Was lese ich gerade in der A Spezial? <BR><CENTER><BLOCKQUOTE><I><B>«Das OS 3.5 kommt mit einer
 Amiga-typischen Implementation des PPC«.</B></I></BLOCKQUOTE></CENTER><BR> Was DAS hei&szlig;t d&uuml;rfte jedem klar
 sein. Oder der hier, aus der AOS: <BR><CENTER><BLOCKQUOTE><I><B>»...endlich haben wir eine charismatische und
 vision&auml;re F&uuml;hrungspers&ouml;hnlichkeit an der Spitze von
 Amiga«.</B></I></BLOCKQUOTE></CENTER><BR> Na denn, Heil
 Collas! Die Leute machen sich doch mit solchen Spr&uuml;chen nur selber
 l&auml;cherlich, da&szlig; die das gar nicht merken.</DD><DT><B>
Linux</B></DT><DD> Was hat eigentlich im Moment alle Welt mit Linux am Hut? Fr&uuml;her, als es
 noch zu den Freak Systemen z&auml;hlte, hie&szlig; es, es sei zu schwer, nur f&uuml;r Hacker
 zu gebrauchen, und &uuml;berhaupt ist Windows doch sowieso viel besser. Die Leute
 wollten Linux nicht kostenlos haben, nein blo&szlig; nicht. Aber heute, wo Linux
 von RedHat, Debian, etc. teuer verscherbelt wird, da beginnt der gro&szlig;e Run.
 Ich frage euch: Was bringt dem Durchschnitts-Idioten heute Linux, das es ihm
 nicht schon vor Jahren h&auml;tte geben k&ouml;nnen? F&uuml;r Spiele und &auml;hnliches k&ouml;nnen
 die Leute genausogut Windows benutzen. Und ich glaube nicht, da&szlig; sich von
 Heute auf Morgen 100.000 einen eigenen Server aufbauen. Ich glaube, es sind
 einfach zwei Punkte:<OL>
 <LI>Wollen die Leute angeben k&ouml;nnen. "Euy, ick hab jetz Linux bei mir Alder.
 `s voll Kuhl!". Was sind sie doch toll... kann man eigentlich Idioten auch
 kastrieren lassen?</LI>
 <LI>KDE. Die Leute wollen gar nichts neues. Die benutzen tats&auml;chlich einen
 Windowmanager, der ihnen das Gef&uuml;hl gibt, wieder vor Windows zu sitzen. Und
 da sie mit Linux eh nichts anfangen k&ouml;nnen, k&ouml;nnen sie genausogut wieder zum
 Gameboy wecheseln.</LI>
 </OL></DD><DT><B>
95%</B></DT><DD> Wer schonmal die Amiga+ gelesen hat wird wissen was ich meine. In dieser
 (und leider auch in anderen Zeitschriften) wird jedem Kr&uuml;ppelprogramm in den
 Arsch gekrochen. Z.B. Ein E-Mail Programm (Namen vergessen), ein beinahe
 direkter Abklatsch von Yam. Nur h&auml;&szlig;licher. Dieses Teil bietet vieleicht zwei
 bis drei Vorz&uuml;ge gegen&uuml;ber Yam, aber daf&uuml;r kostet es, haltet euch fest,
 <B>126 DM!</B> 126 Eier, und im Test hei&szlig;t es dazu lapidar, da&szlig; es ein wenig
 teuer ist. So ein Programm w&uuml;rde ich nicht mal anfassen. Wie kommt es, da&szlig; in
 den letzten beiden Jahren verst&auml;rkt M&uuml;ll auf dem Amiga-Markt erscheint, und
 die Zeitschriften diesen auch noch loben? Nur weil weniger erscheint, kann es
 doch dennoch Qualit&auml;t haben. Ich bring doch auch kein halbfertiges Programm
 auf den Markt, und verlang dann auch noch Geld daf&uuml;r, wo wirklich
 erstklassige Freeware kaum beachtet wird.</DD><DT><B>
Die Gemeinde</B></DT><DD>
Ich habe langsam das Gef&uuml;hl, die da oben &uuml;bertreiben es ein klitzekleines
 bischen mit diesem Gemeinschafts-gedunsel. Mein Gott, Jim Collas soll doch
 wohl prim&auml;r darum k&uuml;mmern, das neue Amigas rauskommen, und nicht darum die
 Gemeinschaft zu st&auml;rken. Die User-Gemeinde ist zwar gut und sch&ouml;n, aber wenn
 kein neuer Rechner kommt ist keine Gemeinde mehr &uuml;brig.</DD><DT><B>
Unterst&uuml;tzung f&uuml;r Programmierer</B></DT><DD>
 Ich dachte ich h&auml;tte mich verh&ouml;rt. Ein Programmierer hat mir erz&auml;hlt, da&szlig; er
 Haage&Partner ein Programm f&uuml;r das OS 3.5 angeboten hat, und diese kaum
 Interesse zeigten. Ich darf zwar nicht sagen, was es f&uuml;r ein Tool ist, aber 
 ich denke schon, da&szlig; es was taugt, und da&szlig; die werten Herren sich mal erheben sollten, und ein bischen Support f&uuml;r
 die Programmierer leisten sollten. &auml;hnliches berichteten n&auml;mlich auch andere
 Programmierer.</DD></DL>
 <P>
So, mehr f&auml;llt mir im Moment nicht ein. Wi&szlig;t ihr, wie ich mich jetzt f&uuml;hle?
 Ich sags euch: Befreit! Wenn man erstmal alles losgeworden ist, was einem auf
 dem Herzen liegt, geht es gleich viel besser. Also, ihr habt doch sicher auch
 irgendwas, was euch ankotzt? Schreibt es auf!</P><P>Ach ja: Dieser Text soll
 keine multiple Diskussion ausl&ouml;sen, betrachtet das hier einfach als
 Meckerecke.</P>
<BR><P>
<CENTER><TABLE BORDER=2 BORDERCOLOR=WHITE BGCOLOR=BLACK>
<TR><TD>
<P><CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint.gif" width=142 height=51 alt="The Saint" BORDER=0></A><BR><SMALL><FONT COLOR=#FFFF00>Markus Castro</FONT></SMALL></CENTER></P>
</TD></TR></TABLE></CENTER></P>
</BODY></HTML>