<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Ratlos</title>
</head>

<body background="wolf1.jpg" text=black link=blue alink=red bgcolor=gray>
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Ratlosigkeit</b></font></center></p>

<p>Von NoCover Nr. 1 an, also seit &uuml;ber f&uuml;nf Jahren, steht in den
Statuten, dass f&uuml;r Ver&ouml;ffentlichungen in der NoCover bestimmte
Richtlinien und Regeln einzuhalten sind. Dazu geh&ouml;rt, keine
Verbalentgleisungen, keine Beschimpfungen, keine Copyrightsverletzungen, keine
Pornographie und keine Artikel und Verherrlichungen &uuml;ber indizierte
Computerspiele. Letzteres wurde manchmal leicht umgangen, in dem f&uuml;r das
kleine &quot;o&quot; im Namen einfach ein Sternchen gesetzt wurde, damit auch
jeder mitbekam, dieses Spiel habe ich auch.</p>

<p>Nun bin ich aber doch etwas ratlos. Eigentlich ist dies noch sehr harmlos
ausgedr&uuml;ckt. Es ist viel mehr, dass ich leicht w&uuml;tend bin, oder anders
ausgedr&uuml;ckt ungehalten bin. Weil in den Statuten nicht steht, dass Filmtips
mit Tips von Computerspielen gleichzusetzen sind, wird hier eine Verbalorgie
&uuml;ber einen Horrorfilm losgelassen, der wider jeder Vernunft hier platziert
wurde und jedem guten Geschmack eine gewaltige Ohrfeige verpasst. Die deutsche
Sprache ist sehr m&auml;chtig und wer viele stilistischen Ausdr&uuml;cke kennt
und &uuml;ber einen gro&szlig;en Wortschatz verf&uuml;gt, kann sich hier
hervorragend austoben. </p>

<p>In den Richtlinien steht: keine Pornographie. Nun meine Frage: Ist Horror
nicht noch viel schlimmer als Pornographie? Porno kann sich stimmulierend auf
alle m&ouml;glichen k&ouml;rperlichen Funktionen auswirken. Schaden kann sie nur
denen, die schon einen geistigen Defekt haben. Aber Horror? Wenn sich das
f&uuml;r jemanden stimmulierend auswirkt, dann hat er schon einen geistigen
Defekt. Anders kann ich mir diese Liebe zu diesem Genre nicht erkl&auml;ren. Ich
bin antiquiert und im Grunde meiner Seele erzkonservativ. Trotzdem bin ich
f&uuml;r Probleme fast aller Art aufgeschlossen und versuche vieles zu
verstehen. Aber f&uuml;r mich gibt es eine Grenze: Und das ist die
<b>Verherrlichung</b> von Horror. </p>

<p>Meine Ratlosigkeit erstreckt sich nun auf meine ethische Einstellung. Bin ich
wirklich so antiquiert und vielleicht verbohrt, dass ich Fl&ouml;he husten sehe,
wo gar keine sind? Sehe ich alles zu verkniffen und die heutige Generation hat
sich wirklich zur Normalit&auml;t der Gewalt hin entwickelt und ich habe dies
&uuml;bersehen? Oder sind das doch nur Ausw&uuml;chse einer kleinen Minderheit,
die aber laut auf sich aufmerksam machen will? Wer kl&auml;rt mich ob meiner
Ratlosigkeit auf? </p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr>
</table>
<br>
</body>
</html>

