
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian "The Bruce" Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=yellow>
<h1><CENTER><FONT COLOUR="YEllow">Leserbriefe von Kilian<blink> "The
Bruce"</BLINK> Servais</FONT></h1></CENTER></P>
<ul>
<li><a href="#alle.html">An Alle (und zur Abwechselung sind wirklich ALLE angesprochen)</A><BR>
<li><a href="#hertwig.html">An den stresserf&#252;llten Benjamin
Hertwig</A><BR>
<li><a href="#yonder.html">An den sich bedankenden Yonder</A><br>
<li><a href="#dark.html">An den depressiven &quot;The Dark&quot;</A><BR>
<li><a href="#saint.html">An den Konkurrenz machenden Saint</A><BR>
<li><a href="#rolf.html">An den meine E-Mail Addy suchenden Rolf Nue. aus Wue.</A><BR>
<li><a href="#peters.html">An die das optimale Grafikformat suchende Sieglinde Peters</A><BR>
<li><a href="#thowin.html">An den sich bedankenden Thowin</A><BR>
<li><a href="#andreas.html">An den Onkelz Freak Andreas Etzrodt</A><BR>
<li><a href="#top.html">Top 5</A><BR></UL>
<hr>
<a name="alle.html">
<b>An Alle:</B></P>
Ups, in der letzten NC sind mal wieder einige Fehler, die auf meinem Mist
gewachsen sind, zu &quot;bewundern&quot;: Zum einen w&#228;re da der Text &quot;Patterns Of
Force&quot; im Small Talk. Dieser war f&#252;r die STP gedacht (und war dort ja auch
zu finden) und ist mir leider auf die Disk f&#252;r den Andreas &quot;gerutscht&quot;.
Sorry! Zum anderen nochmal das gleiche Missgeschick: Der Leserbrief an Saint
war gar nicht f&#252;r die NC gedacht und ist mir ebenfalls nur durch einen
bl&#246;den Fehler dort reingerutscht. Sorry daf&#252;r...</P>
<hr>
<a name="hertwig.html">
<b>An Benjamin:</B></P>
Yup, Dein Tape ist ebenfalls bei mir angekommen, aber das m&#252;sste ich
mitlerweile auch schon per Brief geschrieben haben, so da&#223; das hier faktisch
nix neues f&#252;r Dich ist. Das Dein Brief erst sp&#228;ter angekommen ist, macht
wirklich nix. Wir alle stecken nunmal etwas im Stress :-))<br>
Was die HMG betrifft: Ich arbeite z.Zt. wieder intensiver an der HTML
Version und hoffe, da&#223; ich nach den Sommerferien eine neue Release
pr&#228;sentieren kann. Versprechen kann ich zwar noch nix, aber momentan schaut
es wirklich ganz gut damit aus...<br>
Na ja, alles weitere kommt dann per S-Mail; read you!</P>
<hr>
<a name="YONDER.HTML">
<b>An Yonder:</B></P>
Moin! Dein Paket mit den CD`s ist hier gut angekommen, aber im Grunde
h&#228;ttest Du die CD`s &#252;berhaupt nicht zur&#252;ckschicken m&#252;ssen. Selbst wenn Du
damit nix anfangen konntest, h&#228;ttest Du Dir das Porto echt spaaren k&#246;nnen.
Na ja, thanx auch f&#252;r die wirklich coolen Aminet Intros; echt genial!
Den Gag in Deinem Leserbrief habe ich allerdings nicht so ganz verstanden;
kann das sein, da&#223; Du versuchst,  meine &quot;Standardtips&quot; ins l&#228;cherliche zu
ziehen :-))))? Macht auch nix; das alles habe ich ohnehin zuerst gepr&#252;ft.<br>
Meine Test`s waren wieder auf hohem Niveau? Man, solche Aufmunterungen
machen mich richtig gl&#252;cklich und auch in der n&#228;chsten Ausgabe werden wieder
einige Artikel von mir zu sehen (bzw. zu lesen) sein.<br>
Einen Workshop zum Thema &quot;ShapeShifter&quot;? Nun ja, da&#223; ist so eine Sache. Ich
w&#252;rde ja gerne einen machen, aber erstens wei&#223; ich nicht, was da alles
reingeh&#246;rt und zweitens habe ich noch nie einen geschrieben. Wenn Du
allerdings daf&#252;r einige Tips h&#228;ttest, w&#252;rde ich sowas mal in Angriff nehmen
:-))))<br>
Du h&#246;rst also auch Iron Maiden? Man, da&#223; wundert mich dann doch etwas. Iron
Maiden war im Grunde die erste Metal Band, die ich geh&#246;rt habe. Im Laufe der
Jahre haben sich dazu auch viele Rarit&#228;ten (schonmal was von &quot;Raising Hell&quot;
geh&#246;rt?) angesammelt. Interesse?<BR>
Da&#223; mit dem Tape war kein Problem; da&#223; es Dir gefallen hat, freut mich umso
mehr :-))) Was hat Dir denn besonders gefallen? Interessiert mich mal so...
Evtl. habe ich mich auch schon per Brief bei Dir gemeldet, so da&#223; das obige
eigentlich schon wieder &quot;unaktuell&quot; ist. Read You!</P>
<hr>
<a name="dark.html">
<b>An &quot;The Dark&quot;:</B></P>
Vorsicht; ich haben den dumpfen Verdacht, da&#223; dieser Brief an Dich etwas
l&#228;nger wird (denke ich mal...). So here we go: Du h&#246;rst also alles so
Querbeet; na ja, der Aufz&#228;hlung Deiner Lieblingsbands nach handelt es sich
dabei wenigstens um &quot;richtige&quot; Musik und nicht um dieses total
Computergesteuerte Chart kompatibele Zeugs. Therapy? h&#246;re ich auch ab und an
mal; habe von denen auch eine Scheibe (&quot;Troublegum&quot;) in meiner Sammlung. Zu
&quot;Metallica&quot; brauche ich hoffentlich nix mehr sagen; fr&#252;her waren die ja ganz
nett, aber heute? Na ja....</P>
Dein Birthday war also nicht so der Bringer? Tut mir ehrlich gesagt leid f&#252;r
Dich.<br>
Du fragst nach meinem Birthday? Ok, da muss ich wohl weiter ausholen:
In meiner Anspielung von letztemal (&quot;hoffentlich verl&#228;uft Deiner besser als
meiner&quot;) bezog ich mich eigentlich auf meinen vorletzten Geburtstag (um
genau zu sein auf den 3.9.97). Vorweg muss ich auch gleich sagen, da&#223; ich
nicht der Typ bin, der Geburtstage (zumindest die eigenen) &#252;berschweniglich
feiert; ganz im Gegenteil: Ich kann diese (teilweise) geheuchelten
Gl&#252;ckw&#252;nsche kaum abhaben und ziehe es vor, den ganzen Tag &quot;normal&quot; zu
verbringen. Mit diesem Ansatz bin ich auch damals in den Tag gestartet und
der schulische Teil verlief soweit auch in Ordnung. Nachmittags stand dann
eine allumfassende Gruppenstunde (ich bin da Betreuer; alle Namen, die gleich folgen, ebenfalls) von unserer Kirche aus an, in der alle
Gruppen zusammen so eine Art Schnitzeljagd spielten. Dort bin ich nat&#252;rlich
auch hingegangen; genau wie einige meiner (damaligen) Freunde und
Freundinnen. Auch zwei M&#228;dels (Gaby &amp; Angela) waren dabei, die beide, na
sagen wir mal, nicht mehr die besten Freundinnen meiner damaligen Freundinn
Steffi waren (hast Du den Satz jetzt kappiert??). Auf jeden Fall gingen wir
alle gut gelaunt durch die Stadt (Steffi war nicht dabei) und irgendwann
erz&#228;hlte mir Angela dann, da&#223; Steffi fremdgegangen w&#228;re, was mich nat&#252;rlich
voll traf. Im Grunde war f&#252;r mich da schon der Tag gelaufen, aber
gottseidank k&#252;mmerten sich Angela &amp; Gaby (die beide 3 Jahre &#228;lter sind als
ich...) noch um mich, so da&#223; ich den Tag irgendwie &#252;berstanden habe. Das war
zwar noch l&#228;ngst nicht alles, was da passiert ist, aber der Rest geh&#246;rt
nicht unbedingt in die NC :-((</P>

Was Deine &quot;depressiven Gedanken&quot; angeht: Auch ich hatte diese Phase (die
immerhin zwei Jahre dauerte; ich wei&#223; selbst nicht genau, ob diese heute
vorbei ist). Aber vergiss niemals, da&#223; es immer Ideale gibt, f&#252;r die es sich
lohnt, weiter zu leben. Ich war damals total froh, da&#223; es einige wenige
(wahre) Freunde in meinem Umfeld gab, die mir extrem geholfen haben. Dazu
kam noch, da&#223; mir Musik sehr geholfen hat (ok, klingt ziemlich
komisch, war aber so). In dieser Zeitphase habe ich mich auch ziemlich
ver&#228;ndert, was Du evtl. auch versuchen solltest.</P>

Nun aber genug mit diesem ganzen Psychokram...</P>

Dir hat also mein Artikel &#252;ber Olofight gefallen? Freut mich, aber
&quot;beibringen&quot; kann ich Dir das leider nicht. Wieso auch? Deine Artikel in den
letzten Ausgaben waren sowohl inhaltlich als auch optisch m&#228;chtig gut
gemacht. Die Patterns waren zwar nicht immer das gelbe vom Ei, aber f&#252;r die
ersten Versuche war das alles schon sehr &#252;berzeugend (wenn ich da mal an
meine ersten Versuche denke...). Und Dir hat tas&#228;chlich das Layout gefallen?
Bisher habe ich f&#252;r diesen &quot;rote Schrift auf schwarzem Background&quot; nur
Kritik einheimsen k&#246;nnen.... </P>

Was die Leute alle gegen das &quot;The&quot; vor unseren Pseudos haben? Keine Ahnung!
Ich finde bei mir klingt das ganze mit dem &quot;The&quot; einfach besser und auch
&quot;The Dark&quot; h&#246;rt sich wesentlich besser an als einfach nur &quot;Dark&quot;. Lass das
&quot;The&quot; einfach stehen, mache ich auch.</P>

So, ich hoffe, da&#223; ich Deine Fragen ausreichend beantwortet habe und das Dir
das Lesen nicht alzu langweilig wurde :-))) Walk On Fighting!</P>
<hr>
<a name="saint.html">
<b>An Saint:</B></P>
Auf Deinen Brief in der letzten NC brauche ich wohl nicht mehr eingehen; da&#223;
hatten wir ja schon per S-Mail gekl&#228;rt bzw. abgehandelt.
Man, Du hast Dich ja f&#252;r die letzte NC kr&#228;ftig ins Zeugs gelegt. Willst Du
mir etwa den ersten Platz in Yonder`s Hitliste wegnehmen? Na, wenn ich mich
nicht verz&#228;hlt habe, habe ich drei Artikel mehr geschrieben, hehehh :-))
Aber immerhin waren Deine ganzen Artikel sehr gut gemacht; besonders Deine
Spieletest haben mir gefallen. Mit dem Filmtip konnte ich zwar nicht so viel
anfangen (stehe nicht auf Splatter), aber es gibt bestimmt einige Leute im
Club, die auf dieses Genre stehen. Bleibt mir nur noch zu sagen, da&#223; ich
alles weitere mit der FD Hitparade und den NC Artikeln kl&#228;ren werde (falls
mir noch was entgangen ist). Bis demn&#228;chst, see ya!</P>

P.S.: Meinen Vornamen schreibt man lediglich mit einem "l"...</P>
<hr>
<a name="rolf.html">
<b>An Rolf Nue.:</B></P>
Wenn ich Dir einen Tip betreffend Deiner Homepage geben darf: Ver&#246;ffentlich
diese doch einfach! Wenn Du Dir nicht sicher bist, ob Deine Page &quot;gut genug&quot;
ist, dann kannst Du diese mir auch gerne zukommen lassen. Ich werde Dir dann
ein m&#246;glichst objektives Urteil dar&#252;ber geben.</P>

Was &quot;meine E-Mail Addy&quot; angeht: Ich habe &#252;berhaupt keine! Aber lass es mich
kurz erkl&#228;ren: Ich bin ab und an von meiner Schule aus im Internet und surfe
ein kleines bi&#223;chen. Leider kann (bzw. darf) ich mir in der Schule keine
E-Mail Addresse einrichten, was irgendwie auch verst&#228;ndlich ist (dann k&#246;nnte
ja jeder kommen). Und bei uns zu Hause sieht es momentan mit einem Modem
auch sehr schlecht aus (erstmal ein Scanner). Wenn Du also Deine Fragen oder
sonstigen Gedanken an mich noch loswerden willst (und daf&#252;r nicht die NC als
Medium benutzen willst), dann bleibt Dir leider nur die Schneckenpost &#252;brig;
sorry!</P>

Sorry auch, da&#223; ich in meinem Leserbrief bei Dir das &quot;.html&quot; vergessen
hatte; kann im Eifer des Gefechtes schonmal vorkommen. Du hast mich &#252;brigens
&#228;lter gemacht, als ich wirklich bin: Ich bin gerade mal 16 Jahre und nicht
etwa 19 wie Du geschrieben hast :-)))</P>

Ob ich einen Computer in die Wiege gelegt bekommen habe, wei&#223; ich nicht. Mit
5 Jahren kam auf jeden Fall unser erster Amiga ins Haus und ich spielte nur
damit. Mit ca. 13 Jahren habe ich dann angefangen mich intensiver mit dieser
Kiste auseinanderzusetzen und was dabei herausgekommen ist, wei&#223;t Du ja.
Praktisch kann man sagen, da&#223; ich mit dem Amiga aufgewachsen bin und niemals
(!) einen PC wirklich gebraucht (Gr&#252;&#223;e an Frank Guder) habe. Na ja, soviel
dann dazu. Auf jeden Fall freut es mich, da&#223; Dir meine Texte gefallen haben;
ich werde versuchen, weiterhin solche Texte zu verfassen. Bis denne!</P>
<hr>
<a name="peters.html">
<b>An Sieglinde:</B></P>
In der letzten NC hast Du gefragt, warum Du keine GIF Bilder verwenden
sollst. Nun, im Grunde spricht nichts gegen GIF, aber da die NC wieder etwas
voller wird, sollte man schon auf ein Speicherplatz schonenendes Format
achten. Und da ist PNG i.d.R. besser f&#252;r geeignet als GIF; insbesondere bei
Screenshots (die auch mit 8 Farben gut aussehen). Mit Personal Paint 6.4 ist
das ganze ein Kinderspiel: Einfach Screenshot laden, Bereich markieren und
dann als PNG Datei abspeichern (vorzugsweise bei maximaler Kompression). Das
ganze sieht immer noch gut aus, belegt aber weniger Speicherplatz. Auch JPG
kann mitunter die bessere Wahl sein, besonders dann, wenn die Qualit&#228;t eine
untergeordnete Rolle spielt (=gr&#246;&#223;ere Kompression). Mein Tip an Dich:
Probieren geht &#252;ber studieren. Wenn Du wieder mal einen Screenshot machst,
kann Du ja mal vergleichen.</P>
Was Dein Feedback zur Metal Corner angeht: Die Metal Corner habe ich bisher
ohne weitere Verfasser gemacht (Du hattest den Plural benutzt :-))). Da&#223; Du
kein Metal magst, ist IMHO auch kein Beinbruch; schlie&#223;lich ist Musik
Geschmackssache und besonders bei Metal ist die Anh&#228;ngerschaft etwas d&#252;nn
ges&#228;ht. So, mach`s mal gut!</P>
<hr>
<a name="thowin.html">
<b>An Thowin:</B></P>
Yup, da&#223; &quot;The&quot; vor meinem Pseudo hat eine Bedeutung. F&#252;r die letzte NC hatte
ich dazu einen Artikel geschrieben und hoffe, da&#223; ich alle Deine Fragen zu
meinem Pseudo beantworten konnte :-)) Wenn nicht, kannst Du nat&#252;rlich
nochmal nachfragen.</P>
Das mit den &quot;STP&quot; ist doch wirklich kein Problem; mache ich wirklich gerne.
Zwar gehen mir langsam die Themen aus (Ideen?), aber irgendetwas f&#228;llt mir
bestimmt noch ein :-)) Solltest also auch f&#252;r diese Ausgabe der &quot;STP&quot;
Material von mir erhalten haben (solange die Post keinen M&#252;ll mit der Disk
gemacht hat).</P>
Zum Thema &quot;Metal Corner&quot; hatte ich mich ja in der letzten Ausgabe schon
ge&#228;u&#223;erst. Es ist also wirklich nicht schlimm, wenn Du nix schreiben kannst.
Viiiiieeeeelllll wichtiger w&#228;ren da zum Bleistift die STP und Dein
(hoffentlich wieder regelm&#228;&#223;iges) Feedback.
Am Layout arbeite ich z.Zt. auch etwas; wie haben Dir denn meine beiden
Previews gefallen? </BR>
Alles weitere ist dann per Brief bei Dir eingetrudelt. So long!
<hr>
<a name="andreas.html">
<b>An Andreas:</B></P>
Hi! ich wollte eigentlich nur kurz auf Deinen Artikel &quot;B&#246;hse Onkelz&quot; aus der
letzten NC eingehen. Layoutm&#228;&#223;ig war das ganze sehr gut gemacht, wie ich
finde. Inhaltlich hast Du Dir scheinbar auch sehr viel M&#252;he gegeben, ebenso
bei der objektiven Berichterstattung. Nur genau da liegt mein Kritikpunkt:
In der Einleitung hast Du geschrieben, da&#223; Du die offizielle Biographie
&quot;Danke f&#252;r nichts&quot; gelesen hast und daraus die Fakten f&#252;r Deinen Artikel
entnommen hast. Tja, da&#223; die Onkelz in ihrer eigenen Biographie versuchen,
m&#246;glichst gut wegzukommen, d&#252;rfte wohl klar sein. Auch ich bin der Meinung,
da&#223; die Onkelz heute nicht mehr rechts sind, aber es geht auch noch um was
anderes: Die eigentliche Musik ist derma&#223;en schlecht (sowohl musikalisch als
auch lyrisch gesehen), da&#223; ich mir das wirklich nicht anh&#246;ren muss. Ich
kenne auch hier noch einige bekloppte Typen, die Bands wie Onkelz immer noch
&quot;total cool&quot; finden, eben weil diese rechts waren (da werden teilweise Bands wie &quot;St&#246;rkraft&quot; in einem Zug wie Onkelz genannt). Ups, jetzt bin ich
etwas weit abgeschwiffen. Was ich Dir eigentlich sagen wollte: Der Artikel
war gut gemacht und hat mir sehr gut gefallen; auch wenn mir die Musik
&#252;berhaupt nicht gef&#228;llt. Aber da wir sowieso alle einen individuellen
Geschmack haben, bleibt soetwas wohl nicht aus. Ok, das war es auch
eigentlich schon von meiner Seite aus. Man lie&#223;t sich; see ya!</P>
<HR>
<a name="top.html">
<b>Top 5:</B></P>
1. Herr der Ringe von Benjamin Herwig (sehr informativ und auch sehr viel
Arbeit)<br>
2. StoryGame TNG von &quot;Thowin&quot; (sehr witzig geschrieben; sicherlich viel
Arbeit; mehr davon)<br>
3. B&#246;hse Onkelz von Andreas Etzrodt (guter Artikel; sowohl inhaltlich als
auch layouttechnisch)<br>
4. It Came From The Dessert von The Saint (gutes Layout; eines meiner
ehemaligen
Lieblingsgames)<br>
5. Myst von &quot;The Dark&quot; (alles top!)<P>

Ich hatte zwar noch einige weitere Artikel f&#252;r meine Top 5 ins Auge gefasst,
aber da ich mich nunmal auf die Zahl 5 beschr&#228;nke, ist`s damit nix. Aber an
alle, die nicht hier stehen: In der letzten NC war jeder Artikel &#228;u&#223;erst gut
gemacht; Ausf&#228;lle gab es nicht. </P>

So, da&#223; waren meine Briefe f&#252;r diesen Monat von mir. Entschuldigt bitte,
wenn ich den einen oder anderen vergessen habe, aber soetwas kann vorkommen.
Erwartet noch irgendwer eine Antwort von mir? Bitte melden! Bis n&#228;chsten
Monat ciau,</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
