<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">
<FONT SIZE=4 COLOR="#888888">
<CENTER><font color="#ff0000">
<P><H1>RICKY W       S E I T E </H1></P>
</CENTER><font color="#000000">
<P>
An Alle  ( Spiele )<br>
Kilian S.<br><hr>
<font color="#ff00ff">
An Alle<br><font color="#000000">
Hallo, wie bereits schon mal geschrieben werde ich mich von meinem Amiga 
trennen, obwohl ich eine menge Zeit und Geld investiert habe. Ich habe sicherlich 
kein schlechtes Gewissen deswegen und auch nicht das Gef&#252;hl den Amiga in 
Stich zu lassen, da der Amiga ( Firmen ) mich im Stich lassen. Wie schon oft 
erw&#228;hnt ist bei mir hier in &quot; S&#220;DTIROL &quot; f&#252;r den Amiga 
nichts mehr zu bekommen, da&#223; hei&#223;t, ist er kaputt, so habe ich keine 
Anlaufstelle wo ich in zur Reparatur bringen k&#246;nnte !!!!!
<br><font color="#00ff00">
Nun zu meinen Spielen:<br><font color="#000000">
Ich h&#228;tte da zwei eigene entwickelte Spiele, schickt mir ein Postbonus zu 2,2 
Dm oder  einen netten Brief und ich schicke euch die Spiele, falls ihr eure Adresse 
mitschickt.<br><font color="#ff0000">
1.) Spiel   &quot; 3D DicDacDoe &quot;<font color="#000000"><br>
     Ich glaube das originale Spiel hei&#223;t TicTacToe, aber meines ist 3 
Dimensional. Also es gilt nicht nur auf einem Spielbrett zu spielen sondern auf 3 
     &#252;bereinanderliegende Bretter. Da es so aber leicht ist eine Dreierreihe zu 
bilden kann man durch eine eigene Dreierreihe die des Gegners neutralisieren.
Man kann Mensch gegen Mensch, oder Computer gegen Mensch spielen, wobei 
noch zu sagen ist, der Computer verliert meistens, aber nicht immer .<br>
<font color="#ff00ff">
2.) Spiel    &quot; Stechen &quot;<br><font color="#000000">
Dies ist ein Kartenspiel, wo man zu 4 spielt. Ein Mensch und den Rest 
&#252;bernimmt der Computer. Das Spielprinzip ist einfach, man w&#228;hlt den 
Trumpf mit 3 Karten, wirft aus, wobei der Gegner stets die gleiche Farbe auswerfen 
mu&#223;, und hofft zu stechen.
Pro Stich ein Punkt, wer in einem Spielzug alle 6 macht bekommt 12 Punkte.
Wer am Ende 25 Punkte hat, der ist Sieger.<br><font color="#0000ff">
3.) Spiel  &quot; Kartenlegen &quot;<br><font color="#000000">
 Es ist nur ein Zeitvertreibspiel, den richtigen Namen habe ich vergessen.
 Karten liegen umgekehrt auf dem Tisch und man mu&#223; hoffen das sie beim
 umdrehen sich in die richtige Position kommen, verstanden ..... Nein !!!
Ist nicht wichtig, probieren denn es ist leicht, weil man fast nichts tun mu&#223;, nur 
dem Computer  sagen welche Farbe er in welcher Reihe anordnen mu&#223;.
<br><hr><font color="#ff0000">
An Kilian<br><font color="#000000">
Wer ist hier ein <font color="#110000">SCHWEIZER <font color="#000000">( nichts 
gegen den Schweizern ) und wieso JUNG, ich f&#252;hle mich ALT ( hatte einen 
schweren Arbeitsunfall vor 5 Jahren und kann mich nur mehr beschr&#228;nk
 bewegen und das Wetter....) Also ich bin ein Italiener ( aber nicht weitersagen ) mit 
deutscher Muttersprache, lebe in der Provinz S&#252;dtirol/Trentino, die eine 
Autonomie besitzt und mit der Schweiz und &#214;sterreich grenzt. Wir haben hier 
ber&#252;hmte Sportler ( Rodler, Bob und Skifahrer ) , den Bergsteiger Reinhold  
Messner wirst du sicher kennen oder unser &#214;tzi, all diese sind meine Lands-
leute. Andreas Hofer wirst du nicht kennen, der hat Napoleon hier das Leben schwer 
gemacht bis sie im an die Wand stellten und einen Nudelschieb daraus machten, 
aber daf&#252;r ist er jetzt ein Nationalheld.
&#220;ber mein Outfit vom vorigen Artikel, gebe ich zu war ScH...... , aber nicht
 wegen mir. Bei mir war alles wunderbar leserlich, aber wenn das Hintergrundbild 
fehlt und  deswegen die Farbe im Hintergrund danach ung&#252;nstig ausgefallen 
ist, da kann ich nichts daf&#252;r.<br>
Den PC habe ich noch nicht, meine Chef ( Ehefrau) verbietet es mir. Erst im Januar
 ( vielleicht )   wenn es die G&#246;tter gut mit mir meinen, sprich finanziellen Mit-
teln, kommt er ins Haus und den Amiga werde ich verschenken, wenn ich 
Gl&#252;ck habe nimmt ihn einer ab ( so sieht es hier n&#228;mlich aus).
Ich habe mich irre gefreut, wenn  ich  deinen Artikel las, den ich f&#252;hle mich hier 
ziemlich alleingelassen , ich mit meinem Amiga . Ehrlich gesagt leiht tut es mir 
schon, Abschied von meinem Amiga zu nehmen , aber vielleicht, bis Januar , man 
hofft auf ein kleines Wunder und der neue Amiga erobert  den Markt und man kann 
sich auf in  ( Computer &amp; Firma ) verlassen, dann kann schon sein das ein 
Amiga wieder mein Eigen ist.<br><hr><font color="#ff0000"><center>  
Euer Ricky-W</center><br><font color="#000000">
Apropo meine Adresse , falls ihr die Spiele wollt.<br>
Richard Wiedemann<br>
Maiergasse 30<br>
39014  Burgstall<br>
BZ -  Italien<br>
</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 
height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
