<HTML>
<HEAD><TITLE>Heaven: Now with Hell Protection!</TITLE></HEAD>
<BODY BGCOLOR=WHITE TEXT=BLACK BACKGROUND=mauer_07.jpg>
<CENTER><H1><U><FONT COLOR=RED>Heaven</FONT></U></H1></CENTER>
Ach ja, irgendwie hab ich diesen Monat meine faule Phase. Mehr als die
 Leserbriefe hab ich bis heute nicht zustande gebracht. Aber was solls,
 wenigstens etwas. Letter gibt es heute f&uuml;r <A HREF=#1>Mark Tom</A>, <A
 HREF=#2>Killian</A>, <A HREF=#3>Thowin</A>, eine neue <A HREF=castro.html>Vorstellung</A> für Neelix
 und au&szlig;erdem noch meine <A HREF=#4>Top 4</A>.
 Ach ja: Ich habe bemerkt das meine Artikel, besonders die
 Tabellen-intensiven,
 mit den PC-Browsern einfach grausam aussehen. Mit IE geht es noch, aber
 Netscape h&auml;tte ich beinahe erscho&szlig;en, wenn es sich nicht aufgeh&auml;ngt h&auml;tte.
 :)<BR>Also, falls meine Artikel bei euch komisch aussehen, immer nur mit
 Amiga Browsern ansehen.
<HR width=45% COLOR=BLACK NOSHADE SIZE=2>
<A NAME="1"></A>
<DL>
<DT><B><U><H3><FONT COLOR=BLUE>An Mark Tom:</FONT></H3></U></B></DT><DD>
<FONT SIZE=-1><FONT COLOR=GREEN>Du,</FONT> Ich</FONT><BR>
<P><BLOCKQUOTE><I><B><FONT COLOR=GREEN>»Aaaaah, jetzt verstehe ich Dich!!! Also ehrlich, das h&auml;ttest Du auch schon
 fr&uuml;her sagen k&ouml;nnen. Wie ich Deinem letzten Diskussions-Beitrag entnehme,
 bist Du gar nicht scharf darauf, das der Amiga nun wesentlich erfolgreicher
 wird, weil dann ja all die Deppen vom PC-Lager wieder zu uns r&uuml;berkommen!«
</FONT></B></I></BLOCKQUOTE></P> <P>
 Naja, fast. Wenn Amiga wirklich einen neuen Rechner rausbringt werde ich
 diesen mit offenen Armen empfangen. Insbesondere, wenn er wirklich so gut
 wird wie angek&uuml;ndigt. Das hab ich aber auch schon gesagt. Das sagte ich auch
 schon.
 Allerdings habe ich mir inzwischen auch einen PPC
 zugelegt, und sei es nur, um die Wartezeit zu &uuml;berbr&uuml;cken. :)</P><p>
 Wenn Amiga nun also so eine Hammerkiste auf den Markt bringt ist das toll,
 aber zwei Dinge gebe ich zu bedenken: Erstens das gro&szlig;e <B>wenn</B>,
 <B>wenn</B> sie ihn rausbringen, <B>wenn</B> er so toll ist...<BR>
 Zweitens die Sache mit den <B>Deppen</B>:</P><P>
 W&uuml;rdest du es echt gerne sehen, wenn der Amiga so erfolgreich wird, das er
 den PC zur&uuml;ckdr&auml;ngt? Ich meine jetzt wirklich stark?<BR>Stell dir vor, jeder
 auf der Welt (naja, <B>fast</B> jeder) h&auml;tte nun einen Amiga zuhause
 stehen... ich finde, in so einem Fall k&ouml;nnte der Amiga sehr schnell zu dem
 werden, was der PC heute ist:<P>&uuml;berbev&ouml;lkert, tr&auml;ge, und voll von
 <B>Deppen</B>.<BR>Ich meine mich zu erinnern, da&szlig; auch du einmal den Gedanken
 der Innovation und Revolution angesprochen hast. Was bringt es denn nun, wenn
 Amiga und PC die Rollen tauschen w&uuml;rden (rein hypothetisch nat&uuml;rlich...)?
 Dann w&uuml;rde der Wintel PC zum Freak Compi werden!</P><P>
 Und schlie&szlig;lich warst DU der, der was von der Philosophie hinter dem Amiga
 sagte...<BR>
 Das wollte ich halt damit ausdr&uuml;cken. Von mir aus k&ouml;nnte der
 Amiga auch einen Userkreis von 25 Millionen oder mehr haben, aber dann k&ouml;nnte
 es schnell wieder so werden wie damals, am A500.<P>Ich erinnere mich noch gut daran, was f&uuml;r
 ein <B>Depp</B> ich gewesen bin... nach drei (!) Wochen wu&szlig;te ich grade mal
 den Klammergriff... W&auml;hre Como nich pleite gegangen h&auml;tte sich das auch wohl
 wenig ge&auml;ndert.</P><P>Aber ich schweife ab. Wie w&auml;re es, wenn wir einfach mal bis
 Ende des Jahres abwarten, und dann nochmal sehen, was Sache ist? Dadurch da&szlig;
 wir uns hier die K&ouml;pfe einschlagen arbeitet Amiga auch nicht schneller.</P>

</P>
<P>
<BLOCKQUOTE><I><B><FONT COLOR=GREEN>»Ja, stimmt schon. Das w&auml;r nicht so doll, aber man kann ja nicht alles haben! Und
 ich schreib mir meine Wurstfinger blutig um Dich zu &uuml;berzeugen, weil ich
 dachte das wir das gleiche wollten, aber weit gefehlt!«
</FONT></B></I></BLOCKQUOTE></P> <P>
 Also, ICH steh schon auf M&auml;dels- du nicht? ;-))
</P>
<P>
<BLOCKQUOTE><I><B><FONT COLOR=GREEN>»
Ich glaube, wir k&ouml;nnen uns jetzt diese Diskussion wirklich sparen, da wir
 beide recht haben: Du m&ouml;chtest weiterhin, das der Amiga ein Au&szlig;enseiter f&uuml;r
 eine kleine exklusive User-Gruppe bleibt, daf&uuml;r ist ein PPC-Amiga durchaus
 eine gute Wahl. Ich hingegen (und gut 90% aller Amigauser) wollen dem Amiga
 zu mehr Glanz und Erfolg verhelfen, weswegen es aus unsere Sicht vern&uuml;nftig
 ist, den NG-Amiga zu unterst&uuml;tzen! Friede?!
 </FONT></B></I></BLOCKQUOTE></P> <P>
 Grob richtig. Wie w&auml;hre es mit dem NG-Amiga f&uuml;r eine exklusive User-Gruppe?
 Siehst du, ich hab doch gar nichts gegen die Sache an sich. Nur ein par
 Detailpunkte st&ouml;ren mich (Dieser ganze Mist mit LCD-Tablets, Information
 Assem-irgendwas und &uuml;berall der gro&szlig;e Button Iiiinternet. B&auml;h! :-P).</P>
 <P>Wo wir schon mal dabei sind, wei&szlig;t du was mich besonders ankotzt? Dieses
 Wort, dieses UNWORT: <B>Multimedia</B>! Das steht jetzt sogar schon auf
 Lautsprechern drauf! Das ist so ein Punkt siehe Deppen...</P>
<P>
<BLOCKQUOTE><I><B><FONT COLOR=GREEN>»Hui, nun gibts doch HTML-Tabellen in der FD-Hitparade! Puh, nochmal Gl&uuml;ck
 gehabt! Ich hatte inzwischen mein Angebot etwas bereut, denn ich h&auml;tte dieses
 Tool f&uuml;r Dich anpassen m&uuml;&szlig;en, also, d.h. ja, ich h&auml;tte f&uuml;r Dich arbeiten
 m&uuml;&szlig;en! F&uuml;r Dich??? Einen der PPC toll findet??? :))«
 </FONT></B></I></BLOCKQUOTE></P> <P>
 
 Jaja, aber erst einen auf dicke Hose machen ;).<BR>
 Naja, mu&szlig; ich halt mal selbst sehen, was ich so machen kann...<BR>
 Will mir eigentlich keiner Seine Charts schicken?<BR><CENTER>
<BLINK><A HREF="MAILTO:FD-Hitparade@Gmx.de?subject=FD-Hitparade">FD-Hitparade@Gmx.de
 </a></BLINK><BR></CENTER></P>
<P>
<BLOCKQUOTE><I><B><FONT COLOR=GREEN>»Was ich noch los werden m&ouml;chte: F&uuml;r mich bist Du ab sofort der
 Tabellenmeister!!!«
 </FONT></B></I></BLOCKQUOTE></P> <P>
 JETZT erst? Da bem&uuml;he ich mich seit 10 NCs darum, das mir einer DAS sagt...

 ich bin ger&uuml;hrt! :)<BR>
</P>
<P>
<BLOCKQUOTE><I><B><FONT COLOR=GREEN>»Also Dein Tabellen-Ding aus dem MCP-Artikel ist ja ein
 Ding... Ich mu&szlig;te im Quelltext nachschauen, ob das wirklich eine Tabelle ist
 und kein GFX-Fake. «
 </FONT></B></I></BLOCKQUOTE></P> <P>
 Hm, GFX-Fakes mach ich eigentlich keine, aber ich hab da noch so `ne Idee f&uuml;r
 ein Tabellen-GFX-Fake... kommt vieleicht in der n&auml;chsten NC, wird witzig. :))
</P>
 <P>
<BLOCKQUOTE><I><B><FONT COLOR=GREEN>»Da guckste, was!? Jaaahaa, auch ich hab ein Talent! Na na, nur nicht neidisch
 werden!!! :)«
</FONT></B></I></BLOCKQUOTE></P> <P>
&ouml;hm, &auml;h, also... wenn du es SO ausdr&uuml;cken willst... :)
</P>
<P><B><H4>The Saint</H4></B></P></DD>
<HR width=45% COLOR=BLACK NOSHADE SIZE=2>
<A NAME="2"></A>
<DT><B><U><H3><FONT COLOR=BLUE>An Killian:</FONT></H3></U></B></DT><DD>
 Jo, inzwischen sollte mein Letter auch schon wieder bei dir angekommen sein.
 Besser sp&auml;t als nie, nech?<P><B><H4>The Saint</H4></B></P></DD>
 <HR width=45% COLOR=BLACK NOSHADE SIZE=2>
<A NAME="3"></A>
<DT><B><U><H3><FONT COLOR=BLUE>An Thowin:</FONT></H3></U></B></DT><DD>
Wegen dem Selbstmord Abschnitt:<BR>
Das war NICHT makaber. ICH trinke Blut und fresse kleine Kinder, und ich sage,
 es war NICHT makaber! Soviel dazu. Was kommst du Depp eigentlich dazu, unser
 Massaker hier &ouml;ffentlich rauszuposaunen? Was denkst du mu&szlig;te ich mir
 einfallen lassen, um diese GSG-9 Typen hier wegzukriegen? Nenene...<BR>Und
 f&uuml;r den Termin w&auml;hre doch der 24.12 nicht schlecht? ]:-><BR>
 Naja, wir reden uns...
 <HR width=45% COLOR=BLACK NOSHADE SIZE=2>

<A NAME="4"></A>
<DT><B><U><H3><FONT COLOR=BLUE>Top 4:</FONT></H3></U></B></DT><DD>
<OL>
<LI> STTNGTNG von Thomas Windecker- Ja, freu dich: Jetzt bekommst du doch mal
 ein Lob :)</LI><LI>
 FastFood von Mark Tom- Hm, eigentlich gefallen mir nur die News aus der
 Konsolenwelt... aber nicht schlecht, f&uuml;r einen der den NG-Amiga gut findet...
 :)</LI><LI> Mutli Ecke von Yonder- Gutes Layout!</LI>
<LI> Star Trek Pages von Thowin- Irgendwie mu&szlig; ich diese Liste
 vollbekommen...</LI></OL>
</DD></DL>
<!--
Was mir nicht gefallen hat:
1. Das neue Layout ist IMHO leider um einiges unpraktischer als das alte.
 Besonders der &uuml;berblick &uuml;ber alle Artikel fehlt doch schon.
2. Irgendwelche Leute, die ihre Texte unbedingt mit H4 oder FONT SIZE=+1
 aufbauschen m&uuml;&szlig;en, damit es nach mehr aussieht. 
3. Das die ganzen Leute, die damals so laut br&uuml;llten: "Ich schreib wieder,
 damit es besser wird" jetzt doch nicht schreiben.
4. Das einige Rubriken in der NoCover immer mehr verwaisen.
5. Das gewisse Leute (Jaja, ich meine genau DICH ;-)) immer noch
 Gro&szlig;buchstaben in ihren Artikeln verwenden. Diese Artikel kann man &uuml;ber die
 Homepage nicht ansprechen (na gut, schwer).//-->
 
 <!--Begin Signature-->
<CENTER><P><TABLE BORDER=2 BGCOLOR=BLACK BORDERCOLOR=WHITE><TR><TD> <CENTER><A HREF="mitglieder/castro.html"><IMG SRC="thesaint.gif" width=142 height=51 alt="The Saint" BORDER=0></A><BR><SMALL><FONT COLOR=#FFFF00>Markus Castro</FONT></SMALL></CENTER></TD></TR></tABLE></P></CENTER>
<!--End Signature-->
 </BODY></HTML>
 