<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>

<body background="wolf1.jpg" text=black link=blue alink=red bgcolor=gray>
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Markus Thomaschewski</a></b></li>
<li><a href="#a2"><b>f&uuml;r Rolf N&uuml;nninghoff</a></b></li>
</ul>
<br>

<h3><a name="a1">Gr&uuml;&szlig; Dich Markus</h3>

<p>Deine Entschuldigung ist angenommen!!!</p>

<p> Erst wollte ich diesen Satz so in der Landschaft stehen lassen, aber bei
genauerem Hinsehen sieht es dann so aus, als wenn ich doch beleidigt w&auml;re
oder mindestens mich wie eine Mimose benehme. Es trifft beides nicht zu, das
kann ich Dir versichern. Nur eines solltest Du wissen, wenn man &auml;lter wird
und wie ich l&auml;ngere Zeit keinen t&auml;glichen Kontakt mehr zu
stressbedingten Verbalentgleisungen und deren Handhabung mehr hat, wird man doch
gewaltig d&uuml;nnh&auml;utig, wenn dieses Ph&auml;nomen pl&ouml;tzlich ganz
&uuml;berraschend und unvorbereitet auftaucht. Vielleicht auch deshalb meine
etwas vehemente Verteidigung. </p>

<p>Aber ganz ehrlich, wenn Deine E-Mail Adresse stimmen w&uuml;rde, dann
w&auml;re dieses alles nicht so ausgeufert, sondern die
&quot;Ungereimtheiten&quot; h&auml;tten sofort mit der ersten Mail
ausger&auml;umt werden k&ouml;nnen. </p>


<p>Alles Gute bis zum n&auml;chsten Mal, Wolf</p>

<hr>
<h3><a name="a2">Gr&uuml;&szlig; Dich Rolf</h3>

<p>Deinen Leserbrief hatte ich Dir schon teilweise per E-Mail beantwortet und
nun folgt der Rest etwas ausf&uuml;hrlicher. </p>

<p>Zu Frage nach Aktualit&auml;tsstand der NC-Guide und Update zu NC-Guide: <br>
Bei beiden downloadbaren LHA-Files steht das aktuelle Datum der Erstellung in
Klammer dahinter. Wobei ich nochmals darauf hinweisen m&ouml;chte, dass das
Update sich immer nur auf die NC-Guide des Standes des Vormonats bezieht. Hast
Du einmal vergessen, einen Monat zu &quot;updaten&quot;, dann musst Du schon das
aktuelle Gesamtverzeichnis ziehen. Im Update sind immer nur die
Ver&auml;nderungen zum Vormonat enthalten. </p>

<p>Die &Auml;nderung, die Du ansprichst, bezog sich auf die Neugestaltung meiner
Homepage. Wie Du nun gesehen hast, habe ich dieses Grundmuster an Andreas als
Vorschlag f&uuml;r die NoCover gesandt und er hat dies auch konsequent
umgesetzt. Ich habe aber keine Ahnung, wieviele User PAL-Hires oder sogar
PAL-Lowres auf ihrem Bildschirm haben und wenn dann der Browser noch mit vollem
Kopf gefahren wird, ist bei denen von der NoCover nicht mehr viel zu sehen. Ein
Gl&uuml;ck, dass diese Kopfzeilen ausgeblendet werden k&ouml;nnen und die
Steuerung der Browser auch mit der rechten Maustaste durchgef&uuml;hrt werden
kann. Dann bleiben von den 256 Pixeln pro Seitenh&ouml;he wenigstens 180 - 190
Pixel zum Lesen der NoCover &uuml;brig. Am Besten w&auml;re es nat&uuml;rlich,
wenn die Bildschirme auf 800&times;600 eingestellt w&auml;ren, aber kleiner als
640&times;480 sollte man aber wirklich nicht gehen und dabei die Kopfzeilen der
Browser auf das notwendigste minimieren. </p>

<p>Wenn Du diese Zeilen liest, wirst Du wahrscheinlich auch viel Negatives
&uuml;ber das neue Outfit der NoCover gelesen haben. Aber eine konsequente
Neuerung der NoCover ist derzeit noch nicht m&ouml;glich, wenn viele in den
Genuss des Lesens und Betrachtens kommen wollen. Denn allzuviele User benutzen
nur eingeschr&auml;nkte Demo-Versionen von Browsern und so muss halt leider noch
der HTML-Standard 3.2 ohne Verwendung von Javascripts, CSS und Dynamischem-HTML
eingehalten werden. Die Steuerung vom linken Frame aus ohne Grafiken geht so am
schnellsten vonstatten. F&uuml;r den Kopfframe k&ouml;nnte ein Banner entwickelt
werden, das keinesfalls h&ouml;her als 65 Pixel sein darf. Wenn aMozillaX
h&auml;lt, was es verspricht und es kann verteilt werden, dann steht einer
generellen Umorganisation der NoCover nichts mehr im Wege. </p>

<p>Deine Frage nach der Interesse von NC-Guide kann ich nicht beantworten. Der
einzige Feedback ist derzeit die sehr kleine Zahl der E-Mail Anforderung des
Updates, erfreulicherweise dagegen aber die Platzierung in der FD-Hitparade.
Anforderung per Diskette ist NULL. Und auf meiner Homepage habe ich den
Besucherz&auml;hler weggenommen, um nicht noch mehr Frust zu bekommen. In einem
Jahr hatte ich weniger als 100 Besucher gez&auml;hlt (meine Besuche musste ich
ja abziehen, weil diese auch gez&auml;hlt wurden). So kann ich mich der Hoffnung
hingeben, dass es inzwischen doch ein paar mehr geworden sind ohne an die
tats&auml;chliche Realit&auml;t erinnert zu werden. </p>

<p>Alles Gute bis zum n&auml;chsten Mal, Wolf</p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr>
</table>
<br>
</body>
</html>

