<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Black Metal</TITLE>
   <META NAME="AUTHOR" CONTENT="Dark Evil">
   <META NAME="DESCRIPTION" CONTENT="The Black Metal Bibel Tip">
   <META NAME="KEYWORDS" CONTENT="Black Metal">
   <META NAME="GENERATOR" CONTENT="Dark Evil with the Evil Hands">
</HEAD>
<BODY BACKGROUND="back.png" BGCOLOR="Black" TEXT="White" LINK="Red">
<CENTER>
<IMG SRC="logo.gif" ALT="LINE" WIDTH=637 HEIGHT=133 ALIGN="MIDDLE"><BR>
<IMG SRC="line.gif" ALT="LINE" WIDTH=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
<H1><FONT COLOR="#FFFFFF">&#220;BER GUT UND B&#214;SE (THE BLACK METAL BIBEL)</H1><BR>
</CENTER>
<H2><FONT COLOR="#AAAAAA">Gut und B&#246;se sind zun&#228;chst einmal ganz einfach nur zwei Worte, denen wir durch
unser Verhalten und unsere Ansichten Leben verleihen. Doch nun wird es schon
etwas komplizierter.Was der Gute nicht guthei&#223;en kann, nennt er b&#246;se. Was der
B&#246;se nicht gut findet - also b&#246;se hei&#223;en mu&#223;, nennt er gut, und meint doch b&#246;se.
Die babylonische Verwirrung nimmt schnell ihren Lauf. Denn der als &quot;b&#246;se&quot;
Geziehene empfindet sich ja (meist) als &quot;gut&quot;, h&#228;lt die Gegenpartei f&#252;r &quot;b&#246;se&quot;.
Auch zahlreiche Bands oder  Musiker  in  diesem  Buch (The Black Metal Bible –
Anm. CrossOver)  wollen  eine Weltherrschaft des  B&#246;sen  erreichen,  was  auch
immer sie darunter verstehen. Das von ihnen abgelehnte Gute erm&#246;glicht es ihnen
jedoch erst, sich als dessen Gegenteil, also &quot;b&#246;se&quot;, zu begreifen. Die
von ihnen  angestrebte/erhoffte  Neukonstitutionierung der Welt unter
umgedrehten Vorzeichen, in der das  &quot;B&#246;se&quot;  zum  Herrschaftsprinzip gelangt,
bedeutete ja die Umkehrung des Wertes. So w&#228;ren die Initiatoren des Wechsels ja
nun wieder gut...<BR><BR>
Ach Kinder, so kommen wir nicht weiter. Die Frage bleibt offen:  Was  ist 
nun gut,  und  was  b&#246;se? Vielleicht hilft ja ein Gleichnis, um diesem
widerspenstigen Ph&#228;nomen etwas n&#228;her zu kommen. Der Mensch hat mehr Zellen, als
Menschen auf der Erde leben (mehrere Milliarden).Trotzdem kommt es in
der  Regel  zu keinerlei  Verst&#228;ndigungsschwierigkeiten  im  menschlichen
Organismus, denn das Kommunikationssystem der Zellen untereinander ist
vorbildlich. &#220;bertragen wir diesen komplizierten Mechanismus auf die Erde, f&#252;hrt
es zu dem Schlu&#223;: Das Miteinander von Milliarden auf engstem Raum l&#228;&#223;t sich nur
durch Kommunikation, also Verst&#228;ndigung, erm&#246;glichen. Gehen wir davon aus, da&#223;
das Miteinander auf dieser Erde  nur  mit  gewissen Kompromissen  (an 
die &quot;Gegenseite&quot;)  und  der Einhaltung gewisser Regeln  funktionieren kann, sich
nur durch diese regeln l&#228;&#223;t, erfordert dies, vorrausgesetzt, man erkennt die
Existenz unabdinglicher Regeln an, eine gewisse Toleranz gegen&#252;ber denen/dem,
das anders ist, als man selbst. Man begreift, da&#223; der andere vor allem so hei&#223;t,
weil er so ist: anders.Das also nicht jeder so sein kann und so sein will, wie
man selbst. Hier wird es nun pr&#228;ziser. Das Gute erkennt diese Grundregel an. Das
B&#246;se meint, sich dar&#252;ber hinwegsetzen zu d&#252;rfen, um seine eigenen, egoistischen
Ziele gegen jeden durchzusetzen, dem die Kraft fehlt, sich ihm
entgegenzustellen. Zu diesem Problemkreis hat ein englischer Forscher
Bahnbrechendes geleistet: Charles Darwin. Der brachte Licht in das bisherige
Dunkel, erhellte die Herkunft der Arten (&quot;On the Origin of Species&quot;), stellte
eine Evolutionstheorie auf, die im Gegensatz zur Relativit&#228;tstheorie, keine
Theorie mehr ist, sondern (nach unserem Ma&#223;stab) unumst&#246;&#223;liche Gewi&#223;heit.  Die 
Ver&#228;nderlichkeit  der Organismen und der &quot;Kampf ums Dasein&quot; erschienen ihm als
die wichtigsten Vorraussetzungen der Umwandlungen, die die Lebewesen im Laufe
der Jahrmillionen durchlaufen haben. Unter der unendlichen Vielzahl von
Nachkommen jeder Generation merzt die sich stets ver&#228;ndernde Umwelt aus, was
weniger lebenst&#252;chig ist,  das  Bessere,  Lebenst&#252;chtigere  bleibt erhalten, 
und  gibt  seine  fortschrittlichen Eigenschaften in der Vererbung an seine
Nachkommen weiter, bei denen sich das Spiel von Variablit&#228;t, Auslese und
Vererbung wiederholt.
Die (verknappte) Essenz der Darwin'schen Theorie hat also zum Inhalt, da&#223; unter
allen Lebewesen, von
der Mikrobe bis zum Menschen, das anpassungsf&#228;higste Wesen &#252;berlebt. In dieser
Lesart gilt der Mensch  als die  Krone der &quot;Sch&#246;pfung&quot;,  deren christliche
Genese der Engl&#228;nder verneint. Das ist aus diesem Blickwinkel okay. Aber, und
nun wird es wieder  komplizierter:  Die Definitionen  und Erkenntnisse des
gro&#223;artig/genialen Darwin enden auch  mit dem, was wir als menschliche
&quot;Zivilisation&quot; bezeichnen (die keine solche ist, sondern ein Chaos). Die
Forschungsergebnisse von Darwin dienen seit Jahrzehnten bestimmten Kreisen als
Alibi.  Leiten manche  (Extremisten  jeglicher Couleur) aus dem
Evolutionsprinzip der Arten doch eine  Verhaltensmaxime  f&#252;r  die menschliche
Gesellschaft ab, nach der das &quot;Recht des St&#228;rkeren&quot; zu gelten  habe.  Hier 
wurde  ganz  einfach der Lehrsatz &quot;Survival of the Fittest&quot; in &quot;Survival of the
Strong&quot; umgedeutet.Man glaubte ein biologisches Gesetz ausgemacht zu haben, nach
dem der Starke den Schwachen fri&#223;t bzw. fressen darf. Das mag in der Zoologie
den Eindruck erwecken, &#252;bertr&#252;ge man dieses scheinbare Prinzip auf den Menschen,
w&#252;rde  der sich  praktisch  zum Tier zur&#252;ckentwickeln. Auch das ist nat&#252;rlich
eine These, f&#252;r die es in &quot;Brehms Tierleben&quot; keinen Beweis gibt. So weit ich das
als Laie mitbekommen habe, fri&#223;t das starke Tier das schwache nur wenn es Hunger
hat oder um zu &#252;berleben, etwa wenn sein Lebensraum bedroht ist. Hier wirken
jedoch Instinkte und nicht das Gef&#252;hl &quot;Ich bin stark und du bist schwach&quot;. Ob
man &quot;stark&quot; oder &quot;schwach&quot; ist, l&#228;&#223;t uns zun&#228;chst an den Anfang dieser
Ausf&#252;hrungen zur&#252;ckkehren.Denn was der eine f&#252;r &quot;stark&quot; h&#228;lt, k&#246;nnte ja auch
&quot;Schw&#228;che&quot; sein.  Meint  jedenfalls  manch &quot;Schwacher&quot; von denen, die sich f&#252;r
&quot;stark&quot; halten. Ob man &quot;stark&quot; oder ,schwach&quot; wird, h&#228;ngt (auch nach Darwin) von
den Erbanlagen ab. Die verdankt  man jedoch  dem  Lotteriespiel  der
Fortpflanzung  auf dem  Lotterbett  sexueller Leidenschaften.  Dies 
unterliegt einem  Zufallsprinzip, auf das niemand Einflu&#223; hat. Was ich an den
Darwin mi&#223;interpretierenden Ideologien noch nie verstanden habe, ist die
schlichte Tatsache:
Auch k&#246;rperlich schwache, gesundheitlich instabile Menschen (oft gerade die)
k&#246;nnen sehr klug, sehr weise, folglich von Nutzen sein. Habt ihr schon mal
einen  muskelstrotzenden Kernphysiker gesehen?  Wohl kaum. Doch ein jeder nach
seinen Neigungen.Auch  die  Gebrechlichen  k&#246;nnen  mit  geistigen Leistungen zum
Gemeinwohl beitragen (man denke an die Forschung oder Medizin zum Nutzen des
Menschen, man denke an Literatur und Kunst zur Erbauung des Menschen). Sollen
doch die Kr&#228;ftigen und weniger Begabten diese sch&#252;tzen und mit dem Ertrag ihrer
k&#246;rperlichen Arbeit auch mitern&#228;hren.
Das w&#228;re eine Symbiose von h&#246;herem Sinn und Nutzen  f&#252;r alte.  Kehren wir  nun 
zur&#252;ck zum Ausgangspunkt  dieser  Betrachtung. Das  B&#246;se glaubt, sich &#252;ber diese
sinnvollen und segensreichen Regeln hinwegsetzen zu k&#246;nnen/zu d&#252;rfen. Kraft 
h&#246;heren Glaubens,  Kraft der  M&#228;chte  der Finsternis. Und hier beginnt sich nun
endlich der Nebel zu lichten. Wir sehen etwas klarer: Das Gute steht also f&#252;r
die Toleranz gegen&#252;ber jedem Leben.
Das B&#246;se steht f&#252;r das gnaden- und gewissenlose Ausleben jeden Triebes (sei es
ritueller Kindesmi&#223;brauch im Namen des &quot;Geh&#246;rnten&quot; u.&#228;.)  Das B&#246;se steht auch
f&#252;r die Ignoranz jeglicher Normen. Und hier st&#246;&#223;t man unweigerlich auf die
dunkelste Epoche der Neuzeit: Das 20. Jahrhundert erlebte 12 Jahre, in denen
dieses Streben ganz besonders skrupellos zur Staatsdoktrin erkl&#228;rt wurde: Das
Dritte Reich strebte  nach der Weltherrschaft f&#252;r eine besondere Rasse (den
nordisch-arisch-germanischen Typus), setzte sich f&#252;r die Durchsetzung seiner
Ziele &#252;ber jegliche v&#246;lkerrechtlichen Normen hinweg. Millionen Menschen wurden
dem Endziel geopfert, kaltbl&#252;tig und besessen. Wir sind uns einig: H&#228;tten sie 
gesiegt, h&#228;tten  sie  die  Geschichtsb&#252;cher geschrieben.In denen  w&#228;ren  die
entsetzlichen Opfer bestenfalls eine Fu&#223;note wert gewesen. In ihrer Art des
Vorgehens w&#228;ren sie wahrscheinlich auch zahlreicher Probleme der modernen
Zivilisation der 90er Jahre Herr geworden. Doch zu welchem Preis? Herrenmenschen
aus dem , Lebensborn&quot;, in  dem  die  besten  Erbtr&#228;ger  beiderlei Geschlechts
zur Zucht der Nachkommen dienen sollten. Getreu dem Evolutionsprinzip der
Tierwelt wollten sie den Menschen auf die n&#228;chsth&#246;here Entwicklungsstufe
stellen. K&#252;hn stark, klug, blond, blau&#228;ugig, unbezwingbar. War f&#252;r ein Traum.
Was f&#252;r ein Alptraum. Das nach unseren Ma&#223;st&#228;ben un&#252;bertrefflich  B&#246;se  h&#228;tte 
sich als  Retter  der Menschheit und der Erde aufgeschwungen. Keine Frage:  Sie
w&#228;ren von  nun an die Guten.  Das Denken, Wirken,  Agieren  und  Scheitern 
Adolf Hitlers ist  einfach  unbegreiflich  f&#252;r  jeden Sterblichen.Vision&#228;r,
Genie, Feldherr, Psychopath - was war nicht alles schon zu vernehmen. Der Tier-
und Kinderfreund (als der er sich inszenierte) ein R&#228;tsel. Er war unter Garantie
davon &#252;berzeugt, das Beste f&#252;r sein Volk anzustreben, f&#252;r sich selbst hat der
Vegetarier, Anti-Alkoholiker,  Frauenverschm&#228;her, Asket und Luxusver&#228;chter die
Welt nicht ins Verderben gerissen, sondern f&#252;r eine Sache, von der er &#252;berzeugt
war das sie gut ist. Und sie war doch so b&#246;se.Die apokalyptischen Schrecken und
Leiden, die es hervorbrachte, sind ohne Beispiel in der Geschichte der
Menschheit. Daran l&#228;&#223;t sich weder etwas revidieren, noch &quot;wiedergutmachen&quot;.
Aber daraus l&#228;&#223;t sich enorm viel lernen. Und enorm viel verdienen. Das &quot;Dritte
Reich&quot; und der F&#252;hrer sind zwar in Deutschland ein Tabu der Neuzeit wenn es  um 
Ursachen,  Zusammenh&#228;nge  und Hintergr&#252;nde geht,  die  mit  DER  Trag&#246;die  der
Menschheit unzertrennlich verbunden sind. Und trotzdem: Viele verdienen gut und
gern mit ihm,  wie etwa ein gewisser G. Knopp, Fach-Historiker beim ZDF
(&quot;Hitlers Helfer&quot;), der sich einen s&#252;ffisant-herablassenden Ekel leistet (der
mich oft an Karl-Eduard von Schnitzler erinnert), und doch vom Geist und der
Faszination des Faschismus schamlos profitiert, von dem er meiner Meinung nach
nichts begriffen hat (gar nichts. um genau zu sein).
Welten liegen zwischen diesem ganz besonders widerlichen Kerl und einem anderen
Journalisten, den dieselbe Thematik fasziniert. In kritischer Intellektualit&#228;t 
und distanzierter  Betrachtung  (wie  ein Mikrobenforscher mit Mikroskop)
n&#228;herte sich ihm beispielhaft  Joachim  Fest in  seiner   Hitler -Biographie 
(er  ist auch  Mitherausgeber  der &quot;Frankfurter Allgemeinen&quot;)... Zur&#252;ck zum
eigentlichen  Thema:  Selbst  wenn  man  das B&#246;se  als Gegenspieler des Guten
als Bestandteil eines kosmischen Prinzips des Gleichgewichts akzeptiert, hei&#223;t
das noch lange nicht, da&#223; bestimmte Dinge (Mord und Totschlag) akzeptiert oder
auch nur geduldet werden k&#246;nnen. Doch es besteht kein Zweifel, der Mensch ist
auf dem Wege der Evolution in eine Sackgasse geraten, auf die auch Darwin keine
Antwort gewu&#223;t h&#228;tte. Er hat sich physisch seit Jahrhunderten nicht mehr
weiterentwickelt.
Liest man die gro&#223;en Denker der Vergangenheit (Kant  Schopenhauer, Nietzsche),
dann mu&#223;man unweigerlich  feststellen,  da&#223;  auch  die geistige Potenz nicht
mehr gewachsen ist. Ganz unter uns:  Ein gro&#223;er Denker mu&#223; nicht &quot;korrekt&quot;
gedacht haben. Er mu&#223; in erster Linie &quot;gro&#223;&quot; gedacht haben (Nietzsche).  Was
w&#228;chst ist  das  Streben  nach Macht, Reichtum und Profit. Weiter nichts. Das
ist im Wachstum der Untergang als Preis f&#252;r die unvorstellbare Dekadenz.  Ein 
klassisches  Paradoxon.
K&#246;nnen wir uns wehren? Ich glaube ja! Und jetzt wird es wirklich spannender, als
jeder Hitchcock-Krimi.Denn wo Darwin mit seinem Evolutions-Latein  am  Ende 
war (siehe  oben/Weiterentwicklung des  Menschen),  kehren wir an  die Urspr&#252;nge
des Denkens zur&#252;ck. Jedes, aber auch jedes Problem der modernen Zivilisation
findet seinen Widerhall schon in der Bibel (und all den anderen Zeugnissen
menschlichen Denkens anderer Kulturkreise). Die auf &#252;ber tausend Seiten
verschl&#252;sselten, symbolhaften  Parabeln,  Sagen, Mythen und Gleichnisse sind
auch tausende Jahre nach  ihrer  Entstehung von  Nutzen und  Sinn. K&#246;nnten den
Menschen, diesen j&#228;mmlichen, armen Tropf, retten. Man mu&#223; die Kapitel der
lutherischen Bibel sicher nicht f&#252;r historisch bare M&#252;nze nehmen, aber ihr
Inhalt bietet Millionen Menschen auch ein seelisches Zuhause, f&#252;r die Anstand
und Moral Quelle des Wohlbefindens sind. Und das bedeutet eigentlich auch Gott
in meiner laienhafter Sicht  eines  Au&#223;enstehenden. Warum  gibt  es Menschen,
die an Gott glauben, und sogenannte Ungl&#228;ubige? Interviewt man die Ungl&#228;ubigen,
so erf&#228;hrt man von den meisten, da&#223; sie doch an etwas glauben, was st&#228;rker ist
als sie. Aber sie weigern sich, dieses Unfa&#223;bare Gott zu nennen.Wo liegt der
Unterschied? Der eine praktiziert seinen Glauben in der altbew&#228;hrten Form, der
andere wandelt diese ab, modernisiert sie, und ein dritter glaubt, da&#223; er nicht
glaubt. Fazit: Gott ist nicht tot, denn er sorgt f&#252;r Diskussion. Vermutlich hat
jeder Mensch eine Seele, sei sie primitiv oder roh, wei&#223; oder schwarz. Doch
viele sind sich dieser nicht bewu&#223;t. Wer jedoch einmal die Existenz seiner
eigenen Seele wahrgenommen hat, wird sich &#252;ber spirituelle oder religi&#246;se
Menschen nie wieder lustig machen oder sie verh&#246;hnen. Der Glaube ist ein derart
individuelles Ph&#228;nomen, da&#223; es die Vorstellungskraft der Dummen &#252;bersteigt.W&#252;rde
man dies akzeptieren, k&#228;men meiner Meinung nach auch Heiden und Moslems ganz gut
miteinander aus. Primitive oder dogmatische Individuen legen jedoch oft die
konfessionellen Vorgaben ihres Glaubens bzw. Unglaubens nach  eigenem  Gusto 
aus.  Die  Wurzel der Intoleranz, denn die meisten Religionen sind meines
Wissens tolerant und menschenfreundlich ausgerichtet. Hilfreich sind sie zudem,
in einem komplizierten Dasein, in dem nur wenige wissen, wo hinten, und wo vorn
ist. Wo der Unmut &#252;ber die Politiker die m&#228;chtigste emotionale Str&#246;mung, etwa in
Deutschland, geworden ist. Und &#252;berhaupt: Nach Erl&#246;sung strebt jede
vernunftbegabte Kreatur. Daran kann es keinen Zweifel geben. Das schlie&#223;t Black
Metaller und &quot;Satanisten&quot; ausdr&#252;cklich mit ein.
Auch in der unterschiedlichen Auslebung dieses Ziels k&#246;nnte ein &quot;g&#246;ttliches&quot;
Prinzip walten, dessen Ergr&#252;ndung der menschlichen Intelligenz verwehrt bleiben
wird ( gebt euch keine M&#252;he ). Das die menschliche Zivilisation gegen&#252;ber der
Natur (die l&#228;nger existiert und dies auch ewig tun wird) jeglichen Anspruch,
jegliche Legitimierung eingeb&#252;&#223;t hat (seit den naturverbundenen Heiden). halte
f&#252;r einen tragbaren gemeinsamen Nenner mit dem Leser (der ansonsten  in  jedem 
Punkt  anderer Meinung sein  darf.  kann  und  soll).  Das  der Untergang dieser
potentiell suizidalen Zivilisation beschlossene Sache ist, gilt als
unumst&#246;&#223;licher Fakt.
Hier wird die christliche Bibel nach tausenden Jahren wieder aktuell. Sie
prophezeite den verdienten Untergang der Menschen, denen Gier, Macht, Egoismus.
Gewalt und Dekadenz zur Triebfeder und zu Attributen gelangten, die wirklich
kein Sch&#246;pfer ertragen kann/k&#246;nnte (nicht mal, wenn sie in seinem Namen sich
entwickelten).Sie werden untergehen, egal ob mit oder ohne „Gottes&quot; Segen. Wir
wissen: Jeder hat ca. 70 Jahre irdischen Lebens vor sich. Wir sind uns einig:
Das Leben hat keinen Sinn, kann keinen Sinn haben. Und trotzdem: Das Leben hat
genau den Sinn, den DU ihm verleihst. Das wird an  den 
biblischen Prophezeiungen  aus  den Apokalypsen, dem Armageddon nichts
&#228;ndern.Ich benutze  als  Glaubensloser  diese  Worte als Synonyme f&#252;r Dinge, die
unaufhaltsam kommen werden. In Ehrfurcht vor der Ahnung der Weisen und der Alten
gebe ich dir, Leser dieses Buches, eine elementare Gewi&#223;heit weiter: F&#252;r die
mitteleurop&#228;ische Zivilisation ist die Bibel unver&#228;ndert eine sch&#228;tzenswerte
(Zusatz-) Lekt&#252;re, die einen wesentlichen Kern der Intelligenz des Abendlandes
bildet, die ihren Ursprung im Morgenland hat. Sie verhei&#223;t Hoffnung.ohne die
KEIN MENSCH leben kann (widersprich mir nicht, du Idiot). Sie verhei&#223;t das 
selige  Ende.  Wir  bem&#252;hen erneut  die &quot;Apokalypsen&quot;, beziehungsweise eine
gleichnishafte, symbolische  Prophezeiung:  wir  meinen &quot;Armageddon&quot;, die letzte
Schlacht: Armageddon ist jener biblische Ort. an dem die K&#246;nige der Erde zur
letzten  Schlacht antreten.  Die  Heerscharen des Teufels gegen die Streitkr&#228;fte
des Guten:“ Und Gott versammelte sie  an  einem  Ort,  der  hei&#223;t Harmagedon&quot;,
schrieb Johannes in der Apokalypse,  dem letzten Buch der Bibel. Armageddon war
einst die m&#228;chtigste Festung des alten Reiches Kanaan im heutigen Israel. 
Pharaonen eroberten sie, K&#246;nig Salomon baute sie zur Hauptstadt aus. Heute hei&#223;t
der Ort Megiddo. Von dort aus wurde Jahrtausende lang die Heerstra&#223;e von &#196;gypten
aus nach Norden kontrolliert - so wurde Megiddo zum Symbol des Endkampfes
zwischen der g&#246;ttlichen und der d&#228;monischen Armee... Gott siegt und h&#228;lt das
J&#252;ngste Gericht ab: Die Gottlosen verdammt er zur H&#246;lle, den Treuen schenkt er
das ewige Leben. F&#252;r sie schafft er ..einen neuen Himmel und eine neue Erde.
denn der erste Himmel und die erste Erde verging. Johannes zum Verlauf der
Schlacht: ..Und es geschahen Blitze und Stimmen und Donner, und es geschah ein
gro&#223;es Erdbeben, wie es noch nicht  gewesen ist, seit Menschen auf der Erde
sind... Und auch dieses schaurige, klar- und weitsichtig formulierte Ende in
einer betagten Schrift bietet eine (wahrhaft g&#246;ttliche) Chance. Denn: Jede
Erneuerung birgt den totalen Untergang des Althergebrachten mit sich. Diese
Zivilisation hat die Berechtigung ihrer  Existenz  restlos  verwirkt.  Den 
Untergang wirst du nicht mehr miterleben. die Energieressourcen  reichen
noch ca. 250 Jahre, sagt die Wissenschaft. Aber die Chance f&#252;r den Neubeginn
sind  Gehirne,  die  denken  k&#246;nnen.  Nachdenken k&#246;nnen, &#252;ber die Fehler unserer
Epoche. &#220;berleg selbst.Muss jeder Mensch ein Auto haben? Mu&#223; jeder Mensch diesen
Planeten mit einer monstr&#246;sen Menge an Abfall &quot;zuscheissen&quot; (man verzeihe mir
diesen F&#228;kalbegriff). Ist nicht weniger mehr wenn man die Demut des Verzichts,
der Dankbarkeit f&#252;r die  Existenz einmal  begriffen hat?  Ist es nicht sch&#246;n.
einfach nur da zu sein. Die Welt wird von mittelm&#228;&#223;igen Typen  beherrscht und
dominiert. Die dr&#228;ngen  sich  auf  allen  Ebenen, in  jeder Chefetage, in jeder
Bank, in jedem Vorstand, in jeder Partei nach vorne, da&#223; es jeden Edelmann
erschauert. Sie sind alle gleich bl&#246;d, in ihrer bornierten
Profitmaximierungs-Mentalit&#228;t. Ich verachte diese mental gest&#246;rten Wesen ohne
die geringste Ahnung von Ethos auf das Tiefste. Ich r&#228;ume ein, da&#223; gemessen an
den Mehrheitsverh&#228;ltnissen ich mit meinen antiquierten Ansichten gest&#246;rt bin.
Die werden's schon richtig machen. Trotzdem  kann man  ihnen  Paroli bieten. 
Mit einem  humanen Bewu&#223;tsein, da&#223; sich nicht an vererbten Qualit&#228;ten bemi&#223;t 
(auf  die niemand  Einflu&#223;  hat),  wie Sch&#246;nheit, Intelligenz,  Reichtum  etc. 
Keine Mi&#223;verst&#228;ndnisse: Ich mag sch&#246;ne Menschen, ich liebe  intelligente 
Menschen, und  wenn  man „reich&quot; (materiell) ist, das ist gleichfalls nicht
&#252;bel.
ABER: Wir wollen eine humane Gewichtung dieser Attribute, die  f&#252;r ihre  Eigner
eine moralische Verpflichtung darstellen, die kaum einer bew&#228;ltigt. Ich meine
damit: Der Kluge w&#228;re zu kameradschaftlicher Kooperation mit dem Dummen (der
nichts daf&#252;r kann) verpflichtet, trotzdem schaut er meist auf ihn herab. Der
Reiche w&#228;re zu Leistungen verpflichtet, die den Armen in seine Segnungen
integrieren (aber die Sozialbez&#252;ge werden st&#228;ndig gek&#252;rzt,  und  die  aus 
dem Amt  scheidenden Minister der Kohl-Regierung erhalten  DM 500 000.-- ,also
eine halbe Million,“&#220;bergangsgeld&quot;).
Der Sch&#246;ne &#252;be sich in M&#228;&#223;igung, Respekt und Bescheidenheit gegen&#252;ber den
weniger Beg&#252;nstigten. Doch kein noch so leidenschaftlicher Moralist konnte
damals oder heute die Welt retten. Weil sie es nicht will! Ein Anfang zum
Wechsel ist getan, wenn DU beschlie&#223;t. nicht dazu zu geh&#246;ren.Wenn du begreifst,
was es bedeutet, am Leben zu sein, ein Mensch zu sein, EIN MENSCH ZU SEIN, mit
Seele und  Bewu&#223;tsein,  gesegnet mit  Verstand,  mit Kreativit&#228;t, mit der
F&#228;higkeit.das Beste aus seinen M&#246;glichkeiten  zu  machen (oder sich zumindest
darum  zu  bem&#252;hen).  Sich  zu erg&#228;nzen  mit Menschen, die &quot;durch Zufall&quot; genau
das k&#246;nnen, was du nicht kannst, und die dankbar f&#252;r deine Talente sind, die sie
selbst nicht besitzen. Wenn all dies zusammenkommt, das ist in meinen Augen GUT.<BR>
<FONT COLOR="#FFFFFF"> 
<CENTER><IMG SRC="blackmetal.gif" ALT="LINE" WIDTH=96 HEIGHT=154 ALIGN="MIDDLE"></CENTER>
Leider kann Ich euch keine ISBN Numer geben aber der Author von "THE BLACK METAL BIBEL" ist
Mathias Herr</H2><BR><BR>
<H1>Quelle: Internet<BR>
Layout: Dark Evil</H1> 
<CENTER>
<IMG SRC="line.gif" ALT="LINE" WIDHT=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
<IMG SRC="logi.gif" ALT="LINE" WIDHT=87 HEIGHT=143 ALIGN="MIDDLE"><BR>
<A HREF="Dark.html"><TD><IMG ALT="INFO" BORDER="1" SRC="click.gif" WIDHT=176 HEIGHT=24 ALIGN="MIDDLE"></A HREF><BR>
</CENTER>
</BODY>
</HTML>
