<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Was zum Teufel interessiert mich Farbe?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOUR="YELLOW">Farbe: Ein durchaus interessantes Thema</FONT></h1></CENTER><P>

Wir alle kennen es und nehmen es sek&#252;ndlich war, ohne uns dabei wirklich
etwas zu denken. Tagt&#228;glich werden wir mit Millionen von ihnen konfrontiert.
Die Rede ist von der &quot;Farbe&quot; in allen Dimensionen. Mit diesem Artikel m&#246;chte
ich einige Grundlagen zu diesem Thema, die ich aus verschiedenen Quellen
zusammengetragen habe, vermitteln. In der n&#228;chsten Ausgabe der NC wird es
eine Fortsetzung geben, die als Schwerpunkt das Thema &quot;Farbe am Computer&quot;
haben wird.<p> 

<h2><CENTER><FONT COLOUR="GREEN">Farbmischsysteme</FONT></h2></CENTER><p>

Zuerst einmal muss man wissen, da&#223; es in der menschlichen Netzhaut drei
verschiedene Z&#228;pfchentypen gibt, deren Empfindlichkeit den drei Grundfarben,
Rot, Gr&#252;n und Blau zugeordnet werden k&#246;nnen. Genau aus dieser Grundlage
heraus, ist es m&#246;glich, sog. &quot;Farbmischgesetze&quot; abzuleiten und auf diese Art
und Weise alle Farben zu erkl&#228;ren. Es gibt unterschiedliche Ans&#228;tze daf&#252;r;
mitlerweile sind es ca. 15-20 St&#252;ck, die sich teilweise nur in Kleinigkeiten
unterscheiden. In diesem Artikel m&#246;chte ich nur auf die zwei f&#252;r den
Computer relevanten Verfahren eingehen.<p>

<h2><CENTER><FONT COLOUR="RED">Das additive Farbmischverfahren</FONT></h2></CENTER><p>

Das additive Farbmischsysten basiert auf der Grundlage, da&#223; durch die
Addition (deswegen auch &quot;additive&quot;) der drei Grundfarben Rot, Gr&#252;n und Blau
Wei&#223; erzeugt wird. Das additive Farbmischverfahren muss immer dann
angewendet werden, wenn Licht direkt -ohne Reflexion eines Gegenstandes- in
das menschliche Auge gelangt.<p><CENTER>
<img src="farbe1.png"></CENTER><p>


Durch Mischen von Rot und Gr&#252;n entsteht Gelb, aus Gr&#252;nd und Blau entsteht
Cyan und aus Rot und Blau wird Magenta. Alle drei Grundfarebn
zusammentreffend ergebn Wei&#223;<p>


<h2><CENTER><FONT COLOUR="WHITE">Das subtraktive Farbmischsystem</FONT></h2></CENTER><P>

Klar, wenn es ein additives Verfahren gibt, wird es auch ein subtraktives geben.
Beim subtraktiven Farbmischverfahren geht man von den drei Grundfarben Cyan,
Magenta und Gelb aus. Hierbei werden die Farben durch Subtraktion oder
Filtern gemischt, also der genaue Gegesatz zu dem oben beschriebenen
additiven Verfahren. Dieses Verfahren wird dann angewendet, wenn die
Reflexion von Licht ins Auge gelangt (z.B. bei auf Papier aufgetragenen
Farben).<p><CENTER>
<img src="farbe2.png"></CENTER><p>
Durch Mischen von Cyan mit Magenta entsteht Blau, aus Magenta und Gelb
entsteht Rot und aus Gelb und Cyan entsteht Gr&#252;n. Werden alle drei
Grundfarben subtrahiert, entsteht Schwarz. <p>


<h2><CENTER><FONT COLOUR="GRAY">Farbbeschreibungsmodelle:</FONT></h2></CENTER><P>
Nach dieser trockenen Einf&#252;hrung wenden wir uns nun den sog.
&quot;Farbbeschreibungsmodellen&quot; zu, die sich direkt aus den oben gennanten
Verfahren ableiten lassen.<p>

Da das menschliche Auge mehrere hunderttausend Farbnuancen (ca. 350000)
unterscheiden kann, ist die Einf&#252;hrung von mathematischen Farbmodellen
erforderlich. Diese erm&#246;glichen es, Farbnuancen durch Zahlenwerte exact zu
beschreiben.<p>

Daf&#252;r existieren in der Praxis bisher mehrere Modelle, von denen zwei auch
vom Amiga her bekannt sind: Das RGB Farbmodell (additives Farbmischsystem)
und das CMY Farbmodell (subtraktives Farbmischsystem) kennt man bestens aus diversen Malprogrammen (z.B.
Art Effect, ImageFx etc.) oder auch vom Farb Voreinsteller der WB.<p>

<h3><u><CENTER><FONT COLOUR="BLUE">Das RGB Modell</FONT></h3></U></CENTER><P>

Beim RGB Modell werden alle Farben aus den drei Grundfarben Rot, Blau und
Gr&#252;n erzeugt. Das RGB beruht auf dem oben besprochenen additiven
Farbmischsystem und setzt diese Addition direkt in ein Zahlenmodell um.

Anschaulich im Einheitsw&#252;rfel sieht das dann so aus:<p>
<CENTER><IMG SRC="wrgb.png"></CENTER><p><BR>


Bei den 8 Ecken handelt es sich um die Grundfarben Rot, Blau, Gr&#252;n, Cyan,
Magenta, Gelb, Schwarz und Wei&#223;. Durch die Koordinaten in diesem W&#252;rfel wird
jede einzelne Farbe beschrieben, wobei sich die Koordinaten aus den drei
Grundfarben Rot, Gr&#252;n und Blau zusammensetzen. Wieviele Farbnuancen allerdings dargestellt werden
k&#246;nnen, h&#228;ngt von den unterschiedlichen Abstufungen der drei Grundfarben
Rot, Gr&#252;n und Blau ab.<P><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>Das RGB Modell</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anzahl der Abstufungen</TD>
<TD>Anzahl der Grundfarben (Rot, Grün, Blau)</TD>
<TD>Anzahl der Farbnuancen</TD>
</TR>
<TR>
<TD>1</TD>
<TD>2 / 2 / 2</TD>
<TD>8</TD>
</TR>
<TR>
<TD>2</TD>
<TD>4 / 4 / 4</TD>
<TD>64</TD>
</TR>
<TR>
<TD>3</TD>
<TD>8 / 8 / 8</TD>
<TD>512</TD>
</TR>
<TR>
<TD>4</TD>
<TD>16 / 16 / 16</TD>
<TD>4096</TD>
</TR>
<tr>
<TD>5</TD>
<TD>32 / 32 / 32</TD>
<tD>32768</TD>
</TR>
<tr>
<TD>6</TD>
<TD>64 / 64 / 64</TD>
<TD>262144</TD>
</TR>
<tr>
<TD>7</TD>
<TD>128 / 128 / 128</TD>
<TD>2097152</TD>
</TR>
<tr>
<TD>8</TD>
<TD>256 / 256 / 256</TD>
<TD>16777216</TD>
</TR>
</TABLE><br><p>
</CENTER>
Um einen kontinuierlichen &#220;bergang zwischen zwei verschiedenen Farben zu
erreichen, muss man lediglich die beiden Farben (oder besser: deren Punkte)
im Einheitsw&#252;rfel mit einer Geraden verbinden, wie man es auch aus der
Mathematik kennt. Auf dieser Geraden sind dann alle &#220;berg&#228;nge von der einen
zur anderen Farbe enthalten.<p>

Das RGB Farbmodell ist eines der favorisrtesten bei Computeranwendungen
&#252;berhaupt: Zum einen kann mit dem RGB Modell &#228;u&#223;erst einfach gerechnet
werden (was bei den Preisen f&#252;r heutige PPC Karten aber auch nicht mehr so
wichtig ist wie z.B. zu Zeiten des C 64) und zum anderen muss keine Umrechnung
zur Darstellung auf dem Monitor vorgenommen werden.<p>

Wie bei jedem Modell hat aber auch das RGB Modell zwei (zu
vernachl&#228;ssigende) Schwachpunkte: Der Nachteil im direkten Einsatz durch den
Menschen ist, da&#223; nur sehr schlecht von einem Wertetripel auf einen
Farbsinneseindruck geschlossen werden kann. Die zweite Schw&#228;che besteht
darin, da&#223; der geometrische Abstand zweier Farbpunkte im Einheitsw&#252;rfel
nicht zwingend mit der Differenz des Farbeindruckes &#252;bereinstimmt.<p>


<h3><U><CENTER><FONT COLOUR="RED">Das CMY Modell</FONT></h3></U></CENTER><P>

Im Gegensatz zum RGB Modell geht das CMY Farbmodell von den drei Grundfarben
Cyan, Magenta und Gelb aus, aus denen dann alle anderen Farben abgeleitet
werden k&#246;nnen. Das CMY Modell setzt dabei das subtraktive Farbmischsystem
direkt in ein Zahlenmodell um. Die Darstellung des CMY Modells erfolgt,
ebenso wie die des RGB Modells, im Einheitsw&#252;rfel, woraus sich auch die
&#196;hnlichkeit der beiden W&#252;rfel ergibt:<p>
<CENTER><img src="wcmy.png"></CENTER><br><p>

Im CMY Modell stellen die 8 Ecken die Grundfarben Rot, Gr&#252;n, Blau, Cyan,
Magenta, Gelb, Schwarz und Wei&#223; dar. Nat&#252;rlich lassen sich auch in diesem
W&#252;rfel wieder alle Farben durch ihre jeweiligen Koordinaten im W&#252;rfel
ableiten, die sich aus den Grundfarben Cyan, Magenta und Gelb zusammensetzt.
Auch hier kann wieder eine Tabelle, die Aufschluss &#252;ber die Anzahl der
jeweiligen Farbnuancen, Abstufungen und Mengenverh&#228;ltnis der Grundfarben
gibt, aufgestellt werden:<p><CENTER>


<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>Das CMY Modell</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anzahl der Abstufungen</TD>
<TD>Anzahl der Grundfarben (Cyan, Magenta, Gelb)</TD>
<TD>Anzahl der Farbnuancen</TD>
</TR>
<TR>
<TD>1</TD>
<TD>2 / 2 / 2</TD>
<TD>8</TD>
</TR>
<TR>
<TD>2</TD>
<TD>4 / 4 / 4</TD>
<TD>64</TD>
</TR>
<TR>
<TD>3</TD>
<TD>8 / 8 / 8</TD>
<TD>512</TD>
</TR>
<TR>
<TD>4</TD>
<TD>16 / 16 / 16</TD>
<TD>4096</TD>
</TR>
<tr>
<TD>5</TD>
<TD>32 / 32 / 32</TD>
<tD>32768</TD>
</TR>
<tr>
<TD>6</TD>
<TD>64 / 64 / 64</TD>
<TD>262144</TD>
</TR>
<tr>
<TD>7</TD>
<TD>128 / 128 / 128</TD>
<TD>2097152</TD>
</TR>
<tr>
<TD>8</TD>
<TD>256 / 256 / 256</TD>
<TD>16777216</TD>
</TR>
</TABLE><br><p>
</CENTER>

Durch Verbindung zweier Punkte mittels einer Geraden kann man auch in diesem
Modell den &#220;bergang von einer zur anderen Farbe genau bestimmen. <p>

Eingesetzt wird das CMY Modell immer dann, wenn eine farbige Vorlage auf
einem Drucker oder einer klassischen Vierfarbmaschine ausgegeben werden
soll. Die Umwandlung des RGB Modells in das CMY Modell kann wie folgt
beschrieben werden:
<PRE>

C     W     R <br>
M  =  W  -  G <br>
Y     W     B <br>
</PRE>
Das &quot;W&quot; steht dabei f&#252;r 100% Wei&#223;.<p>
<hr>
So, da&#223; war es f&#252;r den ersten von zwei Teilen &#252;ber den Themenkomplex
&quot;Farbe&quot;. Diese, mehr oder minder trockene, Einleitung ebnet den Weg f&#252;r den
n&#228;chsten Teil, der sich mit dem Themenkomplex &quot;Farbe am Computer&quot;
besch&#228;ftigen wird. Ich hoffe mal, da&#223; Euch das ganze ein bi&#223;chen gefallen
hat und Ihr wenigstens etwas Spa&#223; beim Lesen gehabt habt. Bis n&#228;chste
Mal,<p>








<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
