<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Kurzgeschichten</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#800000" size="7">
<b>Kurzgeschichten</font></b></p>

<ul>Inhalt:
<li> <a href="#a1"> Zusammenhalt </a></li>
<li> <a href="#a2"> Kultur </a></li>
<li> <a href="#a3"> Ein dicker Fisch </a></li>
<li> <a href="#a4"> Kleinigkeiten </a></li>
</ul>

<hr>

<p>
<a name="a1"><font color="800000" size="4">
<b>Zusammenhalt </font></b></a></center></p>

<p>Die Eltern waren es leid, dass sich ihre sieben Kinder dauernd stritten. Eines
Tages rief der Vater die Kinder ins Wohnzimmer. Auf den Tisch legte er sieben
gleichdicke St&ouml;cke, die mit einer Schnur zu einem B&uuml;ndel zusammengebunden
waren, </p>

<p>&quot;Ich bin bereit, demjenigen von euch hundert Mark zu geben, der es schafft,
diese St&ouml;cke zu zerbrechen&quot;, forderte er seine Kinder auf. Jedes seiner
Kinder bem&uuml;hte sich, doch schlie&szlig;lich mussten sie einsehen, dass es ihnen trotz
aller Anstrengung nicht m&ouml;glich war, das B&uuml;ndel zu zerbrechen.</p>

<p>&quot;Nun, ihr habt euch bem&uuml;ht und erkannt, dass ihr diese St&ouml;cke nicht
zerbrechen k&ouml;nnt&quot;, sagte der Vater. &quot;Und doch ist nichts leichter als das.&quot; Er
&ouml;ffnete die Schnur, nahm einen Stock in die H&auml;nde und zerbrach ihn. Und auch die
anderen St&ouml;cke zerbrach er, einen nach dem anderen, ohne die geringste
Anstrengung. </p>

<p>Die Kinder protestierten und meinten, das sei ein ganz lausiger Trick. Doch
sie wurden still und nachdenklich, als der Vater ihnen sagte: &quot;So wie es den
St&ouml;cken erging, wird es euch ergehen. Denn ihr seid wie diese St&ouml;cke, Solange
ihr zusammenhaltet, seid ihr stark, wie dieses B&uuml;ndel, und niemand kann euch in
Gefahr bringen. Doch wenn ihr streitet und untereinander uneins seid, wenn ihr
auseinander geht und nichts mehr voneinander wissen wollt, dann kann es jedem von
euch ergehen wie diesen St&ouml;cken, die jetzt zerbrochen vor euch auf dem Tisch
liegen.&quot; </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr size="1" width=60%>

<p><a name="a2"><font color="800000" size="4">
<b>Kultur </font></b></a></center></p>

<p>Zwei chinesische Lastentr&auml;ger waren an einer Stra&szlig;enecke zusammengesto&szlig;en. Ein
heftiger Streit war entfacht. Passanten blieben stehen und sahen sich das
Schauspiel der zwei Streith&auml;hne an. Argumente und Beschuldigungen flogen hin und
her. </p>

<p>Unter den Neugierigen war auch ein Tourist, der sich die folkloristische
Darbietung nicht entgehen lassen wollte. Weil die Schuldzuweisungen immer
heftiger wurden, wandte er sich an seinen einheimischen F&uuml;hrer und fragte, ob
die beiden Kontrahenten nicht gleich mit F&auml;usten aufeinander losgehen werden.
</p>

<p>&quot;Das glaube ich nicht&quot;, antwortete der Chinese, &quot;denn derjenige, der den
ersten Schlag tut, w&uuml;rde zugleich auch sein Gesicht verlieren. Denn er gibt
durch seinen Angriff zu, dass er der D&uuml;mmere ist, weil ihm die Argumente
ausgegangen sind.&quot; </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr size="1" width=60%>

<p><a name="a3"><font color="800000" size="4">
<b>Ein dicker Fisch </font></b></a></center></p>

<p>Ein Gesch&auml;ftsmann litt seit einiger Zeit an verschiedenen Beschwerden. Doch
konnte keine Medizin seine Unp&auml;sslichkeit lindern. Sein Hausarzt &uuml;berwies
ihn zu einem Facharzt f&uuml;r psychosomatische Erkrankungen. Nach einer gr&uuml;ndlichen
Untersuchung erz&auml;hlte der Arzt folgende Geschichte: </p>

<p>Eine M&ouml;we hatte einen pr&auml;chtigen Fisch gefangen, und sofort st&uuml;rzte sich mit
lautem Geschrei der ganze M&ouml;wenschwarm auf sie. Die M&ouml;wen hackten auf sie ein,
verletzten sie an verschiedenen Stellen und versuchten mit aller Gewalt, ihr den
dicken Fisch wegzuschnappen. Sie lie&szlig;en nicht von ihr ab, ganz gleich wohin sie
sich wendete. Und noch immer kamen andere M&ouml;wen hinzu, bis schlie&szlig;lich eine
&Uuml;bermacht der Widersacher zu gro&szlig; wurde. Da lie&szlig; die M&ouml;we den Fisch fallen. </p>

<p>Sofort fing ihn eine andere M&ouml;we auf, und alle Peiniger lie&szlig;en von der ersten
M&ouml;we ab und st&uuml;rzten sich auf die M&ouml;we mit dem Fisch. Die erste M&ouml;we, nun wieder
unbehelligt, ruhte sich auf dem Ast eines Baumes friedlich aus. </p>

<p>Ein Fischer, der das Geschehen beobachtet hatte, dachte bei sich: &quot;Man muss
loslassen k&ouml;nnen, wenn man in Ruhe und Frieden leben will.&quot; </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr size="1" width=60%>

<p><a name="a4"><font color="800000" size="4">
<b>Kleinigkeiten </font></b></a></center></p>

<p>Jede Woche, wenn der Stra&szlig;enkehrer auch vor ihrem Haus fegte, kam die Frau
heraus, gab ihm ein Glas Limonade und ein St&uuml;ckchen Geb&auml;ck. Er war ein netter
alter Mann. dankte freundlich und nahm seine Arbeit wieder auf.</p>

<p>Eines Abends ert&ouml;nte die Klingel und der Stra&szlig;enfeger stand vor der Haust&uuml;re.
In der Hand hielt er ein Str&auml;u&szlig;chen Blumen und eine kleine Schachtel Pralinen.
Er schien etwas nerv&ouml;s, als er der Frau sagte: &quot;Das ist f&uuml;r Sie, liebe Frau,
als Dank f&uuml;r Ihre Freundlichkeit.&quot; </p>

<p>&quot;Aber das sollten Sie wirklich nicht tun&quot;, sagte die Frau etwas verlegen.
&quot;Ein Glas Limonade, das ist doch nichts.&quot; &quot;Mag sein, dass es nicht viel ist,&quot;
sagte der Stra&szlig;enfeger, &quot;aber es ist mehr, als jeder andere getan hat.&quot; </p>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
</body>
</html>
