<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Redensarten</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#800000" size="7">
<b>??? Woher kommt der Ausdruck...</font></b></p>


<h3>&quot;Da trifft man Hinz und Kunz ...&quot;</h3>
<p><img src="st_redensa1.gif" border=0 width=104 height=104 align=left alt="Hinz &amp; Kunz">
Das hei&szlig;t, dass man mit allerlei namenlosen Gesindel zusammentreffen wird,
mit Leuten ohne Namen und Geltung. Die Hinz&acute; und die Kunz&acute; sind eben
Leute, deren Namen tausendfach wiederkehren, die die Masse repr&auml;sentieren,
ohne Besonderheit. Ist es heute Zufall, ein Hinz oder ein Kunz zu sein, so
dr&uuml;ckte sich fr&uuml;her die Zugeh&ouml;rigkeit zu einem Beruf oder einer
Charaktereigenschaft mit dem eigenen Namen aus. Hinz soll aus Heinrich, Kunz aus
Konrad hervorgegangen sein. Das waren nun freilich Namen k&ouml;niglichen
Ursprungs, und sie absch&auml;tzig zu gebrauchen, konnte als irrige Abwertung
erst im Laufe der Jahre geschehen. </p>

<hr width=60%>

<h3>&quot;Einem den Rang ablaufen ...&quot;</h3>
<p><img src="st_redensa2.gif" border=0 width=104 height=104 align=left alt="Rang ablaufen">
Diesen Ausdruck gebraucht man dann, wenn man jemanden zuvorkommt, ihn
&uuml;berholt, schneller ist und ihn auf diesem oder jenem, meist geistigen
Gebiet &uuml;berfl&uuml;gelt. Urspr&uuml;nglich ist die Bezeichnung f&uuml;r den
sportlichen Wettbewerb gemeint gewesen. Der Rang war aber eigentlich der
&quot;Rank&quot;, das hei&szlig;t jene Wegebiegung, die der &Uuml;berholende
abschnitt, sich dadurch einen Weg verk&uuml;rzte und auf diese Weise zum Vorteil
kam. Wir sehen also, dass es v&ouml;llig irrig ist, im milit&auml;rischen den
Ursprung des Wortes &quot;Rang&quot; zu suchen, denn der Milit&auml;rrang hat
mit diesem Begriff gar nichts zu tun. </p>

<hr width=60%>

<h3>&quot;Ich wasche meine H&auml;nde in Unschuld ...&quot;</h3>
<p><img src="st_redensa3.gif" border=0 width=104 height=104 align=left alt="H&auml;nde waschen">
Diesen Spruch benutzt man heutzutage, wenn man mit irgendeiner unangenehmen
Sache nichts zu tun haben will und sich selbst unbeteiligt heraushalten
m&ouml;chte. Der Ursprung dieses Ausdrucks liegt in der reinigenden Kraft des
Wassers begr&uuml;ndet und ist den Menschen von alters her bekannt. So badete
man sich z.B. seiner S&uuml;nden frei oder sp&uuml;lte mit dem Wasser alle
Schuld von sich ab. Vor Gricht wusch sich der arme S&uuml;nder seine H&auml;nde,
aber auch der Richter Pilatus reinigte sich, bevor er Christus verurteilte, vor
allem Volke seine H&auml;nde, womit er kundtun wollte: Sehet her, ich bin
unschuldig am Tode dieses Mannes. </p>

<hr width=60%>

<h3>&quot;Einem den Laufpass geben ...&quot;</h3>
<p><img src="st_redensa4.gif" border=0 width=104 height=104 align=left alt="Laufpass geben">
Nur in F&auml;llen groben Versagens oder ernster Verst&ouml;&szlig;e wird man
heute einem in Arbeit und Brot Stehenden &quot;Den Laufpass geben&quot;, was
bedeuten soll, dass ihm gek&uuml;ndigt wird, dass man ihn aus seiner Stellung
entl&auml;sst. Es gab in fr&uuml;heren Zeiten tats&auml;chlich einen
regelrechten &quot;Laufpass&quot;. Wenn Soldaten im sp&auml;ten Mittelalter bis
ins 18. Jahrhundert aus ihren Kriegsdiensten entlassen wurden -nur zu oft in
einem nicht eben sehr leistungsf&auml;higen Zustand - so wollte man ihnen den
&Uuml;bergang ins private Leben dadurch erleichtern, dass man ihnen beim
Ausscheiden einen sogenannten Laufpass ausstellte, der Aufschluss &uuml;ber
Charakter, F&auml;higkeiten und Leistungen des Betreffenden gab. So ausgewiesen,
lie&szlig; sich leichter eine passende Arbeit finden. </p>

<hr width=60%>

<h3>&quot;Der zittert ja wie Espenlaub ...&quot;</h3>
<p><img src="st_redensa5.gif" border=0 width=104 height=104 align=left alt="Espenlaub">
Irgend ein Schreck oder unerwartetes Erlebnis, der Anblick eines Unfalls oder
eine gro&szlig;e Gefahr, die auf einen zukommt, kann selbst einen Mann so
durcheinander bringen, dass er wie &quot;Espenlaub&quot; zu zittern beginnt. Die
Espe hat, wie so mancher Naturfreund wei&szlig;, die Eigent&uuml;mlichkeit, ihre
auf der R&uuml;ckseite silbrig gl&auml;nzenden Bl&auml;tter beim geringsten
Lufthauch erzittern zu lassen. Wie ein Rascheln und ein beben geht es durch die
Zweige, weshalb man sie auch Zitterpappel nennt. Wenn auch der &uuml;beraus
feine und lange Stil der Espenbl&auml;tter die Ursache dieser
&quot;Erregbarkeit&quot; ist, so will in Schweden und Schottland der Volksmund
es so erkl&auml;ren, dass Jesus&acute; Kreuz aus dem Holz des Espe geschnitten
wurde und der Baum seither keine Ruhe mehr f&auml;nde. </p>

<hr width=60%>

<h3>&quot;Einen an den Pranger stellen ...&quot;</h3>
<p><img src="st_redensa6.gif" border=0 width=104 height=104 align=left alt="Pranger stellen">
Es gibt nicht wenige, die sich eine besondere Schadenfreude daraus machen,
jemanden &quot;anzuprangern&quot;, d.h. ihn &ouml;ffentlich ver&auml;chtlich zu
machen, ihn mit Schimpf und Schande zu belegen. Die Volksjustiz griff im
Mittelalter zu dem Mittel, einen Menschen, der sich was zuschulden kommen
lassen, auf &ouml;ffentlichem Marktplatz an einen h&ouml;lzernen oder
steinerenen Pfahl zu binden, zus&auml;tzlich mit einem breiten Halseisen
gesichert. Die Gaffer konnten sich am Anblick des Gefesselten weiden. Hexen
verbrannte man, in solcher Weise gebunden, auf dem Scheiterhaufen. Diebe,
M&ouml;rder, Landesverr&auml;ter wurden so der allgemeinen Verachtung
preisgegeben. &quot;Prangern&quot; bedeutete im Mittelalter
&quot;Dr&uuml;cken&quot;, mit prangen oder pranken hat das Wort Pranger nichts
gemeinsam. </p>

<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
</body>
</html>
