<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> NATO Denkmal </a></li>
<li> <a href="#a2"> Evolution </a></li>
<li> <a href="#a3"> in eigener Sache </a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table>

<p><a name="a1"><font color="800000" size="7"><center> <b>NATO Denkmal </font></b>
</a></center><br>
Bisher war es mir nicht gelungen, offizielles Material &uuml;ber das NATO
Denkmal einzuholen. Noch bin ich guter Hoffnung, dass ich direkt vom
NATO-Headquaters etwas bekomme, viel Hoffnung habe ich aber nicht. Wie ich
herausfinden konnte, soll erst im n&auml;chsten Jahr so eine Art Dokumentation
&uuml;ber dieses Denkmal erarbeitet und ver&ouml;ffentlicht werden. Bisher gibt
es soetwas noch nicht. Auch eine Recherche via Altavista eines Journalisten war
leider ohne Erfolg. </p>

<p>Irgendwie finde ich es sehr verwunderlich, dass sich bisher noch niemand
bewogen f&uuml;hlte, einen Artikel &uuml;ber dieses &quot;Monstrum&quot; zu
verfassen. Mindestens das Klientel der negativ Eingestellten der schreibenden
Zunft h&auml;tten hier ein wunderbares Gebiet gehabt, sich richtig auszutoben und
Interpretationen loszuwerden, die schwerlich zu widerlegen sind. Nein, aber auch
gar nichts wurde bisher ver&ouml;ffentlicht und im Internet festgehalten.
Vielleicht habe ich doch ein ganz kleines bisschen Gl&uuml;ck und bekomme irgend
welches Material, damit ich doch noch einen objektiven Bericht dar&uuml;ber
verfassen kann. Wenn nun in Small Talk kein weiterer Artikel &uuml;ber dieses
Denkmal von mir enthalten ist, dann hat es nicht geklappt, mindestens nicht 
fristgerecht f&uuml;r diese NoCover. </p>
<hr>
<p><a name="a2"><font color="800000" size="7"><center> <b>Evolution </font></b>
</a></center><br> Beim Lesen des Streitgespr&auml;chs &uuml;ber die Evolution
hatte ich sofort den inneren Drang, auch ein paar S&auml;tze zu dieser nicht
ganz sachbezogen gef&uuml;hrte Argumentation hinzuf&uuml;gen zu m&uuml;ssen.
Selbstverst&auml;ndlich ist es jedem selbst &uuml;berlassen, seine eigenen
Ansichten argumentativ vorzubringen und diese in der &auml;u&szlig;eren Form von
Thesen zu manifestieren. Ich bin kein Theologe und auch kein Wissenschaftler,
aber eine eigene Meinungen sollte man schon selbst bilden und nicht von anderen
deren Dogmen ohne jegliche Pr&uuml;fung und Abw&auml;gung einfach
&uuml;bernehmen und diese dann als eigene Meinung deklarieren. Keine Angst, ich
gehe nicht her und doziere jetzt Lexikatexte &uuml;ber den sogenannten Urknall
verbunden mit der damit einhergehenden kosmologischen Evolution bis hin zu den
Bedingungen, die vielleicht zuf&auml;llig durch eine chemische Reaktion
entstandene Uram&ouml;be erm&ouml;glichten, die dann durch chemische Evolutionen
und dann &uuml;ber eine biologische Evolution hochmolekulare f&uuml;r Lebewesen
charakteristischen Verbindungen bilden konnte. Auch werde ich keine Darstellung
der abrupten Entstehungsgeschichte der theologischen Seite bringen. Am liebsten
w&uuml;rde ich alles entsch&auml;rfen und hier die Genesis von Jean Effel mit
seinen s&uuml;&szlig;en Bildchen und seinen einzigartigen Versen aufzeigen, wenn
es keine © Probleme geben w&uuml;rde. </p>

<p>Zahllos sind die Religionen der Menschheit. Man wird die Namen der
G&ouml;tter und G&ouml;ttinnen, zu denen der Mensch jemals gebetet hat oder noch
betet, niemals vollst&auml;ndig aufz&auml;hlen k&ouml;nnen. Wissenschaften wie
die Anthropologie, die Arch&auml;ologie und die Pal&auml;anthropologie (das ist
die biologische Anthropologie des fossilen Menschen und seiner Vorg&auml;nger)
bringen st&auml;ndig neue Funde an den Tag, aus denen wir das Leben unserer
vorgeschichtlichen Ahnen kennenlernen. Was die Funde im einzelnen zeigen, mag
unterschiedlich sein, in einem jedenfalls stimmen sie &uuml;berein: Der Mensch
ist ein religi&ouml;ses Wesen. Wie und wo immer der Mensch zum Menschen wurde,
hat er &uuml;berirdisches angebetet, und meist war er auch von der
Unsterblichkeit seiner Seele &uuml;berzeugt. Irgendwo habe ich einmal einen sehr
schlauen Satz gelesen: &quot;Der Mensch ist ein Gesch&ouml;pf, das Dinge, die es
nicht sehen kann, begreift, und Dinge, die es nicht begreifen kann,
glaubt.&quot; Das will ich aber an dieser Stelle nicht weiter vertiefen. Um
diesen Satz abzurunden, gegenw&auml;rtig gibt es sechs gro&szlig;e Religionen,
Hinduismus, Buddhismus, Chinesischer Universismus, Islam, Judentum und
Christentum. Zwischen ihnen gibt es viele Ber&uuml;hrungspunkte, aber auch viele
- manchmal un&uuml;berbr&uuml;ckbare - Unterschiede. Doch alle diese Religionen
haben Antworten auf die gro&szlig;en Fragen gefunden, die jedes Menschen Geist
bewegen, wenn er sich mit dem Mysterium des Lebens und der Entstehung des Lebens
auseinandersetzt. Aber welche Antwort ist richtig? Nach meinem Daf&uuml;rhalten
besitzt diesbez&uuml;glich das Christentum die gr&ouml;&szlig;te
&uuml;berzeugungskraft. Aber auch die anderen Religionen k&ouml;nnen
&uuml;berzeugen, sonst w&auml;ren sie keine lebendige Religionen mehr. </p>

<p>Doch eines m&ouml;chte ich noch loswerden. Bei der Diskussion sollten immer
gewisse Spielregeln gelten und das ist die &auml;u&szlig;ere Form. Am besten ist
es eine zweigeteilte Fragestellung zu errichten <ul> <li> Was ist Evolution?
</li> <li> Urspr&uuml;nge der Evolution. </li></ul> Wobei bei letzterem
dringlich darauf zu achten ist, dass der Unterschied zwischen Anfang und
Ursprung rigoros eingehalten wird. Anfang ist historisch und Ursprung ist die
Quelle. Wenn dieses bei der Diskussion ber&uuml;cksichtigt wird, kann bestimmt
etwas sehr Gutes dabei herauskommen. </p>

<p>Einen Aspekt sollte bei dieser Diskussion aber <b>nicht</b> ber&uuml;cksichtigt
werden, das ist die Philosophie. Denn dann wird es gef&auml;hrlich und die
Uferlosigkeit ist erreicht. F&uuml;r einen wissenschaftsgl&auml;ubigen Menschen
ist das Schlimmste, dass die Philosophie gar keine allgemeing&uuml;ltigen
Ergebnisse hat, etwas, das man wissen und damit besitzen kann. W&auml;hrend die
Wissenschaften auf ihren Gebieten zwingend gewisse und allgemein anerkannte
Erkenntnisse gewonnen haben, hat die Philosophie dies trotz der Bem&uuml;hungen
der Jahrtausende nicht erreicht. Das Schlimmste: In philosophischen Dingen
h&auml;lt sich fast jeder f&uuml;r urteilsf&auml;hig. W&auml;hrend man
anerkennt, dass in den Wissenschaften Lernen, Schulung und Methode Bedingung des
Verst&auml;ndnisses ist, erhebt man in bezug auf die Philosophie den Anspruch,
ohne weiteres dabei zu sein und mitreden zu k&ouml;nnen. Das eigene Schicksal
und die eigene Erfahrung gelten als gen&uuml;gende Voraussetzung. </p>

<p>Nun beende ich aber schleunigst meinen Beitrag, sonst ergeht es mir wie dem
Knaben, der die Sch&ouml;pfungsgeschichte h&ouml;rte und automatisch die
logischte aller logischen Fragen stellte: &quot;Was war denn vor dem
Anfang?&quot; Dieser Knabe erfuhr die Endlosigkeit des Weiterfragens, das
Nichthaltmachenk&ouml;nnen des Verstandes, dass f&uuml;r ihn keine
abschlie&szlig;ende Antwort m&ouml;glich ist. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a3"><font color="800000" size="7"><center>
<b> in eigener Sache </font></b></a></center><br>
<font size=+1>Velbert</font><br>
</p>

<p>Wie auch zum ersten Clubtreffen im vergangenen Jahr werde ich auch dieses
Jahr wieder mit dabei sein. Dieses Mal werde ich einzelne Teile mitbringen, die
mir abgekauft werden k&ouml;nnen. Preise werden vor Ort ausgehandelt, verdienen
will ich nichts, aber die Dinge auch nicht unbedingt verschenken. <ul>
<li> A1200 Magic (fast neu), 170 MB, SIMM PS/2 16 MB 60ns, Blizzard 1230 IV,
     int. HD-Laufwerk.</li>
<li> Monitor: Commodore 1960. </li>
<li> Liana (Soft- und Hardware,
um zwei Amigas &uuml;ber die innere Parallel-Schnittstelle zu verbinden), </li>
<li> UltraConv3 und </li>
<li> Opus 5 Magellan </li></ul>
Die Seriennummern der beiden genannten CD&acute;s sind schon upgedated, k&ouml;nnen 
also nicht mehr als Grundlage f&uuml;r eine Update-Bestellung herangezogen werden. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a4"><font color="800000" size="7"><center>
<b>Feedback </font></b></a></center><br> Folgende Artikel habe ich dieses Mal in
meinem Feedback in alphabetischer Reihenfolge der Titel ber&#252;cksichtigt. Ein
Autor erscheint bei mir nur einmal, auch wenn mehrere Beitr&#228;ge lobenswert
sind: </p>
<ul>
<li> <b>ABackup Test</b> von Kilian Servais</li>
<li> <b>Astro Corner</b> von Lars Philipsen</li>
<li> <b>Bl&ouml;de Spr&uuml;che</b> von Thomas Weber</li>
<li> <b>Fastfood</b> von Mark Tom</li>
<li> <b>Multiecke #10</b> von Gerd Wolpert</li>
</ul>
<p>Auf meinem Schmierzettel standen auch diesesmal wieder eine ganze Reihe mehr
Titel, leider musste ich mich wieder letztendlich entscheiden, da ich auch
weiterhin an der Zahl 5 festhalten m&ouml;chte.</p>
<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
</body>
</html>
