

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Tips & Tricks zu Blitzbombers</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENtER>Tips &amp; Tricks zu Blitzbombers</h1></CENTER></P>
<FONT COLOUR="GREEN">
Selten habe ich auf dem Amiga ein Spiel gefunden, da&#223;, trotz schlichter
Grafik, derma&#223;en begeistern konnte; zumindest im Mehrspielermodus. F&#252;r die
User, die ab und an auch mal gerne eine Partie mit ihren Freunden spielen,
habe ich einige Tips gesammelt:</P></FONT>
<FONT COLOUR="WHITE">
1. Wenn ihr einen roten Handschuh findet, k&#246;nnt ihr bekanntlich Bombem
kicken. Nicht so bekannt ist die Tatsache, da&#223; ihr auch &quot;&#252;ber den
Bildschirm&quot; kicken k&#246;nnt. Stellt Euch das so vor: Ihr steht ganz links oben an
der nicht sprengbaren Wand. Einer Eurer Gegner steht ganz rechts oben. Wenn
Ihr nun die Bombe an die Wand legt und in Richtung Wand kickt, kommt die
Bombe auf der anderen Seite beim Gegner an. Besonders am Anfang ist das
besonders fie&#223;.... </P></FONT>
<FONT COLOUR="yellow">
2. Im Spiel erscheint des h&#228;ufigeren das Extra &quot;Vertauschen&quot;. Dann werden
zwei Spieler jeweils an die Stelle gebeamt, wo gerade noch der Gegner stand.
Ihr solltet, bevor ihr das Extra holt, eine Bombe direkt vor das Extra legen
und kurz warten (nat&#252;rlich nicht zu lange). Sobald ihr euch dann beamt,
landet der Gegner direkt in der Explosion und hat normalerweise keine Chance
mehr zu reagieren.</P></FONT>
<FONT COLOUR="red">
3. Auch das Extra &quot;POW&quot; ist sehr n&#252;tzlich. Wartet ab, bis der Gegner eine
Bombe legt und schnappt dann sofort zu. No chance!</FONT></P>
<FONT COLOUR="purple">
4. Rennt der Gegner in eine &quot;Sackgasse&quot; ist das Extra &quot;Bombe legen&quot;
n&#252;tzlich: Habt ihr das ganze richtig abgesch&#228;tzt, legt der andere Spieler
eine Bombe und kommt nicht mehr aus der Sackgasse raus....</FONT></P>
<FONT COLOUR="white">
5. Spielt ihr mit 4 Spielern (oder mehr) und ihr findet in &quot;eurer Ecke&quot; ein
Schild, dann sollte unbedingt auf Tempo geachtet werden: Es sind noch drei
weitere Schilde zu holen! Diese liegen normalerweise immer in den
verschiedenen Ecken bzw. sehr nah daran gelegen. Wenn ihr ordentlich Speed
gebt, habt ihr am Ende mehr Schilde. &#196;u&#223;erst praktisch...</FONT></P>
<FONT COLOUR="00b6ff">
6. Tempo, guter Stichpunkt: Es gibt ein Extra &quot;Speed&quot; und &quot;Verlangsamen&quot;; in
beiden F&#228;llen hat man gute Karten. Man verfolgt einfach nur einen Gegner,
&#252;berholt diesen und legt dabei Bomben. Durch dieses Man&#246;ver ist der Gegner
von Bombem eingeschlossen und k&#246;st sich somit fr&#252;her oder sp&#228;ter in
Wohlgefallen auf.</FONT></P>
<FONT COLOUR="ff06ff">
7. Bei der Suche nach dem &quot;Goldenen Schild&quot; kann es mitunter sinnvoll sein,
einfach abzuwarten, was der (menschliche) Gegenspiler so macht. Dieser wird
nat&#252;rlich versuchen, m&#246;glichst schnell an das Schild zu kommen und bombt
sich zu Dir durch. Wenn Du nun einfach abwartest, bis das &quot;Goldene Schild&quot;
freigebombt ist und dann noch schneller reagierst, &#228;rgert sich der
Mitspieler ma&#223;los und ihr habt die Fr&#252;chte seiner Arbeit auf bequeme Art und
Weise einkassiert.  Besonders witzig ist auch das t&#246;ten in diesem Subgame:
Es kommt ab und an vor, da&#223; sich der Gegner nur auf die Suche beschr&#228;nkt und
seine Mitspieler gar nicht mehr wahrnimmt. In diesem Fall k&#246;nnt ihr h&#228;ufig
die Chance nutzen und den Gegner t&#246;ten. Auch wenn ihr danach das Schild
nicht mehr findet; euer Gegner wird es auch nicht finden!</FONT></P>

8. Besonders gemein ist das &quot;Blockier&quot; Extra (da wo alle Gegner Zeitung
lesen). Holt Euch dieses Extra und rennt dann sofort zu einem Gegenspieler.
Diesen legt ihr dann mit Bombem zu und sobald dieser &quot;aufwacht&quot;, steht er
auch schon in einer Explosion. Doch Vorsicht: Gehen die Bombem zu fr&#252;h los
(wenn der Gegner noch blokiert ist) nutzt das ganze nichts. Beim Zeitung
lesen ist er n&#228;mlich unverwundbar. Mit etwas &#220;bung klappt das ganze aber
nach kurzer Zeit schon perfekt...</P>
<FONT COLOUR="PURPLE">
9. Sparsam sollte man mit dem Extra &quot;Dauerfeuer&quot; umgehen. F&#252;r eine kurze
Zeit legen alle menschlichen Mitspieler soviele Bomben, wie sie gerade
besitzen. Vergewissert euch also vor dem aktivieren dieses Extras, da&#223; der
Gegner gen&#252;gend Bombem legen kann (zu erkennen in der Statusleiste). Bei
einer einzigen verf&#252;gbaren Bombe macht das ganze kaum Sinn, aber mit ab 5
Bombem d&#252;rfte der Konkurrent ganz sch&#246;n ins Schwitzen geraten.</FONT></P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
