
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amplifier Test</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOUR="GREEN">Test: AMPlifier</FONT></h1></CENTER><P>

In letzter Zeit h&#246;rt man vermehrt die Begriffe MP3 oder auch MPEG, obwohl es
das Multimediaformat MPEG schon relativ lange gibt. Nicht selten st&#246;&#223;t man
auch mal auf der einen oder anderen CD mal auf ein solches File, wei&#223; aber
nun nicht, wie man es abspielen kann. Mit AMPlifier ist nun eine L&#246;sung
vorhanden, die neben MPEG I, II und III auch noch diverse andere Formate
lesen kann. Mal schauen, ob die Software wirklich top ist...<p>

<h2><CENTER><FONT COLOUR="YELLOW">Was kann AMPlifier &#252;berhaupt?</FONT></h2></CENTER><P>
In erster Linie ist AMPlifier ein Abspieler f&#252;r MPEG Audio Dateien. Quasi
als &quot;Bonus&quot; kann AMPlifier aber auch noch diverse andere Audio Formate (u.a.
AIFF, Wave, Maud) abspielen. Das es sich bei AMPlifier nat&#252;rlich nicht nur
um ein simples Abspieltool handelt, d&#252;rfte anhand der (folgenden) zahlreichen Features
schnell klar werden:<p>
<ul>
<li>Schnittstelle zu ARexx<br>

<li>konsequentes Drag &amp; Drop<br>

<li>Unterst&#252;tzung von WinAMP Skins<br>

<li>Plugin System - somit k&#246;nnte eine externe Visualisierung benutzt werden <br>

<li>MP 3 Unterst&#252;tzung<br>

<li>CD Player Komfort (Shuffle, Programmierbar, endloses Abspielen
etc.)<br>

<li>AMPlifier ist ein Commodity<br>
</UL>
<h2><CENTER><FONT COLOUR="BLUE">Eine gute GUI ist schonmal die halbe Miete...</FONT></h2></CENTER><P>
Wer sich etwas in der Materie auskennt, der wird bei dem Feature
&quot;Unterst&#252;tzung von WinAMP Skins&quot; gro&#223;e Augen gemacht haben. F&#252;r die, die
damit nix anfangen k&#246;nnen: F&#252;r den von uns allen geliebten PC gibt es ein
&#228;hnliches Tool, da&#223; WinAMP hei&#223;t. F&#252;r dieses Tool gibt es hunderte von
verschiedenen Oberfl&#228;chen in allen m&#246;glichen Designs, die als &quot;Skins&quot;
(zu Deutsch: Haut) bezeichnet werden. Diese Skins k&#246;nnen nun auch in
AMPlifier eingebunden werden. Alternativ kann nat&#252;rlich auch die normale GUI
benutzt werden, die aber, im Gegensatz zu den Skins, &#228;u&#223;erst spartanisch
wirkt; bei den Skins kommt doch wesentlich mehr Begeisterung auf. Wer mit
den drei mitgelieferten Skins nicht zufrieden ist, findet auch im Aminet
noch eine beachtliche Auswahl, so da&#223; f&#252;r jeden Geschmack was dabei sein
d&#252;rfte. Um das ganze mal zu visualisieren, habe ich einfach mal einige
Screenshots diverser Skins gemacht; u.a. auch zum Vergleich mal die "normale" Oberfläche:<p><CENTER>
<img src="skin1.jpg"><p>
<img src="skin2.jpg"><p>
<img src="skin3.jpg"><p>
<img src="skin4.jpg"><p>
<br>
<p>
<p>
<hr>
<h2><FONT COLOUR="WHITE">MPEG? Was ist denn das?</FONT></h2></CENTER><p>
F&#252;r MPEG-Audio Daten hat man zwei verschiedene L&#246;sungen zur Auswahl: Zum
einen k&#246;nnen die wenigen User, die einen Hardware Decoder haben (z.B.
Melody), auf dessen F&#228;higkeiten zur Entschl&#252;sselung zur&#252;ckgreifen, zum
anderen k&#246;nnen die User, die zwar keinen Hardware Decoder, aber gen&#252;gend
Rechenpower unter der Haube haben, auf eine Software Entschl&#252;sselung
zur&#252;ckgreifen, die mittels mpega.library/AHI realisiert wurde. Nat&#252;rlich ist
die Software Entschl&#252;sselung stark von der verwendeten CPU abh&#228;ngig; bei
einer schwachen CPU muss man schonmal Abstriche in der Qualit&#228;t machen, denn
ansonsten kommt man nur in den "Genuss" eines stark &quot;ruckelnden&quot; Sounds. Aber
um dies optimal an sein eigenes System anzupassen, kann man sowohl die
Samplerate als auch die Qualit&#228;t im AMPlifier einstellen. Mit meinem 040/25
MhZ Prozessor war schon eine relativ gute Qualit&#228;t realisierbar; auch wenn
ein 060er wahrscheinlich der Idealfall sein m&#252;sste. Ob der PPC unterst&#252;tzt
wird, wei&#223; ich zwar nicht, m&#246;chte ich aber bezweifeln. Weder die
mpega.library noch AHI (die zusammen ja die Software Entschl&#252;sselung
&#252;bernehmen) sind bisher auf PPC umgesetzt worden. Zumindest bei AHI ist ja
ein PPC Port in Sicht, so da&#223; auf Dauer keine teure Zusatzhardware, wenn man
im Besitz eines PPC Boardes ist, mehr gebraucht wird.<p>


<h2><CENTER><FONT COLOUR="GRAY">In der Praxis:</FONT></h2></CENTER><p>
Dadurch das das Tool sehr kompakt aufgebaut ist, kann man es st&#228;ndig im
Hintergrund laufen lassen, ohne dabei einen alzugro&#223;en Speicherverbrauch
hinnehmen zu m&#252;ssen. Lediglich beim Abspielen von MP3 Dateien und
gleichzeitiger Benutzung von WordWorth wird das Tool zum totalen
&quot;Ausbremser&quot;, was aber mehr an der fehlenden Rechenpower seitens der 68K
Hardware liegt. Schraubt man dort allerdings nochmal kr&#228;ftig an der
Qualit&#228;tsscharube (z.B. statt &quot;Stereo&quot; &quot;Mono&quot; benutzen), kann man auch hier
das Multitasking nahezu perfekt ausnutzen; ohne dabei mit Gurus konfrontiert
zu werden, wie es bei dem entsprechenden PC Tool (WinAMP) der Fall sein soll
:-) Und wer nun glaubt, da&#223; die Konfiguration ein Problem sei, der irrt sich
auch: Nach dem Start von AMPlifier braucht man in der Praxis maximal 2 Minuten um alles
eingestellt zu haben; vorrausgesetzt man benutzt die GUI (wahlweise kann man
AMPlifier auch &#252;ber die CLI starten).


<h2><CENTER><FONT COLOUR="red">Hab ich noch was vergessen?</FONT></h2></CENTER><p>
Nat&#252;rlich gibt`s noch weitere Sachen, auf die man im Rahmen eines
Testberichtes eingehen k&#246;nnte; z.B. w&#228;re da noch die Tatsache, da&#223; AMPlifier
auch eine Abspielliste einrichten kann, in der dann Spielzeit und Titel
angegeben werden. Bei MPEG Dateien mit ID3 Informationen werden diese
statt des Titels angezeigt.<br>
Abgerundet wird das ganze von einer knappen, aber ausreichenden deutschen
Guide, die die wesentlichen Men&#252;punkte erkl&#228;rt und auch noch einige Tips
bereith&#228;lt. Da die gesamte Oberfl&#228;che ohnehin sehr intuitiv aufgebaut ist,
braucht man auch keine seitenlange Guide Datei, die jede Kleinigkeit
erkl&#228;rt.<br>
Erw&#228;hnt werden sollten auch noch die Anforderungen: Einzigste Vorraussetzung
ist OS 2.04. Man sollte aber tunlichst darauf achten, mindestens OS 3.0 zu
haben, da AMPlifier f&#252;r dieses Systen optimiert wurde. Ein leistungsf&#228;higer
Prozessor ist ebenfalls anzuraten (siehe oben), aber kein Muss. Wer auf den
Softwaremodus zur&#252;ckgreift, muss sich aus dem Aminet noch AHI sowie die
mpega.library (f&#252;r die es spezielle Versionen f&#252;r jede CPU gibt) besorgen, da
es ansonsten bei der zwar schönen, aber nutzlosen Oberfläche bleibt.<p>

<h2><CENTER><FONT COLOUR="purple">Muss ich nun Million&#228;r sein?</FONT></h2></CENTER><P>
Das w&#228;re nat&#252;rlich gut (dann k&#246;nnten Sie n&#228;mlich dem Autor dieses Artikels
eine kleine Spenden zukommen lassen) :-))<br>
Nein, aber im Ernst: AMPlifier ist Shareware und kostet, wenn man nicht
Besitzer der Melody Soundkarte ist, 30 M&#252;cken; im Gegensatz erh&#228;lt man ein
Keyfile, aber so weit ich es bisher &#252;berblicken konnte, ist in der normalen
Aminet Version nichts eingeschr&#228;nkt. Hir muss jeder selber wissen ob er f&#252;r
einen leistungsf&#228;higen MPEG Abspieler 30 DM ausgeben will oder
nicht. Für den "normalen" User ohne Internetzugang (wo man ja haufenweise MP3 findet) dürften die
30 DM allerdings relativ hoch angesetzt sein (soooo häufig findet man nun auch keine MPEG Samples). <p>

<h2><CENTER><B>Fazit:</B></h2></CENTER>
AMPlifier ist ein rundherum gelungener MPEG Audio Abspieler, der seinen
Dienst mit Bravour erf&#252;llt. Durch zus&#228;tzliche Features wie z.B. die
Einbindung von Skins wird das Tool noch weiter aufgewertet und ist somit f&#252;r
User mit einem gut ausgestatteten Rechner sehr zu empfehlen. Zu bekommen ist
AMPlifier nat&#252;rlich im Aminet oder auch bei mir (gegen Disk &amp; R&#252;ckporto).
Wer nicht immer einen CD Player neben seinem Rechner stehen haben will, der
kann sich AMPlifier ja mal anschauen!<p>




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>




