

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CDB-Eine Datenbank nur für Chemiker?</TITLE>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=green>
</HEAD>
<h1><CENTER><FONT COLOUR="green">Test: Chemical Database (CDB)</FONT></h1></CENTER><p>

Als ich vor kurzem mal die komplette Mitgliederliste des APC &amp; TCP
durchgegangen bin, stellte ich zu meinem Erstaunen fest, da&#223; es noch viele
junge Mitglieder gibt, die, ebenso wie ich, noch zur Schule gehen. Ebenso
wie &quot;Genius&quot;, der in einer der letzten Ausgaben das Mathetool
MathX
vorstellte, m&#246;chte ich mit CDB eine Datenbank vorstellen, die f&#252;r alle
angehenden Chemiker (und Biologen) bestimmt sehr hilfreich ist.<p>

<h2><CENTER><FONT COLOUR="WHITE">Was ist CDB?</FONT></h2></CENTER><p>
Bei CDB handelt es sich im Grunde um eine einfache, auf MUI basierende
Datenbank, die allerdings sehr viele Informationen &#252;ber die einzelnen
Elemente enth&#228;lt. Als Vorbild f&#252;r diese Datenbank diente das
&quot;Periodensystemn der Elemente&quot; (kurz: PSE), da&#223; sicherlich vielen aus der
Schule bzw. aus dem Beruf oder sonstwo her bekannt ist. Durch das anklicken
eines Elementes, erh&#228;lt man alle wichtigen Infos zu dem jeweiligen Stoff.
Zus&#228;tzlich gibt`s noch einige &quot;Extras&quot;, auf die ich aber im weiteren Verlauf
diese Testes eingehen werde.<p>

<h2><CENTER><FONT COLOUR="GRAY">Eine typische 8 / 15 Datenbank?</FONT></h2></CENTER><p>
Um es gleich vorweg zu nehmen: Nein! CDB ist zwar &quot;nur&quot; eine Datenbank, aber
erf&#252;llt ihre Aufgabe &#228;u&#223;erst souver&#228;n und ist eines der wenigen Tools dieser
Gattung, da&#223; mich von Anfang an hellauf begeistern konnte. Um Euch einen
kleinen Eindruck von der Vielf&#228;ltigkeit der Software zu geben, habe ich im
folgenden die Eigenschaften aufgelistet, zu denen CDB Daten bereith&#228;lt; und
das zu jedem (!) einzelnen Element:<p>
<ul>                             <img src="cdb2.png" width="275" height="335" align=right>
<li>Atomic Number<br>
<li>Atomic Weight<br>
<li>Melting Point<br>
<li>Boiling Point<br>
<li>Volumic Mass<br>
<li>Electronegativity<br>
<li>Ionization Energy<br>
<li>Heat Of Fusion<br>
<li>Heat Of Vaporization<br>
<li>Thermic Conductivity<br>
<li>Electrical Resistivity<br>
<li>Specific Heat Capacity<br>
<li>Atomic Radius<br>
<li>Covalent Radius<br>
<li>Ionic Radius<br>
<li>Atomic Volume<br>
<li>Acidic-Basis Prop.<br>
<li>Steady Phase<br>
<li>Crystal Structure<p>
</UL>
<FONT SIZE="-1">
P.S.: Sorry, aber da das Tool komplett in Englisch ist, musste ich die
Eigenschaften auch in Englisch auflisten, da ich nicht mit jedem Begriff
etwas anfangen konnte; sorry!<p></FONT>
<hr>
</p>
<br>

Wie Ihr seht ist das schon eine ganz sch&#246;ne Ansammlung von Daten, die noch
durch ein weiteres Feature erg&#228;nzt wird: Zu vielen Elementen existiert ein
umfassender Text, der noch diverse Zusatzinformationen gibt
(z.B. Entdecker, Preis des Elementes nach heutigen Maßstäben etc.); eine sehr gute Idee, wie ich
finde. Als weiteres Extra kann Euch die CDB auch eine bestimmte Eigenschaft
(z.B. Atomdurchmesser), sortiert nach jedem Element auflisten, so da&#223; man
gleich einen umfassenden &#220;berblick bekommt. Und wer einen Drucker sein eigen
nennt, kann nat&#252;rlich auch alle Fakten (inkl. Texte) zu Papier bringen und
somit wertvolles Material, beispielsweise f&#252;r ein Referat, gewinnen.
Wer nicht direkt aus CDB ausdrucken will, kann nat&#252;rlich auch alles erst als
Textdatei abspeichern und diese dann z.B. in seine Textverarbeitung oder
Lieblingseditor laden. Der Komplementierung halber sei noch erwähnt, daß das ganze ohne Probleme (also
Amiga typisch) und volkommen unkompliziert über die Bühne geht.</P>


<h2><CENTER><FONT COLOUR="YELLOW">Wo viel Licht ist...</FONT></h2></CENTER></P>
Der Schatten h&#228;ngt in diesem Fall von vielen Faktoren ab: Erstmal ist die
grundlegende Frage, wof&#252;r man die CDB verwenden möchte. F&#252;r einen angehenden
Professor in Chemie ist die CDB nat&#252;rlich nicht mehr als ein einfaches Spielzeug, daß selten zum Einsatz kommen wird.
F&#252;r einen Sch&#252;ler wie ich es bin,
h&#228;lt die CDB hingegen viele Informationen bereit, die man sich sonst aus mehreren
B&#252;chern oder tausend verschiedenen Tabellen zusammensuchen muss (und selbst dann findet man nicht alles). Der
Knackpunkt der CDB liegt aber wohl darin, da&#223; das komplette Tool in
Englischer Sprache verfasst ist und somit f&#252;r viele User mehr als ein Buch
mit sieben Siegeln sein d&#252;rfte. Klar, wer der englischen Sprache m&#228;chtig
ist, dem d&#252;rfte das ziemlich egal sein, aber da es auch gen&#252;gend Leute gibt,
die Englisch gar nicht oder nur unzureichend k&#246;nnen, ist dies doch ein
wesentliches Problem.

<h2><CENTER><FONT COLOUR="RED">Was habe ich neben den wichtigen Sachen noch
vergessen?</FONT></h2></CENTER></P>
Wie oben schon erw&#228;hnt, handelt es sich bei CDB um einen MUI Applikation, die
nat&#252;rlich dementsprechend gut &amp; professionell aussieht. Pro Forma sei
deshalb erw&#228;hnt, da&#223; CDB ein korrekt installiertes MUI System ben&#246;tigt (aber
wer hat schon kein MUI installiert?). Zus&#228;tzlich wird noch OS 3.X ben&#246;tigt
sowie ein kleines bi&#223;chen Speicher (2 MB Chip Ram reichen v&#246;llig aus). Diese
Anforderungen sollten also keine Probleme machen und somit sollte jeder in
den Genuss dieser intuitiv aufgebauten Datenbank kommen, die &#252;brigens auch
per ARexx startbar und bedienbar ist. Auch bei diesem Feature hat sich der
Autor kr&#228;ftig M&#252;he gegeben und nicht nur einen liebelosen ARexx Port
&quot;drangeklatscht&quot;: Zahlreiche Kommandos werden direkt unterst&#252;tzt und machen
somit auch die Arbeit &#252;ber ARexx zu einem wahren Vergn&#252;gen. Obligatorisch
sei erw&#228;hnt, da&#223; CDB im Aminet oder auf den entsprechenden CD`s zu bekommen
ist.</p>
<u>Weitere Screenshots:</U>
<li><a href="cdb1.png">Screenshot 1</A>
<li><a href="cdb3.png">Screenshot 2</A></p>

<h2><CENTER><FONT COLOUR="GRAY">Money makes the world go round</FONT></h2></CENTER></P>
CDB ist ein Shareware Tool, f&#252;r das nat&#252;rlich mal wieder Geld bezahlt werden
sollte. Der Preis betr&#228;gt 15 US Dollar, die aber nicht nur f&#252;r CDB sondern
auch alle anderen Produkte aus dieser Reihe gedacht sind; frei nach dem
Motto: Einmal zahlen, viele Programme nutzen! Der Betrag ist nach Italien
per Post zu schicken und wer schonmal Geld mit der italienischen Post
verschickt hat, kennt das Risiko nur alzu gut :-(((</p>

<h2><CENTER>Fazit:</h2></CENTER></P>
CDB ist eine sehr gut gemachte Datenbank, die als einer der wenigen Vertreter dieses Genres den Namen auch
wirklich verdient. Zwar ist das Tool nur f&#252;r eine relativ kleine Personengruppe interessant,
aber dies ist nat&#252;rlich auf den Gegenstand &quot;Elemente&quot; zur&#252;ckzuf&#252;hren, mit
denen ja nun wirklich nicht jeder zu tun hat (oder zu tun haben wil). Alles
in allem ist CDB trotzdem, Englischkenntnisse vorrausgesetzt, f&#252;r Sch&#252;ler
eine sehr sinnvolle Bereicherung und bewei&#223;t mal wieder, da&#223; die PD Szene
auf dem Amiga wahre Highlights hervorbringt.</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>

