<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Magic64</TITLE>
   <META NAME="AUTHOR" CONTENT="Dark Evil">
   <META NAME="DESCRIPTION" CONTENT="Magic 64 Test">
   <META NAME="KEYWORDS" CONTENT="C64">
   <META NAME="GENERATOR" CONTENT="Dark Evil with the Evil Hands">
</HEAD>
<BODY BACKGROUND="back.png" BGCOLOR="Black" TEXT="White" LINK="Red">
<CENTER>
<IMG SRC="logo.gif" ALT="LINE" WIDTH=637 HEIGHT=133 ALIGN="MIDDLE"><BR>
<IMG SRC="line.gif" ALT="LINE" WIDTH=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
</CENTER>
<H1><FONT COLOR="FFFFFF">MAGIC 64 V1.81</H1>
<BR><H2><FONT COLOR="AAAAAA">
Wer kennt ihn nicht den guten alten 64er der f&#252;r so manche langen N&#228;chte sorgte. Ach was
waren das noch f&#252;r Zeiten, keinen Stre&#223; mit MS-Dosen und Konsorten, die einzigen nat&#252;rlichen
Feinde Waren der Schneider CPC und der ATARI 800XL ach ja es gab da ja auch noch den guten
alten SPECTRUM aber alle diese Systeme waren eigentlich keine wirkliche Gefahr f&#252;r den C64
man da war die Welt noch in Ordnung wie es eigentlich auch mit dem AMIGA sein sollte aber
vielleicht wird sich das ja mit den erscheinen der neuen AMIGA Generation wieder &#228;ndern.
<BR><BR>
Naja genug mit dem Nostalgischen gelabere los geht es. Magic 64 ist ein C64 Emulator der fast
alles bittet was das Herz begehrt angefangen bei einer ordentlichen und &#252;bersichtlichen GUI die
es auch einem Anf&#228;nger leicht macht sich zurecht zu finden.
<BR><BR>
<U>Unter der &#220;berschrift <B>Project</B> findet man die Men&#252;punkt</U><BR>
<B><FONT COLOR="FFFFFF">Copyright:</B><BR><FONT COLOR="AAAAAA">
Hier gibt es nur algemeine Informationen zum Magic c64, wie z.b. Versionsnummer und Adresse der Autors<BR>
<B><FONT COLOR="FFFFFF">Save:</B><BR><FONT COLOR="AAAAAA">
Hier werden die Einstellungen die man get&#228;tigt hat abgespeichert.<BR>
<B><FONT COLOR="FFFFFF">Graphics:</B><BR><FONT COLOR="AAAAAA">
Hier k&#246;nnen die Grafik und Eigenschaften des Emulators Ver&#228;ndert werden wie z.b. der Frame Skip der
dazu dient die Geschwindigkeit auf langsamen Rechnern zu erh&#246;hen durch einfaches auslassen von jedem
X ten Bildes au&#223;erdem kommen hier Grakas zum Zuge durch das einschalten des Direct Access Buttons unter
anderem k&#246;nnen hier die Art des Bildschirmes ausgew&#228;hlt werden wie etwa Amiga Screen oder Amiga Views.<BR><BR>

<U>Unter der &#220;berschrift <B>Emulation</B> findet man die Men&#252;punkte</U><BR>
<B><FONT COLOR="FFFFFF">CPU &amp; ROM:</B><BR><FONT COLOR="AAAAAA">
Hier k&#246;nnen die Eigenschaften f&#252;r die CPU eingestellt werden und man hat die Wahl ob man ein Originales C64 Rom
benutzen m&#246;chte oder man lieber die Rom Emulation benutzen m&#246;chte wovon Ich aber von der Emulation abraten
m&#246;chte es gibt n&#228;mlich Gepatchte ROMs eines davon findet man bei einem anderen C64 Emulator Namens Frodo allerdings
erst ab der Version 4.<BR>
<B><FONT COLOR="FFFFFF">Video:</B><BR><FONT COLOR="AAAAAA">
Hier kann das Timing des Emulators beeinflu&#223;t werden wenn z.b. Raster Bars nicht korrekt wiedergegeben werden
aber das ist f&#252;r die meisten Games &#220;berfl&#252;ssig, au&#223;erdem kann hier noch zwischen PAL &amp; NTSC gew&#228;hlt werden
manche Spiele laufen nur auf einem der beiden Modes<BR>
<B><FONT COLOR="FFFFFF">Sprites:</B><BR><FONT COLOR="AAAAAA">
Hier k&#246;nnen Sprites und Kollisionen ein und aus geschaltet werden.<BR>
<B><FONT COLOR="FFFFFF">Sound:</B><BR><FONT COLOR="AAAAAA">
Hier k&#246;nnen die Soundeigenschaften des Emulators beeinflu&#223;t werden wie z.b. Sound Ausgabe &#252;ber die Playsid.library
oder die 6581sid.library au&#223;erdem kann der Sound auch noch ausgeschaltet werden was die Emulation erheblich beschleunigt.<BR>
<B><FONT COLOR="FFFFFF">Joysticks:</B><BR><FONT COLOR="AAAAAA">
Hier k&#246;nnen Joysticks ein und ausgeschaltet au&#223;erdem kann man noch ein Variabeles Dauerfeuer einstellen.<BR>
<B><FONT COLOR="FFFFFF">Keyboard:</B><BR><FONT COLOR="AAAAAA">
Hier kann zwischen dem Originalen C64 Tastatur Layout und der von der Amigaseite eingestellten Tastatur gew&#228;hlt werden.<BR>
<B><FONT COLOR="FFFFFF">Floppy:</B><BR><FONT COLOR="AAAAAA">
Hier kann die Emulation noch nicht ganz &#220;berzeugen weil die 1541 Emulation noch nicht komplett ist was dazu
f&#252;hrt das verschiedene Spiele nicht zum Laufen zu bewegen sind wie z.b. Turbo Outrun allerdings soll das in
der n&#228;chsten Version durch eine komplette 1541 Emulation behoben werden:-).<BR><BR>

<U>Unter der &#220;berschrift <B>Disk &amp; Tapes</B> findet man die Men&#252;punkte</U><BR>
<B><FONT COLOR="FFFFFF">D64-Disks:</B><BR><FONT COLOR="AAAAAA">
<B><FONT COLOR="FFFFFF">T64-Tapes:</B><BR><FONT COLOR="AAAAAA">
<B><FONT COLOR="FFFFFF">POO.Files:</B><BR><FONT COLOR="AAAAAA">
<B><FONT COLOR="FFFFFF">C64.Files:</B><BR><FONT COLOR="AAAAAA">
Alles diese Optionen sind f&#252;r das Laden der Verschiedenen Formate zust&#228;ndig.<BR>
<B><FONT COLOR="FFFFFF">Diskstate:</B><BR><FONT COLOR="AAAAAA">
Hier kann der Aktuelle zustand der 1541 Emulation abgefragt werden.<BR><BR>

<U>Unter der &#220;berschrift <B>Tools</B> findet man die Men&#252;punkte</U><BR>
<B><FONT COLOR="FFFFFF">Debug:</B><BR><FONT COLOR="AAAAAA">
Dieser Punkt beherbergt einen Debuger der allerdings f&#252;r die meisten &#220;berfl&#252;ssig ist<BR>
<B><FONT COLOR="FFFFFF">Start:</B><BR><FONT COLOR="AAAAAA">
<B><FONT COLOR="FFFFFF">Quit:</B><BR><FONT COLOR="AAAAAA">
Diese Men&#252;punkte werde Ich hier wohl nicht weiter erl&#228;utern weil sie jedem klar sein d&#252;rfte<BR><BR>

&#220;ber die Emulation ist eigentlich kein Wort mehr zu verlieren nach dem Start meldet sich
Magic 64 genauso wie ein Echter 64er au&#223;er vielleicht das das Laden der Programme viel viel
Schneller vonstatten geht, wie Ich schon erw&#228;hnt hatte Laufen Programme die einen Fastloader
benutzen zu 90 Prozent noch nicht (z.b. GEOS, Turbo Outrun usw.) aber ausnahmen best&#228;tigen die
Regel und das ein oder andere Programm (z.b. Godot) lassen sich durch abschalten der Fehler
Meldungen doch noch zum Laufen bringen aber es ist doch eher unwahrscheinlich. 
Eine gute Methode zur Beschleunigung von Magic 64 ist es den Frame Skip auf 4 zustellen es f&#228;llt n&#228;mlich bei fast
keinem Spiel und erst recht nicht bei einem Anwender Programm auf, andere M&#246;glichkeiten sind
z.b. die Sound und Sprite Kollision Emulation auszuschalten aber Probiert es selbst mal aus.<BR><BR>
Viel Spa&#223; beim Probieren.<BR><BR></H3>
<H1><FONT COLOR="FFFFFF">80 von 100 Punkten</H1><BR><BR><FONT COLOR="AAAAAA">
<UL><H2>Wenn auf diesen Test einen Resonanz gibt gibt es weitere Emulatoren Tests z.b.<BR>
<LI>Commodore C64
<LI>Commodore Vc20
<LI>Commodore C16/116
<LI>Commodore C16/Plus4
<LI>Mame
<LI>Apple 2
<LI>Macintosh
<LI>BK
<LI>MSX
<LI>CPC
<LI>Amoric
<LI>PC
<LI>Coleco Vision
<LI>Atari ST
<LI>Atari 800xl
<LI>Spectrum
<LI>Nintendo Gameboy
<LI>Nintendo NES
<LI>Nintendo SNES
<LI>Sega Game Gear
<LI>Sega Master System
<LI>Sega Mega Drive</UL>
</H2>
<CENTER>
<IMG SRC="line.gif" ALT="LINE" WIDHT=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
<IMG SRC="logi.gif" ALT="LINE" WIDHT=87 HEIGHT=143 ALIGN="MIDDLE"><BR>
<A HREF="Dark.html"><TD><IMG ALT="INFO" BORDER="1" SRC="click.gif" WIDHT=176 HEIGHT=24 ALIGN="MIDDLE"></A HREF><BR>
</CENTER>
</BODY>
</HTML>
