<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>FBlit</TITLE>
   <META NAME="AUTHOR" CONTENT="Dark Evil">
   <META NAME="DESCRIPTION" CONTENT="FBlit Test">
   <META NAME="KEYWORDS" CONTENT="FBLIT">
   <META NAME="GENERATOR" CONTENT="Dark Evil with the Evil Hands">
</HEAD>
<BODY BACKGROUND="back.png" BGCOLOR="Black" TEXT="White" LINK="Red">
<CENTER>
<IMG SRC="logo.gif" ALT="LINE" WIDTH=637 HEIGHT=133 ALIGN="MIDDLE"><BR>
<IMG SRC="line.gif" ALT="LINE" WIDTH=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
<H1><FONT COLOR="FFFFFF">MP3 Sound Player im Vergleich</H1>
</CENTER>
<BR><H2><FONT COLOR="AAAAAA">
Wer sich mit Musik besch&#228;ftigt der kennt auch die Verschidenen Formate wie z.b. IFF, RAW,
VOC, WAV, AIFF, MP2 und MP3 alles diese Musik Formate und auch viele andere die hier nicht
aufgef&#252;hrt sind k&#246;nnen mit dem AMIGA abgespielt werden aber bei MP2 und MP3 k&#246;nnte es bei
manchen Leuten zu Probemmen kommen weil einfach die Prozessor Leistung nicht ausreichend
ist und genau aus diesem grunde will Ich die verschiedenen MP2 und MP3 AMIGA AMP, AMPLIFIER
TMLG und MpegA genauer unter die Lupe nehmen m&#246;chte.<BR><BR>

<FONT COLOR="FFFFFF">Amiga Amp<BR><FONT COLOR="AAAAAA">
Hierbei handelt es sich um einen MP2 &amp; MP3 player der &#252;ber die m&#246;glichkeit verf&#252;ght sogenannte
Skins zu benutzen, was dem benutzer die m&#246;glichkeit bitet sich seine eigene Oberfl&#228;che zu Malen.
Die Konfiguration des Amiga Amps gestalltet sich relativ einfach, nachdem man das Config Men&#252; 
aufgerufen hat kann man hier die einstellungen bez&#252;glich der Qualit&#228;t, Buffer und Priorit&#228;t des
Amiga Amps einstellen, wenn man die einstellungen hinter sich gebracht hat m&#252;ssen die Konfigurationen
nur noch abgespeichert werden und man kann nun beginnen den AMIGA AMP auszuprobieren.Allerdings
ist der Amiga Amp auf menem System v&#246;llig unbrauchbar selbst mit den niederigsten einstellungen
ist es unm&#246;glich dem Programm eine halbwegs vern&#252;nftige Soundausgabe hinzubekommen, auf einem
Schnellerem System ab 68040/40 oder 68060/50 wird es aber Problemlos m&#246;glich sein vern&#252;nftig mit
dem Amiga Amp zu Arbeiten.<BR><BR>
<FONT COLOR="FFFFFF">Amplifier<BR><FONT COLOR="AAAAAA">
Wie auch der Amiga Amp unterst&#252;tzt auch der Amplifier Skins und die eistellungen sind fast Identisch
allerdings k&#246;nnen mit dem Amplifier auch andere Soundformate Abgespielt werden die da w&#228;hren Wav, Maud,
Aiff und Raw ausserdem arbeitet der Amplifier auch mit Soundkarten wie der Melody 1200 zusammen un unterst&#252;tzt
DSP.<BR><BR>
<FONT COLOR="FFFFFF">Tmlg<BR><FONT COLOR="AAAAAA">
Es war mir nicht m&#246;glich mit TMLG zu Arbeiten weil sobald Ich ein MP2 oder MP3 file geladen habe und es
Abspielen wollte das ganze System Abest&#252;rzt ist und Ich keinen Bock mehr hatte nach dem 20 Absturz weiter
rumzukonfigurieren.<BR><BR>
<FONT COLOR="FFFFFF">MpegA<BR><FONT COLOR="AAAAAA">
MpegA besitzt keine Schicke Oberfl&#228;che da es sich hier um ein CLI Programm handelt aber man kann es Problemlos
in Directory Opus einbauen womit das Problem mit der GUI wohl behoben sein d&#252;rfte allerdings gibt es auch noch
andere m&#246;glichkeiten wie z.b. Verschiedene fertige Guis zu benutzen die man im Aminet oder auf den CDs findet.
MpegA ist die beste Wahl wenn man nicht soviel Power unter der Haube hat und trotzdem MP1/2/3 direkt Anh&#246;ren
m&#246;chte ohne vorher eine L&#228;stige und Zeitraubende konvertierung durchzuf&#252;hren.<BR><BR>
<CENTER>
<TABLE BORDER=1 BGCOLOR="#666666" CELLSPACING=2>
<TR><TH><H2> Programm Name <TH><H2> CPU     <TH><H2> PPC Version <TH><H2> GUI <TH><H2> SKINS <TH><H2> AHI <TH><H2> MP2 <TH><H2> MP3 <TH><H2>Funkioniert </TR>
<TR><TH><H3> Amiga Amp     <TH><H3>68030/50 <TH><H2> Ja          <TH><H3> Ja  <TH><H3> Ja    <TH><H2> Ja  <TH><H3> Ja  <TH><H3> Ja  <TH><H2>Mangelhaft  </TR>  
<TR><TH><H3> Amplifier     <TH><H3>68030/50 <TH><H2> Nein        <TH><H3> Ja  <TH><H3> Ja    <TH><H2> Ja  <TH><H3> Ja  <TH><H3> Ja  <TH><H2>Befridigend </TR>  
<TR><TH><H3> Tmlg          <TH><H3>68030/50 <TH><H2> Nein        <TH><H3> Ja  <TH><H3> Ja    <TH><H2> Ja  <TH><H3> Ja  <TH><H3> Ja  <TH><H2>Mangelhaft  </TR>  
<TR><TH><H3> MpegA         <TH><H3>68030/50 <TH><H2> Nein        <TH><H3>Nein <TH><H3> Nein  <TH><H2> Ja  <TH><H3> Ja  <TH><H3> Ja  <TH><H2>Sehr Gut    </TR>  
</TABLE>
<B>Test Rechener AMIGA 1200 CHIP 2MB FAST 16MB, Blizzard IV CPU 68030/50 FPU 68882/50</B>
</CENTER>
<CENTER>
<IMG SRC="line.gif" ALT="LINE" WIDHT=592 HEIGHT=14 ALIGN="MIDDLE"><BR>
<IMG SRC="logi.gif" ALT="LINE" WIDHT=87 HEIGHT=143 ALIGN="MIDDLE"><BR>
<A HREF="Dark.html"><TD><IMG ALT="INFO" BORDER="1" SRC="click.gif" WIDHT=176 HEIGHT=24 ALIGN="MIDDLE"></A HREF><BR>
</CENTER>
</BODY>
</HTML>
