<html>
 <head>
  <title>VNC - Virtual Network Computing</title>
  <meta name="author" CONTENT="David Brunet obligement@free.fr">
 </head>

<body bgcolor="#000000" text="#cccccc" link="#cccc33" vlink="#aaaa22" alink="#cccccc" marginheight="0" marginwidth="0" topmargin="5" leftmargin="0">

<a name="top">

<map name="ObMap">
  <area shape="rect" coords="0,0,760,82" href="http://obligement.free.fr">
  <area shape="rect" coords="8,87,62,104" href="../index.html" alt="Intro">
  <area shape="rect" coords="80,87,168,104" href="edito.html" alt="Editorial">
  <area shape="rect" coords="186,87,278,104" href="apropos.html" alt="A Propos">
  <area shape="rect" coords="296,87,399,104" href="sommaire.html" alt="Sommaire">
  <area shape="rect" coords="414,87,473,104" href="quizz.html" alt="Quizz">
  <area shape="rect" coords="491,87,589,104" href="musiques.html" alt="Musiques">
  <area shape="rect" coords="607,87,648,104" href="pub.html" alt="Pub">
  <area shape="rect" coords="666,87,756,104" href="archives.html" alt="Archives">
</map>

<table align="center" valign="top" width="760" height="100%" background="../gfx/fondsommaire.jpg" bgcolor="#112233" cellspacing="0" cellpadding="0">
 <tr align="top">
  <td align="center">
   <img src="../gfx/oblogo.jpg" ismap usemap="#ObMap" border="0" height="108" width="760" alt="Obligement">

   <br><br><br>
   <table align="center" width="75%">
    <tr>
     <td>

<div align="center"><font size="+3">Dossier&nbsp;: VNC </font>par&nbsp;<a href="mailto:niffo@free.fr">Nicolas&nbsp;Gressard</a></div><br><br><br>


<div align="center">
<img alt="VNC" src="../gfx/vnc_logo.gif" height="113" width="120"><br><br>
</div>

<font color="#ccbb33" size="+1">Qu'est-ce que VNC&nbsp;?</font><br><br>

VNC signifie "Virtual Network Computing". VNC est un protocole
client-serveur libre de prise de contr&ocirc;le d'une machine &agrave;
distance multi plate-forme. La version originelle a &eacute;t&eacute;
d&eacute;velopp&eacute;e par Olivetti Research Laboratory.
D&eacute;but
1999,
AT&amp;T a rachet&eacute; ORL et a poursuivi le d&eacute;veloppement de
VNC. VNC est actuellement repr&eacute;sent&eacute; officiellement par
la soci&eacute;t&eacute; RealVNC.<br>
Dans ce cas pr&eacute;cis, "multi plate-forme" ne signifie pas
uniquement qu'il est impl&eacute;ment&eacute; sur plusieurs
plates-formes, mais &eacute;galement que l'on peut contr&ocirc;ler une
machine qui appartient &agrave; une plate-forme &agrave; partir d'une
machine appartenant &agrave; une autre plate-forme. En clair, le
protocole est conserv&eacute; d'une impl&eacute;mentation &agrave;
l'autre. "Prise de contr&ocirc;le &agrave; distance" signifie que le
clavier et l'&eacute;cran de la machine cliente deviennent le clavier
et l'&eacute;cran de la machine serveur. Ceci est tr&egrave;s pratique
lorsque l'on a &agrave; intervenir sur une machine distante par
l'interm&eacute;diaire du net par exemple ou m&ecirc;me pour
&eacute;viter &agrave; avoir &agrave; se lever de sa chaise pour
acc&eacute;der &agrave; une machine du r&eacute;seau local ou encore
pour acc&eacute;der &agrave; une machine sans &eacute;cran/clavier.
Pour les connaisseurs, VNC est au mode graphique ce que SSH ou Telnet
est au mode texte. Les logiciels commerciaux les plus connus ayant les
m&ecirc;mes fonctionnalit&eacute;s sont PCAnyWhere de Symantec et
MetaFrame de Citrix, tous deux sur PC uniquement.<br><br>

<font color="#ccbb33" size="+1">Comment &ccedil;a marche VNC&nbsp;?</font><br><br>

<img src="../gfx/vnc_schema.jpeg" alt="VNC" align="right" height="118" hspace="10" vspace="7" width="264">

Le principe de fonctionnement est que le "serveur" envoie, via
TCP/IP,&nbsp; des portions
de l'&eacute;cran au client, par paquets de rectangles (ou encore
framebuffer
updates). Ces mises &agrave; jour sont envoy&eacute;es par le serveur
uniquement sur demande du client. Ceci permet au client d'effectuer un
contr&ocirc;le plus subtil selon plusieurs param&egrave;tres (par
exemple la vitesse
de transmission, qui lui permet d'estimer le meilleur taux de
rafra&icirc;chissement selon l'encombrement de r&eacute;seau).
Parall&egrave;lement, le
client envoie au serveur, toujours via TCP/IP,&nbsp; toute action qui a
&eacute;t&eacute; effectu&eacute;e sur le
clavier ou la souris afin que ce dernier les r&eacute;percute sur la
machine sur lequel il tourne.<br><br>

Deux programmes sont donc n&eacute;cessaires pour mettre en oeuvre VNC&nbsp;:<br><br>

Le <b>client VNC</b>&nbsp;: c'est le programme &agrave; faire tourner sur la
machine dont on va utiliser le clavier et l'&eacute;cran pour
acc&eacute;der &agrave; la machine distante. Il faut bien s&ucirc;r
utiliser une version compil&eacute;e pour la plate-forme que l'on va
utiliser comme client.<br><br>

Le <b>serveur VNC</b>&nbsp;: c'est le programme &agrave; faire tourner sur la
machine dont on souhaite pouvoir prendre le contr&ocirc;le. Il faut
ici aussi bien entendu utiliser une version compil&eacute;e pour la
plate-forme que l'on va utiliser comme serveur.<br><br>

De base, le protocole de VNC est assez (voire tr&egrave;s)&nbsp;
lent et n'est r&eacute;ellement utilisable que sur des r&eacute;seaux
locaux. Au fil des impl&eacute;mentations, des modes de compression de
donn&eacute;es ont fait leur apparition de fa&ccedil;on &agrave;
permettre son utilisation de fa&ccedil;on honorable via des lignes RTC
ou ADSL.<br>
La version de VNC la plus efficace dans ce domaine est certainement
TightVNC pour Windows, Unix, Linux et Java.<br>
Citons &eacute;galement une autre version de VNC extr&ecirc;mement
aboutie (avec transfert de fichier, tchat, barre d'ic&ocirc;nes,...)&nbsp;:
UltraVNC mais pour windows uniquement&nbsp;:(.<br>
Lorsqu'un client et un serveur VNC communiquent, ils utilisent en
priorit&eacute; les protocoles de compression qui leur sont commun. Si
aucun protocole de compression commun n'est&nbsp; trouv&eacute; (ou si
l'un ou l'autre des programmes n'en supporte pas), la liaison se fait
dans le mode d'origine de VNC, c'est-&agrave;-dire sans compression. Le
num&eacute;ro de port TCP utilis&eacute; par d&eacute;faut par VNC est
le 5900. Il est souvent question de num&eacute;ro d'&eacute;cran
(display number) dans les serveurs et clients VNC. Ceci est directement
li&eacute; au num&eacute;ro de port &agrave; utiliser. Le "display"
0 correspond donc au port 5900, le "display" 1 correspond au port 5901,
etc.<br><br>

<font color="#ccbb33" size="+1">Les impl&eacute;mentations de VNC sur Amiga</font><br><br>

Puisqu'il s'agit de r&eacute;seau, et comme d'habitude sur Amiga, il
existe des choses dans le domaine de VNC.<br><br>

<b>1. Les serveurs&nbsp;:</b><br><br>

Il existe (&agrave; ma connaissance) deux impl&eacute;mentations de
serveur VNC 68K&nbsp;:<br><br>

<b>AmiVNC</b> de St&eacute;phane Guillard que l'on peut trouver sur le
"matou femelle" ici&nbsp;: <a href="ftp://de.aminet.net/pub/aminet/comm/tcp/AmiVNC.lha">de.aminet.net/pub/aminet/comm/tcp/AmiVNC.lha</a>.
Sa page web se trouvant ici&nbsp;: <a href="http://s.guillard.free.fr/AmiVNC/AmiVNC.htm">s.guillard.free.fr/AmiVNC/AmiVNC.htm</a>.<br><br>

AmiVNC pr&eacute;sente l'avantage de fonctionner avec les modes natifs
de l'Amiga (OCS, ECS, AGA), mais aussi avec les environnements RTG
Picasso96 et CyberGraphX.<br><br>

<b>AVNC</b> de Denis Spach que l'on peut trouver ici&nbsp;:
<a href="http://dspach.free.fr/amiga/avnc/">dspach.free.fr/amiga/avnc/</a>.<br><br>

AVNC ne fonctionne qu'avec les modes RTG Picasso96. Son
efficacit&eacute; est cependant accrue par le fait qu'il utilise un
pilote (Monitor) P96 sp&eacute;cial lui permettant de rafra&icirc;chir
uniquement les zones d'&eacute;cran effectivement modifi&eacute;es. Ne
disposant pas de machine sous P96, je n'ai pas pu le l'essayer&nbsp;:(.<br><br>

<b>2. Les clients&nbsp;:</b><br><br>

Il existe (toujours &agrave; ma connaissance&nbsp;;) &eacute;galement deux
clients VNC sur Amiga. L'un 68K et l'autre pour MorphOS.<br><br>

<b>VVA</b> de Denis Spach que l'on peut trouver ici&nbsp;:
<a href="http://dspach.free.fr/amiga/vva/index.html">dspach.free.fr/amiga/vva/index.html</a>.<br><br>

<b>MorphVNC</b> de Mark Olsen (alias BigFoot) que l'on peut trouver sur
le "pote r&eacute;seau" ici&nbsp;:
<a href="ftp://de.aminet.net/pub/aminet/comm/tcp/MorphVNC.lha">de.aminet.net/pub/aminet/comm/tcp/MorphVNC.lha</a>.<br>
Comme son nom l'indique, ce client fonctionne sous MorphOS. Il
pr&eacute;sente l'avantage de supporter le protocole de compression
ZLib.<br><br>

<font color="#ccbb33" size="+1">Utiliser AmiVNC, VVA et MorphVNC sur Amiga</font><br><br>

<b>Mise en oeuvre du serveur AmiVNC&nbsp;:</b><br><br>

AmiVNC est distribu&eacute; en deux versions&nbsp;: "Planar" et "RTG &amp;
Planar". La version "Planar" supporte uniquement les modes natifs de
l'Amiga, tandis que l'autre supporte en plus les modes RTG Picasso96 et
CGX. Chacune de ces deux versions est distribu&eacute;e compil&eacute;e
pour 68020 et 68060.<br><br>

Avant toute chose, il faut cr&eacute;er le mot de passe qui sera
demand&eacute; aux clients se connectant. Il faut consid&eacute;rer
qu'il est obligatoire de cr&eacute;er un mot de passe sous peine de
gros probl&egrave;mes avec la majorit&eacute; des clients/serveurs VNC
existants.
Pour cr&eacute;er le mot de passe avec AmiVNC, il suffit de lancer
l'ex&eacute;cutable avec la ligne de commande suivante&nbsp;: "AmiVNC.0x0
-pmot_de_passe". Ceci a pour effet de cr&eacute;er un fichier dans "S:"
contenant le mot de passe sans pour antant lancer le serveur VNC. Pour
lancer enfin
le serveur VNC (sans param&egrave;tres particuliers), il suffit
d'ex&eacute;cuter "AmiVNC.0x0". Il est possible de sp&eacute;cifier le
num&eacute;ro de port sur lequel le serveur va "&eacute;couter" avec
l'option "-s" sur la ligne de commande ou avec l'option "PORT=" dans
les tooltypes de l'ic&ocirc;ne.<br><br>

 AmiVNC n'est pas particuli&egrave;rement efficace puisqu'il se contente
de renvoyer une image de l'&eacute;cran au client &agrave; intervalles
r&eacute;guliers. Ceci a trois effets directs&nbsp;: sa lenteur, la
consommation de CPU, et la consommation de bande passante. Il a
cependant l'avantage de fonctionner quelque soit la configuration
vid&eacute;o de la machine. Il fonctionne d'ailleurs &eacute;galement
sur Pegasos sous MorphOS. Ce serveur VNC ne supporte que le protocole
de base et n'int&egrave;gre pas le support d'algorithmes de compression.
St&eacute;phane Guillard nous informe sur son site qu'une version
PPC/WarpOS existe et fonctionne mais cette derni&egrave;re ne semble
pas distribu&eacute;e&nbsp;:(&nbsp;: St&eacute;phane, si tu nous r'gardes...<br><br>

Petite ombre au tableau, je ne suis pas parvenu &agrave;
d&eacute;placer de fen&ecirc;tres depuis un client&nbsp;: il semble que le
serveur ne "voit" pas lorsque le bouton de la souris reste
enfonc&eacute;. Suis-je le seul&nbsp;? (ceci que je fasse tourner AmiVNC
sous OS3.9 ou MorphOS et quel que soit le client utilis&eacute;&nbsp;:
Amiga, PC, etc.)<br><br>

<b>Mise en oeuvre du client VVA&nbsp;:</b><br><br>

VVA est un client 68K parfaitement fonctionnel. Il ne supporte
cependant pas non plus de protocole de compression. Il est par contre
parfaitement utilisable sur un 68040 &agrave; travers un r&eacute;seau
local ce qui est tr&egrave;s bluffant&nbsp;!<br>
Il est possible de sp&eacute;cifier nombre de param&egrave;tres sur la
ligne de commande&nbsp;: je vous renvoie &agrave; la documentation pour leur
d&eacute;tail. Si vous lancez l'ex&eacute;cutable seul, ce dernier vous
demandera d'abord le nom ou l'adresse IP de l'ordinateur "Serveur" puis
le mot de passe. VVA affiche ensuite la liste des modes &eacute;cran
disponibles (l'id&eacute;e &eacute;tant de s&eacute;lectionner le mode
qui se rapproche le plus de la r&eacute;solution utilis&eacute;e sur
l'ordinateur "serveur") avant de se connecter tout simplement.<br><br>

<b>Mise en oeuvre du client MorphVNC&nbsp;:</b><br><br>

MorphVNC est un client natif MorphOS d'une efficacit&eacute;
redoutable. De plus, il supporte le protocole de compression basic ZLib.<br>
Pour le lancer, il suffit d'ex&eacute;cuter la ligne de commande
suivante&nbsp;:
"MorphVNC ordinateur_serveur:numero_de_port". Si le num&eacute;ro de
port est inf&eacute;rieur &agrave; 100, MorphVNC consid&eacute;rera
qu'il s'agit d'un num&eacute;ro de "display" (port = 5900+display). Si
le num&eacute;ro de port n'est pas sp&eacute;cifi&eacute; le port 5900
sera utilis&eacute; par d&eacute;faut. Ensuite, MorphVNC demande le mot
de passe et se connecte au serveur.<br><br>

<font color="#ccbb33" size="+1">Liens</font><br><br>

Site officiel de VNC&nbsp;: <a href="http://www.realvnc.com/">www.realvnc.com/</a>.<br>
AmiVNC sur Aminet&nbsp;: <a href="ftp://de.aminet.net/pub/aminet/comm/tcp/AmiVNC.lha">de.aminet.net/pub/aminet/comm/tcp/AmiVNC.lha</a>.<br>
Page web de AVNC et VVA&nbsp;: <a href="http://dspach.free.fr/">dspach.free.fr/</a>.<br>
MorphVNC sur Aminet&nbsp;: <a href="ftp://de.aminet.net/pub/aminet/comm/tcp/MorphVNC.lha">de.aminet.net/pub/aminet/comm/tcp/MorphVNC.lha</a>.<br>
Site de TightVNC&nbsp;: <a href="http://www.tightvnc.com/">http://www.tightvnc.com/</a>.<br>
UltraVNC sur sourceforge&nbsp;: <a href="http://ultravnc.sourceforge.net/">ultravnc.sourceforge.net/</a>.<br><br>

<font color="#ccbb33" size="+1">Conclusion</font><br><br>

D'avis personnel, un serveur VNC PowerPC (AmiVNC&nbsp;?) serait le bienvenu. Il
faut admettre que si les deux clients VNC existant sont tr&egrave;s
utilisables, le serveur que j'ai pu tester en est (comme l'indique
d'ailleurs son auteur) &agrave; un stade exp&eacute;rimental. Qui se
propose pour porter TightVNC ou Ultr@VNC sur Amiga&nbsp;?&nbsp;;).<br><br><br>



<div align="center"><a href="#top">Retour en haut</a> | <a href="sommaire.html">Retour au sommaire</a></div><br><br> 



     </td>
    </tr>
   </table>
  </td>
 </tr>
</table>


</body>
</html>

