<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Das Pferdeei</TITLE>
  </HEAD>

  <BODY background="st_pferdeei1.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Das Pferdeei</B></FONT></P>

          <P>Es war einmal ein Bauer, der hie&szlig; Hans, der ging in die Stadt zu
          Markte. Und als er da so herumschlenderte, sah er einen H&auml;ndler
          sitzen, der hatte ein paar gro&szlig;e K&uuml;rbisse zu verkaufen. Da
          fragte er ihn: "Bruder, was sind das f&uuml;r Dinger, die du da zu Markte
          gebracht?" - "Pferdeeier" antwortete der andere. "Ei, du liebe Zeit!",
          sagte Hans, "Pferdeeier? Die sind wohl sehr teuer?" - "Nun, bezahlen lassen
          sie sich noch", sprach jener, "sieh mal hier das rotbraune, das gibt einen
          pr&auml;chtigen Fuchs und kostet nur zehn Taler!" Das d&uuml;nkte Hans
          nicht allzu viel f&uuml;r einen sch&ouml;nen Fuchs - und schnell borgte er
          das Geld und kehrte zu dem H&auml;ndler zur&uuml;ck.</P>

          <P>Nun wollte er aber auch gern wissen, wie das Ei ausgebr&uuml;tet werde;
          und der andere sagte ihm, er m&uuml;sse es selbst ausbr&uuml;ten. Und es
          dauere volle vier Wochen, bis ein Fohlen herausk&auml;me! W&auml;hrend
          dieser Zeit d&uuml;rfe er ja nicht von dem Ei aufstehen -und wenn er's
          einmal m&uuml;sse, so m&ouml;ge er's ja recht warm zudecken. Auch solle er
          sich lieber die ganze Zeit von seiner Frau f&uuml;ttern lassen, damit er
          eine recht hitzige Brut habe.</P>

          <P>Hans pr&auml;gte sich alles ganz genau ein und eilte nun mit seinem
          Pferdeei nach Hause, wo er seiner Frau mit gro&szlig;er Freude
          erz&auml;hlte, was f&uuml;r einen sch&ouml;nen Handel er gemacht habe. Er
          konnte kaum die Zeit erwarten, bis sie ihm das Nest zurechtgemacht hatte.
          Nachdem sie nun ein Bund Stroh im Stall ausgebreitet und in der Mitte eine
          Vertiefung f&uuml;r das Ei gemacht hatte, setzte sich Hans darauf - und
          seine Frau musste ihn f&uuml;ttern und noch einige Bund Stroh um ihn
          sch&uuml;tten, damit er auch eine hitzige Brut h&auml;tte.</P>

          <P>Als nun endlich die vierte Woche zu Ende ging, da sprang Hans
          pl&ouml;tzlich auf und horchte an dem Ei und klopfte daran; aber der Fuchs
          wollte sich nicht r&uuml;hren. Da konnte er seine Ungeduld nicht
          l&auml;nger z&uuml;geln. Er nahm das Ei und ging damit hinters Haus, wo ein
          gro&szlig;er Stein lag, gegen den warf er es. Und da der K&uuml;rbis innen
          schon ganz faul war, flogen die St&uuml;cke weit umher.</P>

          <P>Und eins davon fiel in ein nahes Gestr&auml;uch, hinter dem gerade ein
          Fuchs lag und schlief. Der sprang auf und lief eilig davon. Da glaubte
          Hans, es sei sein rotes Fohlen und er rief immerzu: "Hi&szlig;, hi&szlig;!"
          Er meinte, wann's m&uuml;de ist, wird's schon zur&uuml;ckkommen; aber es
          kam nicht. Hans ging endlich betr&uuml;bt wieder ins Haus und nahm sich
          vor, wenn er wieder ein Pferdeei kaufe, h&uuml;bsch im Stall zu bleiben,
          damit sein Fohlen nicht entwischen k&ouml;nne.</P>

          <P>Verfasser unbekannt</P>
          <HR>

          <P>Ich werde Euch zwischendurch immer wieder mal Geschichten und Gedichte
          pr&auml;sentieren, die frei von Copyrights sind. Also viel Spass damit -<BR>

          Euer HIGGINS CordHagen@as-x.de</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

