<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>
<p><h1><center><font color="green">Leserbrief von Kilian &quot;The Bruce&quot; Servais</font></center></h1></P>

<p><a href="#sieg.html">An Sieglinde</A></Li><BR>
<a href="#wolf.html">An Wolf</A></Li><BR>
<a href="#rainer.html">An Rainer</A></Li><BR>
<a href="#top.html">Top 5</A></Li></p>
<hr>
<a name="sieg.html">
<p><b>Gr&#252;&#223; Dich Sieglinde!</B><BR>
Ich finde es zwar sehr sch&#246;n, da&#223; Du Dich mal wieder in der NoCover zu Wort meldest, auch wenn Du dort praktisch nur Deinen Austieg aus dem Amiga Bereich meldest - glaube mir: Ich kann es schon langsam nicht mehr h&#246;ren, wenn Leute sagen, da&#223; der Amiga nichts mehr zu bieten hat, sie aber auf jeden Fall zur&#252;ck kommen, wenn es einen neuen Amiga gibt. Diese abgedroschene Phrase &quot;Ich komme zur&#252;ck, wenn es einen neuen Amiga gibt&quot; habe ich nun schon einfach zu oft geh&#246;rt und ich nehme es kaum noch einem ab, wenn er soewtas sagt.</P>

<p>Aber sei es drum, Dein Umstieg scheint perfekt zu sein, auch wenn ich einfach mal in Zweifel stelle, da&#223; in der Amiga Plus nichts mehr interessantes steht. Auch die Abqualifizierung der Aminet CD`s kann ich so nicht stehen lassen, da sich dort doch alle zwei Monate viele gute Programme und sonstige Dinge finden lassen. Vielleicht siehst Du ja die momentane Situation einfach nur zu schwarz, denn ich muss Dir ganz ehrlich sagen, da&#223; ich wegen eines Office Paktes (mit &quot;Papyrus&quot; kommt jetzt ein hervorragendes Paket auch f&#252;r den Amiga) und einigen Spielen (wof&#252;r gibt es preisg&#252;nstige Konsolen &amp; die Amiga Spiele) niemals einen neuen Rechner gekauft h&#228;tte, wie Du es in Deinem lezten Leserbrief anmerkst. Und was das Thema Komfort angeht: Ich glaube kaum, da&#223; Windows in Sachen Komfort an AmigaOS 3.9 herankommt - aber das ist sicherlich Ansichtssache....</P>

<p>Ich w&#252;nsche Dir auf jeden Fall viel Erfolg mit Deinem neuen System und wenig Abst&#252;rze. Vielleicht bleisbt Du dem APC &amp; TCP ja doch noch ein Jahr erhalten??</P>
<hr>
<a name="wolf.html">
<p><b>Hallo Wolf!</B><BR>
Ich hoffe, Du hast Dich von den Messestrapazen ordentlich erholt. Mein Zug hatte noch etwas Versp&#228;tung und musste dann sogar noch eine einst&#252;ndige Zwangspause einlegen, da man ausgerechnet in unseren Zug einige rechte Dumpfbacken von der Demo unter Aufsicht des BGS platzierte....</P>

<p>Na ja, den versprochenen Messe Artikel habe ich gerade zu Ende geschrieben und ich hoffe, da&#223; ich nichts vergessen habe - vielleicht gibt`s von Dir oder Thomas ja doch noch die eine oder andere Impression. AmigaOS 3.9 habe ich nat&#252;rlich auch schon installiert und ich muss Dir sagen, da&#223; es wirklich 
gut ist und es sich die Anschaffung allemal gelohnt hat. Einen kleinen Bericht dar&#252;ber habe ich auch schon angefangen und ich hoffe, da&#223; ich selbigen f&#252;r diese Ausgabe noch fertig bekomme - aber das wirst Du dann ja merken. Hat sich das Update auf Wordworth 7 eigentlich gelohnt? W&#252;rde mich echt mal interessieren, da ich hier selber noch WW6 im Einsatz habe und momentan mit einer Anschaffung von AmigaWriter lieb&#228;ugle, obwohl mich auch das angek&#252;ndigte Office Paket &quot;Papyrus&quot; begeistert hatte (ein Kollege benutzt das schon heute).  </P>

<p>Mach`s mal gut!</P>
<hr>
<a name="rainer.html">
<p><b>Sei gegr&#252;&#223;t Rainer!</B><br>
Tja, jetzt k&#246;nnen wir uns auch noch per NoCover unterhalten - ist ganz praktisch, zumal die n&#228;chste Fireball ja ohnehin erst im Februar erscheint. Die aktuelle Fireball habe ich nat&#252;rlich auch gekriegt - vielen Dank f&#252;r das Manowar Video: Das Teil ist ja echt der Hammer, auch wenn man es nicht unbedingt Manowar Hassern zeigen sollte, da alle Vorurteile mal wieder best&#228;tigt werden. Ich schicke Dir das Video zusammen mit den Fireball Artikeln Ende Januar zu. Oder brauchts Du es vorher? Dann w&#252;rde ich es Dir sofort wieder zur&#252;ckschicken. Davon gibt`s wohl auch `ne DVD. Du wei&#223;t nicht zuf&#228;llig, ob da zus&#228;tzliches Material drauf ist?</P>

<p>Zum Thema Ayeron: Yup, ich hatte ein Interview (rund 20 Minuten) mit Arjen gef&#252;hrt. Momentan wei&#223; ich zwar nicht so ganz genau, wo die Interview CD abgekommen ist, aber da haben tue ich es auf jeden Fall noch. Also bei Interesse Rohling an meine Addy (R&#252;ckport kannst Du Dir ruhig klemmen - &#252;bernehme ich schon) und ich kopiere Dir das Teil dann auf Rohling. Das letzte Album ist &#252;brigens echt der Hammer, insbesondere der Song, auf dem Bruce einen Part &#252;bernommen hat. Es sind &#252;brigens noch jede Menge weitere Musiker auf den beiden CD`s (Andi Deris, Ralf Scheepers etc.) - lohnen sich auf jeden Fall.</P>

<p>So, alles weitere im Fireball!</P>
<hr>
<a name="top.html">

<p><center><h2><font color="yellow">Top 5</font></center></h2></P>

<p>1. Autsch von Wolf Zimmer<br>
2. WebPlug Workshop von Martin Voepel<br>
3. Heretic II von Andreas Guldner<br>
4. Clubtreffen Diskussionsartikel von Wolf Zimmer<br>
5. Brimsteone Saga von Rainer &quot;The Machine&quot; Thiecke</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
