<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Messebericht World Of Amiga 2000</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><center><img src="messeklogo.gif"></center></P>
<p>Dank Haage &amp; Partner kamen die Amiga User in diesem Jahr noch in den Genuss einer Amiga-only Messe, die am 9. und 10. Dezember im K&#246;lner Mediapark stattfand. Als Amiga User durfte man sich soetwas nat&#252;rlich nicht entgehen lassen und so pilgerte ich am Samstag morgen Richtung K&#246;ln...</P>

<p>Nachdem ich also recht fr&#252;h aufgestanden bin und nach einer rund 90 min&#252;tigen Zugafhrt auch am K&#246;lner HBF angekommen bin, folgte ich einfach nur den Instruktionen von Haage &amp; Partner und dachte, da&#223; ich den Mediapark recht schnell finden w&#252;rde. Um selbigen dann zu finden, brauchte ich dann doch wieder erwarten etwas l&#228;nger, da am gleichen Tag in K&#246;ln einige Demos stattfanden und die immer hilfsbereite Polizei mich gleich zweimal in die falsche Richtung schickte. Irgendwie habe ich den Mediapark dann doch noch gefunden und kam somit in den Genuss der Amiga Messe.</P>

<p>Beim Eingang also schnell das Ticket f&#252;r 18 DM gel&#246;st und schon konnte man sich in das Get&#252;mmel st&#252;rzen - zumindest am Samstag schien einiges los zu sein und auch gekauft wurde offensichtlich flei&#223;ig. Die offiziellen Daten sprechen von rund 2000 Besuchern, was f&#252;r eine Amiga-only Messe mitten in Weihnachtszeit gar nichtmal schlecht ist. Aber kommen wir nun zu den einzelnen St&#228;nden: Den ersten Stand, den ich logischerweise ansteuerte, war der von Haage &amp; Partner, in dessen Mittelpunkt nat&#252;rlich das brandneue OS Update auf 3.9 stand, welches ich gleich f&#252;r 89 DM erwarb. Es ist zwar schade, da&#223; OS 3.5 Kunden keinen speziellen Update Preis bekommen, aber als Amiga User sollte man sich dieses Update trotzdem nicht entgehen lassen. Meine pers&#246;nlichen Eindr&#252;cke dar&#252;ber d&#252;rften auch in dieser Ausgabe zu finden sein. Auserdem gibt es passend zu OS 3.9 noch ein neues Handbuch, welches man allerdings seperat f&#252;r erneut 89 DM erwerben 
konnte. Das war mir dann aber doch etwas zu teuer und so blieb ich bei der OS 3.9 CD. Nat&#252;rlich waren am Haage &amp; Partner Stand auch alle weiteren Produkte, wie etwa die Textverarbeitung AmigaWriter2.2 oder das neue StormC 4, k&#228;uflich erwerbar. Unterschlupf fand hier zudem noch die Amiga Active - ein hervorragend gemachtes englischsprachiges Amiga Magazin, welches in Zukunft plant, zu expandieren.</P>

<p>Und wo wir gerade bei den Magazinen sind: Auch der Falke Verlag war nat&#252;rlich anwesend und bot dort seine ganze Palette an Printmagazinen an, u.a. nat&#252;rlich die Amiga Plus, die Mac Life (die mich nicht alzu sehr vom Hocker gehauen hat) und die Atari ST. Auch die ehemalige Amiga Plus CD, die jetzt auf den Namen Amiga Plus CD &amp; Gamer h&#246;rt, durfte nicht fehlen und entwickelt sich ganz pr&#228;chtig. Epic Interactive befand sich ebenfalls am Falke Stand und verkaufte sein gesammtes Softwaresortiment und auch Simon 2 konnte man endlich kaufen. Ebenso wurde eine hervorragend aussehende Demo zu Earth 2140 gezeigt, die Napalm sicherlich schl&#228;gt und sich evtl. auch gegen Exodus behaupten kann.</P>

<p>Bei KDH Datentechnik konnte man dann eben jenes Konkurrenzprodukt, n&#228;mlich Exodus-The Last War, gleich kaufen. Ich muss sagen, da&#223; mich das Game beinahe umgehauen h&#228;tte- so geil ist es geworden. Schon Napalm war grafisch nicht schlecht, aber Exodus packt da nochmal eine ganze Schaufel drauf. Nat&#252;rlich konnte man bei KDH auch noch alles m&#246;gliche an aktueller Soft- und Hardware erwerben. Leider wurde aus dem geplantem Vortrag zu iFusion nichts mehr, da der entsprechende Programmierer wieder erwarten keine Zeit hatte. Als Ersatz wurde schonmal der Wildfire Nachfolger Taifun unter Elate gezeigt. </P>


<p>Traditioneller Softwareanlaufpunkt auf Amiga Messen ist die Schatztruhe, die mit Amiga Forever 4.0, dem Aminet Set 10 und der frisch gepressten Aminet CD 40, die die Vollversion von Turbo Calc 4.0 enth&#228;lt, drei Neuerscheinungen bereit h&#228;lt. Zus&#228;tzlich konnte man nat&#252;rlich auch &#228;ltere CD`s erstehen und das eine oder andere Schn&#228;ppchen machen.</P>

<p>Mein pers&#246;nliches Highlight der Messe war aber, neben OS 3.9, die Pr&#228;sentation der angek&#252;ndigten PCI Hardware: Elbox lie&#223;en es sich nicht nehmen und pr&#228;sentierten ihr Mediator Bord mit Voodoo3 und TV Karte, was mich sehr beeindruckte. Zwar lief ununterbrochen Viva II, aber daf&#252;r k&#246;nnen die Jungs von Elbox ja nichts. Wer also immer noch behauptet, da&#223; es sich bei den PCI Projekten nur um &quot;hei&#223;e Luft&quot; handelt, der sollte mal ganz kurz seinen Realit&#228;tssinn &#252;berpr&#252;fen lassen. Auch der direkte Konkurrent, das PCI Bord G-Rexx aus dem Hause DCE war auf der Messe pr&#228;sent, wenn auch nur als zusammengeschusterte Version mit Voodoo Karte. Trotzdem schien auch dieses Bord zu laufen, was man am Hyperion Stand u.a. bei Spielen wie Descent II und Heretic II, zu denen auch Seminare angebotren wurden, bewundern konnte. Hyperion wartete zudem noch mit einer &#220;berraschung auf, indem sie ank&#252;ndigten, den Real3D Nachfolger Realsoft auf den 
Amiga zu portieren. Eine entsprechende Lizenz hat die Firma auf jeden Fall schon einmal. </P>
<p><center><img src="messek2.jpg"></center></P>

<p>Individual Computers lie&#223;en es sich auch nicht nehmen und waren mit einigen neuen Produkten vertreten: Der Lyra Tastaturadapter erm&#246;glicht am Amiga die Nutzung von Standard PC Tastaturen, der ISDN Surfer ist eine ISDN Karte (nein, wer h&#228;tte das jetzt gedacht?) f&#252;r den Amiga und zudem gab es mit Kickflash noch ein Flash Rom f&#252;r die alten Amigas der Marke A1000, mit dem es theoretisch m&#246;glich ist, OS 3.9 auf selbigem zu installieren. Auch die von Aliendesign geplante Hightech Soundkarte Repulse war als Prototyp bereits zu sehen und wird von Individual Computers gefertigt.</P>

<p>Erwartungsgem&#228;&#223; war auch der K&#246;lner Amiga H&#228;ndler Cool Bits anwesened und pr&#228;sentierte die Scanner Software FXScan 3, die jetzt auch &#252;ber OCR F&#228;higkeiten verf&#252;gt und dank BetaScan Unterst&#252;tzung (kostenlose Scanner Software aus dem Aminet) auch viele weitere Scanner unterst&#252;tzt. Videofans kamen bei Cool Bits ebenfalls auf ihre Kosten, wurde doch der Casablanca Avio (der in Fachzeitschriten zugegebenerma&#223;en eher schlecht weg gekommen ist) von Macro Systems hier pr&#228;sentiert, der mit dem Vorg&#228;nger in Sachen Hardware allerdings nicht mehr viel gemein hat. Direkt neben Cool Bits hatte sich Eternity platziert, die den MAS PLayer in verschiedenen Einsatzgebieten zeigten - so wurde ein CDTV (yup, der nunmehr fast 10 Jahe alte Kasten!) mit dem MAS Player zum vollwertigen MP3 Abspieler. Auch dem A600 l&#228;sst sich auf diese Weise neues Leben einhauchen. Softwarem&#228;&#223;ig konnte man bei Eternity den WB Enhancer EASys sowie das (immer noch nicht 
fertige) Spiel Tales Of Tamar bestaunen, wovon die erste Version wohl Mite 2001 erscheinen soll.</P>

<p>Nicht vergessen darf an dieser Stelle nat&#252;rlich auch der Stand &quot;unseres&quot; Clubs - Andreas &amp; die Mannen vom APC &amp; TCP hatten mal wieder das gesammte Sortiment dabei und mit &quot;Light Over Mars&quot; pr&#228;sentierte man sogar eine neue CD, auf der Raytraycing Fans zahlreiches Futter finden. Auch die Amiga Future war hier pr&#228;sent, wobei die Ausgabe 27 leider schon komplett ausverkauft war (und das am Samstag morgen), was wohl auch an der niedrigen Auflage von 300 St&#252;ck gelegen haben mag. F&#252;r die Ausgabe 28 hat man schon ein komplett neues Layout im Kasten, was im gro&#223;en und ganzen auch recht ansprechend wirkt. Zus&#228;tzlich hatte man einige Future Goodies im Messegep&#228;ck: So konnte man z.B. Amiga Future Mousepads und Schl&#252;sselanh&#228;nger erwerben.</P><p><center><img src="messek1.jpg"></Center></P>

<p>Kurz erw&#228;hnen m&#246;chte ich noch die St&#228;nde von DreiEinhalb und Verkosoft, an denen man das eine oder andere Schn&#228;ppchen machen konnte</P>

<p>Tja, das war so der erste Rundgang durch die Halle &amp; das Foyer und mich hat es echt gewundert, da&#223; so viele Neuigkeiten zu entdecken waren, denn immerhin darf man nicht vergessen, da&#223; die Messe recht kurzfristig angek&#252;ndigt wurde. Alsabld traf ich dann auch Wolf Zimmer und &quot;Mr. Comic&quot; Thomas Weber, mit denen ich mich noch etwas unterhielt und noch den einen oder anderen Rundgang &#252;ber die Messe machte. Aufgrund akuter Zeitnot konnte ich mir leider keine Seminare angucken, da ich bereits um 16 Uhr wieder in Herne am Fu&#223;ballplatz sein musste. Allerdings war zu h&#246;ren, da&#223; das AmigaOS (Classic) nur dann weiterentwickelt wird, wenn es sich 50.000 mal verkauft - eine recht utopische Zahl wie ich finde. Trotzdem kann ich nur alle Classic User dazu aufrufen, sich das neue OS Update zu holen, da es wirklich n&#252;tzlich ist und damit zumindest eine theoretische Chance besteht, da&#223; es weiterentwickelt 
wird.</P>

<p>An dieser Stelle klinke ich mich einfach mal aus - wie gesagt, es war im gro&#223;en und ganzen eine gelungene Amiga-only Messe, die ein turbulentes Jahr 2000 f&#252;r den amiga hoffnungsvoll abschlie&#223;t. Bleibt zu hoffen, da&#223; es 2001 auch wieder eine oder mehrere Amiga Messen geben wird, die &#228;hnlich erfolgreich verlaufen. Wer die &quot;World Of Amiga 2000&quot; verpasst hat, der sollte sich definitiv die n&#228;chste Messe nicht entgehen lassen.</P>

<p><i>Die Bilder habe ich diversen Quellen entnommen</I></P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
