<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Meine OS 3.9 Eindrücke</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">AmigaOS 3.9 - Meine Eindr&#252;cke</font></center></h1></P>
<p><center><img src="koslog.jpg"></Center></P>
<p>AmigaOS 3.9 kommt, im Gegensatz zu seinem Vorg&#228;nger OS 3.5, in einer simplen CD H&#252;lle daher, die lediglich das Booklett mit Installationshinweisen enth&#228;lt. Auch wenn das auf den ersten Blick etwas spartanisch anmutet, so m&#246;chte ich anmerken, da&#223; eine Box nur wenig Sinn gemacht h&#228;tte und ein Handbuch den Preisrahmen gespr&#228;ngt h&#228;tte. Wer dennoch ein Handbuch ben&#246;tigt, der kann das 500 Seiten starke Handbuch &quot;Amiga OS 3.9 - Das Buch&quot;, f&#252;r das sich (genau wie f&#252;r OS 3.9) Haage &amp; Partner verantwortlich zeichnet, f&#252;r 89 DM erwerben. Im Bundle mit OS 3.9., welches einzeln ebenfalls 89 DM kostet, werden nur 159 DM f&#228;llig.</P>

<p>Soviel zu den Formalit&#228;ten: Die CD also in`s Laufwerk geschoben und schon erwartet den unbedarften User die erste &#220;berraschung - auf der CD befindet sich auch ein Audio Track namens &quot;Skyflight&quot; und zwar von der Amiga Gruppe Annex. Ich bin zwar kein Fan von dieser Musikrichtung, aber als kostenlose Dreingabe sicherlich nett. Aber viel wichtiger als irgendwelche Audio CDDA Tracks ist ja das Update, welches sich problemlos &#252;ber eine bestehende OS 3.5 oder OS 3.1 Installation durchf&#252;hren l&#228;sst und keinerlei Probleme bereitete - zumindest auf einem echten Amiga, denn unter dem UAE konnte man die automatische Installation, wie schon bei OS 3.5, vergessen, was mal wieder beweist, da&#223; der UAE in Zusammenspiel mit Windows nicht die Ideall&#246;sung ist, als die er von vielen angepriesen wird....</P>

<p>Nachdem man also OS 3.9 installiert hat und den Rechner neu gebootet hat, fallem einem direkt die ersten Ver&#228;nderrungen auf: Am unteren Bildschirmrand befindet sich eine neue Dock Leiste namens &quot;AmiDock&quot;, mit der man auf einfachste Art und Weise Programme direkt starten kann, ohne erst lange in irgendwelchen Verzeichnissen w&#252;hlen oder Piktogramme auslagern zu m&#252;ssen. Das Tool hat sich in der Praxis wirklich bew&#228;hrt und zumindest ich m&#246;chte dieses praktische neue Tool mitlerweile nicht mehr missen, da es auch grafisch einiges hermacht und sich natlos in den modernen Look des Amiga OS 3.5 / 3.9 einf&#252;gt. Aber Haage &amp; Partner haben noch eine ganze Menge weiterer Tools beigelegt: Ein Manko, welches das AmigaOS dank seinem Alter (OS 3.1 stammte imemrhin von 1993) in den letzten Jahren hatte, waren die nicht von Haus aus beigef&#252;gten Multimediaf&#228;higkeiten. In OS 3.5 hatte man noch andere Priorit&#228;ten gesetzt, aber Amiga OS 3.9 bringt den Amiga auch in 
Sachen Multimedia wieder nach vorne: So hat man einen attraktiven CD Player beigelegt, derren GUI man mittels &quot;Skins&quot; (&#228;hnlich wie bei g&#228;ngigen MP 3 Playern) beliebig an seine eigene W&#252;nsche anpassen kann. Auch ein Video Abspieler f&#252;r AVI &amp; QT Files namens &quot;Action&quot; (bei dem es sich wohl um &quot;Moovid&quot; handelt) liegt OS 3.9 bei, der in der Praxis auch einen schnellen Eindruck macht. Zum sinnvollen Einsatz sollte man nat&#252;rlich eine GraKa und im Idealfall eine AHI Soundkarte sein eigen nennen, aber wir leben immerhin im Jahre 2001. Demzufolge darf nat&#252;rlich auch ein MP3 Player nicht fehlen - Haage &amp; Partner haben sich f&#252;r &quot;Amplifier&quot; entschieden, der auch auf schw&#228;cheren Systemen eine vergleichsweise gute Performance bietet. Um die neuen Multimedia F&#228;higkeiten auch ausgiebig zu testen, finden sich auf der randvollen CD einige MP3 St&#252;cke sowie Video Files zu diversen aktuellen Kino Filmen (z.B. &quot;Scarry 
Movie&quot;, &quot;The Grinch&quot; etc.) wieder, die sich nat&#252;rlich optimal mit den neuen Tools abspielen lassen.</P>
<p><center><img src="kos1.jpg"></P><br>
<p><i>AmiDock, Action und MP3 Abspieler auf der WB...</I></P></center>
<p>In Sachen Multimedia hat AmigaOS 3.9 also schonmal gewaltig aufgeholt und auch der Bedienungskomfort ist nicht zuletzt dank des neuen Docks in der Praxis gewaltig gestiegen. Aber auch das OS selber wurde in vielen Deatails verbessert, wobei ich an erster Stelle ein Feature anf&#252;hren m&#246;chte, das unter einem bestimmten OS namens &quot;Windows&quot; noch lange nicht ausgereift bzw. mehr als unbrauchbar ist: Die automatische Dateitypenerkennung. Durch die simple Implementierung des schon f&#252;r OS 3.5 existierenden Tools &quot;Def Icons&quot; (welches f&#252;r OS 3.9 freilich nochmal geupdatet und angepasst wurde) in das OS kann man nun f&#252;r jede Art von Datei, seien es nun HTML Dateien, GIF Grafiken, Source Codes, Amiga Guide Dateien oder MP3 St&#252;cke, ein eigenes Piktogramm bestimmen. Soweit eigentlich nichts neues, scheint dieses Feature doch auch unter Windows zu existieren. Tja, aber hat mal jemand versucht, eine HTML Datei unter Windows beispielsweise mit der Endung .jpg zu versehen? 
Das Resultat ist dort sehr verbl&#252;ffend: Aus dem HTML Dokument (was es nach wie vor ist!) macht Windows nun eine JPG Datei und auf Doppelclick wird diese nun ein Malprogramm geladen, was nat&#252;rlich zu keinem Erfolg f&#252;hrt. Das AmigaOS geht da mal wieder einen anderen und - nat&#252;rlich - besseren Weg: DefIcons lie&#223;t die ersten Zeilen der jeweiligen Datei aus, in der sich die Formatangaben befinden und ordnet u.a. dadurch automatisch das richtige Piktogramm zu. Selbst wenn eine Datei irrt&#252;mlich mit der Endung .gif abgespeichert wird, obwohl es sich um ein .jpg Datei handelt, zeigt das Betriebssystem das richtige Piktogramm an - in diesem Fall das f&#252;r .jpg Dateien. DefIcons kann man sehr flexibel einstellen - selbst eine Lernfunktion f&#252;r unbekannte Dateitypen ist vorhanden.</P> 
<p><center><img src="kos2.jpg"></p><BR>
<p><i>DefIcons und der neue Info Dialog im Zusammenspiel</I></center></P>

<p>Aber wer glaubt, da&#223; damit der Reigen an neuen Tools schon beendet ist, der irrt gewaltig: Ein neuer M&#252;lleimer namens &quot;Bench Trash&quot; (den ich als weitaus flexibler als den von einem weit verbreiteten, anderem OS bezeichnen w&#252;rde) geh&#246;rt ebenso zur Standardausr&#252;stung von OS 3.9 wie eine neue (alternative) Profi Shell namens &quot;Vinced&quot;, ein komfortabler Entpacker namens &quot;UnARC&quot;, der die g&#228;ngisten Formate beherrscht, die Iomega Tools f&#252;r alle Besitzer von Zip Laufwerken und nat&#252;rlich eine neue Version von WarpUP, dem Treibersystem f&#252;r PPC Karten. Auch eine schnelle Suchfunktion wurde fest in das neue OS integriert und kann bequem &#252;ber die Workbenchtitelleiste gestartet werden - wer also mal wieder nicht genau wei&#223;, wo er seine wichtigen Dateien versteckt hat, kann nun ganz bequem und vor allem schnell suchen. Ein neuer Info Dialog ist ebenfalls bei OS 3.9 hinzugekommen und selbiger ist weitaus flexibeler als der alte und kann 
sogar die Versionsnummer bei Bedarf anzeigen - dem einfachen Updaten von Librarys und &#228;hnlichem steht somit nichts mehr im Wege. Der Vollst&#228;ndigkeit halber sei noch erw&#228;hnt, da&#223; OS 3.9 auch eine neue, attraktive Uhr sowie ein Fontcache beiliegt - letzterer muss aber noch nachtr&#228;glich gestartet werden, was in der aktuellen Ausgabe der Amiga Plus (1 / 2001) erkl&#228;rt wird.</P>  

<p>Aber was w&#228;re ein starkes und modernes Betriebssystem ohne entsprechende Internet Ausr&#252;stung? Auch hier haben Haage &amp; Partner meiner Meinung nach gute Arbeit geleistet, indem sie neben einer neuen SE Version von AWeb 3.4 (die sehr brauchbar ist) auch den Internet Stack Genesis, mit dem man kinderleicht in`s Internet kommt, beigelegt haben. Pro forma hat man dann noch einen E-Mailer beigelegt, wobei dieser erwartunsgem&#228;&#223; nicht an YAM, den quasi Standard auf dem Amiga, der auch plattform&#252;bergreifend seinesgleichen sucht, heranreicht - da YAM aber kostenlos aus dem Aminet (und den entsprechenden CD`s) zu beziehen ist, ist das kein wirklicher Kritikpunkt. Somit hat man ein gut funktionierendes Internet Paket gesch&#252;rrt, mit dem man innerhalb von wenigen Minuten auch mit dem Amiga in`s Netzt kommt und nicht erst stundenlang konfigurieren muss.</P>

<p>Aber man hat in OS 3.9 nicht nur neue Tools einflie&#223;en lassen, sondern auch bestehende Dinge weiter verbessert: So ist der Picture Datatype nun auf PPC optimiert, was f&#252;r Besitzer einer PPC Karte oder jene, die es noch werden wollen (man denke dabei insbesondere an das &quot;Shark Projekt&quot; von Elbox), sicherlich eine tolle Sache ist. Besitzer von 68K Amigas k&#246;nnen sich demhingegen &#252;ber neue Funktionen im &quot;Workbench Voreinsteller&quot; freuen, der mit OS 3.5 eingef&#252;hrt wurde: So kann nun die F&#252;llstandanzeige am Rand bequem abgestellt werden und auch die Piktogramme k&#246;nnen nun in`s Fast Ram ausgelagert werden, was neben der Schonung des Chip Ram`s vor allem zu einer schnelleren Darstellung f&#252;hrt. Auch die Titelzeile der WB l&#228;sst sich nun per Workbench Voreinsteller abstellen. Leicht &#252;berarbeitet wurden auch der &quot;IControl&quot;, &quot;Screen Mode&quot; und &quot;WBPattern&quot; Voreinsteller und mit &quot;ASL Prefs&quot; ist sogar ein neues 
Prefs Programm hinzugekommen, mit dem man, wie der Name schon vermuten l&#228;sst, das Aussehen der ASL Requester ganz an seine Wunschvorstellungen anpassen kann - aus meiner Sicht kann man nun mit s&#228;mtlichen Voreinstellern des AmigaOS das komplette Betriebssystem an seine eigenen Vorstellungen anpassen, was mit anderen Betriebssystemen so einfach und reibungslos nicht m&#246;glich ist. </P>

<p>Damit habe ich jetzt lediglich die auff&#228;lligsten und wohl gravierensten &#196;nderrungen aufgez&#228;hlt, wobei nat&#252;rlich auch wieder jede Menge Bugfixes in das Update mit eingeflossen sind, die das ohnehin schon stabile AmigaOS noch stabiler und belastbarer machen. Wenn ich OS 3.9 mit meinem System vor anderthalb Jahren vergleiche, als ich wie jeder andere Amiga User auch eine aufgepeppte OS 3.1 Version mit vielen Patches nutzte, kann ich nur zu dem Entschluss kommen, da&#223; OS 3.5 und OS 3.9 unter Garantie dazu beigetragen haben, da&#223; das Betriebssystem wieder stabil wird und dazu noch mit vielen optischen Gef&#228;lligkeiten und Komfort gl&#228;nzen kann. Heute m&#246;chte ich OS 3.9, genau wie letztes Jahr OS 3.5, nicht mehr missen und kann das Update auf OS 3.9 allen empfehlen. User, die immer noch OS 3.1. nutzen, bekomen gratis die gesammten Ver&#228;nderrungen von OS 3.5 mit und alle, die schon OS 3.5 nutzen, kann ich auch nur dazu aufrufen sich das aus meiner Sicht gelungene 
Update auf OS 3.9 zuzulegen. In der Praxis hat das AmigaOS dadurch wieder vielen verlorenen Boden gutgemacht und schl&#228;gt einige andere Betriebssysteme in bestimmten Bereichen um L&#228;ngen und braucht sich folgerichtig weder hinter Windows noch MacOS noch Linux verstecken.</P> 

<p>Ach ja, zum Abschluss des Artikels m&#246;chte ich noch anmerken, da&#223; ein erstes Update f&#252;r OS 3.9 schon in der Mache ist und die Workbench komplett Multitasking-f&#228;hig macht - zuk&#252;nftig kann man dann bei jedem Kopiervorgang noch weiter arbeiten und selbst wenn man die rechte Maustaste dr&#252;ckt, friert die WB nicht ein. Ich freue mich schon jetzt auf dieses kostenlose Update - und wer wei&#223;: Wenn sich alle User brav OS 3.9 kaufen und zur Abwechselung mal keine Raubkopien verbreitet werden, bekommen wir vielleicht noch irgendwann OS 4.0 mit dem das AmigaOS anderen Betriebssystemen wieder soweit vorraus ist, wie es OS 1.3 damals im Vergleich zu MsDOS &amp; Co. war. Long Live Amiga!</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
