
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Demons & Wizards: Demons & Wizards</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="GREEN">Demons &amp; Wizards: Demons &amp;
Wizards</FONT></CENTER></h1></P>

Lange Zeit warteten viele Fans gespannt auf dieses neue Projekt von Hansi
K&#252;rsch (Blind Guardian; Vocals) und Jon Schaffer (Iced Earth; Gitarre), die
beide wohl zu den momentan angesagtesten Gr&#246;&#223;en im Power Metal Bereich
geh&#246;ren. Insofern war es nicht weiter verwunderlich, da&#223; sich die Kritiken
im Vorfeld &#252;berschlugen und auch die Werbetrommel ordentlich ger&#252;hrt wurde.
Das dicke Ende aber kommt aber schon bald, denn ich kann beim besten Willen nicht
verstehen, wie diverse Mags diese CD abfeiern. Denn wenn man mal von den
drei herausragenden Songs &quot;Heaven Denies&quot;, dem Blind Guardian &#228;hnlichen
&quot;Blood On My Hands&quot; (Ohrwurm) und dem mit einem m&#228;chtigen Refrain
ausgestatetten &quot;Winter Of Souls&quot; absieht, bietet die CD nichts anderes als
solide Durchschnittsware, die zwar technisch hervorragend umgesetzt wurde (es mangelt
in keinster Weise an den musikalischen F&#228;higkeiten der Herren K&#252;rsch und
Schaffer), aber in keinster Weise herausragend ist - man hat einfach das
Gef&#252;hl, da&#223; die CD so vor sich hin pl&#228;tschert und ehe man sich versieht,
sind die 55 Minuten auch schon wieder um; wirklich herausragendes gibt`s au&#223;er den drei oben genannten Songs nicht mehr.
Ziemlich nervig fand ich auch noch
den viel zu hohen Iced Earth Anteil in Demons &amp; Wizards, denn, wenn man mal
vom Gesang absieht, k&#246;nnte dieses Debut Album auch der Nachfolger zum
letzten Iced Earth Album &quot;Something Wicked This Way Comes&quot; sein. Es sollte
also niemanden wundern, wenn demnach auch die Coverversion &quot;White Room&quot;
(Original von Cream), die &#252;brigens nur auf der Digipack Version zu finden
ist, zu den st&#228;rksten St&#252;cken des Albums z&#228;hlt. Insgesamt muss ich leider
als Fazit festhalten, da&#223; &quot;Demons &amp; Wizards&quot; alles andere als der
langerwartete Kracher geworden ist - vielleicht sollten sich die beiden
Initiatoren des Projekts lieber auf ihre Stammbands konzentrieren, ehe sie die
Metal Gemeinde mit solcher Durchschnittsware begl&#252;cken. Der Vorwurf der
Geldmacherei kommt also nicht von ungef&#228;hr und ich kann nur hoffen, da&#223; ein
eventuelles n&#228;chstes Album die hohe Qualit&#228;t von den Hauptbands Iced Earth
bzw. Blind Guardian erreicht.</P>

Fazit: 5.5 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="cd1.jpg"></P>
<img src="kit.gif"></P></CENTER>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
