
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>News</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="RED">News</FONT></CENTER></h1></P><UL>

<li> Das neue <b>Judas Priest</B> Album, das eigentlich schon f&#252;r Februar angek&#252;ndigt
war, wurde auf den Herbst verschoben. Insbesondere Glenn Tipton musste sich
verst&#228;rkt um seinen schwerkranken Vater k&#252;mmern, was die Verz&#246;gerrung wohl
erkl&#228;rt.</P><BR>

<li> Nichts erfreuliches aus dem Hause <b>Megadeth</B>: Gitarrist Marty Friedman hat
die Band aus freien St&#252;cken verlassen. Als neuer Kandidat ist Al Pitrelli
(<b>Savatage</B>) im Gespr&#228;ch - momentan stehen die Chancen 50 zu 50, ob Al
Pitrelli bei <b>Savatage</B> aus- und bei <b>Megadeth</B> einsteigt. Als weiterer Kandidat
wird Jeff Waters (<b>Annihilator</B>) gehandelt.</P><BR>

<li> Eine der bekannten deutschen Metal Bands aus dem Power Metal Bereich
wechselt nun auch zum deutschen Metal Label Nuclear Blast. Die Rede ist von
niemand geringerem als <B>Helloween</B>. Nach Manowar, HammerFall und Stratovarius sind
Helloween nun das dritte gro&#223;e Highlight bei Nuclear Blast - wenn mir das
einer vor drei Jahren gesagt h&#228;tte (wo Nuclear Blast ausschlie&#223;lich Black
Metal Bands signten), h&#228;tte ich ihn f&#252;r verr&#252;ckt erkl&#228;rt...</P><BR>

<li> F&#252;r den Herbst diesen Jahres ist das neue Album der Epic Symphonic Power
Metal Meister <b>Rhapsody</B> angek&#252;ndigt. Wer sich nicht solange gedulden will,
der schaut sich Rhapsody auf deren Tour Debut als Support von <b>Stratovarius</B>
an.</P><BR>

<li> Komplett aufgel&#246;st haben sich <b>The Sygnet</B>. Grund daf&#252;r waren die &#252;blichen
musikalischen Unstimmigkeiten zwischen den beiden Bandk&#246;pfen Michael Bormann
und Alexander Beyrodt (u.a. <b>Sinner</B>). Letzterer hat aber schon eine neue Kapell namens
Allied Forces am Start, bei denen &#252;brigens <b>D.C. Cooper (ex-Royal Hunt)</B> f&#252;r
Vocals zust&#228;ndig sein wird. Das erste Album soll uns bereits im Fr&#252;hsommer
erwarten.</P><BR>

<li> Die obligatorische Reunion des Monats kommt diesmal von den US Metallern
<b>Liege Lord</B>, die auf dem diesj&#228;hrigen Wacken Open Air spielen werden.
Reformiert hat man sich &#252;brigens im klassischem &quot;Master Control&quot; Line-up.
Mal sehen, ob`s was wird...</P><BR>

<li> Wer noch nicht angeschnallt ist, der halte sich jetzt zumindest fest: <b>Bruce
Dickinson (Iron Maiden)</B> und <b>Rob Halford (ex-Judas Priest)</B> haben einen
gemeinsamen Track eingesungen. Grund daf&#252;r: Beide arbeiten momentan im
selben Studio in L.A. an ihren neuen Solo CD`s (<b>Bruce Dickinson</B> aufgrund
seiner T&#228;tigkeit bei <B>Iron Maiden</B> nur sporadisch) und haben zudem den selben
Producer / Co Songwriter Roy Z. Wo der Track ver&#246;ffentlicht wird, ist noch
nicht ganz klar. Klar ist hingegen, da&#223; die neue Solo CD von <b>Bruce Dickinson</B>
nicht vor 2001 releast wird.</P><BR>

<li> Fans der NWOBHM aufgepasst: &#220;ber Air Raid Records von Meister <B>Bruce
Dickinson</B> wird am 13.3 der komplette <b>Samson</B> Backkatalog (wo <b>Bruce
Dickinson</B> vor seiner Karriere bei <b>Iron Maiden</b> am Mikro stand), der bisher zu
Wucherpreisen auf Plattenb&#246;rsen gehandelt wurde sowie die beiden Sampler
&quot;Metal For Muthas&quot; (u.a. mit <b>Angel Witch, Iron Maiden, Xero</B> etc.) zum
Special Price neu aufgelegt.</P><BR>

<li> Ger&#252;chteweise sollen sich <b>Fifth Angel</B> reformiert haben und bereits die
Arbeit zu einem neuen Album aufgenommen haben. Offiziell best&#228;tigt ist das
zwar noch nicht, aber nachdem es im Metal Markt wieder Geld zu verdienen
gibt, ist nichts mehr ausgeschlossen....</P><BR>

<li> Auf der im Mai erscheinen &quot;Best Of&quot; von <b>Gamma Ray</B> (Dooppel CD) werden auch
zwei neue Tracks von Chef Kai Hansen zu finden sein.</P><BR>

<li><B> Virgin Steele</B> Fans m&#252;ssen sich leider noch etas gedulden: Der zweite Teil
der Metal Oper &quot;The House Of Atreus&quot; wird erst im September und nicht, wie
angek&#252;ndigt, im Sommer erscheinen.</P><BR>

<li> Die Not OP von <b>Death / Control Denied</B> Mastermind
Chuck Schuldiner (Gehirn Tumor) verlief zum Gl&#252;ck ohne Probleme. Wann es
allerdings mit Death bzw. Control Denied weitergeht steht bisher nat&#252;rlich
noch in den Sternen.</P><BR>

<li> Die gro&#223; angek&#252;ndigte <b>Great White</B> Tour musste aufgrund von Krankheit von
Gitarrist Mark Kendall verschoben werden. Die Jungs flogen mit einem
namentlich nicht n&#228;her bezeichneten Aushilfsgitarrist zwar dennoch nach
Europa um die Tour durchzuziehen, allerdings war dieser so schlecht, da&#223;
man frustriert die Tour absagen musste.</P><BR>

<li> Eine &#220;berraschung gab es bei der Schlager Grand Prix Vorausscheidung.
Einige werden jetzt sicherlich sagen: Hat der Kerl `ne Meise? Was suchen
Schlager in der Metal Corner? Tja, ich habe auch nicht schlecht gestaunt,
als die Fun Metaller <b>Knorkator</B> am 18. Februar die B&#252;hne enterten und mit &quot;Ick
wer zun Schwein&quot; (!) eine geniale Performance boten, die den Schlagerfans
aber wohl nicht unbedingt gefallen hat. Na ja, gewonnen haben sie zwar nicht
(wie bekannt sein d&#252;rfte, angelte sich der total trendige [und hoffentlich
bald wieder in der Versenkung verschwundene] Stefan Raab den Titel), aber
dabeisein ist ja bekanntlich alles. Nächstes Jahr entern dann <b>JBO</B> die
Schlagerhitparade...</P><BR>


<li> Eine <b>Steeler</B> Reunion wird es laut <b>Axel Rudi Pell</B>, dessen Solo Karriere
momentan besser als je zuvor l&#228;uft (neues Album:&quot;The Masquerade Ball&quot;
erscheint am 17. April), nicht geben. Aber das haben bekanntlich schon ganz
andere Leute gesagt...</P><BR>

<LI> Daf&#252;r haben sich anscheinend <B>Angel Witch</B> reformiert. Diese spielen n&#228;mlich
recht &#252;berraschend auf dem disj&#228;hrigen Wacken Open Air. Im welchen Line-up
diese Reunion allerdings vollzogen wurde und ob es neue CD`s geben wird (die
dqann hoffentlich nicht`s mit den letzten Werken der Band, sonder eher mit
denen von 1980 zu tun haben) ist bisher noch nicht klar. Wenn weitere Info`s
folgen, wird das nat&#252;rlich an dieser Stelle
erw&#228;hnt....</P><BR></UL>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
