
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Oldie Review: Angel Witch</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER>Oldie Review: Angel Witch`s &quot;Angel
Witch&quot;</h1></CENTER></P>

Nachdem in den letzten beiden Ausgaben mit Iron Maiden und Samson zwei sehr
bekannte Vertreter der NWOBHM in dieser Rubrik vorgestellt wurden, gesellt
sich mit Angel Witch nun noch ein weiterer Vertreter aus dieser Zeit hinzu,
die aber leider das Pech hatten, niemals aus dem Schatten der &quot;Gro&#223;en&quot;
herauszutreten. Und das ganz zu unrecht, wie das zweifelsohne hervorragende
Debut Album beweist.</P>

Angel Wicth haben es n&#228;mlich geschafft auf ihrem selbsbetitelten Debut (1980) 10
gandenlos gute und vor allem zeitlose Heavy Metal St&#252;cke zu schreiben, die
auch 20 Jahre sp&#228;ter nichts von ihrem Flair verloren haben und immer noch
begeistern k&#246;nnen. Insbesondere die offizielle Bandhymne &quot;Angel Witch&quot;, die
zugleich als Opener fungiert, vermag den Zuh&#246;rer unmittelbar in seinen Bann
zu ziehen und zeigt ganz deutlich, da&#223; sich heutige True Metal Formationen
(HammerFall, Scared Steel etc.) ganz deutlich am Sound der NWOBHM
orientieren. Das ist selbstverst&#228;ndlich nicht das einzigste Highlight der
CD: Mit &quot;Free Man&quot;, &quot;Devil`s Tower&quot; und &quot;Gorgon&quot; gibt`s noch drei weitere
klassische Headbangerst&#252;cke, die bisweilen recht ungew&#246;hnlich f&#252;r die
damalige Zeit ausfallen, aber vielleicht gerade deswegen so zeitlos sind.
Da die Original CD aber mitlerweile vergriffen ist, wurde das Debut zusammen
mit 6 Bonus Tracks neu ver&#246;ffentlicht. Und die Bonus Tracks stellen wirklich
eine interessante Zugabe da, da diese sich natlos in die CD einschlie&#223;en und
ebnefalls Heavy Metal vom feinsten bieten. Insbesondere das mgegageile
&quot;Baphomet&quot; sei an dieser Stelle als weiteres Highlight zu nennen. Ach ja:
Die Bonus Tracks sind auch f&#252;r langj&#228;hrige Fans der Band interessant, da es
sich ausnahmslos um rares Material (Single B-Seiten sowie Compilation
Beitr&#228;ge) handelt. Das einzigste kleinere Problem, mit dem dieses Rerelease (1998) zu
k&#228;mpfen hat, ist die Produktion, die man nat&#252;rlich nicht mit heutigen
Ma&#223;st&#228;ben messen kann.</P>

Trotzdem ist die CD ein hervorragender Beweis f&#252;r die Existenz von gutem,
zeitl- und trendlosen Heavy Metal, der auch heute noch zu begeistern vermag
- egla ob es nun Fans von &quot;modernen&quot; Bands wie HammerFall &amp; Co. oder Fans
des klassischen Heavy Metals sind. Das einzigste Problem: Obwohl die Scheibe
1998 rereleast wurde, ist es &#228;u&#223;erst schwierig diese aufzutreiben. Ich habe
sie bisher nur ein einziges mal gesehen und nat&#252;rlich sofort zugegriffen.
Wer in einem Laden mal zuf&#228;llig &#252;ber die CD stolpert kann auf jeden Fall
ohne Bedenken zugreifen!</P>

Fazit: 10 von 10 Punkten </P><CENTER>

<img src="kit.gif"></P>
<img src="oldie.jpg"></P>
<img src="kit.gif"></P></CENTER>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
