<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
3. Vorabbericht: Amiga-Emulator-Paket »AmigaOS XL« (von Michael Christoph)

The next generation

Haage & Partner &uuml;berraschte uns, in der sonst recht ruhigen Sommerzeit, mit
AmigaXL, nachdem kurze Zeit vorher der x86 Emulator Amithlon angek&uuml;ndigt
wurde. Beide werden aber jetzt in einem Paket vertrieben, so da&szlig; jeder
selber entscheiden kann, welchen Emulator er verwendet m&ouml;chte.
Wer Probleme mit seiner &uuml;beralterten Amiga-Hardware hat oder des Wartens
auf einen AmigaOne &uuml;berdr&uuml;ssig ist, hat jetzt die M&ouml;glichkeit, das Original-
Amiga-Betriebssystem auf einem Standard-PC einzusetzen. Was sich genau
hinter AmigaOS XL verbirgt, steht im folgenden Bericht.

Vorbereitung

AmigaOS XL wird in einer DVD-H&uuml;lle mit zwei CDs und Installationsanleitung
geliefert. Als Hardware wird ein Standard-PC mit Pentium bzw. AMD Prozessor
ben&ouml;tigt. 64 MByte Ram, eine Festplatte mit 600 MByte freiem Platz und ein
CD-ROM-Laufwerk sollten bereits vorhanden sein. F&uuml;r Amithlon wird nicht
zwingend eine Festplatte vorgeschrieben, da dieser direkt von CD-ROM
gestartet werden kann.
Bei der Hardware kann es sich auch um einen Laptop handeln - wer schon
immer einen Amiga-Laptop haben wollte, hat jetzt die M&ouml;glichkeit hierzu.
Und dabei kann die Leistungsf&auml;higkeit der Hardware noch frei ausgesucht
werden (je nach Geldbeutel)!
Soll AmigaXL verwendet werden, mu&szlig; dabei allerdings beachtet werden,
da&szlig; f&uuml;r die Hardware bereits Treiber f&uuml;r das QNX Betriebssystem vorhanden
sein m&uuml;ssen. Auf Standard-Komponenten trifft das gr&ouml;&szlig;tenteils zu, ganz
neue Hardware, aber leider auch Laptops mit ihren "Spezialchips" sind
noch nicht so gut versorgt. Hier ist vor einer Neuanschaffung ein Blick
auf http://www.qnx.de anzuraten.

Installation

Unter Windows 95/98 kann QNX als "Datei" innerhalb von Windows installiert
werden, ansonsten ist eine separate Partition zu erzeugen. Die weitere
Installation von QNX ist weitgehendst automatisch. Sind noch andere
Betriebssysteme vorhanden, so kann wahlweise der QNX-Bootloader oder aber
auch lilo (von Linux) zum Einsatz kommen.

Screenshot:
<IMG SRC="../extra/xl_install_qnx.png" ALT="Screenshot">

Nach der Installation ist QNX zu booten und als Benutzer "root" einzuloggen.
Dann kann mittels des Paket-Managers die zweite CD mit AmigaXL
installiert werden.
Das ganze ist auch recht ausf&uuml;hrlich in einer AmigaGuide-Datei auf der CD
vorhanden, welche normal auf dem Amiga angezeigt werden kann (MultiView).
Wer den "neuen Amiga" nicht aus der Console starten will, kann ihn mittels
Shelf auch in die Task-Bar von QNX integrieren oder direkt in den Boot-
Prozess von QNX einbinden (ebenfalls beides beschrieben).

Screenshot:
<IMG SRC="../extra/xl_startleiste.png" ALT="Screenshot">

AmigaXL

AmigaXL basiert auf einem stark erweiterten und fehlerbereinigten UAE-
JIT (Unix Amiga Emulator mit Just in time compiler). Emuliert wird ein
68040 inkl. FPU. Die Arbeitsgeschwindigkeit hingegen ist mit einem Amiga
68060 mit 250 bis 350 MHz zu vergleichen (unter Verwendung eines aktuellen
1 GHz-Prozessors)! AmigaXL &uuml;bertrifft also bei weitem die aktuellen
Amiga-Modelle, auch wenn diese &uuml;ber einen eingebauten PowerPC-Prozessor
verf&uuml;gen.

Screenshot:
<IMG SRC="../extra/xl_wb.jpg" ALT="Screenshot">

Rechenintensive Programme wie PageStream oder Raytracer profitieren hier
sichtbar von den Gigahertz-Takten der PC-CPUs. Als Grafiksystem kommt
Picasso96 (bis 24 bit) und als Soundsystem AHI zum Einsatz. Beide verf&uuml;gen
&uuml;ber spezielle Treiber, die direkt auf QNX aufsetzen und nichts mehr mit
einer simplen Denise oder Paula-Emulation gemeinsam haben. Dadurch ist
nat&uuml;rlich auch der Bildschirmaufbau in hohen Frameraten und die l&uuml;ckenlose
Musikwiedergabe m&ouml;glich. MPEG-Videos abspielen macht damit richtig Spa&szlig;.
Weitere von QNX bereitgestellte Komponenten sind Netzwerk (auch f&uuml;r
Internetzugang) und Joystick. Der Internetzugang kann sogar &uuml;ber T-DSL
erfolgen, da ausgereifte Treiber f&uuml;r QNX vorhanden sind. Als AmigaOS kommt
die unver&auml;nderte aktuelle Version 3.9, allerdings mit zus&auml;tzlichen
Programmen, zum Einsatz. Alle systemkonformen Programme sollten daher
tadellos funktionieren.

Amithlon

Erfreulicherweise bekommt man mit AmigaOS XL auch noch den zweiten neuen
Emulator, genannt Amithlon geliefert! Dieser verwendet einen selbstgebauten
Linuxkernel und kann direkt von CD-ROM gestartet werden. Eine Festplatte
zum Installieren wird also nicht unbedingt ben&ouml;tigt. Technisch wird auch
ein UAE-JIT verwendet, allerdings ohne ECS/AGA-Emulation. Als Grafiksystem
kommt wieder Picasso96 zum Einsatz, diesmal mit bekanntem uaegfx Treiber.
Es wird jede Grafikkarte unterst&uuml;tzt, die per Linux-Framebuffer-Device
ansprechbar ist. Als Workbench kommt auch hier AmigaOS 3.9 zum Einsatz.
Die Geschwindigkeit d&uuml;rfte im Bereich von AmigaXL liegen. Auch hier
besteht noch Steigerungspotential, wenn Treiber nicht mehr emuliert werden,
sondern direkt auf die PC-Hardware zugreifen. Wird ECS/AGA-Ausgabe ben&ouml;tigt
besteht die M&ouml;glichkeit, einen Amiga-UAE zu starten und innerhalb dessen
Umgebung das Programm oder das Spiel auszuf&uuml;hren.

Fazit

Auch wenn QNX ein unbekanntes System ist und nur einen Nischenmarkt
aufweist, ist die Verbindung von AmigaOS Betriebssystem und QNX
"Hardwarelayer" eine unschlagbare Kombinationen. Beide Systeme sind
schlank, schnell und durchschaubar (im Vergleich zu einem anderen,
aufgeblasenen, &uuml;berlasteten und dadurch langsamen Betriebssystem). Vor
allem in Verbindung mit einem Laptop ergeben sich ungeahnte M&ouml;glichkeiten.
Haage & Partner wird allerdings in Zukunft AmigaXL noch weiter ausbauen
und mehr Komponenten von QNX auch der Amiga-Seite zug&auml;nglich machen (z.B.
USB und DVD). Bereits jetzt kann der virtuelle Speicher von QNX im AmigaOS-
XL verwendet werden (konfigurierbar). Damit k&ouml;nnen sich speicherintensive
Programme wie ArtEffect oder Apache richtig "vollsaugen".

Wer nicht extra QNX installieren will oder bei wem aufgrund fehlender
Hardwarekompatibilit&auml;t QNX nicht l&auml;uft, kann auch Amithlon verwenden.
Beide Emulatoren m&uuml;ssen nicht als Konkurrenz betrachtet werden, sondern
k&ouml;nnen, je nach Situation, der eine oder der andere eingesetzt werden.

Erfreulicherweise unterst&uuml;tzen beide Emulatoren direkt das Amiga
Filesystem. Es kann also auch direkt die Amiga-Festplatte angeschlossen
werden, welche automatisch erkannt und eingebunden wird. Vorsicht ist
allerdings geboten, wenn mit angesteckter Amiga-Platte Windows gestartet
wird. Dieses System macht sich wieder alle "Ehre", indem es einfach auf
eine Festplatte mit ihm unbekanntem Filesystem schreibt. Amithlon erkennt
beim Booten automatisch diese Situation und korrigiert den RDB wieder.
Technisch soll in Verbindung mit einer Catweasel-Erweiterng sogar der
Betrieb eines Original-Amiga-Floppylaufwerks am PC m&ouml;glich sein.

Einen Vorteil bringt allerdings nur AmigaXL mit: Die kompletten Sourcen,
inkl. der &Auml;nderungen f&uuml;r QNX sind auf der CD vorhanden. Es besteht also
f&uuml;r jedermann die M&ouml;glichkeit, diese weiter zu verbessern.

Zum Preis von 299 DM (rund 152 Euro) erh&auml;lt man in einer DVD-H&uuml;lle zwei
CDs. Die erste enth&auml;lt QNX in der aktuellen Version 6.1, die zweite enth&auml;lt
beide Amiga-Emulatoren, Kickstart und die Workbench 3.9. Wie es aussieht,
lege Haage & Partner auch noch Programme aus der eigenen Palette bei.
Rechnet man Kickstart (AmigaForever 119 DM) und Workbench 3.9 (89 DM)
heraus, schlagen beide Emulatoren "lediglich" mit 91 DM zu buche.

Wer will sich unter diesen Voraussetzungen noch einen teuren AmigaOne
PowerPC-Rechner kaufen, auf dem nur ein spezielles AmigaOS l&auml;uft, wenn er
ein schnelleres System bereits heute f&uuml;r weniger Geld haben kann?


Weitere Informationen:

http://amigaxl.haage-partner.com, http://www.amithlon.com

Haage & Partner, Schlo&szlig;borner Weg 7, 61479 Glash&uuml;tten
http://www.haage-partner.com

QNX Software Systems GmbH, Am Listholze 76, 30177 Hannover
http://www.qnx.com, http://www.qnxstart.com

Mehr &uuml;ber QNX und dessen Installation:
Amiga Magazin 12/2000, Seite 28, QNX zum Probieren von J&ouml;rn-Erik Burkert
Amiga Magazin 12/2001, Seite 28, QNX zum Zweiten von J&ouml;rn-Erik Burkert

Michael Christoph &lt;michael@meicky-soft.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
