<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
4. Offizielle FAQ (Fragen & Antworten) zu AmigaOS XL

Die folgende Auflistung von h&auml;ufig gestellten Fragen zu den geplanten
Amiga-Emulatoren AmigaXL und Amithlon wurde dem AmigaOS-XL-Bereich der
Haage&Partner-Website (http://amigaosxl.haage-partner.de) entnommen.


»Von Beginn an gab es zu AmigaOS XL bzw. Amithlon und AmigaXL viele Fragen.
Aufgrund der Anfragen von Kunden haben wir diesen Fragenkatalog
zusammengestellt. Er sollte meisten Fragen beantworten. Wenn Sie weitere
Fragen haben, so richten Sie sich an die Diskussionsgruppe, die von uns
regelm&auml;&szlig;ig gelesen wird oder schicken Sie uns Ihre Frage direkt.


1. Welche Grafikkarten werden unterst&uuml;tzt?

Amithlon: Derzeit existiert direkter Picasso96 Support f&uuml;r Matrox- und
nVidia-Karten (noch nicht GForce3!). Weitere Treiber sind in Planung.
Andere Karten werden als VESA-Framebuffer angesprochen, was eine
Vesa2.0-Kompatibilit&auml;t der Karte voraussetzt.

Mit eigenen Picasso96 Treibern sind alle Aufl&ouml;sungen in allen Farbtiefen
die eine Karte anbietet direkt nutzbar.

Wenn die Karte nur &uuml;ber den VESA-Treiber eingebunden wird, steht jeweils
nur eine Aufl&ouml;sung (Einstellbar: 640x480x8,800x600x8,1024x768x8) zur
Verf&uuml;gung.

AmigaXL: &Uuml;ber QNX werden fast alle g&auml;ngigen Grafikkarten unterst&uuml;tzt. Siehe
Hardwareliste


2. Welchen Sound-Support gibt es?

Amithlon: Die Soundausgabe erfolgt &uuml;ber eigene AHI-Treiber. In der
aktuellen Version sind bereits Treiber f&uuml;r AC97 Codecs und SoundBlaster
128 enthalten. An weiteren Treibern wird bereits gearbeitet.

Das Interruptverhalten des Amiga Paula Bausteins wird exakt nachgebildet
wodurch Programm die versuchen direkt auf die nicht vorhandene Hardware
zuzugreifen weiterhin lautlos funktionieren werden.

AmigaXL: Die Soundausgabe wird &uuml;ber eine Paula-Emulation und AHI
abgewickelt, dabei werden &uuml;ber QNX fast alle g&auml;ngigen Soundkarten
unterst&uuml;tzt. Siehe Hardwareliste


3. Welche Drucker werden unterst&uuml;tzt?

Amithlon: Die Druckeransteuerung erfolgt &uuml;ber die Amiga-Software. Daher
funktionieren alle Drucker, die von AmigaOS, TurboPrint oder Studio
unterst&uuml;tzt werden.

AmigaXL: &Uuml;ber QNX werden fast alle g&auml;ngigen Drucker (seriell und USB)
unterst&uuml;tzt. Siehe Hardwareliste


4. Wie funktioniert der Internet-Zugang?

Amithlon: Miami, MiamiDX, AmiTCP und Genesis k&ouml;nnen direkt mit eigenen
Treibern f&uuml;r die seriellen Schnittstellen verwendet werden.

AmigaXL: Es wird der QNX TCP/IP-Stack verwendet. Zudem kann der
QNX-Browser Voyager oder Opera verwendet werden. Dadurch erh&auml;lt man auch
SSL, Macromedia Flash, MPEG, RealAudio, JavaScript und Java-Support.


5. Wie sieht es aus mit Netzwerk-Support?

Amithlon: In der aktuellen Version sind Treiber f&uuml;r beliebige NE2000 PCI
Netzwerkkarten enthalten. Weitere Treiber f&uuml;r 100 MBit Modelle werden
gerade geschrieben.

Die Treiber wurden schon ausgiebig mit allen bekannten Amiga TCP/IP-Stacks
getestet und funktionieren tadellos.

Selbst das Amiga eigene Envoy-Netzwerk l&auml;sst sich ohne Probleme nutzen.

AmigaXL: &Uuml;ber QNX k&ouml;nnen fast alle 10 und 100 MBit Netzwerkkarten (auch
PCMCIA f&uuml;r z.B. Laptops) verwendet werden. AmigaXL bietet
Netzwerkunterst&uuml;tzung f&uuml;r TCP/IP und direkte QNX-Vernetzung im LAN (freier
Zugriff auf alle Resourcen im Netz). Envoy ist leider noch nicht lauff&auml;hig.


6. Werden Modems, ISDN und DSL unterst&uuml;tzt?

Amithlon: Modems die an einer seriellen Schnittstelle angeschlossen sind
k&ouml;nnen direkt verwendet werden. Bei ISDN-Karten werden in der aktuellen
Version Karten mit SIEMENS ISAC-S/HSCX oder Cologne HFC Chips&auml;tzen direkt
unterst&uuml;tzt (z.B. AVM FitzCard-PCI)

AmigaXL: Modems k&ouml;nnen verwendet werden. ISDN ist noch nicht getestet.


7. Welche Prozessoren werden unterst&uuml;tzt?

Generell laufen Amithlon und AmigaXL auf fast allen Prozessoren, doch
gew&auml;hren wir keine Garantie f&uuml;r alles unterhalb von Pentium II (Pentium I,
Pentium MMX, K6, K6-2, Cyrix 6x86). Diese Prozessoren enthalten nicht alle
Befehle und Funktionen, die f&uuml;r die Emulatoren notwendig bzw. n&uuml;tzlich
sind. Die unterst&uuml;tzten Prozessoren sind daher AMD Athlon/Duron und Intel
Pentium II/III/4/Celeron.


8. Welche Festplatten- und Kontroller werden unterst&uuml;tzt?

Amithlon: Eigener "scsi.device" kompatibler Treiber mit voller
Unterst&uuml;tzung f&uuml;r SCSI, IDE und ATA Ger&auml;te; Amiga-Festplatten (IDE oder
SCSI) k&ouml;nnen sofort angeschlossen und direkt gebootet werden.

AmigaXL: Unterst&uuml;tzung f&uuml;r alle g&auml;ngigen SCSI- und IDE/ATAPI-Festplatten
und CD-ROM-Laufwerke. Siehe Hardwareliste


9. Macht es Sinn, Dateisysteme wie FFS zu verwenden?

Amithlon: Es k&ouml;nnen alle Amiga-Dateisysteme (FFS, SFS, PFS) verwendet
werden.

AmigaXL: Man kann alle von QNX unterst&uuml;tzten Dateisysteme (QNX4,
Linux ext2 Version 0 und 1, FAT32) und Amiga Festplatten (Festplatten mit
einem RDB) mit einem beliebigen Amiga Dateisystem (FFS, SFS, PFS)
verwenden.

Das Dateisystem QNX4 ist deutlich sicherer als FFS. Wenn man beide Systeme
parallel verwenden will, sollte man aber ein Amiga-Dateisystem nutzen,
weil nur das von beiden Systemen gelesen werden kann.


10. Gibt es Fax-Support?

Amithlon: Ja, &uuml;ber die entsprechende Amiga-Software.

AmigaXL: Derzeit ist keine Fax-Support m&ouml;glich.


11. Gibt es Support f&uuml;r Scanner?

Amithlon: &Uuml;ber entsprechende Amiga-Software wie ScanQuix oder BetaScan
k&ouml;nnen Scanner direkt angesprochen werden, auch parallel Scanner die
vonScanQuix unterst&uuml;tzt werden funktionieren direkt.

AmigaXL: Derzeit gibt es keinen Support f&uuml;r Scanner. Amiga-Treiber k&ouml;nnen
jedoch relativ einfach auf QNX portiert werden.


12. Kann man MP3, MOV, MPEG, AVI und DVD abspielen?

Amithlon: Mit dem OS3.9 Action-Player lassen sich einfach AVIs abspielen.
F&uuml;r MP3-Dateien steht der Amplifier zur Verf&uuml;gung. MPEG kann mit
Shareware-Programmen wie z.B. Frogger abgespielt werden. Das Abspielen von
DVDs ist prinzipiell m&ouml;glich, allerdings ist wegen der hohen Lizenzkosten
keine Software im Paket enthalten.

AmigaXL: MP3, MPEG k&ouml;nnen mit dem QNX-Mediaplayer abgespielt werden. In
Zukunft kann man auch mit weiteren Abspielmodulen wie AVI und DVD f&uuml;r den
Mediaplayer rechnen. Auf der Amiga-Seite k&ouml;nnen selbstverst&auml;ndlich alle
dort verf&uuml;gbaren Programme eingesetzt werden. Das Abspielen von DVDs ist
prinzipiell m&ouml;glich, allerdings ist wegen der hohen Lizenzkosten keine
Software im Paket enthalten.


13. Kann man ECS/AGA-Software nutzen?

Amithlon: Unter Amithlon sind OCS/ECS/AGA-Grafikmodi &uuml;ber die integrierte
Picasso96 RTG Software auf entsprechende Grafikkartenmodi umgeleitet. F&uuml;r
Software die direkt auf die Grafikhardware zugreift kann Amiga UAE
verwendet werden der volle Kompatibilit&auml;t f&uuml;r alle alten Spiele liefert.

AmigaXL: Im Prinzip ja, doch in der Praxis zeigen sich mehr oder weniger
starke Einschr&auml;nkungen. Es wird nur ECS gut unterst&uuml;tzt. Die
AGA-Unterst&uuml;tzung ist l&uuml;ckenhaft. Siehe Softwareliste


14. Funktionieren CD-Brenner?

Amithlon: Die g&auml;ngige CD-Brenner-Software des Amiga ist direkt nutzbar,
z.B. BurnIT, MasterISO, MakeCD.

AmigaXL: Derzeit ist das Brennen von CDs nicht m&ouml;glich.


15. Gibt es TV-Karten-Support?

Amithlon: Ja, erste Testsoftware samt Beispiel-Sourcecode stehen zur
Verf&uuml;gung.

AmigaXL: Derzeit werden keine TV-Karten unterst&uuml;tzt.


16. Kann ich Videobearbeitungs-Hardware verwenden?

Amithlon: Derzeit gibt es keine Unterst&uuml;tzung f&uuml;r Video-Hardware wie
Genlocks und Schnittsysteme.

AmigaXL: Derzeit gibt es keine Unterst&uuml;tzung f&uuml;r Video-Hardware wie
Genlocks und Schnittsysteme.


17. Kann ich Fusion/iFusion verwenden?

Amithlon: F&uuml;r 68k basierende MAC-Emulatore ist bereits direkter Support in
Amithlon integriert. Ein extra Neustart durch Programme wie RsrvWarm oder
&auml;hnliches entf&auml;llt ganz. ShapeShifter und Fusion wurden erfolgreich
getestet und sind auf modernen Rechnern schneller als der derzeitige
MAC-PPC Emulator auf Amiga Basis.

AmigaXL: Noch nicht getestet.


18. Welche Software l&auml;uft mit Amithlon/AmigaXL?

Wir werden hierzu eine spezielle Liste ver&ouml;ffentlichen. Die Arbeiten dazu
sind im Gange und eine erste Version sollte in den n&auml;chsten Tagen online
gehen. Siehe Softwareliste


19. Welche Geschwindigkeit erreichen man mit Amithlon/AmigaXL?

Wir sind gerade dabei hierzu Werte zu ermitteln. Eine &Uuml;bersicht wird in den
n&auml;chsten Tagen verf&uuml;gbar sein.


20. Brauche ich wirklich eine Kickstart/Workbench-Lizenz?

F&uuml;r jeden Amiga-Computer braucht man eine separate Kickstart- und
Workbench-Lizenz. Daher wird auch f&uuml;r AmigaOS XL bzw. Amithlon/AmigaXL
eine Lizenz ben&ouml;tigt. Das gleiche gilt auch f&uuml;r die Picasso-Lizenz. Die
dem AmigaOS XL beiliegende Version ist zudem eine neue, spezielle Version.
Zudem wird in Amithlon ein speziell angepasstes Kickstart 3.1 verwendet.


21. Wieviel Speicher brauche ich f&uuml;r AmigaOS XL?

Amithlon: Die CPU-Emulation braucht rund 16 - 32 MB Speicher, der Rest
steht dem AmigaOS direkt zur Verf&uuml;gung. Maximal kann unter Amithlon mit
AmigaOS etwa 1 Gigabyte an RAM verwendet werden. Auf entsprechenden
Systemen mit mehr als 128 MByte RAM ist es sinnvoll den f&uuml;r den JIT
reservierten Speicher zu erh&ouml;hen, da je mehr &uuml;bersetzter 68k-Code schon
vorhanden ist, desto schneller rennt das AmigaOS.

AmigaXL: Ab 128MB, 256MB empfohlen.


22. Wie funktioniert die Installation von AmigaOS XL?

Amithlon: Es kann direkt von der CD gebootet werden. Eine Installation des
Emulationskerns auf Festplatte ist m&ouml;glich, aber derzeit nicht vorgesehen.

AmigaXL: Zuerst wird QNX auf einer freien Partition oder innerhalb des
Windows-Dateisystems (als eine gro&szlig;e Datei) installiert. Dann erfolgt die
Installation von AmigaXL. Danach steht AmigaXL direkt zur Verf&uuml;gung.


23. Brauche ich eine neue Partition f&uuml;r AmigaOS XL?

Amithlon: Entweder eine eigene Amiga Festplatte, oder eine spezielle
Partition auf einer PC-Festplatte die als virtuelle Amiga Festplatte mit
eingebunden wird. Auf einer virtuellen Festplatte k&ouml;nnen dann wie gewohnt
&uuml;ber die HDToolbox eigene Partitionen eingerichtet werden.

AmigaXL: Nicht unbedingt. Man kann QNX sowohl auf einer eigenen Partition,
als auch innerhalb des Windows-Dateisystems installieren. Die erste Methode
ist nat&uuml;rlich vorzuziehen.


24. Auf welche Partitionstypen kann AmigaOS XL zugreifen?

Amithlon: Auf alles wof&uuml;r es unter AmigaOS ein Dateisystem gibt. Also
Windows oder DOS Laufwerke k&ouml;nnen direkt &uuml;ber eine Dateisystem wie z.B.
Fat95 aus dem Aminet angesprochen werden.

AmigaXL: Amiga-Festplatten, QNX-, Windows- und Linux-Partitionen


25. Kann ich mehrere Betriebssysteme installieren?

Nat&uuml;rlich k&ouml;nnen auf dem Rechner mehrere Betriebssysteme installiert
werden. Sie m&uuml;ssen dann gegebenenfalls den von uns vorinstallierten
Bootmanager (der die Auswahl des zu startenden Systems &uuml;bernimmt und bei
unseren Komplettsystemen schon komplett installiert ist) &auml;ndern oder durch
einen eigenen ersetzen.

26. Gibt es eine Demoversion von AmigaOS XL?

Nein, derzeit gibt es keine Demoversion von AmigaOS XL. Es ist auch sehr
unwahrscheinlich, dass es jemals eine Demoversion geben wird, denn in dem
Produkt sind sehr viele Lizenzen enthalten (Amiga Inc., QNX, Picasso96 und
weitere Drittanbieter), die nicht einfach kostenlos verteilt werden k&ouml;nnen.
Aus diesem Grund werden wir AmigaOS XL, bzw. Amithlon und AmigaXL auf
verschiedenen Messen und sonstigen Veranstaltungen vorf&uuml;hren.


27. Was bedeutet x86-Code-Optimierung?

Amithlon: Es k&ouml;nnen ganze Programme oder auch nur kleine Rechenintensive
Teile direkt in x86-Code umgesetzt werden. Dies bringt je nach der Art der
Anwendung massive Geschwindigkeitssch&uuml;be.

F&uuml;r Amithlon wird derzeit ein Entwicklerpaket zusammengestellt was anhand
von Programmbeispielen und entsprechender Dokumentation erkl&auml;rt wie man
sehr leicht und einfach Software hierf&uuml;r erstellen kann. F&uuml;r direkte
Anfragen hierzu bitte direkt an borg@vmc.de wenden und ausf&uuml;hrlich
schildern was damit gemacht werden soll, so k&ouml;nnen wir gezielter auf die
jeweilige Anwendung eingehen.

AmigaXL:


28. L&auml;uft PPC-Software auf AmigaOS XL?

Da es sich bei Amithlon und AmigaXL um 68k-Emulatoren handelt, ist es in
der aktuellen Version nicht m&ouml;glich, PPC-Software zu verwenden. In der
Regel gibt es aber von PPC-Software auch eine 68k-Version, die dann mit
h&ouml;herer Geschwindigkeit auf den Emulatoren ablaufen kann. Eine sp&auml;tere
Einbindung durch Software oder entsprechende Hardware kann zum jetzigen
Zeitpunkt noch nicht ausgeschlossen werden.


29. Wird Amithlon oder AmigaXL auf PPC-Rechnern laufen?

Amithlon: Nein, da es keine Leistungsf&auml;higen nicht Appel PPC-Rechner gibt,
und somit kein ausreichend lukrativer Markt hierf&uuml;r existiert.

AmigaXL: Von QNX gibt es in K&uuml;rze eine PPC-Version. Diese ist jedoch nicht
frei erh&auml;ltlich und in erster Linie f&uuml;r den Embedded-Markt gedacht. Dies
zeigt auch die Liste der unterst&uuml;tzten Motherboards. Zudem m&uuml;sste der
Emulator darauf angepasst werden, was nur bei einer hohen Nachfrage nach
einer solchen L&ouml;sung wirtschaftlich vertretbar w&auml;re.


30. Was ist mit AmigaOS 4.0?

Die Planung und Organisation von AmigaOS 4.0 wird von Amiga Inc. geleitet.
Es ist in der Hauptsache die Portierung des bestehenden AmigaOS 3.9 auf
den PPC. Nur wenige neue Komponenten sind bisher daf&uuml;r vorgesehen. Diese
existieren zudem auch in einer 68k-Version und k&ouml;nnten daher auch
problemlos mit Amithlon/AmigaXL verwendet werden. Dies ist aber die
Entscheidung von Amiga Inc.


31. Was ist mit AmigaDE?

Neben dem PowerPC hat Amiga Inc. auch immer wieder den x86 als
Zielplattform genannt. Somit kann AmigaDE auf der gleichen Hardware wie
AmigaOS XL laufen. Das aktuelle ElateOS ist auch unter QNX 4 lauff&auml;hig.
Denkbar w&auml;re daher eine Portierung von ElateOS auf das neue QNX 6.1. Dann
k&ouml;nnte AmigaDE und AmigaXL auch parallel ablaufen. Dies ist eine
Spekulation von uns, denn hierzu haben wir derzeit keine weiteren
Informationen.

32. Wieso sind zwei Emulatoren enthalten?

Die beteiligten Firmen - Amiga Inc., VMC Harald Frank/Bernd Meyer und
Haage&Partner - haben sich dazu entschlossen, nur ein Komplettpaket
anzubieten, um keine Konkurrenz im kleinen Amiga-Markt aufkommen zu
lassen. Zudem hat jeder Emulator seine eigenen speziellen Vorz&uuml;ge und man
kann sich unter Umst&auml;nden nicht entscheiden bzw. wird gar beide Emulatoren
parallel einsetzen wollen. Dies wird alles durch die Zusammenlegung der
beiden Produkte vereinfacht.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
