<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
5. Kommentar zur Ank&uuml;ndigung von AmigaXL & Amithlon (von Thomas Nosutta)

Oder: Warum ich mir einen Laptop kaufen werde!

Nach der Ank&uuml;ndigung von H&P und AMIGA Inc., dass es einen Amiga-Emulator
f&uuml;r x86-Rechner geben werde, entstand ein mittlerer Aufstand in der
Gemeinde.

Warum?

Die Mitglieder der einen Partei freuen sich wie die Schneek&ouml;nige, da sie
dadurch endlich die M&ouml;glichkeit besitzen, ohne Windows einen Laptop mit
AmigaOS zu haben.

Die andere Partei sieht gerade in der Verf&uuml;gbarkeit von Windows auf ALLEN
x86-Rechnern eine potenzielle Gefahr, dass noch mehr Leute dem Amiga
endg&uuml;ltig den R&uuml;cken kehren werden.

Ich lehne die Meinung der zweiten Partei entschieden ab, denn diese
M&ouml;glichkeit hatten/haben wir doch auch ohne AmigaXL/Amithlon. T&auml;glich
verlassen User den Amiga-Markt.

Eher sehe ich in diesen Emulatoren die M&ouml;glichkeit, dass man in der Lage
sein wird, Nicht-Amiga-Kennern die Welt des AmigaOS in Realtime zu zeigen
und dadurch den einen oder anderen auf unsere Seite ziehen zu k&ouml;nnen.

Au&szlig;erdem erm&ouml;glicht es dem Amiga-Verr&uuml;ckten, seinen Lieblingsrechner auch
unterwegs zu nutzen.

Eine potenzielle Gef&auml;hrdung des AmigaOne-Marktes sehe ich durch die
Emulatoren auch nicht, da diese ihn gar nicht tangieren. AmigaOne l&auml;uft
erst ab OS 4.0 und die Emulatoren nur bis OS 3.9.

Da aber die Nutzung des x86 &uuml;ber das Hostsystem (AmigaXL = QNX und Amithlon
= Linux) dem OS 3.9 erm&ouml;glicht, die vorhandene Hardware (Grafikkarte,
Soundkarte, USB usw.) zu nutzen, k&ouml;nnte es dem OS3.9-Markt noch einmal
neuen Schwung geben, indem massenhaft Software erscheint, die vorher durch
die Hardwarebeschr&auml;nkungen nicht m&ouml;glich war. Das k&ouml;nnte wiederum positive
Auswirkung auf den OS4.x-Markt haben, denn warum nicht ein Produkt f&uuml;r OS
4.x umsetzen, wenn es sich schon f&uuml;r OS 3.9 gut verkaufte?

Man sieht also, die positiven Seiten der Emulatoren &uuml;berwiegen gegen&uuml;ber
den vermeintlich negativen: Gr&ouml;&szlig;ere Auswahl an Hardware, gr&ouml;&szlig;ere
M&ouml;glichkeit, Software optimal zu nutzen.

Fazit: Ich pers&ouml;nlich finde, der Amiga-User muss langsam anfangen &uuml;ber
seinen eigenen Schatten zu springen.
Es darf nicht sein, dass wir versuchen, durch das Klammern an veralteter
Hardware den Fortschritt aufzuhalten. Sehen wir die Emulatoren doch eher
als Erweiterung unseres Betriebssystems an, die uns neue M&ouml;glichkeiten
geben wird, uns weiter zu entwickeln. Und den Bonus, auch weiterhin einen
gro&szlig;en Bogen um Windows machen zu k&ouml;nnen! Im Zweifelsfall installiert man
halt PC-Task, PCx oder Fusion und emuliert dann einen PC/Mac auf einem x86-
Amiga. Den einen oder anderen User werden wir vielleicht unterwegs
verlieren, aber einerseits gewinnen wir neue Kenntnisse aus dem x86-
Bereich, andererseits wird dadurch die Wartezeit auf OS 4.x und AmigaDE
angenehm &uuml;berbr&uuml;ckt. Ich jedenfalls informiere mich jetzt schon mal &uuml;ber
den Laptop-Markt auf der Suche nach einem angemessenen Heim f&uuml;r
AmigaXL/Amithlon - und freue mich auf eine angeregte Diskussion innerhalb
der Amiga-Gemeinde.

Der 68k ist tot, es lebe der Amiga.

Thomas Nosutta &lt;Nosutta@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
