<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga Arena News

Amiga Arena - Back in business!
Nach dem Redesign ist die Amiga Arena wieder verst&auml;rkt f&uuml;r Euch aktiv!

Amiga Arena - Sonderpreis Aktion!
In Zusammenarbeit mit Amarpreet Singh Munde erm&ouml;glicht die Amiga Arena eine
Lite Version von DocDatatypes!
DocDatatypes ist ein Set aus Datatypes f&uuml;r DosWord,WinWord,Windows Write,MS
Work und Mac Word!
Die Amiga Arena Lite Version zum Sonderpreis unterst&uuml;zt folgende Formate:
MS-Word(1, 2, 4, 5, 6, 95, 97, 98, 2000)
WordPerfect (4, 5, 6, 7, 8, 9)
Rich Text File(RTF)
MS-Works (3, 4)
Write(3.1)
Pocket Word (1, 2)

Amiga Arena - Reviews!
Testberichte zu den Vollversionen von Action
Cat,Pferderennen,Vokabeltrainer
FLM,F-Base,Stop Men&uuml; und True Paint liegen zum Download bereit!
(Dank an Bernhard M. vom Online magazine "Starmag")


틻miga Arena News
(08.09.2001)

Amiga Arena - Sonderpreis Aktion!
In Zusammenarbeit mit  Ronny Sch&uuml;tz  erm&ouml;glicht die Amiga Arena eine
Sonderpreis f&uuml;r XTrace.
XTrace ist ein Bildverarbeitungsprogramm welches es erm&ouml;glicht, Bilder
die in einem Bitmap-Format vorliegen, automatisch nachzuzeichnen
(zutracen) und dann in einem Vector-Format abzuspeichern.
Dies ist f&uuml;r die Verwendung von Bildern in DTP-Programmen recht n&uuml;tzlich.
Grundkenntnisse von Desktop Publishing, insbesondere Fachbegriffe, sind
notwendig um XTrace ausnutzen zu k&ouml;nnen.
Die Bilder lassen sich vor und nach dem Tracen vielf&auml;ltig bearbeiten um
m&ouml;glichst gute Ergebnisse zu erzielen.
Einige Features von XTrace:
     - Farbver&auml;nderung
     - Digitale Filter Sequenzen
     - Unterst&uuml;tzung von Farbkurven
     - Interne Liste von ca. 400 Farben mit eigenen Namen
     - Histogramm Anzeige, strecken und ausgleichen
     - Konvertierung zwischen verschiedenen Farbtypen
     - M&auml;chtiger Paletteneditor
     - Aspekt / DPI-&Auml;nderung
     - Rotation (3-dimensional)
     - volle Transparenzunterst&uuml;tzung
     - volle ClipBoard.- und XPK-Unterst&uuml;tzung
     - CyberGraphX/Picasso96 Unterst&uuml;tzung
     - voll Screen.- und Fontsensitive Benutzeroberfl&auml;che
Weitere Infos finden Sie unter http://www.groombridge34.de/rschuetz/ -
XTrace.

Durch diese Sonderpreis Aktion besteht die m&ouml;glichkeit dem Entwickler Ronny
S. zu zeigen in wiefern noch Interesse an XTrace besteht!
Ich hoffe auf positives Feedback von Euch!
Vorschl&auml;ge und Feedback bitte an Ronny Schuetz - Ronny.Schuetz@gmx.de


틻miga Arena News
(10.09.2001)

Amiga Arena - Interview Aktion!
Einer der noch wenigen aktiven Entwickler im Kommerziellen Software Markt
ist Felix Schwarz von Innovative, bekannt durch z.b. fxPaint,fxScan und VHI
Studio.
Die Amiga Arena befragte Felix S. zum derzeitigen Stand der Entwicklung
seiner Produkte und deren Zukunft!


틻miga Arena News
(15.09.2001)

Amiga Arena - Sonderpreis Aktion!
In Zusammenarbeit mit Sven Dr&ouml;ge erm&ouml;glicht die Amiga Arena eine
Sonderpreis f&uuml;r "Bonds".
Bonds ist eine Finanzsoftware zur Verwaltung von Wertpapieren aller Art.
Das Hauptaugenmerk liegt hier allerdings bei Aktien. Die Software ist
speziell f&uuml;r den Finanzplatz Deutschland ausgelegt und kommt mit in
Deutschland gehandelten Wertpapieren am besten zurecht, da es das
Wertpapierkennnummernsystem der Deutschen B&ouml;rse nutzt.
Einige Leistungsmerkmale in der &Uuml;bersicht:

* Verwaltung von Objekten verschiedener Kategorien
* Kategorien sind: Aktien, Fonds, Optionsscheine, Indizes oder W&auml;hrungen
* Darstellung der Kursdaten als Linienchart
* Er&ouml;ffnungs-,Schlu&szlig;-, H&ouml;chst- und Tiefstkurse sowie Handelsvolumen
* Verschiedene Chartstufen (gesamt, 30 Tage, 1 Jahr, usw.)
* Verschiedene gleitende Durchschnitte wie 7-,38-,200-Tagelinien
* Frei skalierbare Charts
* Graphische prozentuale Vergleichsfunktion f&uuml;r zwei Charts
* Zeichenfunktion f&uuml;r eigene technische Chartanalysen

Ich freue mich einmal mehr eine Software f&uuml;r den Amiga zum Sonderpreis
anbieten zu k&ouml;nnen die zeigt, das der Amiga weiterhin vielseitige Bereiche
abdeckt!
Olaf K. - Amiga Arena

Amiga Arena - Interview Aktion!
Desweiteren wurde ein ausf&uuml;hrliches Interview mit Sven Dr&ouml;ge dem Entwickler
von Bonds gef&uuml;hrt!


틻miga Arena News
(17.09.2001)

Amiga Arena - Interview Aktion!
Der Entwickler Mario Esper (KidHTML) aus Brasilien stellte sich den Fragen
der Amiga Arena!
Hinweis: KidHTML das exklusiv in der Vollversion in der Amiga Arena
erh&auml;ltlich ist wird weiter entwickelt!
Die Amiga Arena unterst&uuml;zt Mario E. und wer Verbesserungsvorschl&auml;ge oder
Feedback hat m&ouml;ge Sie gerne an iceman@iceman.nu - Mario E. senden.
&Uuml;ber KidHTML:Mit KidHTML lassen sich HTML Seiten ohne Vorkenntnisse
erstellen!


틻Miga ARena News
(20.09.2001)

Amiga Arena Interview Aktion

Radoslav M. Entwickler aus dem Team von "Ablaze Entertaiment" bekannt durch
Spiele wie z.b."Strangers"  (Vertrieb durch Vulcan Software) und einem
Realtime Strategie Spiel f&uuml;r Clickboom,sowie das Programm "ACommander2" f&uuml;r
den Amiga DE/SDK,stellte sich den Fragen der Amiga Arena!
Zur Zeit entwickelt Ablaze Entertaiment nur f&uuml;r den AmigaDE/SDK!


틻miga Arena News
(23.09.2001)

Amiga Arena - Vollversion!
Mit der Genehmigung von Thomas Kessler dem Entwickler von CDBoot und
Richard Small (Vertrieb &uuml;ber die Schatztruhe), erm&ouml;glicht die Amiga Arena
die Freigabe von CDBoot!
Mit CDBoot k&ouml;nnen Sie fast alle CD32 Spiele auf einem A1200/4000 starten.
Hier ein kleiner Auszug aus der Liste mit Spielen die getestet wurden.
(Weitere Informationen finden Sie auf der CDBoot Disk.)

* Arabian Nights - Krisalis - ECS
* Banshee - Core Design - AGA
* Benefactor - Digital Illusions/Psygnosis - AGA
* Brian the Lion - Psygnosis - AGA
* Fire And Ice - GraftGold - AGA
* Gunship 2000 - Microprose - AGA
* Impossible Mission 2025 - Microprose - AGA
* Microcosm - Psygnosis - AGA l&auml;uft leider nur mit PCMCIA CD-Laufwerk
* Rise of the Robots - Mirage - AGA
* RoadKill - Vision - AGA
* Superfrog - Team 17 - AGA
* Super Stardust - Team 17 - AGA
* Tower Assault & Alien Breed II - Team 17 - AGA

Hinweis:
Die Schatztruhe &uuml;bernimmt selbstverst&auml;ndlich keinen support mehr f&uuml;r
CDBoot!
Besonderen Dank an Thomas K. und Richard S. f&uuml;r die Genehmigung!

Amiga Arena - Aufruf!
Die Amiga Arena sucht weitere Software aus dem Haus "Schatztruhe"!
Bereich Shareware/Lowcoast Produkte.
Anwender die noch Produkte von der Schatztruhe besitzen m&ouml;chten sich bitte
mit der Amiga Arena in verbindung setzten.
Entwickler die Ihre Software freigeben m&ouml;chten sowie Kontaktpersonen werden
ebenso gesucht!
Vielen Dank!


틻miga Arena News
(24.09.2001)

Amiga Arena - Interview Aktion!
Die Amiga Arena f&uuml;hrt zur Zeit einige Interviews und es ist immer wieder
Interessant zu  lesen was heute noch die Beweggr&uuml;nde sein k&ouml;nnen f&uuml;r den
Amiga
zu entwickeln!
Diesmal stand mir Sebastian Jedruszkiewicz der Entwickler von
Frogger/Softcinema rede und Antwort!


틻miga Arena News
(26.09.2001)

Amiga Arena - Interview Aktion!
Vor kurzem erschien eine neue Demoversion zum Spiel "DeepSilence - The
Secret of my Soul".
Die Amiga Arena befragte Sylvio Kurze dem Projektleiter
und Artdirector zum "Stand der Dinge"!

Amiga Arena - Aufruf!
Die Amiga Arena sucht die Shareware Version von Uropa2!
Mit der Genehmigung von Austex Software darf die Amiga Arena Uropa2 zum
freien Download anbieten!


틻miga Arena News
(29.09.2001)

Amiga Arena - Interview Aktion!
Janne Jalkanen der Entwickler der Bildverarbeitungs Software "PPT" stellte
sich den Fragen der Amiga Arena und verriet Interessantes &uuml;ber seine
Zukunft
und dem AmigaDE!

Amiga Arena - BladeHD!
Nachdem viele User das RPG Spiel "Blade" vom Mark S. in der Amiga Arena
Version nicht zum laufen bekamen,liegt jetzt die Final Deutsche Version
exklusiv zum Download bereit!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
