<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Neuigkeiten von Airsoft Softwair

Airsoft Softwair (http://www.airsoftsoftwair.de) informiert:

틻uf der Airsoft Softwair Homepage wurde soeben Search v1.2
ver&ouml;ffentlicht. Dieses Programm erm&ouml;glicht es, Textdateien,
speziell aber CD-Kataloge, mit einer kleinen GUI zu durchsuchen.
Dabei ist das Programm so konfigurierbar, dass es z.B. als
Suchprogramm f&uuml;r ganze CD-ROMs verwendet werden kann. So kam
es z.B. auch auf der "The Best Of Airsoft Softwair Gold Edition"
CD-ROM zum Einsatz. Au&szlig;erdem unterst&uuml;tzt das Programm verschiedene
Sprachen und gibt die Suchergebnisse in einer praktisch formatierten
AmigaGuide Datei aus. Search ist Freeware und steht ab sofort
auf der Airsoft Softwair Homepage (http://www.airsoftsoftwair.de/)
zum Download bereit.


틻uf der Airsoft Softwair Homepage wurde soeben LaunchHTML
ver&ouml;ffentlicht. Bei LaunchHTML handelt es sich um ein Programm
welches HTML-Dateien per Doppelklick von der Workbench aus
mit dem Standardbrowser des Amiga-Systems &ouml;ffnet. Dieser Browser
wird dann &uuml;ber die OpenURL Library angesprochen. LaunchHTML
ist sehr n&uuml;tzlich z.B. f&uuml;r CD-ROMs, da die HTML-Dateien direkt
per Doppelklick auf das Piktogramm ge&ouml;ffnet werden k&ouml;nnen. So
kam das Programm z.B. auch schon auf der "The Best Of Airsoft
Softwair Gold Edition" CD-ROM zum Einsatz. LaunchHTML ist
Freeware und kann von der Airsoft Softwair Homepage, wessen Adresse
http://www.airsoftsoftwair.de/ ist, heruntergeladen werden.


틻uf der Airsoft Softwair Homepage wurde soeben PlayMOD
ver&ouml;ffentlicht. Bei PlayMOD handelt es sich, wie der Name
schon erahnen l&auml;sst, um einen weiteren Abspieler f&uuml;r Protracker
und Noisetracker Module, der allerdings prim&auml;r dazu gedacht
ist, Module auf Doppelklick des Piktogramms abzuspielen. Au&szlig;erdem
spielt er auch beliebig gro&szlig;e IFF-8SVX Dateien ab, ebenfalls
auch per Doppelklick auf das Piktogramm. PlayMOD ist deshalb
auch eher f&uuml;r die Verwendung auf CD-ROMs mit MODs vorgesehen
und wurde auch schon f&uuml;r die "The Best Of Airsoft Softwair
Gold Edition" CD-ROM verwendet. Der Player ist schlank,
systemfreundlich und l&auml;uft wahlweise mit oder ohne GUI.
PlayMOD ist Freeware und steht ab sofort auf der Airsoft Softwair
Homepage &lt;http://www.airsoftsoftwair.de/&gt; zum Download bereit.


틻uf der Airsoft Softwair Homepage wurde soeben der
NewInstaller v1.7 ver&ouml;ffentlicht. Diese Version kann
nun erstmals als Ersatz f&uuml;r den Commodore Installer
verwendet werden! Damit wird jede Installation zur
Multimedia Show! Au&szlig;erdem l&auml;uft der NewInstaller jetzt
endlich mit ScalOS! Alle anderen Features wie automatische
Skripterstellung, Onlineregistration, verschiedene
Themen und so weiter sind nat&uuml;rlich auch vorhanden! Der
NewInstaller unterst&uuml;tzt zudem die Sprachen bosnisch,
deutsch, spanisch, tscheschisch, franz&ouml;sisch, italienisch,
ungarisch, schwedisch, norwegisch, finnisch, holl&auml;ndisch,
polnisch, portugiesisch, russisch, slovenisch, t&uuml;rkisch
und nat&uuml;rlich englisch. Das Programm mit dem "beeindruckenden
Konzept" (AmZeiger 6/99) steht ab sofort auf der Airsoft
Softwair Homepage &lt;http://www.airsoftsoftwair.de/&gt; zum
Download bereit. NewInstaller ist Shareware, kostet
aber lediglich 10 DM! F&uuml;r Benutzer der "The Best Of Airsoft
Softwair Gold Edition" CD-ROM steht das Update kostenfrei
im gesch&uuml;tzten Download-Bereich zur Verf&uuml;gung! Wer sich
&uuml;ber NewInstaller informieren m&ouml;chte, kann das nun in
der Rubrik "Produkte" auf der Airsoft Softwair Homepage
informieren, denn diese wurde heute auch um das Programm
erg&auml;nzt (mit Screenshots!). Au&szlig;erdem kann das Keyfile jetzt
auch &uuml;ber RegNet mit Kreditkarte bestellt werden!


틻uf der Airsoft Softwair Homepage (http://www.airsoftsoftwair.de/)
wurden soeben Informationen
und Screenshots zum neuen CD32-Emulator Akiko ver&ouml;ffentlicht.
Akiko l&auml;uft mit Hilfe einer angepassten Version vom WinUAE
unter allen Windows Versionen ab 95. F&uuml;r Besitzer der
"The Best Of Airsoft Softwair Gold Edition CD-ROM" steht eine
erste Version schon zum Download bereit. In dieser Version werden
schon &uuml;ber 80% der CD32 Spiele emuliert inklusive CD Audio und
Joypad Unterst&uuml;tzung.


틻uf der Airsoft Softwair Homepage (http://www.airsoftsoftwair.de/)
wurde soeben das CD32 Games Install Kit v4.5
ver&ouml;ffentlicht. Dies ist die erste &ouml;ffentliche Version
des Programms seit Version 3.9. Bisher waren die
Versionen 4.0 bis 4.5 nur f&uuml;r Besitzer der
The Best Of Airsoft Softwair Gold Edition CD-ROM
zug&auml;nglich, aber jetzt gibt es das InstallKit auch
wieder als Shareware-Programm. Die Demoversion von
Version 4.5 kann ab sofort von der Airsoft Softwair
Homepage (http://www.airsoftsoftwair.de/) heruntergeladen
werden. Seit der Version 3.9 hat sich viel ge&auml;ndert:
So gibt es jetzt auch eine MUI GUI, die Stabilit&auml;t
wurde verbessert und es werden viel mehr Spiele unterst&uuml;tzt,
darunter auch Simon the Sorcerer mit Sprachausgabe.
Auch der integrierte Emulator, der Spiele direkt von der
CD-ROM aus starten kann, wurde vielfach verbessert. Zudem
kann das InstallKit jetzt auch &uuml;ber RegNet (Kreditkarte)
bestellt werden. Auch gibt es nun eine Rubrik &uuml;ber
das InstallKit in der Produkte-Sektion der Airsoft
Softwair Homepage (http://www.airsoftsoftwair.de/).

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
