<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Ist der PowerPC am Ende? (von Carsten Schr&ouml;der)

Ich wei&szlig;, gerade in den Ohren ausgesprochener Fans dieser Prozessorreihe,
die es ja unter den Amiga-Anwendern durchaus gibt, muss diese Frage sehr
provokant klingen, doch meiner Ansicht nach ist es durchaus legitim, sie zu
stellen - und zwar sowohl bezogen auf die Zukunft des PowerPC im Amiga-
Bereich als auch auf die augenblickliche Situation dieser CPU f&uuml;r Desktop-
Rechner allgemein.

Auf der Amiga-Messe in St. Louis, USA, im Fr&uuml;hjahr dieses Jahres hatte
AMIGA, Inc. die Entwicklung einer PowerPC-Version des AmigaOS angek&uuml;ndigt.
Das Ganze sollte unter der Bezeichnung AmigaOS 4.0 im gerade zu Ende
gegangenen Sommer auf den Markt kommen. Dies ist bekanntlich nicht
geschehen, was jedoch im Amiga-Bereich, wo ja kaum ein Produkt zum zun&auml;chst
angesetzten Termin erscheint, nicht verwundern sollte.

Viel erstaunlicher ist es dagegen, dass in den letzten Wochen praktisch
nichts mehr vom AmigaOS 4.0 zu h&ouml;ren war. AMIGA scheint sich mittlerweile
vielmehr voll und ganz auf die Entwicklung des AmigaDE zu konzentrieren,
und j&uuml;ngsten &Auml;u&szlig;erungen von Haage & Partner nach zu urteilen, scheint das
Unternehmen kaum etwas mit der PowerPC-Portierung des AmigaOS zu tun zu
haben.

Das einzige Unternehmen, das in den letzten Tagen etwas zum AmigaOS 4.0
verlauten lie&szlig;, ist Eyetech. Wichtiges hatte man allerdings nicht zu sagen,
es ging im Wesentlichen um den Bootprozess des OS auf der AmigaOne-
Hardware. Offenbar wollte Eyetech der &Ouml;ffentlichkeit auf diese Weise
mitteilen: "Wir sind auch noch da!". Wenig sp&auml;ter versuchte man
schlie&szlig;lich, das versp&auml;tete Erscheinen des PowerPC-AmigaOS zu begr&uuml;nden.
Nur am Rande: Sollte dieses Projekt scheitern, kann Eyetech mit seinem
AmigaOne, der ja auf das AmigaOS 4.0 ausgerichtet ist, im wahrsten Sinne
des Wortes einpacken. Daher ist es nicht erstaunlich, dass dieses
Unternehmen mehr Interesse an dem PowerPC-AmigaOS hat als jedes andere.

Dass dieses Projekt &uuml;berhaupt noch existiert, k&ouml;nnte der eine oder andere
Anwender mittlerweile tats&auml;chlich vergessen haben. Denn in den Medien
spielen seit geraumer Zeit, wenn es um die Nutzung des AmigaOS auf einem
schnelleren Prozessor geht, nur noch die Amiga-Emulatoren Amithlon und
AmigaXL eine Rolle, die beide ausschlie&szlig;lich f&uuml;r x86-Hardware, aber
nicht f&uuml;r PowerPC-CPUs, angek&uuml;ndigt sind.

Aber nicht nur die Amiga-bezogene PowerPC-Situation, auch die fundamentale
Lage dieser Prozessorreihe stellt sich derzeit ung&uuml;nstiger als je zuvor
dar:
In der Frage der Taktfrequenzen &ouml;ffnet sich die bereits seit Jahren
existierende Schere zwischen den PowerPC-CPUs und der x86-Konkurrenz immer
mehr. W&auml;hrend ein aktueller G4 mit etwa 800 MHz "herumkrebst", ist AMDs
Kraftpaket Athlon bereits mit nahezu doppeltem Takt erh&auml;ltlich. Und dessen
direkter Konkurrent Intel hat erst vor wenigen Tagen die 2GHz(!)-Variante
seines Pentium4-Prozessors vorgestellt.

Von Seiten der PowerPC-Fans wird zwar immer damit argumentiert, dass "ihr"
Prozessor bei gleichem Takt aber viel schneller als ein x86-Chip sei. Dies
jedoch ist, zumindest seit es den Athlon gibt, durchaus strittig. Aber
selbst wenn der G4 bei gleicher Taktfrequenz noch die Nase vorn haben
sollte: Sp&auml;testens bei Ber&uuml;cksichtigung des Preis-Leistungs-Verh&auml;ltnis
sieht der PowerPC-Prozessor im wahrsten Sinne des Wortes alt aus.

Und wo liegen die Gr&uuml;nde daf&uuml;r? Entweder haben Motorola und IBM der x86-
Konkurrenz technologisch nichts entgegenzusetzen, oder sie versuchen es -
aus welchen Gr&uuml;nden auch immer - gar nicht erst. Eventuell trifft beides
zu.
Auf der technischen Seite hatte Motorola bei Einf&uuml;hrung des G4 gravierende
Probleme in Zusammenhang mit dessen Fertigung - der Ausschuss war extrem
hoch. Man mag dar&uuml;ber spekulieren oder nicht, aber m&ouml;glicherweise ist dies,
neben der offensichtlichen Schwierigkeit, die Taktraten angemessen zu
erh&ouml;hen, ein weiteres Indiz daf&uuml;r, dass das Hardwaredesign des G4 deutliche
Schw&auml;chen aufweist.

Doch auch die Beziehung der PowerPC-Produzenten Motorola und IBM
unterscheidet sich gravierend von der der x86-Hersteller AMD und Intel:
Letztere bek&auml;mpfen sich mit allen erlaubten Mitteln - gerade im Augenblick
tobt ein regelrechter Preiskrieg -, w&auml;hrend man bei Motorola und IBM den
Eindruck bekommen kann, es handele sich um ein Kartell, in dem wichtige
Details, zum Beispiel die Verkaufspreise, gemeinsam beschlossen werden.
Solche Absprachen sind nicht nur unzul&auml;ssig, sondern f&uuml;hren in der Regel zu
h&ouml;heren Verkaufspreisen und geringerem Fortschritt - also exakt dem, was
wir derzeit im PowerPC-Markt beobachten k&ouml;nnen.
Um jegliches Missverst&auml;ndnis zu verhindern: Ich will den beiden Unternehmen
auf keinen Fall unterstellen, dass sie tats&auml;chlich rechtswidrig handeln, es
geht mir vielmehr darum, m&ouml;gliche Gr&uuml;nde f&uuml;r die schlechte Marktlage der
PowerPC-Reihe zu er&ouml;rtern.

Aber sei es, wie es ist: Es muss etwas passieren - ansonsten ist der
PowerPC bald gar keine Alternative mehr zu den x86-Chips. Bereits jetzt
bleibt Apple keine andere Wahl, als den professionellen Mac-Usern
Multiprozessor-Rechner anzubieten, bei denen jedoch zwangsl&auml;ufig ein Teil
der CPU-Leistung auf der Strecke bleibt. Denn die Gesamtperformance ist bei
einer solchen L&ouml;sung geringer als die addierte Leistung der
Einzelprozessoren, so dass beispielsweise ein Rechner mit einem
(theoretischen) 1,6GHz-G4 schneller w&auml;re als einer mit zwei 800MHz-CPUs
desselben Typs.

Vor einigen Wochen hat eine Online-Publikation gemeldet, dass bald der
"G5", also ein Nachfolger der aktuellen PowerPC-G4-Reihe erh&auml;ltlich sei.
Dabei handelt es sich zwar nur um eine Spekulation, aber wenn diese der
Wahrheit entspr&auml;che, d&uuml;rfte sich die PowerPC-Situation in absehbarer Zeit
kaum verbessern: Demnach seien Prozessoren mit 800 MHz bis 1,6 GHz Takt
geplant - was hie&szlig;e das konkret? Zun&auml;chst w&uuml;rde die 800MHz-Version
erscheinen, nach und nach dann die h&ouml;her getakteten Varianten, und
irgendwann schlie&szlig;lich der 1,6GHz-Chip. Zu der Zeit jedoch d&uuml;rften AMD und
Intel mit ihren CPUs bereits in den oberen 2GHz-, wenn nicht sogar schon in
den 3GHz-Bereich vorgesto&szlig;en sein...

Fazit: Der PowerPC-AmigaOS-Zug scheint sp&auml;testens mit der Ank&uuml;ndigung der
beiden x86-Emulatoren endg&uuml;ltig abgefahren zu sein. Und ob die
Prozessorreihe f&uuml;r Desktop-Rechner insgesamt noch eine Zukunft hat, h&auml;ngt
ausschlie&szlig;lich davon ab, ob IBM und vor allem Motorola sowohl den Preis-
als auch den Leistungsr&uuml;ckstand zu den x86-CPUs bald aufholen k&ouml;nnen. Ich
bin jedoch skeptisch, ob dies &uuml;berhaupt m&ouml;glich ist, und falls ja, ob die
beiden Hersteller auch wirklich die Kraft haben, dies in die Tat
umzusetzen.

Wenn nicht, dann gibt es insbesondere f&uuml;r die Firma Apple, die durch
Microsofts neues, offenbar nahezu makelloses, Betriebssystem Windows XP
zus&auml;tzlich unter Druck geraten d&uuml;rfte, mittelfristig nur zwei Alternativen:
Entweder man erwirbt Motorolas oder IBMs PowerPC-Sparte und k&uuml;mmert sich
selbst um die Weiterentwicklung und Fertigung der Chips, wie bereits vor
einiger Zeit &ouml;ffentlich spekuliert wurde, oder man sucht sich f&uuml;r das MacOS
einen neuen Prozessor - und es ist nicht schwer zu erraten, welche Wahl das
Unternehmen in diesem Fall wohl treffen w&uuml;rde.
Eines n&auml;mlich wei&szlig; auch Apples CEO Steve Jobs: So wie jetzt kann es nicht
mehr lange weitergehen.


Damit bis zur n&auml;chsten Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
