<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Preview: Weltraum-Spiel »Descent: Freespace«

Adel verpflichtet

Hyperion hat die Messlatte f&uuml;r Descent: Freespace selbst hoch angesetzt

Sp&auml;testens seit Heretic II und Shogo z&auml;hlen Spiele von Hyperion zu der
Elite und man erwartet so einiges. Mittlerweile befindet sich Descent:
Freespace in der Betatest-Phase und dies ist nat&uuml;rlich ein Grund, sich
dieses Game einmal n&auml;her anzusehen. Da es sich noch nicht um die Endversion
des Spieles handelt w&auml;re es nat&uuml;rlich zu fr&uuml;h auf irgendwelche technischen
Feinheiten einzugehen. Dieser Bericht dient mehr dazu, euch ein bisschen
neugierig auf das Kommende zu machen. Ihr werdet sehen: Es lohnt sich.

Per Installer l&auml;&szlig;t sich Descent: Freespace bequem auf die Festplatte
bannen, wo es ca. 450-500 MByte Platz veranschlagt. Nat&uuml;rlich dauert dieser
Vorgang einige Zeit, so da&szlig; es sinnvoll ist sich ein (oder zwei) Tassen
Kaffee mit an den Compi zu nehmen. Nachdem man die Seriennummer eingegeben
hat ist es dann endlich soweit, man kann das Spiel starten.
Aber wie bereits bei H2 und Shogo steht auch hier vor dem Vergn&uuml;gen noch
ein bisschen Arbeit und zwar in Form eines Launcher-Programms. Hier lassen
sich alle relevanten Daten so einstellen, da&szlig; das Spiel auf jedem Rechner
das Maximum leistet. Es lassen sich von Grafik &uuml;ber 3D-spezifischen Angaben
und Sound bis hin zum Cache wirklich alle Sachen einstellen. Dies erscheint
am Anfang vielleicht etwas m&uuml;&szlig;ig, aber zum einen kommt man mit der
Standardeinstellung auch schon gut zurecht, zum anderen helfen die
"Bubbles" einem wirklich weiter.

Irgendwann ist es dann soweit: man dr&uuml;ckt auf "Play Freespace" und schon
geht es richtig los. Es erscheint zun&auml;chst das Logo von Hyperion (in
gewohnter Qualit&auml;t) und  dann ein sehr gut gemachter Introfilm, mit dem ein
bisschen auf die Story eingestimmt wird.

Nachdem man sich einen Spieler aus der Liste herausgesucht bzw. einen neuen
generiert hat, kommt man ins Optionsmen&uuml;. Dies ist aufgebaut wie ein Hangar
und beweist schon mal die ungeheure Liebe zum Detail, die in diesem Spiel
steckt.

Grafisch und soundtechnisch wird mal wieder tief in die Trickkiste
gegriffen.

Screenshot:
<IMG SRC="../extra/freespace1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/freespace2.jpg" ALT="Screenshot">

Von hier aus kann man &uuml;berall hingelangen. Wir wollen nicht allzusehr ins
Detail gehen und starten sofort das Spiel. Wer Freespace zum ersten Mal
spielt hat erst einige Trainingseinheiten zu absolvieren, bevor er
in die Schlacht ziehen kann.
Und dieses Tutorial ist wirklich gut gemacht. Der &Uuml;bungsleiter kommuniziert
in deutscher Sprachausgabe mit einem und f&uuml;hrt uns so in die Geheimnisse
der Steuerung ein. Nur wer alle Tests bestanden hat, kann wirklich ins
Spiel gelangen, so kommt nicht gleich am Anfang Frust auf, weil man die
eine oder andere Sache nicht wei&szlig;.
Grafisch und soundtechnisch wird nat&uuml;rlich mal wieder tief in die Kiste
gegriffen und ich kann euch schon jetzt noch nie dagewesene Effekte
versprechen.

Descent: Freespace ist auf dem ersten Blick um einiges komplizierter als
HereticII und Shogo. Dies liegt zum einen daran, da&szlig; es verdammt viele
Flugsimulatorelemente und somit entsprechend viele Tasten zu lernen gibt.
Zum anderen kann man sich vorstellen, da&szlig; die Orientierung im Weltraum
etwas mehr &Uuml;bung bedarf als die pure Aktion am Boden. Daf&uuml;r wird es eine
Unterst&uuml;tzung f&uuml;r Playstation-Controller und PC-Joysticks geben, was
wahrscheinlich gerade den Freunden von Flugsimulatoren gefallen wird.
Hat man sich aber erst einmal in alles hineingedacht - hierf&uuml;r ist das
Tutorial mehr als geeignet - kann man es kaum noch erwarten seine erste
Mission zu starten. Nat&uuml;rlich kann man dies nur dann machen, wenn man
gen&uuml;gend Power unter der Haube hat, aber welche Voraussetzungen genau zu
erf&uuml;llen sind, werden wir dann im ausf&uuml;hrlichen Test untersuchen. Sicher
ist nur eines: man kann nicht genug haben. PPC, Voodoo3, Soundkarte, alles
wird unterst&uuml;tzt. Es ist sogar eine Version f&uuml;r den 060er in der Mache.
Wenn ihr schon einen HighEnd-Amiga zuhause stehen hat, braucht ihr nur
noch eines: Geduld. Denn es wird wohl noch einige Wochen dauern, bis der
Hit in den L&auml;den steht.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
