<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
2. Bericht: »Amiga Forever - nach 6 Wochen...« (von John und Judy Ballant)

Die Leser von AMIGA aktuell konnten k&uuml;rzlich einen Artikel lesen, der sich
mit der Installation von WinUAE befasste. Ich las ihn ebenfalls und er
regte mich dazu an zu versuchen, Amiga aus der Kiste [AIAB.lha = Amiga In A
Box; Archiv im Aminet] mal einfach so auf dem nicht vernetzten Probier-PC
an meinem Arbeitsplatz einzurichten. Das schien zu funktionieren, also
kaufte ich mir die Amiga Forever 4.0 CD und installierte sie auf der
Maschine mit P3 1GHz 256MB 30Gig Geforce2 + Soundkarte, die mein K&auml;tzchen
mir zum Geburtstag geschenkt hatte.

Oh ja, und einen 17-Zoll-Monitor! Unser Amiga-Monitor war aus zweiter Hand,
sehr alt, krank, und eines Tages weigerte er sich, etwas anderes
darzustellen als eine wei&szlig;e Linie quer &uuml;ber den Bildschirm. Als ich den
Fernseher anschlie&szlig;en wollte, drohte mir Judy mit Scheidung! Nicht viel
Auswahl bei einem Aufbau aus CD-32 + SX-1, 10Mb und 3Gig - er hat uns fast
6 Jahre gute Dienste geleistet, aber vielleicht ist doch Amiga Forever das
Richtige.

Die Installation war im Gro&szlig;en und Ganzen dank des Aakt-Artikels und des
Probelaufs auf der Maschine am Arbeitsplatz einfach genug. Das einzige
echte Problem bestand im &Uuml;bertragen der Dateien zum Amiga Forever. Ich
hatte von Floppies genug, also probierte ich es damit, mir selbst Dateien
zuzumailen (langsamer Upload und langsamer Download, aber es geht), FTP zum
Speicherplatz, den mein ISP zur Verf&uuml;gung stellt (fast eben so langsam,
aber es geht) und Amiga Forevers L&ouml;sung Seriell nach Seriell (sehr sehr
sehr langsam, aber es geht und spart Online-Kosten). Die schlaue Art w&auml;re
es, einen Backup der Festplatte auf eine CD-R zu machen (langsam) und sie
&uuml;ber das PC-CD-Laufwerk zu laden (schnell). Leider keine Option mit meinem
Aufbau!

Ich dachte daran, die Amiga-Festplatte zu nehmen und sie in den PC
einzusetzen, um sie von da aus zu lesen, aber das geht offensichtlich
nicht. Wenn jemand w&uuml;sste, wie man ein Amiga-Laufwerk in einem PC lesen
kann, ohne *nix zu installieren, dann h&auml;tte er den richtigen Weg gefunden
(sehr schnell).
Eine Anmerkung zu Amiga Forever's serieller L&ouml;sung, Amiga Explorer. Man
liest, dass man das ohne Monitor erledigen kann, es sei vollst&auml;ndig von der
PC-Seite aus durchzuf&uuml;hren. Wirklich wahr, aber verschrottet den Monitor
nicht, ehe ihr nicht eine Zeile in die User-Startup eingef&uuml;gt habt, um den
Amiga Explorer bei Startup laufen zu lassen, und startet den Miggy immer
als Ersten ...

Wie ist es also, wenn man einen Amiga mit 130 MB Speicher auf einem PC hat?
Fast-RAM zum Wegschmei&szlig;en, aber immer noch nur 8 MB an Chip-RAM. PPaint
wird umsonst mit Amiga Forever geliefert, aber trotz 8 MB Chip-RAM sagt es,
ein 430-KB-JPEG-Bild  - der Scan einer Kreditkarte - sei zu gro&szlig; zum Laden.
PageStream 2.2 l&auml;dt klaglos einen 2-MB-Scan - eine Postkarte in Grauskala -
und zeigt sie an, es dauert etwa eine Minute. Beim Laden eines 24-MB-
Farbscans (DIN-A4-Seite) bleibt der Mauszeiger etwa 15 Minuten "Busy",
weitere 15 Minuten werden zur Darstellung ben&ouml;tigt, und das Gleiche
passiert bei Gr&ouml;&szlig;enver&auml;nderung.

Alte Software l&auml;uft gut, aber schwer arbeitende Anwendungsprogramme haben
nur 020-Tempo. Die Begrenzung des Chip-Memory kann das Problem sein. Das
ist nicht sch&ouml;n f&uuml;r Leute, die einen beschleunigten Amiga gew&ouml;hnt sind. Und
man wei&szlig; ja, dass gerade um die Ecke, nur einen Tastendruck &lt;ALT-TAB&gt;
entfernt, eine schnelle Maschine ist, auf der der Emulator l&auml;uft. Und da
gibt es eine freies Malprogramm, dass dem 600 x 600 dpi-Scanner beigelegt
wurde, als beim Kauf &uuml;ber Preis und Zusatzspeicher verhandelt wurde.
Scanstudio l&auml;dt den 24-MB-Scan in weniger als 15 Sekunden.

Judy und ich hingen sehr an dem Amiga-Schreibprogrammen, die wir 1988 mit
unserem A500 bekommen hatten. Ich verwendete Scribble, ein echte
Antiquit&auml;t, f&uuml;r meine Sachen. Bei Amiga Forever entdeckte ich, dass das
Anklicken der Einstell-Requester von Scribble zu einem Crash f&uuml;hrte. Die
Programmierer m&uuml;ssen die Kurven extrem scharf gekratzt haben, was zwar beim
echten Amiga mit OS3.1 noch nicht auffiel, aber mit Amiga Forever ist
Scribble nicht zu gebrauchen.

Judy schreibt viel mehr als ich, und sie hat immer das doch schon etwas
alte KindWords3 verwendet. Haupt-Anreiz ist der Schnelldruck - der Text
wird dem Drucker &uuml;bergeben, der es mit seinem internen Font druckt. Amiga
Forever hat keine Druckereinstellung, man muss sich seine eigene Routine
zusammenbasteln. Mit &lt;ALT-TAB&gt; muss man hin&uuml;ber zur Windows-Seite wechseln
und dort ein neues Verzeichnis "AmigaSpool" im Stamm-Verzeichnis anlegen.
Wenn man dann von Amiga Forever aus drucken will, wird der Job in dieses
Verzeichnis umgeleitet. Dann muss man wieder mit &lt;ALT-TAB&gt; r&uuml;ber gehen und
die Batchdatei, die Amiga Forever dahin gesandt hat, starten, um die
Geschichte zu drucken. Die Batchdatei gibt aber eine Fehlermeldung aus und
verweigert die Arbeit. Auf der Webseite von Cloanto findet man die L&ouml;sung:
Die Batchdatei ist im Amiga-Textformat gespeichert, sie muss erst erneut im
PC-Textformat gespeichert werden.
Wir haben das getan und es hat funktioniert.

Aber ich habe mir nicht die M&uuml;he gemacht, Judy &uuml;berhaupt zu erz&auml;hlen, dass
es so geht, denn sie verwendet es sowieso nicht. Dr&uuml;ben bei Windows gibt es
einfache Textverarbeitungen, die aus dem Men&uuml; heraus drucken. Judy ist
nicht mehr bei Amiga. Ich verwende das mitgelieferte TurboText f&uuml;r einige
Dinge und nat&uuml;rlich YAM. Aber ich habe auch die freie Windows-Version von
StarOffice von Sun (90 MByte...) heruntergeladen, welches PageStream auf
Amiga Forever doch alt aussehen l&auml;sst. Wem das als Download zu viel
erscheint, der sollte es sich im Gesch&auml;ft auf CD f&uuml;r 99 australische Dollar
($Aus1 = US50c) besorgen, oder er sollte die Augen offen halten, vielleicht
findet er es auf der Coverdisk eines PC-Magazins.

Text und Grafik sind also nicht mehr bei Amiga. Wie steht es mit dem
Internet? Auf den Maschinen im Gesch&auml;ft ist Outlook Express die einzige
Wahl, und ich kann es nicht leiden. Und ich mag auch nicht all diese
Outlook-E-Mail-Viren, die heute so beliebt sind. YAM l&auml;uft wie geschmiert
mit Amiga Forever, und ich lasse mich von den gelegentlichen Holperern beim
Herunterladen nicht aus der Ruhe bringen, vor allem, weil ich bef&uuml;rchte,
dass sie durch die miserable Telefonleitung verursacht werden, die in die
neue Wohnung f&uuml;hrt, in die wir k&uuml;rzlich eingezogen sind. Wenn ADSL jemals
billig genug wird, wird dieses Problem auch gel&ouml;st sein.

Browser habe ich beiseite geschoben. Ich hatte Voyager auf dem Amiga, aber
mit IE im Gesch&auml;ft habe ich endlich Internet-Banking geschafft. Und Voyager
m&uuml;sste auf Amiga Forever in einem Hardfile laufen. Ich bin einfach zu faul,
um heraus zu bekommen, wie ich einen Browser installieren soll, der doch
nicht tut, was ich will, wenn nur einen &lt;ALT-TAB&gt;-Tastendruck weit weg IE
schon installiert ist und der viel mehr kann (mein Mitgef&uuml;hl gilt Matt
Sealey).

Die meisten Leute haben ein paar Amiga-Spiele, mit denen sie ihren Spa&szlig;
hatten, wie werden die also unter Amiga Forever laufen? Nun, Freecell f&uuml;r
den Amiga ist der Windows-Version meilenweit voraus und l&auml;uft fr&ouml;hlich auf
Amiga Forever.

Aber dann sieht es tr&uuml;be aus. Zum Beispiel Judys Lieblingsspiel: Diamond
Caves. Die Grafik bricht bei Amiga Forever auseinander. Aber kein Problem,
der Autor hat eine Windows-Version herausgegeben (und dazu ein paar Gruppen
mehr mit Leveln, die wir noch nicht hatten), welches traumhaft auf der
Grafikkarte l&auml;uft. Judy ist gl&uuml;cklich.

Ich mag Deluxe Galaga, das Sprite-Erkennung verwendet, und das wird nur
recht wacklig von Amiga Forever unterst&uuml;tzt. Auch gut, der Autor entwickelt
gerade eine spielbare Windows-Version, aber, wie gesagt, noch in
Entwicklung.

Wir spielen das Kartenspiel Bridge. Die Entwicklung der Bridge-Programme
f&uuml;r den Amiga h&ouml;rten 1991 mit einem halbherzigen Versuch im Aminet auf.
Ganz gut in einige Punkten, aber nicht in anderen, wie zum Beispiel Online-
Spiel. Auch hier kein Problem, gleich hinter der &lt;ALT-TAB&gt;-Taste ist ein
f&uuml;r unsere Zwecke fast perfektes PC-Bridge-Programm.

Und dann entdeckt man die "Back to the Roots"-Website. Alle diese alten
Amiga-Spiele stehen bereit zum Download und zum Start. Auch die Mame-
Webseiten bieten einiges an Ablenkung. Die ganzen Arkade-Spiele, die man so
gern hat. Und man findet auch die Gebrauchtwaren-L&auml;den f&uuml;r PC-Spiele mit
alle Sorten von anderen billigen Spielen, die man ausprobieren kann.

Joysticks funktionieren mit Amiga Forever, aber PC-Joysticks sind aus
Tradition analog. Analoge Joysticks sind gut f&uuml;r Flugsimulatoren, aber kaum
geeignet f&uuml;r Arkade-Spiele im Amiga-Stil. Ein paar Deutsche haben dieses
Problem gemeistert und den PC-Competitor gebaut, einen Adapter f&uuml;r 40 US-
Dollar, mit dem man einen Amiga-Joystick in einen PC st&ouml;pseln kann. Wie gut
f&uuml;r uns - wir haben eine Schachtel mit 5 neuen Speedkings im Schrank
stehen.

Aminet-CDs arbeiten mit dem Emulator zusammen, man muss nur ein Assign
setzen, wenn man die Find-Funktion anwendet. Und Amiga Forever enth&auml;lt
Directory Opus. Dopus hat mich schon mehrfach vor dem Ausflippen gerettet,
besonders, weil es einen vom Amiga Forever auf die Windows-Seite bringen
kann. Windows Explorer ist ein hoffnungsloser Fall f&uuml;r die Sachen, die man
mit DOpus leicht machen kann. GPSoft hat das offenbar erkannt, denn DOpus
5.0 f&uuml;r Windows wurde gerade ver&ouml;ffentlicht...

Also, Amiga forever [f&uuml;r immer]? Einige Amiga-Programme starten durch mit
fliegenden Fahnen, aber gibt es genug, um uns von der viel weiteren Welt
von Windows fern zu halten? Wenn man f&uuml;r immer bei Amiga bleiben will,
braucht man zwei vernetzte Maschinen: Einen beschleunigten Amiga und einen
schnellen PC. Man muss sich an zwei Tastaturen gew&ouml;hnen, weil man von einem
Rechner zum anderen h&uuml;pfen muss.

Ein PC mit Amiga Forever schafft das nicht!

John and Judy Ballant &lt;jballant@smartchat.net.au&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
