<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Halford: Resurrection</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><Font color="green">Halford: Resurrection</Font></center></h1></P>

<p>Rob Halford, seines Zeichens ehemaliger S&#228;nger bei der britischen Heavy Metal Legende Judas Priest, will es offenbar mit &quot;Resurrection&quot;, seinem neuesten Studio Output, nochmal wissen. Nachdem er in der nahen Vergangenheit mit seiner Band &quot;Fight&quot; und dem Industrial Projekt &quot;Two&quot; sowie diversen Aussagen in Interviews dem klassischen Metal eher kritsich gegen&#252;berstand, ist er mit &quot;Resurrection&quot; nun endlich wieder zu seinen Wurzeln zur&#252;ckgekehrt und liefert sein erstes richtiges Metal Album nach Priest`s &quot;Painkiller&quot; (1990) ab. Schon nach dem ersten Durchlauf wird klar, da&#223; es der Metal Gott nochmal wissen will, denn die Songs knallen ohne Ende und z&#252;nden sofort. Beispiele gef&#228;llig? Der Titeltrack und gleichzeitige Opener &quot;Resurrection&quot; f&#228;llt recht heftig aus und h&#228;tte, ebenso wie &quot;Night Fall&quot;, durchaus auf &quot;Painkiller&quot; stehen k&#246;nnen und beweist zudem eindrucksvoll, da&#223; Halford`s 
Stimme, nach der Beinahe-Vergewaltigung &quot;Voyeurs&quot; von Two, so gut ist wie eh und jeh - selbst die hohen Kreischpassagen bekommt der 
Meister immer noch so gut wie seinerzeit bei Judas Priest hin. Weitere Vergleiche mit Judas Priest sind nat&#252;rlich auf &quot;Resurrection&quot; keine Seltenheit und so jagen einem Songs wie der Ohrwurm &quot;Made In Hell&quot; und &quot;Cyberworld&quot; einen Schauer nach dem anderen &#252;ber den R&#252;cken - nicht selten glaubt man, einen der alten Priest Klassiker in etwas modernerer Form um die Ohren gepustet zu bekommen. Highlight dieser CD ist aber ohne Frage &quot;The One You Love To Hate&quot;, den Rob Halford zusammen mit Bruce Dickinson (Iron Maiden) komponiert und eingesungen hat, was sich einfach unbeschreiblich anh&#246;rt und mal eben als einer der besten Songs dieses Jahrgangs durchgeht. Und da wir gerade bei Bruce Dickinson sind: Roy Z., der schon Bruce Dickinson in dessen Solokarriere wieder auf die Beine geholfen hat, ist auch ma&#223;geblich an &quot;Resurrection&quot;, und zwar als Songwriter und Producer, beteiligt und verpasste der CD einen wirklich spitzenm&#228;&#223;igen Sound, 
wobei er nat&#252;rlich einen gro&#223;en Wert auf einen modernen Gitarrensound gelegt hat. Viele Worte muss ich wohl jetzt nicht mehr &#252;ber &quot;Resurrection&quot; verlieren, oder? Neben dem Iron Maiden Comeback ist &quot;Resurrection&quot; die f&#252;r mich zweitbeste Platte im klassichen Metal Bereich in diesem Jahrgang und wenn Judas Priest bald mit einer neuen CD r&#252;berkommen, werden sie es verdammt schwer haben, gegen &quot;Resurrection&quot; anzustinken. Top!</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P></Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
