<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Labyrinth: Sons Of Thunder</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><Font color="green">Labyrinth: Sons Of Thunder</Font></center></h1></P>

<p>Labyrinth geh&#246;rten f&#252;r mich bisher, neben Rhapsody, zu dem Aush&#228;ngeschild des italienischen Power Metals. Was sich die Jungs aber bei &quot;Sons Of Thunder&quot; gedacht haben, wird mir wohl f&#252;r immer schleierhaft bleiben, denn im Gegensatz zu all den guten Kritiken, die die CD bisher so bekommen hat, bin ich vom neuesten Werk der Band wirklich gnadenlos entt&#228;uscht. Zwar ist die Band ihrem Stil (epischer Power Metal) treu geblieben, aber Ohrw&#252;rmer oder so ausgereifte Songs wie auf dem letzten Album &quot;Return To Heaven Denied&quot; (1998) muss man bei &quot;Sons Of Thunder&quot; wirklich mit der Lupe suchen und wird selbst dann nicht f&#252;ndig. Die CD pl&#228;tschert die gesamten 50 Minuten total belanglos vor sich hin und wird obendrein noch von Minute zu Minute langweiliger und h&#228;ngenbleiben tut im Ohr wirklich absolut gar nichts - alles wirkt total &#252;berfl&#252;ssig und blutleer. Einzigste positive Ausnahme ist der Ohrwurm &quot;Save Me&quot;, den man aber bezeichnenderweise schon vor &#252;ber einem Jahr (!) auf einer EP verbraten hatte und der zu allem &#220;berfluss f&#252;r das neue Album nochmal neu eingespielt wurde - wohl &#252;berfl&#252;ssig zu erw&#228;hnen, da&#223; das Original auf &quot;Timeless Crime&quot;(so der Name der EP), welches rund eine Minute k&#252;rzer ausgefallen ist, einen ganzen Zacken besser war. Zudem leidet das komplette Album unter einer total schwachen Produktion, die im Grunde das ohnehin schon schwache Songmaterial noch weiter verw&#228;ssert und sich dem allgemeinen Niveau der Platte, bei dem das peinliche Cover leider auch keine Ausnahme macht, anpasst. Ich muss wirklich sagen, da&#223; sich Labyrinth mit &quot;Sons Of Thunder&quot; keinen Gefallen getan haben, denn Songs wie &quot;Chapter 1&quot;, &quot;Elegy&quot; oder &quot;Touch The Rainbow&quot; (beliebig gegen weitere Songs austauschbar) h&#228;tte ich Labyrinth bis zum Kauf dieses Albums wirklich nicht zugetraut. F&#252;r Fans gibt es jetzt zwei Alternativen: Entweder Ihr kauft euch das Album und werdet wohl eine der Entt&#228;uschungen dieses Jahres erleben oder Ihr spaart euch das Geld und investiert es in eine der zahlreichen anderen italienischen Bands wie &quot;Sigma&quot; oder &quot;Drakkar&quot;, die einen &#228;hnlichen Sound wie Labyrinth fahren und die mir mit ihren letzten Releases sehr viel besser gefallen haben, als Labyrinth. Sorry Jungs, aber f&#252;r mich ist &quot;Sons Of Thunder&quot; ganz klar bisher die Entt&#228;uschung im Jahre 2000!  </P>

<p>Fazit: 1 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P></Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
