<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Symphorce: Sinctuary</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><Font color="green">Symphorce: Sinctuary</Font></center></h1></P>

<p>Das 1999 ver&#246;ffentlichte Debut &quot;Truth To Promises&quot; lie&#223; ja schon erahnen, da&#223; Symphorce eine Combo sind, mit denen man auf jeden Fall rechnen muss. Das es allerdings nur ein Jahr dauern w&#252;rde, bis uns die Mannen um Ex-Ivanhoe S&#228;nger Andy B. Franck, der zugleich auch bei Brainstorm f&#252;r die Vocals verantwortlich ist, mit einem neuen Album begl&#252;cken w&#252;rden, h&#228;tte zumindest ich nicht gedacht. Und was soll man gro&#223; sagen? Symphorce haben sich merklich weiterentwickelt, pr&#228;sentieren sich mit einem neuen, sehr versierten Klampfer als Einheit und dementsprechend genial klingt auch das neue Album &quot;Sinctuary&quot;, das man sich grob als Melodic Metal Album mit einer gewaltigen Power Metal Schlagseite sowie einigen wenigen progressive Elementen mit teilweise modernen Soundeffekten vorstellen kann. Die Songs haben es auf jeden Fall in sich: Neben grandiosen und vor allem klischeefreien Power Metal Perlen der Marke &quot;Holy Sin&quot; und &quot;Eye Of Horus&quot;, die nicht selten an Metal Church zu ihren besseren Zeiten oder die alten Savatage erinnern, beweist die Band mit &quot;Until The Last&quot;, da&#223; man auch ein gutes Gesp&#252;r f&#252;r Ohrw&#252;rmer besitzt. Zudem wartet &quot;Sinctuary&quot;, zumindest in der Limited Edition, mit zwei Bonustrack auf, von denen einer das Powermad Cover &quot;Nice Dreans&quot;, welches man hervorragend umgesetzt hat, ist. &#220;ber dem 
alles steht die superbe Stimme von Andy B.Franck, der ja schon bei Brainstorm zeigte, was er alles auf dem Kasten hat und f&#252;r mich, neben Henning Basse (Metalium), zu den hoffnungsvollsten Metal Shoutern im Moment geh&#246;rt und nicht selten an Bruce Dickinson (Iron Maiden) erinnert. Dazu kommt eine richtig fette Produktion, die nat&#252;rlich vor Power nur so strotzt,  und f&#252;r die sich niemand geringeres als Achim K&#246;hler (u.a. Primal Fear) verantwortlich zeichnet - Ehrensache, da&#223; die Produktion dem Album den letzten Schliff verpasst hat. Insgesamt ist &quot;Sinctuary&quot; ein sehr ausgereiftes Power Metal Werk geworden, welches zudem durch seinen recht eigenen Stil Pluspunkte sammeln kann und mich vom Anfang bis zum Ende vollkommen &#252;berzeugt hat - Schwachpunkte sucht man hier wirklich vergeblich und insofern kann ich Power Metal Fans diesen klischeefreien Opus bedenkenlos empfehlen. Lohnt sich total!</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P></Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
