<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="red">Newsflash</Font></center></h1></P><ul>
<p><li> Die traurige Nachricht zuerst: Nachdem im Internet monatelang Ger&#252;chte kursierten, nach denen sich die brasilianischen Power Metaller <b>Angra</B> (einer meiner pers&#246;nlichen Faves!) aufl&#246;sen, so ist es jetzt wohl sicherer Fakt, da&#223; S&#228;nger Andre Matos, Basser Luis Mariutti und Drummer Ricardo Confessori die Band mit unbekantem Ziel verlassen haben. Die beiden &#252;brig bleibenden Gitarristen Kiko Loureiro und Rafael Bittencourt wollen aber trotzdem unter dem Namen <b>Angra</B> weitermachen. Sehr schade, denn die Jungs waren wirklich hervorragend und h&#228;tten mit dem n&#228;chsten Album den Sprung nach ganz oben locker schaffen k&#246;nnen...</LI></P>

<p><li> Im <b>Blind Guardian</B> Camp war es in den letzten Monaten erstaunlich still. Hansi K&#252;rsch meldete sich vor kurzem im Internet zur&#252;ck und lie&#223; u.a. durchblicken, da&#223; die Band definitiv im Oktober in`s Studio geht und das neue, noch unbetitelte Langeisen, welches von Charly Bauernfeind produziert wurde, zwischen Mai und Oktober 2001 erscheinen soll. So lange m&#252;ssen wir uns also noch gedulden...</LI></P>

<p><li> Unter dem Namen <b>Avantasia</B> wird Anfang 2001 die Metal Oper von <b>Edguy</B> S&#228;nger <b>Tobias Sammet</B> ver&#246;ffentlicht, auf der sich an Prominenten u.a. Kai Hansen &amp; Henjo Richter (beide Gamma Ray), Andre Matos (ex-Angra), Markus Grosskopf (Helloween), David DeFeis (Virgin Steele) und Michael Kiske (ex-Helloween) die Ehre geben. </LI></P>

<p><li> Wo wir gerade bei <b>Michael Kiske</B> sind: Der ehemalige <b>Helloween</B> Shouter hat eine neue Band samt Europa Vertrag f&#252;r drei Alben am Start und will wieder h&#228;rter zu Werke gehen, wobei er allerdings auch ausschlie&#223;t, in die alte Helloween Richtung zu gehen. </LI></P>

<p><li> Die Fun Metaller<b> J.B.O.</B> sind vorerst zum Duo geschrumpft, denn Schmitti und Holmer haben die Band verlassen, wobei das neue Album &quot;Sex, Sex, Sex&quot; (V&#214;: 6 November) noch gemeinsam eingespielt wurde. Derweil sucht der verbliebene Rest der Band nach neuen Mitstreitern.</LI></P>

<p><li> Die schwedische Formation <b>Drain</B>, eine Band die stark an Alice In Chains erinnert, hat sich nach nunmehr zwei Alben aufgel&#246;st.</LI></P>

<p><li><b> Primal Fear</B>, die Band um ex-Gamma Ray S&#228;nger Ralf Scheepers und Sinner Mastermind Mad Sinner, sind momentan mit den Aufnahmen zu ihrem mitlerweile dritten Album mit dem Titel &quot;Nuclear Fire&quot; besch&#228;ftigt. Ferner nimmt man noch einen Song f&#252;r eine Thin Lizzy Tribut Scheibe auf.</LI></P>

<p><li> Das neue Album der Melodic Rocker <b>Narnia</B> wurde auf den Fr&#252;hjahr 2001 verlegt, da das neue Material wohl komplexer ausgefallen ist, als bisher angenommen. Zus&#228;tzlich haben die Jungs auch noch ein bi&#223;chen am H&#228;rtegrad gefeilt, so da&#223; uns mit Sicherheit ein h&#228;rteres Album als der gutklassige Vorg&#228;nger &quot;Long Live The King&quot; erwarten wird.</LI></P>

<p><li> Bei <b>Nashville Pussy</B> ist die Bassistin Corey Parks aufgrund von zu massiven Drogenexessen rausgeflogen. Kurzfristiger Ersatz wurde in Person von Tracy Almazon gefunden, die ansonsten auch noch bei Helldorado in Lohn und Brot steht.</LI></P>

<p><li> Der <b>Iron Maiden</B> Ur-S&#228;nger <b>Paul Di`Anno</B> (sang die ersten beiden Iron Maiden Longplayer ein) ist offenbar nicht totzukriegen: In den USA brachte der sympathische Shouter vor kurzem seine neue Soloplatte &quot;Nomad&quot; (bemerke: Ein Track mit dem Titel &quot;The Nomad&quot; befindet sich auch auf dem neuesten Opus von Iron Maiden) heraus - bleibt nur zu hoffen, da&#223; das Qualit&#228;tslevel &#252;ber dem seiner letzten europ&#228;ischen Releases wie etwa &quot;The World`s First Iron Man&quot; liegt....</LI></P>

<p><li> Die diesmonatige Reunion stammt aus dem Lager von <b>House Of Lords</B>, die sich wohl zusammenraufen und demn&#228;chst ein neues Langeisen einspielen wollen. Produziert werden soll selbiges von <b>John Purdell</B>, der auch schon f&#252;r Dream Theater und Ozzy Osbourne hinter den Reglern stand. </LI></P>

<p><li> Schon kurz nach dem Release ihres ersten Albums &quot;Fireball&quot; gibt`s bei der True Metal Formation <b>Stormhammer</B> schon einen ersten Wechsel: Am Mikro steht von nun an Tommy Lion, der den ausgestiegenen Michael Schinkel ersetzen wird. Tommy Lion war vorher bei der Metalband Drifter t&#228;tig, die auch schon mit <b>Manowar</B> auf Tour waren. </LI></P>

<p><li> Mal kurz was aus dem Bereich Labels: Unter dem Namen <b>The Metal Society</B> werden von nun an die beiden deutschen Labels <b>Omega Records</B> und <b>B.Mind Records</B> ihre Energien b&#252;ndeln und die Metal Community weiter mit erstklassigen Releases erfreuen. Nebenbei gibt`s noch einen kostenlosen Promo Sampler, der auf 15.000 St&#252;ck limitiert ist und insgesamt 15, durchweg hochwertige Tracks der Metal Society enth&#228;lt. Dieser wird bei diversen Metal Veranstaltungen kostenlos verteilt - genaue Dates gibt`s auf der Homepage <a href="http://www.omegarecords.de" target="_blank">(www.omegarecords.de)</A>. Wer den Sampler nicht ergattern kann, der kann auch 4 DM in Briefmarken an <b>Omega Records</B> schicken und bekommt das tolle Teil dann frei Haus - eine gelungene Aktion wie ich finde!</LI></P>

<p><li> In Sachen <b>Van Halen</B> gibt`s immer noch keine klaren Infos: Ger&#252;chten zufolge arbeitet man mit dem (angeblich) zur&#252;ckgekehrten S&#228;nger <b>David Lee Roth</B> an einem neuen Studioalbum, welches bis zum Winter in trockenen T&#252;chern sein soll. Allerdings sind diese Info`s mit sehr viel Skepsis zu genie&#223;en - ob was dran ist, werden wir die n&#228;chsten Monate wohl erfahren! </LI></P></UL>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
