<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Oldie Review: Angra`s Angel`s Cry</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="gray">Oldie Review: Angra`s Angel`s Cry</Font></center></h1></P>

<p>Der sympathische F&#252;nfer, der sich leider vor kurzem mehr oder minder aufgel&#246;st hat, legte 1993 mit &quot;Angel`s Cry&quot; sein Debutalbum vor, welches den Weg in eine vielversprechende Zukunft ebnen sollte, die leider viel zu fr&#252;h im Sande verlief, was aber sicherlich nicht mit der musikalischen Klasse der Band zu tun hatte. Wer denkt, da&#223; Angra einer der vielen Power / Progressive Kapellen sind, die heute den Markt mit viel zu vielen Releases &#252;berfluten, der sollte sich mal vorliegendes Debut oder einen der beiden Nachfolger (&quot;Holy Land&quot; oder &quot;Fireworks&quot;) anh&#246;ren und man wird schnell merken, da&#223; hier eine der unterbewertetsten Kapellen &#252;berhaupt am Start ist bzw. war.</P>

<p>Das Debutalbum macht einen sehr professionellen Eindruck und erweckt den Eindruck, da&#223; hier eine Formation das Material komponiert und eingespielt hat, die schon mehrere Jahre dabei ist. Grund daf&#252;r ist wohl neben dem sehr routinierten Songwriting vor allem die kraftvolle Produktion, f&#252;r die sich Sascha Paeth (Heavens Gate Gitarrist; u.a. Rhapsody, Luca Turilli, Avalon) und Charlie Bauernfeind (u.a. Gamma Ray etc.) verantwortlich zeichnen. Nat&#252;rlich macht eine gute Produktion noch lange kein gelungenes Album aus, aber auch im musikalischen Bereich brillieren die Jungs: Neben dem schnellen und eing&#228;ngigen Opener &quot;Carry On&quot; k&#246;nnen vor allem die progressiv angehauchten St&#252;cke &quot;Time&quot; (Ohrwurm mit vielen Tempowechseln), der grandiose Titeltrack sowie das &#252;berlange &quot;Lasting Child&quot;, welches gleichzeitig den kr&#246;nenden Abschluss der CD bildet, gefallen. Alle anderen Kompositionen, die sich stilistisch in den melodischen Power / Progressive Sektor mit einigen Klassik Elementen (sehr vielschichtiger, aber immer nachvollziehbarer Sound!) einordnen lassen, k&#246;nnen ebenfalls gefallen - leichte Abstriche muss man beim Kate Buch Cover &quot;Wuthering Heights&quot; machen, das wahrscheinlich nicht jedermanns Sache sein d&#252;rfte. Dieses leichte Manko kann man aber getro&#223;t &#252;bersehen, vor allem wenn man sich die Stimme von Lead S&#228;nger Andre Matos, der vor seiner Zeit bei Angra bei &quot;Viper&quot; t&#228;tig war, anh&#246;rt, die einerseits schnellen Nummern den richtigen H&#228;rtegrad verpasst, andererseits aber auch langsame Passagen perfekt veredelt. Somit wird schnell klar, da&#223; hier einer der besten S&#228;nger im Metal Bereich am Werke ist, der f&#252;r mich in eine Klasse mit Michael Kiske (ex-Helloween) geh&#246;rt.
</P>
<p>Abgerundet wir der hervorragende Rundling noch von diversen Gast Musikern wie etwa Kai Hansen &amp; Dirk Schl&#228;chter (Gamma Ray), Thomas Nack (ex-Gamma Ray) und Sascha Paeth. Wer auf eingenst&#228;ndigen, aber dennoch superben melodischen Power Metal mit progressiven Einfl&#252;ssen steht, darf sich &quot;Angel`s Cry&quot;, genauso wie alle anderen CD`s von Angra, nicht entgehen lassen. Dies hier ist auf jeden Fall der schlagende Beweis, was f&#252;r eine tolle Formation uns mit der Aufl&#246;sung von Angra im vergangenen Monat verloren gegangen ist!</P>


<p>Fazit: 10 von 10 Punkten</P>
<Center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
