<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Wacken 2000 - Review</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="yellow">Wacken Open Air 2000</Font></center></h1></P>

<p>Bedingt durch unsere Radiosendung &quot;Powerplant&quot; hatte ich in diesem Jahr die M&#246;glichkeit, mit einigen Kollegen, in den Luxus eines Backstageausweises f&#252;r das Wacken Open Air zu kommen, was ich nat&#252;rlich nicht ungenutzt lie&#223;. Also ging`s am Donnerstag Nachmittag mit einigen Kollegen ab in Richtung Wacken, wobei wir nat&#252;rlich vorher noch einkaufen gingen (Fl&#252;ssignahrung versteht sich :-)))</P>

<p>Richtig los ging`s dann am Freitag, wobei ich im folgenden chronologisch auflisten werde, welche Acts ich mir so angeguckt habe:</P>

<p>F&#252;r mich ging`s am fr&#252;hen Mittag mit der NWOBHM Legende <b>Samson</B> los, die sich vor kurzem reformiert hatten - nat&#252;rlich ohne Iron Maiden Frontsirene Bruce Dickinson, daf&#252;r aber mit Original Drummer Thunderstick (der Verr&#252;ckte baut immer noch einen K&#228;fig um sich herum auf!), Chris Aylmer und Paul Samson. Den korpulenten S&#228;nger kannte ich zwar nicht, aber er machte seine Sache gar nicht &#252;bel und der Sound, den Samson fuhren, war auch durchweg gut. Die neueren, sehr Blues lastigen St&#252;cke, kannte ich zwar nicht, aber die &#228;lteren Granaten wie etwa &quot;Vice Versa&quot; oder &quot;Earth Mother&quot; rockten immer noch sehr gut und lie&#223;en mitunter auch richtig gute Stimmung aufkommen. Highlight des Sets war aber der Abschluss &quot;Riding With The Angels&quot;, wo die Meute nochmal richtig gut mitging. Insgesamt ein nettes Comeback einer meiner Faves der NWOBHM, auch wenn ich mir St&#252;cke wie &quot;Hammerhead&quot; oder &quot;Hard Times&quot; 
gew&#252;nscht h&#228;tte...</P>

<p>Weiter ging`s f&#252;r mich mit einem weiteren Vertreter der NWOBHM und zwar mit <b>Angel Witch</B>, die auch heute noch zahlreiche Fans haben und mit ihrem `81er Meilenstein &quot;Angel Witch&quot; eines der Highlights der NWOBHM abgeliefert haben. So wurden die Jungs auch sehr wollwollend aufgenommen und boten eine klasse Performance und sorgten zudem auch f&#252;r richtig gute Stimmung vor der True Metal Stage, was zweifelsohne an Highlights wie &quot;Angel Of Death&quot;, &quot;White Witch&quot; oder der megagenialen Bandhymne &quot;Angel Witch&quot; lag. Ich bin mir ziemlich sicher, da&#223; die Jungs noch f&#252;r die eine oder andere &#220;berraschung gut sind, was auch ein neu komponierter Song (Titel vergessen) eindrucksvoll bewies.</P>

<p>Als <b>Rhapsody</B> um kurz nach 18 Uhr die Bretter betraten, war es vor der True Metal Stage ganz hervorragend gef&#252;llt und, im Gegensatz zum Gig in Bochum vor einiger Zeit, war auch der Sound, nach anf&#228;nglichen Problemen, glasklar und kam richtig fett aus den Boxen. Zwar unterschied sich das Programm der Jungs in keinster Weise von dem der Support Tour f&#252;r Stratovarius, aber um Songs wie &quot;Emerald Sword&quot;, &quot;Land Of Immortals&quot; oder &quot;Warriors Of Ice&quot; (mein pers&#246;nliches Highlight von Rhapsody) kommt die Combo nun mal nicht herum. Dazu gab es noch ein kleines Drumsolo vom neuen Drummer Axel Holzwarth und unter dem Strich eine astreine Leistung der Band, die wesentlich sicherer und kompakter auftrat, als vor einigen Monaten noch in Bochum. Leider vers&#228;umte die Band es, den zahlreichen Fans schonmal einen kleinen Vorgeschmack auf das neue Album zu geben...</P>

<p>Immer wenn ich mir <b>Stratovarius</B> anschaue, scheint die Band irgendwelche Probleme zu haben: In der Zeche Bochum hatte Timo Tolkki damals zahlreiche Probleme mit seiner Klampfe und beim Gig in Wacken verletzte sich S&#228;nger Timo Kotipelto beim Z&#252;nden der Pyros - anscheinend wusste er nicht mehr so genau, wann diese gez&#252;ndet wurden. Er konnte zwar weiter machen, aber seine Hand war von da an ausser Gefecht und nat&#252;rlich litt auch die Stimme etwas darunter. Mal abgesehen von diesem Missgeschick (wobei Timo Kotipelto einen Tag sp&#228;ter wieder putzmunter im Backstage Bereich die Biergl&#228;ser leerte...) war der Stratovarius Gig astrein und bot ein Best Of Programm der Multi-Kulti Truppe: Neben neuen Kracher der Marke &quot;Hunting High And Low&quot; und &quot;Infinite&quot; gab`s auch zahlreiches &#228;lteres Material wie etwa &quot;Father Time&quot;, &quot;S.O.S.&quot; und nat&#252;rlich &quot;Black Diamond&quot; zu h&#246;ren. Ebenfalls geil...</P>

<p>Was bei <b>Iced Earth</B> folgte, waren wohl die h&#228;rtesten Stunden f&#252;r jemanden, der seit Samson in der ersten Reihe stand (nur um Gamma Ray und Kai Hansen aus selbiger zu sehen!): Soviele Crowdsurfer, da&#223; man meinen konnte, das &#252;ber einem die Rush Hour <img src="wacken.jpg" align=left>herrschte, waren bisher an der True Metal Stage nicht gesichtet worden. Es war also schon recht interessant, was f&#252;r eine fulminante Stimmung bei Iced Earth herrschte, vor allem wenn man bedenkt, da&#223; die Band durch eine Operation von Mastermind Jon Schaffer noch gehandicapt war. Und um ehrlich zu sein: Ich war von der Band ein kleines bi&#223;chen entt&#228;uscht, da ich mir etwas mehr erwartet hatte: Die B&#252;hnenshow war zwar ganz nett, aber auf der B&#252;hne habe ich auch schonmal aktivere Bands erlebt. Allerdings schien das nur in Wacken der Fall zu sein. Nichtsdestotrotz bot die Band ein grundsolides Set, wobei auch der &#220;berraschungsfaktor in Form von der Iron Maiden Coverversion &quot;The 
Trooper&quot; oder eines neuen, recht guten Songs nicht zu kurz kam. Sicherlich f&#252;r viele das Highlight in Wacken - f&#252;r mich lediglich ein guter Zeitvertreib.</P>

<p>Und dann war es endlich soweit: <b>Gamma Ray</B> mit Metal Gott Kai Hansen, die gerade bei Noise verl&#228;ngert haben, enternten mit &quot;Lust For Live&quot; die B&#252;hne und ich konnte das Spektakel immer noch aus der ersten Reihe verfolgen. Was folgten, waren f&#252;r mich die besten 1  1 /2 Stunden, denn neben einer genialen B&#252;hnenshow (mit vielen Pyros, Luftschlangen, Feuerspuckeinlage zu Beginn, Bandmaskottchen Fun Face etc.) hat die Band nat&#252;rlich auch einen Gro&#223;teil ihrer bisherigen Spitzensongs mit im Gep&#228;ck gehabt und knallte der staunenden Masse, die nach dem Iced Earth Gewitter wieder etwas ruhiger war, mit &quot;Dream Healer&quot;, &quot;Tribute To The Past&quot;, &quot;Land Of The Free&quot; und &quot;Valley Of The Kings&quot; Songs aus jeder Schaffensphase vor den Latz und bot zudem eine richtig agile Performance, die mir das eine oder andere mal einen Schauer &#252;ber den R&#252;cken laufen lie&#223;. Bei &quot;Somewhere Out In Space&quot; wurden dann die Fans noch 
richtig mit einbezogen, ehe es mit dem Helloween Kracher &quot;I Want Out&quot; und dem einzigsten Song von &quot;Powerplant&quot;, &quot;Send Me A Sign&quot;, die beiden verdienten Zugaben gab. Was die Hanseaten da auf der B&#252;hne trieben war einfach unbeschreiblich und macht die Band f&#252;r mich zum Highlight des diesj&#228;hrigen Wacken Festivals!</P>

<p>Damit endete auch der erste Tag in Wacken und ich muss zugeben, da&#223; ich nach den Gamma Ray Zugaben v&#246;llig ausgelaugt war, denn immerhin stand ich seit Samson in der ersten Reihe - ca. 12 Stunden! Also folgte f&#252;r mich bald die wohlverdiente Nachtruhe- an eine gro&#223;e Party war wirklich nicht mehr zu denken...</P>

<p>...zumal es am n&#228;chsten morgen um halb elf schon mit <b>Freedom Call</B> weiterging, die f&#252;r mich mit zu den besten Newcomern im letzten Jahr z&#228;hlten. Auf der B&#252;hne gab sich der F&#252;nfer, angef&#252;hrt von S&#228;nger und Gitarrist Chris Bay, aiuch recht sicher und bot eine coole Show, die nur darunter litt, da&#223; sie viel zu fr&#252;h war. Trotzdem knallten Songs wie &quot;Over the Rainbow&quot;, &quot;We Are One&quot; oder &quot;Tears Falling&quot; auch am fr&#252;hen morgen recht ordentlich und wurden von nicht wenigen Fans beklatscht und gefeiert. Zudem stellte die Band einen neuen Track, der genau in die musikalische Kerbe vom Debutalbum schnitt, vor, bei dem die Meute auch ordentlich abging und der einen gelungenen Gig abrundete. Daumen hoch f&#252;r diese Band, die sich sicherlich mit ihrem n&#228;ch
sten Album (Herbst / Winter) weiter wird festigen k&#246;nnen - Live ist die Band auf jeden Fall cool!</P>

<p>Danach nahm ich mir erstmal eine kleine Auszeit und kehrte erst zu den Kl&#228;ngen von ex-Iron Maiden Shouter <b>Blaze Bayley</B> zur&#252;ck, der seinen Set mit der Hammergranate &quot;The Launch&quot; und dem Maiden Smasher &quot;Futureal&quot; er&#246;ffnete - den Rest des Sets habe ich leider verpasst, da ich mir lieber Squealer (siehe unten) angucken wollte. So scheint der gute Blaze aber noch &quot;Man On the Edge&quot; (nochmals Maiden) auf die Meute abgefeuert zu haben und erntete insgesamt recht gute Resonanzen. Auf jeden Fall war der Mann auf der B&#252;hne hyperaktiv und wirkte befreiter, als noch zu seinen Iron Maiden Tagen.</P>

<p><b>Squealer</B>, die nur auf der WET Stage auftreten durften (die h&#228;tten auf die True Metal Stage geh&#246;rt - jawohl!), waren f&#252;r mich, neben Gamma Ray, ein weiteres Highlight in Wacken, mit dem ich nicht unbedingt gerechnet h&#228;tte: Neben der coolen Songauswahl, sowohl Material vom neuen Album (&quot;End Of the World&quot;, &quot;Free Your Mind&quot;) als auch vom Vorg&#228;nger (&quot;Friends For Live&quot;, &quot;Nowhere To Hide&quot;), war vor allem die Tatsache, da&#223; die Band zwei S&#228;nger (!!!) pr&#228;s
entierte, sehr beeidruckend - man wusste &#252;berhaupt nicht, auf wen man sich konzentrieren sollte und die Band war in sichtlich guter Spiellaune und zog sich hervorragend aus der Aff&#228;re. Zudem beeindruckte Drummer Mike Terrana noch mit einem geilen Drumsolo - eine wirklich hervorragende Band, die ihr unbedingt mal antesten solltete, wenn ihr auf Metal mit Bombast und Ohrwurmmelodien, zu denen man hervorragend headbangen kann, abfahrt. &quot;The Prophecy&quot;, das nunmher dritte Album, sollte auf jeden Fall in jeder Sammlung stehen!</P>

<p>Danach wurde erstmal die Zeit f&#252;r einige Interviews im Backstagebereich genutzt, ehe es um 16 Uhr 30 dann zur <b>Nightwish</B> Show, die mich unheimlich beeindruckt hat, weiterging: Denn im Gegensatz zur absolvierten Tour im Vorprogramm von Rage war der Sound der Finnen diesesmal glasklar, auch wenn zu einem Gro&#223;teil nur Songs vom neuen Album - darunter nat&#252;rlich das hammergeile &quot;Wishmaster&quot;- gespielt wurden. Die Band zeigte sich auf der B&#252;hne auf jeden Fall deutlich gereift und erntete f&#252;r die oberhammergeile Performance auch entsprechende Reaktionen, wobei mir vor allem Frontfrau Tarja positiv (...) auffiel. Na ja, schade nur, da&#223; nach einer Stunde wieder Schluss war und man auf &quot;Stargazers&quot; vom Debutalbum verzichten musste....</P>

<p>Tja, und danach war f&#252;r mich Wacken schon wieder gelaufen, da ich einerseits noch einige Zeit im Backstage Bereich verbrachte und anderseits die weiteren Acts nicht so mein Fall waren - so habe ich mir zwar noch Teile der Venom &amp; Knorkator Show angeguckt und auch die Tom Angelripper Abschluss Feier durfte nicht unter den Tisch fallen, aber so richtig warm wurde ich mit keinem der weiteren Acts (was ich mir im Vorfeld aber schon gedacht hatte). </P>

<p>Unter dem Strich haben sich die 4 Tage (Donnerstag - Sonntag) Wacken aber auf jeden Fall gelohnt, zumal die Veranstalter auch in allen anderen Bereichen super Arbeit geleistet haben - insbesondere die super freundliche Security muss ich an dieser Stelle lobend erw&#228;hnen, denn diese war total locker drauf und Zwischenf&#228;lle, wie etwa `99, gab es in diesem Jahr meines Erachtens nach nicht. Und eines ist sicher: N&#228;chstes Jahr bin ich wieder da. Raise The Fist Of the Metal Child!</P>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
