<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Test: Digi Booster Add-on CD</TITLE>
</HEAD>
<BODY TEXT=white background="ktest.gif" link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Digi Booster Add-On CD</font></center></h1></P>
<p><center><img src="dgbcd1.jpg"></center></P>
<p>Nachdem es in den letzten Monaten in Sachen Ver&#246;ffentlichungen vom APC &amp; TCP recht ruhig geworden war, hat nun das neueste Produkt aus &#220;bersee das Licht der Welt erblickt. Die Rede ist hier von der &quot;DigiBooster Add On CD&quot;, die - der Name sagt es eigentlich schon - das ebenfalls beim APC &amp; TCP erschienene Musik Tool &quot;DigiBooster&quot; mehr oder minder sinnvoll erg&#228;nzen soll. Ob Amiga Musiker die Investition t&#228;tigen sollten, oder das Geld lieber f&#252;r etwas anderes ausgeben, soll dieser Test zeigen.</P>

<p><h1><center><font color="red">Add-on oder nutzlos?</font></center></h1></P>
Nach dem einlegen der (selbstgebrannten) CD stellt man erstmal erfreut fest, da&#223; der Datentr&#228;ger mit 646 MB bis zum Anschlag gef&#252;llt ist. Auch die NewIcons sind sicherlich positiv zu bewerten, wenngleich ich es nicht verstehen kann, da&#223; man als Herrsteller von Amiga CD`s heutzutage nicht mehr ausschlie&#223;lich auf den mit OS 3.5 eingef&#252;hrten Standard &quot;Glow Icons&quot; setzt - diese sind mit den NewIcons kompatibel und geh&#246;ren einfach auf jedes halbwegs aktuelle Amiga System. Aber gut, wir wollen ja hier nicht &#252;ber die Icons streiten, sondern uns stattdessen ein wenig dem Inhalt widmen, der sich auf insgesamt 6 Ordner verteilt:</P>

<p><u>MP3 Demos:</U><br>
Hier befinden sich insgesamt 6 MP Dateien, die mit DigiBooster auf dem Amiga erstellt wurden. Tja, die Musik an sich trifft erwartunsggem&#228;&#223; nicht wirklich meinen Nerv, aber selbst wenn: Der h&#246;here Sinn dieser 6 Dateien hat sich mir bisher nicht wirklich erschlossen. Okay, die wurden mit DigiBooster 
erstellt - aber hey, wem n&#252;tzt das was? Als Demonstrationsobjekte vielleicht recht sinnvoll, aber mehr auch nicht.</P>

<p><u>Samples:</U><br>
Ah, hier wird es f&#252;r ambitionierte Hobby Musiker wohl eher interessant. Wie der Name schon sagt, befinden sich hier Samples verschiedenster Art (Bass, Percussion, Sequences, Drums, FX, Hihats etc.), die nat&#252;rlich f&#252;r den Einsatz in DigiBooster Pro gedacht sind. Die Qualit&#228;t der Samples ist dabei insgesamt recht hoch und es lassen sich damit wirklich gute Ergebnisse erzielen. Da die Dateien allesamt im &quot;aiff&quot; Format vorliegen, kann man diese aber nat&#252;rlich auch mit anderen Programmen (auch auf anderen Plattformen) benutzen. Inwieweit andere Plattformen allerdings das &quot;aiff&quot; Format unterst&#252;tzen, kann ich nicht sagen. Ach ja, die &quot;Samples&quot; bilden mit rund 470 MB auch den Schwerpunkt dieser CD, was sicherlich sinnvoll ist.</P>

<p><u>Multichannel Modules:</U><br>
&#196;h, ja! Module sind ja an sich keine schlechte Sache, aber wenn man diese zu einem Gro&#223;teil dem Aminet entnommen hat (und die Aminet CD`s bzw. Set`s befinden sich wohl in 99 % aller gut sortierten Amiga Sammlungen), stellt sich hier leider die Frage nach dem Sinn und Zweck dieser Module. Sicher, es sind einige Module dabei, die qualitativ &#252;berzeugen k&#246;nnen, aber hier gilt &#228;hnliches wie f&#252;r die MP3 Dateien: Als Demonstration sicherlich ganz nett anzuh&#246;ren, aber mehr halt auch nicht. Und mit 150 MB wohl auch etwas zu gro&#223;z&#252;gig dimensioniert.</P>

<p><u>DigiBooster Pro Bonus:</U><br>
Leider ist dieser Ordner sehr schwach ausgefallen, denn hier gibt es nur einige wenige Bonus Files f&#252;r Digi Booster bzw. dessen Dateiformat: So kann man mit einem Add-on dem Eagle &amp; Deli Player beibringen, DigiBooster Dateien abzuspielen. Ansonsten befindet sich hier noch das Update auf V2.21 sowie einige TB303 Patterns. Im Grunde also nix spektakul&#228;res und daf&#252;r, da&#223; die CD als Add-on f&#252;r Digi Booster gedacht war leider viel zu wenig.</P>

<p><u>Programme:</U><br>
Hier befinden sich weitere Musik Programme f&#252;r den interessierten Hobby Musiker aus den beiden Bereichen &quot;Play&quot; und &quot;Edit&quot;. Der Haaken an der Sache: Die Programme wurden einfach dem Aminet entnommen und befinden sich zudem nur im gepackten Zustand auf der CD. Klar, Tools wie &quot;MPEGA&quot;, &quot;Songplayer&quot;, &quot;Eagleplayer&quot;, &quot;Amisox&quot; oder &quot;Soundconvert&quot; sollte jeder Musik Freund auf der Platte haben, aber wenn es nur darum ginge, w&#252;rde ich einfach zu einer aktuellen Aminet CD bzw. zu einem der Set`s greifen (sofern noch nicht vorhanden). Wie gesagt: Die Idee ist an sich nicht schlecht, aber falsch umgesetzt worden. Lieber etwas weniger Tools, die daf&#252;r entpackt sind oder gar spezielle SE Versionen w&#228;ren wirklich sinnvoller gewesen.</P>

<p><u>PC Bonus Player</U><br>
Ach, was haben wir denn hier? PC Programme? Nun ja, es soll ja auch PC User geben, die gerne DigiBooster Dateien abspielen w&#252;rden (ach ja?) und daf&#252;r gibt es hier zwei Programme: Das eine (MPP 1.43) lassen wir einfach mal links liegen und widmen uns dem anderen, welches auf den Namen (und jetzt kommt es!) &quot;Deliplayer&quot; h&#246;rt. Genau, der &quot;Deliplayer&quot;, der auf dem Amiga entwickelt wurde und gro&#223; geworden ist und seit geraumer Zeit nicht mehr weiterentwickelt wird - zumindest nicht auf unserer Freundinn. Auf dieser CD befindet sich der PC Port davon, der in der Version 1.02 nat&#252;rlich noch stark an
den Amiga erinnert, aber dessen Funktionsumfang noch nicht erreicht hat. Tja, es geht halt nix &#252;ber den Amiga!!</P>

<p>Tja, das waren die 6 Ordner in Kurzfassung auch schon. Dazu gibt`s nat&#252;rlich noch eine Demoversion von DigiBooster Pro, die man aber erst durch manuelles kopieren der Fonts zum laufen kriegt. Zwar kein wirklich schlimmer Fehler, aber einer, den man h&#228;tte vermeiden k&#246;nnen.</P> 

<p><h1><center><font color="yellow">Fazit</font></center></h1></P>
<p>Da ich eigentlich kein Musiker bin, m&#246;chte ich mir eigentlich kein vernichtendes Fazit anma&#223;en. Insbesondere der Schwerpunkt der CD - die vielen verschiedenen Samples - werden sicherlich f&#252;r viele Musiker sinnvoll sein und laden geradezu dazu ein, stundenlang mit dem Programm rumzuspielen. Was mir auf dieser CD fehlt, ist ein schl&#252;ssiges Konzept. Hiervon etwas, davon etwas und noch ein paar Zusatztools. Zudem finde ich den Namen der CD recht unpassend, denn speziell f&#252;r den &quot;Digi Booster&quot; befindet sich hier eigentlich nur wenig brauchbares. Aber da der CD Preis mit 30 DM auch im unteren Preissegment angesiedelt ist, k&#246;nnen sich interessierte Hobby Musiker den Kauf zumindest mal &#252;berlegen, sofern Bedarf an Samples besteht. Sollte dies nicht der Fall sein, kann man die CD getro&#223;t &#252;bergehen...</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
