<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf&acute;s
Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a4"><b>f&uuml;r Thomas Weber</a></b></li>
<li><a href="#a1"><b>f&uuml;r Kilian Servais</a></b></li>
<li><a href="#a2"><b>f&uuml;r Ren&eacute; Stelljes</a></b></li>
<li><a href="#a3"><b>f&uuml;r Rainer Thieke</a></b></li>
</ul>
<hr size=4>
<br>
<table width=100% border=0 cellpadding=6><tr><td>
<h3><a name="a4">Gr&uuml;&szlig; dich Thomas!</h3>

<blockquote><i><b><font color=#006000>
So, da bin ich wieder. Nun sagt blo&szlig; nicht da&szlig; ich mich
vermi&szlig;t habt, weil ich euch das n&auml;mlich nicht glauben werde.
</font></b></i>
</blockquote>

<p>Das ist nun eine Behauptung die du erstens nicht beweisen kannst und
zweitens nicht stimmt [und wenn kein Schreibfehler vorliegt, dann musst du
selbst doch am besten wissen, ob du dich vermisst hast ;-) ;-)]. Denn mein
erster Klick geht immer zum Comic und der zweite Klick zu den Leserbriefen,
um nachzuschauen, ob einer an mich gedacht hat. &Uuml;brigens das neue Outfit
von Randa sieht gut aus, auch wenn sie nun durch die kriegerische Haltung
sehr resoluter wirkt. </p>

<blockquote><i><b><font color=#006000>
[........] und nach mehreren &Uuml;berlegungen bin ich zu dem Entschlu&szlig;
gekommen, da&szlig; die Serie mit den 50. Teil enden wird. </font></b></i>
</blockquote>

<p>Na das ist ja noch lange hin (Mai 2002) und ich hoffe nicht, dass Randa
pl&ouml;tzlich einem Fluch oder dem Schwert zum Opfer f&auml;llt, um ein
schnelles und abruptes Ende herbeizuzaubern, was bei der Lindenstra&szlig;e
vielleicht nicht verkehrt w&auml;re. Ich bin schon gespannt, wann der Prinz
auftaucht, damit beide am Ende der 50. Folge friedlich gemeinsam auf dem
Thron sitzen k&ouml;nnen. </p>

<p>Meines Erachtens haben nun die Spacys eine reelle Chance aus dem Netz
wieder auszubrechen und eventuell in einer anderen Technik wieder
aufzutauchen, um den Vektorgrafikstil abzulegen, der dann im Netz
h&auml;ngen geblieben ist. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a1">Gr&uuml;&szlig; dich Kilian!</h3>

<p>Na heute haben wir erst den 09.April, aber morgen ist dann der
gro&szlig;e Tag f&uuml;r dich. Ich hoffe doch, dass ich noch einige Mails
von dir erhalte, bis du diese Zeilen liest, trotzdem schreibe ich schon
heute, weil ich nicht wei&szlig; und auch noch nicht absehen kann, wie der
restliche Monat ausschauen wird. </p>

<p>Ab dieser NoCover habe ich meine Javascript &Uuml;bungen wieder
eingestellt, denn es kann wirklich sein, dass viele die NoCover noch mit
Voyager 2.95 oder mit IBrowse 1.x lesen. &Uuml;brigens, wenn du mein Logo
angeklickt h&auml;ttest, dann w&auml;re ein drittes Bild bei Verwendung mit
AWeb 3.3 aufgetaucht. Mit IBrowse 2.2 funktioniert dieses Anzeigen bei
onClick leider nicht. Aber JavaScript macht Sinn, wenn man durch Anklicken
ein Requester mit einem vorgegeben Text aufgezeigt bekommt. Meine Antworten
zu den einzelnen Fragen beim Wissentest kann man dann so abfragen. Nur der
Aufwand war mir dann doch zuviel f&uuml;r die etwa 10 Leute, die es
h&auml;tten sehen k&ouml;nnen und f&uuml;r jede Antwort eine eigene
HTML-Seite zu schreiben, das ist wohl auch nicht das Wahre.
Urspr&uuml;nglich sah eine Zeile so aus (Das Script lasse ich aber jetzt
einfach weg):</dt></tr></table>
<table width=95% border=0 cellpadding=2>
<tr><td align=right valign=top width=10%> 6.)</td>
 <td width=60%>  Was ist Unicode? </td>
 <td bgcolor=#ffff00 align=center><b>JS</b></td>
 <td bgcolor=#c0c0c0><font color=#0000ff><center><u><b>
 "Antwort"</font></b></u></center></td></tr></table>
<table width=100% border=0 cellpadding=6>
<tr><td>
<p>Aber ganz zuerst versuchte ich folgendes, wobei bei aktiviertem
Javascript die Antwort per Requester erschienen w&auml;re und bei Fehlen
von Javascript eine HTML-Seite aufgerufen worden w&auml;re. Aber das tat
ich mir wirklich nicht an und von abgesehen hatte ich es auch noch nicht
realisiert und zum Laufen bekommen: </td></tr></table>
<table width=95% border=0 cellpadding=2><form>
<tr><td align=right width=10%> 6.)</a></td>
 <td width=60%>  Was ist Unicode? </td>
 <td><center><b><input type=button value="Antwort">
 </b></a></center></td></tr></form></table>
<table width=100% border=0 cellpadding=6>
<tr><td>
<p>Zuerst wollte ich das Beispiel hier komplett durchspielen, aber das habe
ich doch sein lassen. Es sieht dann so nach Protzen aus. </p>

<blockquote><i><b><font color=#006000>
Wie hat Dir eigentlich mein Test zur Aminet CD gefallen? Da Du die Tests
nicht mehr weitermachen wolltest, werde ich diese wohl nun &#252;bernehmen
und weiterf&#252;hren. usw. </font></b></i>
</blockquote>

<p>Deine CD-Tests waren schon von jeher sehr gut und spiegelten stets deine
pers&ouml;nliche Meinung wider. So soll es doch auch bleiben und deshalb
rate ich dir, von mir h&ouml;chstens die Form anzueignen, aber nicht meinen
negativen Schreibstil, der immer dann zum Tragen kommt, wenn mir etwas
gegen &quot;die Hutschnur l&auml;uft&quot;. Mir haben deine Ansichten
gefallen und ich sage, mache weiter so. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a2">Gr&uuml;&szlig; dich Ren&eacute;!</h3>

<p><table border=0><tr><td>
<p><img src="leser_wolf1.gif" width="199" height="350" alt="Leserbrief"
align=left hspace=6>
Du wirst wohl sehr verwundert sein, ein paar Zeilen von einem
61-j&auml;hrigen zu erhalten. Als ich deinen Leserbrief las, stand f&uuml;r
mich gleich fest, dass du mit einigen S&auml;tzen bedacht werden wirst. Die
beiden Texte kommen dir bestimmt gleich sehr bekannt vor. Aber dazu etwas
sp&auml;ter. Erst m&ouml;chte ich sagen, dass ich etwas verwundert bin,
dass du in der sogenannten &raquo;Nominierung&laquo; bildlich gesprochen
die Augenbrauen runzelst und nicht verstehst, warum Artikel in
verschiedenen Spalten erscheinen. Kann es sein, dass du deine Artikel ohne
das entsprechende Pr&auml;fix versiehst und Andreas nun raten muss, wohin
du ihn eigentlich haben m&ouml;chtest? Jeder Autor sucht sich die Rubrik
selbst aus, in der sein Artikel erscheinen soll und definiert diesen dann
auch dementsprechend. Nachzulesen unter &quot;Intern/Richtlinien
Artikelschreiben&quot; und zwar fast am Ende in der kleinen Tabelle. Wenn
sich alle an diese Regelung halten, gibt es viel weniger Schwierigkeiten.
Genauere Ausf&uuml;hrungen kann ich mir wohl an dieser Stelle ersparen.
</p>

<p>Der zweite Punkt ist dein Statement an meine Adresse. Ich gehe fest von
der &Uuml;berzeugung aus, dass du keine versteckte Ironie unterbingen
wolltest, sondern ehrlich meinst, was du geschrieben hast. Denn meine
Absicht bestand darin, eine Nachricht von beiden Seiten zu beleuchten und
h&auml;tte ich nur die Nachricht gebracht und es w&auml;re einer auf den
Gedanken gekommen, selbst mal im Internet nachzuschauen, der h&auml;tte
wahrscheinlich sich nur auf die Seite von Stefan Raab verirrt und
h&auml;tte sich vielleicht noch nicht einmal etwas dabei gedacht. Dadurch
dass ich nun den &quot;Elefanten&quot; zeige, wird wohl die Nachricht
inhaltstr&auml;chtiger und man begreift, was f&uuml;r eine billige
Effekthascherei hier betrieben wurde ohne &uuml;berhaupt ein klein wenig
vorher nachgedacht zu haben. <br clear=all></p>

<p><img src="leser_wolf2.gif" width="199" height="208" alt="Diskussion"
align=left hspace=6>Nun zum Dritten: Die beiden Ausschnitte deines
Quelltextes zeigen, warum pl&ouml;tzlich im Text so seltsame Blankstellen
auftreten. Kann es sein, dass der Editor deines Programmes MetalWEB
Designer nichts taugt? Oder kontrollierst du einfach nur nicht, was du so
geschrieben hast? Es gibt wirklich keinen Browser - egal auf welcher
Plattform auch immer - der erkennen kann, ob ein Zeilenumbruch nach einem
Wort oder innerhalb eines Wortes vorgenommen wurde. </p>
</td></tr></table><br clear=all></p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a3">Gr&uuml;&szlig; dich Rainer!</h3>

<p>Auch du wirst dich wundern, dass ich dich anschreibe, aber irgendwann
ist immer einmal das Erste Mal. Der Grund, dass ich es tue, ist deine
Aussage zu Beginn in deinem Leserbrief in der letzten NC:
<blockquote><b><i><font color=#006000>
(grins) Aber anyway...da ich nicht vor habe meine Mitgliedschaft zu
verl&auml;ngern, und mittlerweile f&uuml;r mich Halbzeit ist, lohnt sich
ein einbinden JETZT auch nicht mehr - und ehrlich gesagt wird man des
freundlichen hinweisens darauf irgendwann m&uuml;de...! </font></i></b>
</blockquote>
Siehst du, das sind lapidare Aussagen, die zu wilden Spekulationen Anlass
geben k&ouml;nnten, die aber jeglicher Grundlage entbehren. F&uuml;r uns
etwas schon l&auml;nger dabei Seienden w&auml;re es doch vielleicht
interessant, warum du jetzt schon wei&szlig;t, dass du nach zw&ouml;lf
Monaten nicht verl&auml;ngerst. Sind es die Geb&uuml;hren? Ist es der
Zeitfaktor? Oder ist es vielmehr, dass du den Eindruck gewonnen hast, noch
etwas anonym im Abseits zu stehen? </p>

<p>Ich kenne deine Daten nicht, sch&auml;tze aber dass du zum Klientel der
Sch&uuml;ler zu z&auml;hlen bist. Sollten es die Kosten sein, dann kannst
du immer zum Mittel der Online Mitgliedschaft greifen und wenn du ein neues
Mitglied wirbst, dann bekommst du einen entsprechenden Bonus
gutgeschrieben. Zeitfaktoren sind immer faule Ausreden. Man kann dann eben
passiv werden, wie so viele andere auch. Bei meinem drittgenannten Grund
solltest du nochmals nachdenken, ob du da nicht auch einen kleinen Fehler
gemacht hast, in dem du nur auf eine abwartende Position gegangen bist und
einfach darauf wartest, was nun da so Gro&szlig;artiges passieren wird.
Hier ist deine eigene Initiative gefragt. Aber eines solltest du dabei
bedenken, Kontakt bekommt man immer nur zu einer kleinen Gruppe, nie zum
gesamten Volumen eines Clubs. &Uuml;berlege doch bitte, wie du dich
pers&ouml;nlich verhalten w&uuml;rdest, wenn du ein altes Clubmitglied
w&auml;rst und ein Neuer w&uuml;rde &quot;Guten Tag&quot; sagen. Du
w&uuml;rdest antworten: &quot;Hallo, wie gehts?&quot; und dann w&uuml;rdest
du auch wieder warten was nun passiert. Antwortet der Neue nicht oder nur
lapidar, ja dann darf er sich nicht wundern, wenn verflixt wenig Resonanz
in Zukunft kommen wird. Als Neuer musst du dich ins Gespr&auml;ch bringen
und am besten Gleichaltrige und vor allem Gleichgesinnte immer direkt
ansprechen und Fragen stellen. Dann bekommst du auch Antworten und es
entwickelt sich zumindest ein Zwiegespr&auml;ch. </p>

<p>Ich w&uuml;rde gerne die Gr&uuml;nde f&uuml;r deine pers&ouml;nliche
negative Einstellung kennenlernen. Und zum Schluss m&ouml;chte ich dir noch
eine Erfahrung mitteilen: Zu einem florierenden Clubleben geh&ouml;rt immer
viel mehr zu geben als zu nehmen, denn wenn jeder nur nimmt und nicht gibt,
dann gibt es sehr schnell nichts mehr zum Nehmen. </p>

<p>Dass dir Beitr&auml;ge von mir gefallen haben, freut mich. Das
Zahlenger&uuml;st f&uuml;r die NoCover-Statistik habe ich durch ganz
einfache Auswerteprogramme erhalten. Es ist kein Problem diese Zahlen aus
meiner NoCover-Guide zu extrahieren und festzuhalten. Diese Guide habe ich
seit meiner Zugeh&ouml;rigkeit zum APC&amp;TCP erstellt, sie aber erst mit
Erscheinen von NC-44 erstmals ver&ouml;ffentlicht und seit NC-50 liegt sie
als HTML-Datei vor und monatlich erscheint ein Update. Wenn du sie nicht
kennen solltest, dann schaue einfach auf meiner Homepage nach, da sind alle
Guides und die Arbeit des Waldes downloadbar. Auswertungen &uuml;ber die
einzelnen Autoren ver&ouml;ffentliche ich aber keinesfalls. Von Scheintod
der NoCover habe ich nichts gesagt, aber die R&uuml;ckl&auml;ufigkeit
dokumentiert. Verschiedene Sparten werden &uuml;berhaupt nicht mehr
angesprochen, wie z.B. Interviews oder Beschreibungen von Demos, aber auch
die Diskussionsthemen sind sehr r&uuml;ckl&auml;ufig. Durch meine etwas
vermehrte Pr&auml;senz in der letzten Zeit versuche ich manches zu
kompensieren und bringe auch die verschiedenartigsten Themen. Aber alles
spreche ich nicht an, vor allem keine Spiele. Weiterhin wei&szlig; ich, dass
l&auml;ngst nicht alle meine Artikel ankommen. denn man kann es nie jedem
Recht machen. W&auml;re ich beleidigt, dann sollte ich mit dem Schreiben
sofort aufh&ouml;ren. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<hr size=4></p>
</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<
<br>
</body>
</html>
