<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=red alink=red>
<table width=95%>
<p><center><h1><font color="green">Leserbrief von Kilian "The Bruce" Servais</font></center></h1></P><ul>
<li><a href="#alle.html">An Yonder</A><BR></LI>
<li><a href="#wolf.html">An Wolf Zimmer</A><BR></LI>
<li><a href="#rene.html">An Andreas Guldner</A><BR></LI>
<li><a href="#top.html">Top 5</A></UL></LI></P>
<hr>
<a name="alle.html">

<p><b>Hallo zusammen!</B><br>
Ersteinmal sorry, da&#223; ich f&#252;r diese Ausgabe etwas weniger geschrieben habe - der Grund ist das Abitur, das jetzt unmittelbar vor der T&#252;r steht und nat&#252;rlich eine h&#246;here Priorit&#228;t als die NC hat. N&#228;chsten Monat d&#252;rfte es wohl wieder etwas mehr werden, aber versprechen m&#246;chte ich noch nichts.</P> 

<p>Nun noch zu etwas anderem: Ich habe jetzt endlich einen eigenen Internetanschluss via ISDN bekommen und kann jetzt auf E-Mails viel schneller antworten. Wollte ich Euch allen nurmal mitteilen - vielleicht interessiert es ja jemanden?</P>

<p>So, macht`s mal alle gut!</P>
<hr>
<a name="wolf.html">
<p><b>Tag Wolf!</B><br>
Ersteinmal danke f&#252;r Deinen netten Ostergru&#223;. Mitlerweile verf&#252;ge ich auch &#252;ber einen eigenen Netz Zugang, habe aber leider noch einige Probleme mit dem ganzen E-Mail Kram, da alles &#252;ber einen PC l&#228;uft. Na ja, aber auch das Problem, welches nicht das erste an dieser Kiste ist, werde ich noch in den Griff bekommen.</P>

<p>Was den Eternity I angeht: so schnell eine Emulation auch manchmal sein mag - in Bezug auf den amiga kann der UAE, der f&#252;r die Emulation verantwortlich ist, nunmal nicht restlos &#252;berzeugen und hat noch einige Fehler u.a. mit CD`s, Schutzbit`s (okay, Windows ist daran mitverantwortlich) und demzufolge der Installation / Konfiguratiuon von Software. Deswegen folgt nach der ersten Euphorie nicht selten die schnelle Ern&#252;chterrung. F&#252;r die t&#228;gliche Arbeit w&#252;rde ich immer wieder einen echten Amiga vorziehen, aber hier scheinen die Meinungen ja auseinander zu gehen.</P>

<p>Meine Frage bezgl. des Layout`s sollte abolsut nicht bewirken, mir Deinen Geschmack aufzuzwingen. Ich wollte lediglich meine Artikel ein wenig verbessern, umso die NC vielleicht wieder etwas attraktiver zu machen. Das Du meinem bisherigen Layout trotzdem noch etwas positives abgewinnen konntest, freut mich zwar, aber in absehbrare Zeit muss sich daran trotzdem etwas &#228;ndern. Also, spaare bitte nicht mit Kritik - b&#246;se oder sauer auf Dich werde ich deshalb garantiert nicht. Vielen Dank aber f&#252;r die Hinweise auf die Fehler im HTML Code - werde ich in der aktuellen NC Ausgabe ausgebessert haben.</P>

<p>Tja, die NC 84 war wirklich ziemloich d&#252;nn und auch die NC 85 hat mich nicht unbedingt vom Hocker gehauen. Soicherlich, es gibt einige, die sichtlich bem&#252;ht sind, etwas auf die Beine zu stellen (Hort Uwe Kroll, Martin Voepel, Sascha, Rene oder Andereas Guldner), aber es machen immer noch viel zu wenige an der NC mit, wobei man aber auch dem Andreas eine Teilschuld ankreiden muss. Wenn man die NC regelm&#228;&#223;iger in`s Aminet stellen w&#252;rde, f&#228;nden sich auch mehr aktive Mitglieder, wie nicht zuletzt das Beispiel Fireball zeigt, an der sich wesentlich mehr Leute beteiligen. Deinen Frust bezgl. des Internet`s kann ich zwar verstehen, sehe darin aber keinen Zusammennhang zum Niedergang der NoCover. Und lass Dir eines sagen: Mit dem Internet Explorer zu surfen, macht auch nicht unbedingt viel mehr Spass, denn bis dieses Programm sich in den Speicher geladen hat, dauert es Urzeiten. Um ehrlich zu sein vermisse ich auf dem PC ein schnelles, handlcihes &amp; kompatkes HTML Anzeige- &amp; Browsing Tool wie etwa IBrowse oder 
Voyager. Das geht bei mir sogar schon so weit, da&#223; ich keine Hilfedateien in HTML auf dem PC &#246;ffne, denn das Laden dieser Dateien mit dem Start des Browsers dauert auf meinem 150er AMD zehnmal l&#228;nger, als auf meinem mit vergleichsweise nur 25 MhZ getaktetem Amiga. Also glaube nur nicht, da&#223; ein PC mit seinen aufgebl&#228;hten Programmen unbedingt Abhilfe f&#252;r Deine Probleme schafft. Vielmehr erwachsen dort neue und ich bin mir nicht sicher, ob ich einige Inkompatibilit&#228;ten dagegen eintauschen w&#252;rde. Sieh also nicht alles so schwarz Wolf - auch ein Windows PC gl&#228;nzt - trotz beeindruckender technischer Daten - nicht unbedingt mit hohem Komfort.</P>

<p>So, mach`s mal gut!</P>
<hr>
<a name="rene.html">
<p><b>Hi Rene!</B><br>
Sag einmal, Du wolltest die lieben NC Leser doch nicht etwa mit Deinem Bericht &#252;ber das &quot;AmiOS&quot; auf die Sch&#252;ppe nehmen? Erinnert mich irgendwie total an einen kleinen Aprilscherz, der aber immerhin recht cool r&#252;bergebracht wurde. So, da&#223; war es auch schon wieder - habe momentan leider keine Zeit. See ya!</P>
<hr>
<a name="top.html">
<p><h1><center><font color="green">Top 5</font></center></h1></P>

<p>1. Wissenstest von Wolf Zimmer<br>
2. Simon II von Rainer &quot;The Machine&quot; Thiecke (see ya in da Firebool!)<br>
3. PCX Workshop von Rene (PC Task 4.4 ist aber IMHO schneller!)<br>
4. Schlagzeilen von Wolf Zimmer<br>
5. CDTVscsi von Sascha (cooler Bericht!)</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
