<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#808080">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Der Wassergarten</b></font></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr>
 <td>
<font size="+1"><b>Themen</font></b><ul>

<li> <b>Teichsandbett herstellen</b></li>

<li> <b>Flachwassergarten anlegen </b></li>

<li> <b>Gartenteich anlegen </b></li>

<li> <b>Innenteich im Wintergarten </b></li>

<li> <b>Miniteich auf Rollen bauen </b></li>
</ul>
</td>
</tr>

<tr>
<td><h2 class="ueberschrift">Teichsandbett herstellen</h2>
</td>
</tr>

<tr>
<td>Ein Gartenteich, und sei es nur ein kleiner, der Natur nachempfundener
T&uuml;mpel mit gut sechs Quadratmeter Wasserfl&auml;che, bereichert jeden
Garten mit einer Pflanzen - und Tiervielfalt, auf die man jedoch warten
mu&szlig;.
</td>
</tr>

<tr>
<td><p>Der menschliche Einflu&szlig; beschr&auml;nkt sich dann auf die
Grube mit der Folienauskleidung, Randgestaltung und Startbepflanzung.
Danach gen&uuml;gt es, wenn Sie verhindern, da&szlig; der Wasserspiegel zu
weit f&auml;llt. Ein Schauteich, mit stets klarem Blick bis auf den
steinigen Grund, wird im Prinzip genau so angelegt, nur mit
gr&ouml;&szlig;eren Ma&szlig;en, mehr Aufwand und sp&auml;ter mit sehr viel
mehr Pflege.
</td>
</tr>

<tr>
<td align="center"><img src="onl_garten1a.jpg" width=450 height=355 alt="Teichsandbett"
border="0"><br><br>
</td>
</tr>

<tr>
<td>
<table class="blick" cellpadding=5 cellspacing=1>
<tr>
<td colspan=2><b>Auf einen Blick</b>
</td>
</tr>
<tr>
<td valign="top"><b>Material:</b></td>
<td>Grubensand, Teichfolie, Ger&ouml;ll, Feldsteine, Beton, Klebem&ouml;rtel
</td>
</tr>
<tr valign="top">
<td><b>Werkzeuge:</b></td>
<td>Schaufel, Richtlatte, Wasserwaage, Hei&szlig;luftgebl&auml;se</td>
</tr></table>

<table border=0 cellpadding=3 cellspacing=0>
<tr>
<td colspan="2"><b>Sand als Ausgleich</b>

<p>Nicht immer kann man ein m&ouml;glichst tiefes Loch ausheben. Je nach
Art des vorhandenen Bodens braucht man ein bis zwei Kubikmeter gesiebten
Grubensand, um einen glatten Untergrund - v&ouml;llig frei von spitzen
Steinen - f&uuml;r die Folie zu schaffen. Die Randh&ouml;he legen Sie dabei
von einem Pfosten im Mittelpunkt aus fest. Auf seit langem bebauten
Grundst&uuml;cken ist die Erdbewegung nur mit der Schubkarre m&ouml;glich,
falls man den T&uuml;mpel, wie in dem Beispiel, nicht direkt am
Kellermauerwerk unter der Terrasse anschlie&szlig;en l&auml;&szlig;t und
mit dem Aushub des Gel&auml;ndes sanft abfallend modelliert. </p>
</td>
</tr>

<tr>
<td>
<table cellspacing="5" border=0>
<tr>
<td><img src="onl_garten1b.jpg" width=150 height=184 alt="Aushub" border="0">
</td>
<td><img src="onl_garten1c.jpg" width=150 height=186 alt="Randh&ouml;he festlegen" border="0"></td>
<td><img src="onl_garten1d.jpg" width=150 height=186 alt="Folie auslegen" border="0"></td>
</tr>
<tr>
<td valign="top"><b>F&uuml;r einige Kubikmeter Aushub ist eine Verwendung zu finden. </b></td>
<td valign="top"><b>Randh&ouml;he von einem Pfosten im Mittelpunkt festlegen. </b></td>
<td valign="top"><b>Bei warmen Wetter die dann weichere Folie auslegen.</b></td>
</tr></table>

</td>
</tr>
<tr>
<td><p>
Ob am Mauerwerk oder mitten im Gel&auml;nde, ein umlaufender und genau
waagrechter Wall ist f&uuml;r jeden Folienteich notwendig. Er
l&auml;&szlig;t sich mit Richtlatte und Wasserwaage festlegen.</p>

<p>Dadurch erreicht man einen gleichm&auml;&szlig;igen &Uuml;berlauf und
damit ringsum eine feuchte &Uuml;berzone. Deren Vegetation l&auml;&szlig;t
den T&uuml;mpel gr&ouml;&szlig;er erscheinen und erlaubt einen sanften
&uuml;bergang zum trockenen Gel&auml;nde. </p>
</td>
</tr>
<tr>
<td> <b>Teichzonen gestalten</b><br>
<p>Der Teichgrund sollte (je nach Temparaturregion) mindestens 80 cm unter
diesem Rand liegen, damit Amphibien &uuml;berwintern k&ouml;nnen.Je
vielseitiger die ansteigenden W&auml;nde mit flacher Sumpfzone,
Trittsteinen, Ger&ouml;llkante oder Einfassungen zur Terrasse gestaltet
sind, um so leichter wird sich die k&uuml;nstliche Anlage in die vorhandene
Situation einf&uuml;gen, sofern sich die Art der sichtbaren
Gestaltungselemente auf dem anschlie&szlig;enden Grundst&uuml;ck
wiederfindet.

</td>
</tr>
<tr>
<td>
<table cellpadding="5">
<tr>
<td>
<img src="onl_garten1e.jpg" width=150 height=195 alt="" border="0"></td>
<td><img src="onl_garten1f.jpg" width=150 height=194 border=0 alt=""></td>
<td><img src="onl_garten1g.jpg" width=150 height=190 border=0 alt=""></td>
</tr>
<tr>
<td valign="top"><b>Feldsteine im Betonbett als Br&uuml;cke und f&uuml;r Tiere zum Sonnen.</b></td>
<td valign="top"><b>Gewaschenes Ger&ouml;ll im dicken Klebem&ouml;rtel verlegen.</b></td>
<td valign="top"><b>Der T&uuml;mpel soll sich nahtlos in die Umgebung einf&uuml;gen.</b></td>
</tr>
</table>
</td>
</tr>
<tr>
<td><p>
Wenn Sie die Teichfolie als Plane bestellen, sollten Sie genaue
Gr&ouml;&szlig;e erst nach der fertigen Grube festlegen. Mit zwei dicken
Bindf&auml;den, die man im rechten Winkel zueinander in der
gr&ouml;&szlig;ten L&auml;nge und Breite auslegt. Mit einer selbst aus
Einzelbahnen zusammengeschwei&szlig;ten Plane sind Sie wesentlich freier
bei der Gestaltung der Form. Au&szlig;erdem ist es wirtschaftlicher, weil
Sie &uuml;berfl&uuml;ssige leicht an anderer Stelle ansetzen k&ouml;nnen.
Teichfolie verspr&ouml;det mit der Zeit, wenn sie ungesch&uuml;tzt dem
Tageslicht ausgesetzt ist. </p>
</td>
</tr>
<hr size=4>
Die Fortsetzung w&uuml;rde nun wahrlich hier den Rahmen sprengen, deshalb
lasse ich es auch sein, obwohl wirklich viele und schöne Bilder kommen würden,
wenn ich hier so weiter gemacht h&auml;tte wie z.B:<br>
<center><img src="onl_garten2a.jpg" width=450 height=307 border=0 alt=""></center>
</td>
</tr>
</table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
