<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#808080">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>www.naturdetektive.de</b></font></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>             

<p><img src="onl_natur1.gif" height="152" width="200" border="0" align="left"
hspace=6 alt="">
<b>Naturdetektive 2001</b><br>
Willy Wurm und Raupe Marie... <br>
begrüssen Dich als 13902. Besucher. </p>

<p>Naturdetektive machen mit...<br>
bei <a href="2496.htm">GEO</a>s
"Tag der Artenvielfalt".
Der Tag der biologischen Vielfalt...<br>
ist der 22. Mai. </p>

<p>Macht mit bei unserem Wettbewerb mit "Willy Wurm" und "Raupe Marie"!
Mehr darüber erfahrt ihr in dem Kapitel <a href="1629.htm">Wildgemüse</a>!
</p>

<p>Weißstörchin Anneliese ist auf dem
Rückflug! Nach einer längeren Pause in der
Serengeti fliegt sie nun wieder in den Norden. Mehr erfährst du bei
unserer <a href="1707.htm">Satelliten-Telemetrie</a>!
</p>

<p>Dieser bisherige Text ist die Begrüßungsseite der Website gem. Überschrift.
Und wo fange ich am besten an? </p>

<p><b>Das Projekt 2001</b></p>
<p>Warum gibt es die &quot;Naturdetektive&quot;? <br>

Das ist einfach und doch wieder nicht. Die Naturdetektive sind entstanden,
um den Begriff und den Inhalt der &quot;Internationalen Konvention
&uuml;ber die Biologische Vielfalt&quot; in der &Ouml;ffentlichkeit bekannt
zu machen.</p>

<p>Die Naturdetektive begannen am 19. Februar und enden zum 30. September
2001. Die Naturdetektive sind ein Beitrag des Forschungs- und
Entwicklungsvorhabens &quot;Deutscher Clearing-House Mechanismus&quot;,
das Bundesumweltministerium (BMU) und&nbsp; Bundesamt f&uuml;r Naturschutz
(BfN) bei der Zentralstelle f&uuml;r Agrardokumentation und -information
(ZADI) f&ouml;rdern.</p>

<p>Die
Naturdetektive stellen damit einen konkreten Beitrag des BMU und des BfN zu
Artikel 13 des &Uuml;bereinkommens &uuml;ber die Biologische Vielfalt
(&Uuml;BV) dar, in der &Ouml;ffentlichkeit Interesse f&uuml;r die
&quot;Biologische Vielfalt&quot; zu wecken. Damit stehen die Naturdetektive
auch in Verbindung mit der Konferenz der Vereinten Nationen &uuml;ber
&quot;Umwelt und Entwicklung&quot; in Rio de Janeiro 1992 und der AGENDA 21
mit ihrem Kapitel 36 zur &quot;&Ouml;ffentlichkeitsarbeit&quot;. In Rio de
Janeiro wurde 1992 der Grundstein f&uuml;r drei weltweit bedeutende
Internationale &Uuml;bereinkommen (Konventionen) der Vereinten Nationen
gelegt: die Klima-Konvention, die W&uuml;sten-Konvention und die Konvention
der Biologischen Vielfalt. Alle drei Konventionen dienen dem Erhalt und
Fortbestehen der Natur, der Sicherung und dem
nachhaltigen Schutz der Lebensgrundlagen, wie auch dem damit verbundenen
vorbeugenden Schutz des Welt-Klimas. Mit den Naturdetektiven soll ein
kleiner Baustein entwickelt werden, die bisher wenig bekannte Konvention
der Biologischen Vielfalt, &quot;begreifbarer&quot; zu
machen.</p>

<p>Jede/r kann mitmachen! &quot;Vom Schul-
zum B&uuml;rger-Projekt&quot; lautet das Motto! Ob Sch&uuml;ler,
Sch&uuml;lergruppen, Schulklassen, Eltern mit ihren Kindern,
Naturschutzgruppen oder auch Einzelpersonen. Die Natur auf neuen Wegen
erfahren, Unbekanntes oder auch schon Vergessenes wieder entdecken, stehen
im Vordergrund der &quot;Naturdetektive&quot;. </p>

<p>Die &quot;Naturdetektive&quot; bieten:<ul>

<li>Eine eigene Naturdetektiv-Homepage als eigene &quot;Startseite&quot;
mit allen Reporter-Seiten</li>

<li>Reporter-Seiten alle Beobachtungen mit Text und Bild selbst
gestaltet.</li>

<li>12 Beobachtungen mit Steckbrief, Auftrag und Weitere Informationen zum
Beobachtungsthema</li>

<li>Aktionstipps sie sollen zum detektivischen Arbeiten mit dem Thema
Anregungen geben</li>

<li>Foren - hier k&ouml;nnen Fachleute online zum jeweiligen Thema befragt
werden</li>

<li>eine interaktive Karte - hier werden die Beobachtungen online
eingetragen und hier k&ouml;nnen auch alle
&quot;Naturdetektiv-Homepages&quot; und &quot;Reporter-Seiten&quot;
betrachtet werden.</li></ul></p>

<p>Das Kartenprogramm &quot;Visualisierungsprogramm&quot;<br>

Alle Beobachtungen werden mit dem &quot;WANN wurde die Beoachtung&quot;,
&quot;WO wurde die Beobachtung&quot; und &quot;VON WEM wurde die
Beobachtung gemacht&quot; verkn&uuml;pft. &quot;WANN&quot; und
&quot;WO&quot; werden beim Eintrag der Beobachtungen in die Karte
&quot;festgelegt&quot;. &quot;WO&quot; durch Anklicken des ungef&auml;hren
Ortes in der Karte und das &quot;WANN&quot; durch Auswahl des exakten
Datums der Beobachtung. </p>

<p>Mit dem bei den
Naturdetektiven verwendeten Kartenprogramm (Geographisches Visualisierungsprogramm),
k&ouml;nnen dann alle Beobachtungen
&uuml;ber eine Zeit-Taste mit ihrem &quot;WANN&quot; und &quot;WO&quot; wie
in einem Film betrachtet werden. Viele Beobachtungen lassen dann
&quot;Wanderbewegungen&quot; der Pflanzen und Tiere in Deutschland
erkennen. Die Reporter-Seiten k&ouml;nnen durch einfachen Maus-Klick auf
das jeweilige Kartensymbol in einem neuen Browser-Fenster ge&ouml;ffnet
werden. </p>

<p><b>Biologische Vielfalt</b></p>

<p>Biologische Vielfalt (engl.: Biological Diversity/Biodiversity) was
ist das ? Mit diesem Namen verbinden sich drei Ebenen der Vielfalt, die
ineinandergreifen:<ul>
<li>die Vielfalt an &Ouml;kosystemen oder Lebensr&auml;umen</li>

<li>die Artenvielfalt dazu z&auml;hlen auch Mikroben und
Pilze, die weder Pflanze noch Tier sind, und </li>

<li>die Vielfalt an genetischen Informationen, die in den Arten enthalten sind.
</li></ul></p>

<p>Das &Uuml;bereinkommen &uuml;ber die biologische Vielfalt, das auch
Biodiversit&auml;tskonvention oder von den &quot;Insidern&quot; auch
knapp &quot;Biodiv-Konvention&quot; - genannt wird, verfolgt drei Ziele:<ul>

<li>der Erhalt der biologischen Vielfalt</li>

<li>die nachhaltige Nutzung der biologischen Vielfalt</li>

<li>der gerechte
Vorteilsausgleich aus der Nutzung der biologischen Vielfalt. </li></ul></p>

<p>Dabei ist die Biodiv-Konvention keineswegs nur eine
&quot;Artenschutz-Konvention&quot;. Die Biodiv-Konvention beinhaltet
n&auml;mlich ausdr&uuml;cklich den &quot;nachhaltigen Nutzen&quot; dieser
Vielfalt und den sogenannten &quot;Vorteilsausgleich&quot; zwischen dem,
der die biologische Vielfalt nutzt und dem, der die biologische Vielfalt
f&uuml;r diese Nutzung erh&auml;lt. Das ist das vollkommen Neue an dieser
Konvention! </p>

<p>Pflanzen- und Tierarten sind mit
ihren Erbinformationen seit 1993 (als die Konvention in
Krafttrat) souver&auml;nes Eigentum der Staaten, in denen sie vorkommen!
Die Erbinformationen oder
eben die genetischen Ressourcen - von Pflanzen und Tieren enthalten
vielleicht Wirkstoffe oder chemische Verbindungen, die f&uuml;r den
Menschen besonders im medizinischen Bereich helfend eingesetzt werden
k&ouml;nnen. Diese Wirkstoffe gilt es, in den vorhandenen rund 1,2
Millionen bekannten Pflanzen- und Tierarten zu
entdecken und nutzbar zu machen. Damit das gelingen kann, m&uuml;ssen
diese 1,2 Millionen Arten erhalten werden. </p>

<p>Das Interesse an einer Erhaltung dieser Artenf&uuml;lle soll
&uuml;ber den marktwirtschaftlichen &quot;Vorteilsausgleich&quot;
zwischen Nutzendem (z.B.der Pharma-Industrie) und Erhaltendem (den
Staaten oder den Einwohnern eines Gebietes) gew&auml;hrleistet werden.
Das ist die Theorie – die Praxis wird durch die Vertragsstaatenkonferenzen
(Regierungskonferenzen) in kleinen Schritten alle zwei Jahre neu abgestimmt
die sechste Welt-Konferenz zur Biologischen Vielfalt findet im April 2002
in Den Haag, in den Niederlanden statt. </p>

<p>Und hier
sind wir also wieder bei den Naturdetektiven. Die Naturdetektive sollen dazu
beitragen, diese Konvention der &quot;Biologischen Vielfalt&quot; bekannter
und verst&auml;ndlicher zu machen. Eine Mischung aus Arten- und Lebensraumbeobachtungen
soll dabei unterst&uuml;tzen, nicht nur lokale, sondern auch weit
dar&uuml;ber hinaus gehende Zusammenh&auml;nge sichtbar werden zu lassen. </p>

<p>Ein besonderes Beispiel solcher global vernetzter Lebensr&auml;ume
kann man an den Wei&szlig;st&ouml;rchen und ihren Wanderrouten via Satellit
sichtbar machen. Bei den Naturdetektiven gibt es zu dem Thema
&quot;Wei&szlig;-Storch&quot; einen &quot;Flugsimulator&quot;.
Hier werden aktuelle Satellitenkoordinaten der Flugrouten verschiedener
Wei&szlig;-St&ouml;rche abgebildet. Die St&ouml;rche wandern dabei
jedes Jahr zwischen 6.-12.000 km von Europa nach Afrika hin und
zur&uuml;ck. Auf ihrem Wanderweg brauchen sie bei jeder Rast intakte
Lebensr&auml;ume. Hier wie dort sind sie abh&auml;ngig von den
Ver&auml;nderungen ihrer Lebensr&auml;ume. Ein Thema, um das sich
eine weitere weltweite Konvention k&uuml;mmert, die Konvention der
wandernden Tierarten. </p>

<p>Fakten zur Konvention der Biologischen Vielfalt &nbsp;<ul>

<li>Deutschland hat die Konvention &uuml;ber die biologische
Vielfalt am 12. Juni 1992 unterzeichnet und am 21. Dezember 1993
ratifiziert (Bundesgesetzblatt) </li>

<li>Am 29. Dezember 1993 trat die Konvention in Kraft - es ist ihr
&quot;Geburtstag!&quot;</li>

<li>Den 29. Dezember haben die Vereinten Nationen zum Tag der
biologischen Vielfalt erkl&auml;rt das galt bis zum Jahr 2000.
Die 5. Welt-Konferenz der Biologischen Vielfalt, hat im Mai 2000
in Nairobi, Kenia, den Vorschlag an die Vereinten Nationen gemacht,
diesen Tag auf den 22. Mai zu verlegen um leichter f&uuml;r ihn werben
zu k&ouml;nnen. Der 22. Mai ist der Tag der offiziellen &quot;Annahme&quot;
des Textes der Biodiv-Konvention. Diesem Antrag hat die Generalversammlung
der Vereinten Nationen am 20.12.2000 zugestimmt. </li>

<li>Der Erste Bericht der Bundesregierung nach dem &Uuml;bereinkommen
&uuml;ber die biologische Vielfalt wurde 1998 ver&ouml;ffentlicht </li>

<li>Es gab bisher
f&uuml;nf internationale Konferenzen zur biologischen Vielfalt:<br>1994 Nassau,
Bahamas<br>1995 Jakarta, Indonesien<br>1996 Buenos Aires, Argentinien<br>1998
Bratislava, Slowakien <br>2000 Nairobi, Kenia </li></ul></p>

<p>Die sechste Konferenz findet im April 2002 in Den Haag, in den Niederlanden statt.</p>

<p><b>Die Themen und ihre Moderatoren</b></p> 

<p>12 verschiedene Themen gibt es wieder in diesem Jahr bei den Naturdetektiven zu
beobachten. Wir haben erneut versucht, unsere Themen m&ouml;glichst breit
und unterschiedlich &quot;tief&quot; zu f&auml;chern. Beim Thema &quot;Wild
Gem&uuml;se&quot; haben wir einen kleinen Wettbewerb eingebaut. Andere Themen,
wie z.B. &quot;Spuren der Waldarbeit&quot; sind in Zusammenarbeit mit den 15
Landesforstverwaltungen der Bundesl&auml;nder entstanden. Es gibt aber auch
ein Thema, das einen sehr aktuellen Bezug zur &quot;Biologischen Vielfalt&quot;
und zu dem gleichnamigen &Uuml;bereinkommen hat, n&auml;mlich &quot;Fremde
Pflanzenarten&quot;. Wer hier mitmacht, kann versuchen, Informationen &uuml;ber
die urspr&uuml;ngliche Heimat dieser Pflanzen zus&auml;tzlich im Internet
aufzusp&uuml;ren!</p>


<p>Besonders hat uns gefreut, dass in dieser Staffel zum ersten Mal eine Klasse
aus Berlin, die 9c der Schadow-Oberschule, ein Thema selbstst&auml;ndig betreut.
Die Honig Biene ist eine Ko-Produktion zwischen den Sch&uuml;lerinnen und Sch&uuml;lern,
dem Biologie Lehrer und dem &ouml;rtlichen Imkerverein Zehlendorf. </p>

<p>Und wie bereits im letzten Jahr sind die Reporter-Seiten eine wichtige
Kommunikationsplattform f&uuml;r alle Naturdetektive!</p>

<p>Die Graue Runzelflechte - Algenpilz oder Pilzalge? </p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2a.jpg" width="51" height="49" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Dieses Thema wird moderiert von
<a href="mailto:sylvia.reckel@ecolink-ev.de">Sylvia Reckel</a>*.
Sie ist Biologin und Mitglied im gemeinn&uuml;tzigen <a
href="http://www.ecolink-ev.de" target="_blank">Verein EcoLink e.V.</a>,
der &ouml;kologische und entwicklungspolitische Projekte initiiert,
durchf&uuml;hrt und f&ouml;rdert. Besonderer Schwerpunkt von EcoLink e. V.
ist die Umweltbildung in Verbindung mit den neuen Medien. Mitglieder des
Vereins waren ma&szlig;geblich beteiligt an AeroDataBioNet/Hannover, der
Pilotphase eines nieders&auml;chsischen Umweltbildungs- und Multimedia-Projektes,
in dem Jugendliche an Schulen und Umweltbildungszentren anhand von Flechten
die Luftqualit&auml;t ihrer Region erfassen und ihre Daten via Internet vernetzen.
Die resultierenden Karten k&ouml;nnen unter <a
href="http://www.bionet.schule.de/aerodata/hannover" target="_blank">
http://www.bionet.schule.de/aerodata/hannover</a> eingesehen werden.</p</td></tr></table>

<p>Libellen am Teich -&nbsp; Hochglanzflieger </p>
<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2b.jpg" width="49" height="49"
border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Dieses Thema wird moderiert von &quot;
Karin Blomenkamp. Sie arbeitet an der Biologischen Station Bruchhausen
in Erkrath. Das Thema wurde gestaltet von Prof.em. Dr. Eberhard G. Schmidt
(Text, Zeichnungen, Fotos) und Herrn J&ouml;rg Kaminski (Technik). Beide
arbeiten an der Biologiedidaktik, FB9/S05, der <a href="http://www.uni-essen.de"
target="_blank">Universit&auml;t-Gesamthochschule Essen</a></p</td></tr></table>

<p>Der L&ouml;wenzahn - Pusteblume und tausend Silberschirme</p>
<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2c.jpg" width="50" height="49"
border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Dieses Forum wird moderiert von &quot;
Heike Hildebrand. Sie ist Projektleiterin
quot;<a href="http://www.erlebter-fruehling.de" target="_blank">
Erlebten Fr&uuml;hlings</a>&quot; bei der Naturschutzjugend (NAJU)
des Naturschutzbundes (NABU). Der &quot;Kleine Fuchs&quot; ist ebenfalls
einer von 4 Fr&uuml;hjahrsboten beim &quot;Erlebten Fr&uuml;hling 2001&quot;.
</p</td></tr></table>

<p>Der Kleine Fuchs - Befl&uuml;gelter Diamant</p>

<table cellpadding="0" cellspacing="0" border="0"><tr>
<td valign="top"><img src="onl_natur2d.jpg" width="50" height="49"
border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Das Thema wird moderiert von &quot;Walter
Schoen&nbsp; Er ist Mathematik-Lehrer am St&ouml;rck-Gymnasium Bad
Saulgau und besch&auml;ftigt sich seit 18 Jahren mit Schmetterlingen
(bevorzugt Tagfalter). Er hat an verschiedenen Schmetterlings-Kartierungsprojekten
teilgenommen und pr&auml;sentiert f&uuml;r Laien und Experten gleicherma&szlig;en
seit 4 Jahren &quot;Schmetterlinge&quot; unter
<a href="http://www.schmetterling-raupe.de" target="_blank">
http://www.schmetterling-raupe.de</a></p</td></tr></table>

<p>Das Rotkehlchen - Guter Gartengeist</p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2e.jpg" width="50" height="49" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Dieses Thema wird moderiert von Dr. Rudolf Specht. Er ist
promovierter Biologe und arbeitet beim <a href="http://www.bfn.de"
target="_blank">Bundesamt f&uuml;r Naturschutz</a> in Bonn im Bereich
&quot;Internationaler Naturschutz&quot;. Nebenberuflich hat er mehrere B&uuml;cher
&uuml;ber V&ouml;gel f&uuml;r den Kosmos-Verlag geschrieben. </p</td></tr></table>

<p>Die Honig Biene - Fliegender L&ouml;ffel Honig </p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2f.jpg" width="50" height="49" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Dieses Thema wird moderiert von den &quot;
Sch&uuml;lerinnen und Sch&uuml;lern der Klasse 7c der <a
href="http://www.schadow-oberschule.de" target="_blank">Schadow-Oberschule</a>
in Berlin zusammen mit dem &quot;Imkerverein &quot;Zehlendorf&quot;.
</p</td></tr></table>

<p>Wildgem&uuml;se - Natur pur</p>

<table cellpadding="0" cellspacing="0" border="0"><tr><td valign="top">
<img src="onl_natur2g.jpg" width="50" height="49" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Das Thema &quot;Wildgem&uuml;se&quot; wird moderiert von
&quot;R&uuml;diger Lobitz. Er ist<br>
Ern&auml;hrungswissenschaftler und als Wissenschaftsredakteur beim<br>
<a href="http://www.aid.de" target="_blank">Auswertungs- und
Informationsdienst f&uuml;r Ern&auml;hrung, Landwirtschaft und<br>
Forsten</a> (aid) t&auml;tig. Sein Ressort ist<br>
schwerpunktm&auml;&szlig;ig die Warenkunde pflanzlicher und tierischer Produkte.
</p</td></tr></table>

<p>Die Esche - Baum-des-Jahres-2001</p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2h.jpg" width="50" height="49" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Dieses Thema wird moderiert von &quot;
Dr. Silvius Wodarz. Er ist Vorsitzender des
&quot;<a href="http://www.baum-des-jahres.de"
target="_blank">Kuratorium-Baum-des-Jahres</a>&quot;</p</td></tr></table>

<p>Spuren der Waldarbeit - Lebendiger Wald </p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2i.jpg" width="50" height="49" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Das Thema wir moderiert von
&quot;Henning Freiesleben. Er ist beim
Nieders&auml;chsischen Forstplanungsamt, Dezernat Waldinformation,
zust&auml;ndig f&uuml;r die Bereiche Wald und Schule sowie Internet.
Er moderiert das Thema stellvertretend f&uuml;r die Forstverwaltungen
des Bundes und der L&auml;nder <a href="http://www.wald-online.de"
target="_blank">(http://www.wald-online.de)</a></p</td></tr></table>

<p>Die Ph&auml;nologische Uhr - Wem die Blumen-Stunde schl&auml;gt!</p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2j.jpg" width="50" height="49" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Das Thema wird moderiert von <SPAN
class="bold">Ekko Bruns. Er ist Mitarbeiter des
<a href="http://www.dwd.de" target="_blank">Deutschen Wetterdienstes</a>
(DWD) in Offenbach und zust&auml;ndig f&uuml;r die Ph&auml;nologischen
Me&szlig;netze.</p</td></tr></table>

<p>Fremde Pflanzenarten - nendliche Geschichten</p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2k.jpg" width="50" height="69" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Das Thema wird moderiert von &quot;Dr.
Katharina Dehnen-Schmutz. Sie ist Diplom-Biologin und promovierte
&uuml;ber nichteinheimische Pflanzen an mittelalterlichen Burgen (am
<a href="http://www.tu-berlin.de/~oekosys/" target="_blank">Institut
f&uuml;r &Ouml;kologie</a> der TU-Berlin)</p</td></tr></table>

<p>Der Wei&szlig;-Storch&nbsp; - Nord-S&uuml;d-Wanderer auf Ost-und Westrouten</p>

<table cellpadding="0" cellspacing="0" border="0">
<tr><td valign="top"><img src="onl_natur2l.jpg" width="50" height="69" border="0"></td>
<td><img src="../pics/nix.gif" width="10" height="1"></td>
<td valign="top"><p>Dieses Thema wird moderiert von &quot;
<a href="mailto:storchenhof@lau-st.de">Michael Kaatz</a>.
Er ist Diplom-Ingenieur f&uuml;r Landeskultur und Umweltschutz und
promoviert &uuml;ber das &quot;Rast und Zugverhalten des Wei&szlig;storches&quot;.
Einige seiner Feldstudien unternimmt er auf dem Storchenhof in Loburg
(<a href="http://www.zerbst.de/storchenhof/"
target="_blank">http://www.zerbst.de/storchenhof/</a>) in Sachsen-Anhalt.
</p</td></tr></table>

<p><b>An den Naturdetektiven 2001 sind folgende Partner beteiligt:</b> <ul>
<li><a href="http://www.aid.de" target="_blank">aid e.V.</a><br>
zum Thema &quot;Wildgem&uuml;se</li>

<li><a href="http://www.ample.de/" target="_blank">AMPLE Musikverlag</a></li>

<li><a href="http://www.bmu.de" target="_blank">Bundesministerium f&uuml;r
Umwelt, Naturschutz und Reaktorsicherheit </a></li>

<li><a href="http://www.bfn.de" target="_blank">Bundesamt f&uuml;r Naturschutz</a><br>
zum Thema &quot;Rotkehlchen</li>

<li><a href="http://www.dwd.de" target="_blank">Deutscher Wetterdienst </a><br>
zum Thema &quot;Ph&auml;nologische Uhr</li>

<li><a href="http://www.digionline.de/" target="_blank">DigiVision B&ouml;sch &amp;
Grafenhain GbR&nbsp; </a></li>

<li><a href="http://www.dialogis.de" target="_blank">Dialogis Software &amp;
Services GmbH</a></li>

<li><a href="http://www.ecolink-ev.de" target="_blank">EcoLink</a><br>
zum Thema &quot;Graue Runtelflechte</li>

<li><a href="http://www.ulmer.de" target="_blank">Eugen Ulmer Verlag</a></li>

<li><a href="http://www.wald-online.de" target="_blank">Forstverwaltungen des
Bundes und der L&auml;nder </a><br>
zum Thema &quot;Spuren der Waldarbeit</li>

<li><a href="http://www.geo.de/projekte/artenvielfalt/" target="_blank">GEO &quot;Tag
der Artenvielfalt&quot;</a><br>
Schon im zweiten Jahr ist die GEO-Initiative zur bewundernswerten Massenbewegung geworden:<br>
25 000 Teilnehmer haben den j&uuml;ngsten &quot;GEO-Tag der Artenvielfalt&quot;
zum gr&ouml;&szlig;ten Feldforschungsprojekt gemacht, das es jemals an einem einzigen
Tag in Mitteleuropa gegeben hat. </li>

<li><a href="http://Geospace-Austria GmbH&nbsp; &nbsp; "
target="_blank">http://Geospace-Austria GmbH&nbsp; &nbsp; </a></li>

<li><a href="http://www.gmd.de" target="_blank">GMD, Forschungszentrum f&uuml;r
Informationstechnik</a></li>

<li><a href="http://www.sielmann-stiftung.de" target="_blank">Heinz Sielmann
Stiftung</a></li>

<li><a href="http://www.dainet.de/cms" target="_blank">Konvention Wandernder
Tierarten &quot;Bonner Konvention&quot;</a></li>

<li><a href="http://www.baum-des-jahres.de" target="_blank">Kuratorium
Baum des Jahres</a><br>
zum Thema &quot;Esche</li>

<li><a href="http://www.tivi.de/loewenzahn/" target="_blank">L&ouml;wenzahn</a></li>

<li><a href="http://vowa.ornithol.mpg.de/~vwrado/index_d.html"
target="_blank">Max-Planck-Forschungsstelle f&uuml;r Ornithologie
&quot;Vogelwarte Radolfzell&quot;</a></li>

<li><a href="http://www.uni-bonn.de/museumkoenig" target="_blank">Museum
Alexander Koenig</a></li>

<li><a href="http://www.erlebter-fruehling.de" target="_blank">Naturschutzjugend
im Naturschutzbund Deutschland e.V. </a><br>
zum Thema &quot;L&ouml;wenzahn</li>

<li><a href="http://www.oekobase.de" target="_blank">&Ouml;KOBASE Umweltatlas</a></li>

<li><a href="http://www.schadow-oberschule.de/" target="_blank">Schadow-Oberschule,
Berlin</a><br>zum Thema &quot;Honigbiene</li>

<li><a href="http://www.san-ev.de" target="_blank">Schulen ans Netz e.V.&nbsp; </a></li>

<li><a href="http://www.zerbst.de/storchenhof/" target="_blank">Storchenhof
LoburgStorchenhof Loburg</a><br>
zum Thema &quot;Wei&szlig;storch</li>

<li><a href="http://www.schmetterling-raupe.de" target="_blank">St&ouml;rck-Gymnasium
Bad Saulgau</a><br>zum Thema &quot;Kleiner Fuchs</li>

<li><a href=" http://www.kindernetz.de/kik/marktplatz/naturdetekt.html"
target="_blank">SWR Kindernetz </a></li>

<li><a href="http://www.trickstudio.de" target="_blank">Trickstudio Lutterbeck GmbH</a><br>
Zeichnung &quot;&quot;Willy Wurm&quot; und
&quot;&quot;Raupe Marie&quot;</li>

<li><a href="http://www.tu-berlin.de/~oekosys/index.htm" target="_blank">TU Berlin,
Fachgebiet &Ouml;kosystemkunde / Pflanzen&ouml;kologie</a><br>
zum Thema &quot;Neue Pflanzen</li>

<li><a href="http://www.naturpark.de/" target="_blank">Verband Deutscher
Naturparke (VDN)</a></li>

<li><a href="http://www.zadi.de" target="_blank">Zentralstelle f&uuml;r
Agrardokumentation und -information</a></li>

<li><a href="http://www.verwaltung.uni-bonn.de/ueberbl/ueberblk.htm"
target="_blank">Zentrum f&uuml;r Evaluation und Methoden, Universit&auml;t
Bonn</a></li></ul></p>

<p><b>Spielregeln 2001</b></p>

<p>Anmelden mit &quot;Benutzernamen&quot; und &quot;Passwort&quot;</p>

<p>Grunds&auml;tzlich solltet ihr folgendes beachten: wenn ihr bei den
&quot;Naturdetektiven&quot; mitmachen wollt, m&uuml;&szlig;t ihr euch <SPAN
class="bold"><a href="#" onclick="popup('2029.asp'); return
false;">anmelden</a>! </p>

<p>F&uuml;r die Anmeldung gibt es einen extra &quot;Knopf&quot;. Bei der
Anmeldung gebt ihr euch einen &quot;Benutzernamen und
ein &quot;Passwort. Beide aufschreiben und wirklich
&quot;gut merken! Denn - euer Benutzername mit dem
Passwort sind wie eine Geheimnummer! </p>

<p>Mit dem Benutzernamen und dem Passwort werden anschlie&szlig;end
sowohl eure &quot;Naturdetektiv-Homepage&quot; und alle eure
&quot;Reporter-Seiten&quot; verkn&uuml;pft sie sind dadurch&nbsp;
einzigartig&nbsp; und nur ihr k&ouml;nnt sie wieder mit dem von euch
gew&auml;hlten&nbsp; Benutzernamen und Passwort&nbsp; ver&auml;ndern!
Soviel zur Anmeldung.</p>

<p>Eintragung / Reporter-Seiten &amp; Homepage</p>

<p>Um eure Beobachtung in die Karte eures Landkreises eintragen zu
k&ouml;nnen, m&uuml;sst ihr zuallererst ein Beobachtungsthema
ausw&auml;hlen! Lest dann den Steckbrief mit dem Auftrag und die weiteren
Infos durch. Erst dann rausgehen und beobachten! Erst wenn ihr die ersten
Beobachtungen gemacht habt, geht es zur&uuml;ck an den Computer. Gebt euren
Benutzernamen und das Passwort an.</p>

<p>Danach k&ouml;nnt ihr eure Beobachtung aus der
&quot;Themen&uuml;bersicht&quot; einer farbigen Tabelle -&nbsp;
ausw&auml;hlen. W&auml;hlt noch das richtige Datum aus und tragt per
&quot;Maus-Klick&quot; eure Beobachtung dann ungef&auml;hr in eure
Landkreiskarte ein. </p>

<p>Und wer nun m&ouml;chte, kann zus&auml;tzlich seine eigene
&quot;Naturdetektiv-Homepage&quot; und &quot;Reporter-Seiten&quot; f&uuml;r
jedes Thema anlegen. Auf der eigenen &quot;Naturdetektiv-Homepage&quot;,
werden alle eure Reporter-Seiten automatisch angezeigt! </p>

<p>Ver&auml;ndern der Reporter-Seiten</p>

<p>Das Ver&auml;ndern bzw. das Hinzuf&uuml;gen von neuen Reporter-Seiten
oder auch der eigenen &quot;Naturdetektiv-Homepage ist
ebenfalls sehr einfach. Wer sich schon einmal vollst&auml;ndig angemeldet
hat, der braucht bei jedem weiteren Besuch der
Naturdetektive-Internetseiten, nur seinen Benutzernamen und sein Passwort
einzugeben und kann damit seine Texte und Bilder in allen
Reporter-Seiten und der eigenen Naturdetektiv-Homepage - ver&auml;ndern.
</p>                                    

<li> Ein TIPP: Achtet darauf, dass, wenn ihr
Bilder in eure Reporter-Seiten und in eure
&quot;Naturdetektiv-Homepage&quot; einf&uuml;gen m&ouml;chtet, sie das
JPG-Format haben. In dem JPG-Format&nbsp; sind die Bilder nur wenige KB
gross, verbrauchen sehr wenig Speicherplatz und eure Ladezeiten verringern
sich erheblich! </p>

<p><b>Ein Thema - mehrere Beobachtungen</b></p>

<p>Einige der Themen (u.a. L&ouml;wenzahn, Libellen, Fremde
Pflanzenarten) bieten mehrere Beobachtungen je Thema an so z.B. die
Bl&uuml;hphasen beim L&ouml;wenzahn - gr&uuml;n - gelb - wei&szlig;.&nbsp;
Dann habt ihr f&uuml;r das jeweilige Themensymbol in unserem Beispiel
&quot;L&ouml;wenzahn&quot; drei verschiedene Farben (gr&uuml;n gelb -
wei&szlig;) zur Auswahl, die ihr auch alle drei in die Karte eintragen
k&ouml;nnt! <ul>

<li>je Thema kann aber immer nur eine Reporter-Seite
angelegt werden gleich, ob es zu diesem Thema eine oder eben mehrere
Beobachtungsm&ouml;glichkeiten gibt (unser Beispiel: L&ouml;wenzahn)
</li>

<li>jede Beobachtung, kann nur einmal von dir
ausgew&auml;hlt und anschlie&szlig;end in die Karte eingetragen werden
danach ist die Beobachtung&nbsp; &quot;vergeben&quot;.</li></ul></p>

<p><b>Die Gewinne (durch Verlosung)</b></p>

<p>Die Gewinne werden unter allen Naturdetektiven im Oktober 2001 verlost -<br>
und zwar beginnend mit dem Gewinn Nummer 1, Nummer 2 und so weiter. </p>

<p>Wer mindestens eine Reporter-Seite geschrieben hat, nimmt an der
Verlosung mit diesem Beitrag teil. An der Verlosung nehmen alle von euch
erstellten Reporter-Seiten und Naturdetektive-Homepage als Los teil. Ihr
k&ouml;nnt aber nur einen Preis gewinnen!</p>

<p>Das bedeutet:</p>

<p>Wenn ihr zum Beispiel Reporter-Seiten zu allen 12 Themen und eine
Homepage angelegt habt, dann habt ihr insgesamt 13 Lose die gezogen werden
k&ouml;nnen. So steigen eure Chancen, einen der Preise zu gewinnen!
<br>Wird nun eines eurer Lose gezogen, dann habt ihr einen Preis gewonnen.

Da ihr aber nur einen Preis gewinnen k&ouml;nnt, werden dann eure
restlichen Lose aus dem Gewinntopf herausgenommen. </p>

<p><b>Wichtig!</b></p>

<p>Es ist deshalb ganz wichtig (!), dass ihr euch euer
&quot;Passwort&quot; und den<br>&quot;Benutzernamen&quot; aufschreibt und
nicht verliert!</p><div class="head1">&nbsp;</p><div class="head1">Hier
die Preise!&nbsp;</p>

<p><b>Der besondere Gewinn:</b><ul>
<li>5 mal das &quot;Kosmos-Buch der Erde&quot;
<br>verlosen wir unter den Teilnehmern, die alle 12 Themen und die
Naturdetektiv-Homepage mit Text und Bild angelegt
haben.</li></ul></p>

<p> <b>Unsere Gewinne von 1 bis 140!</b><ul>

<li> Unsere Gewinne von 1 bis 10:<br>
Das Buch <br>
&quot;Der neue Kosmos Tierf&uuml;hrer&quot; <br>
Kosmos Verlag </li>


<li> Unsere Gewinne von 11 bis 15:<br>
Die neue Auflage des Buches<br>
&quot;Was bl&uuml;ht denn da?&quot; <br>
Kosmos Verlag </li>

<li> Unsere Gewinne von 16 bis 20:<br>
Das Buch<br>
&quot;Der neue Kosmos Pflanzenf&uuml;hrer&quot; <br>
Kosmos Verlag</li>

<li> Unsere Gewinne von 21 bis 25:<br>
Das Buch<br>
&quot;Biotope im Garten&quot;<br>
Ulmer Verlag</li>

<li> Unsere Gewinne von 26 bis 30:<br>
Das Buch<br>
&quot;Die Honigbiene&quot;<br>
Ulmer Verlag</li>


<li> Unsere Gewinne von 31 bis 50:<br>
Die Vogelstimmen CD&#39;s<br>
&quot;Was fliegt und singt denn da?&quot;<br>
Kosmos Verlag</li>

<li> Unsere Gewinne von 51 bis 70:<br>
Das Buch<br>
&quot;Ein Garten f&uuml;r Schmetterlinge&quot;<br>
Kosmos Verlag</li>

<li> Unsere Gewinne von 71 bis 75:<br>
Das Buch<br>
&quot;Ernte am Wegrand&quot;<br>
Ulmer Verlag</li>

<li> Unsere Gewinne von 76 bis 85:<br>
Das Natur-Quiz<br>
&quot;Wiesenblumen&quot;&quot;<br>
Kosmos Verlag</li>

<li> Unsere Gewinne von 86 bis 95:<br>
Das Natur-Quiz<br>
&quot;Singv&ouml;gel&quot;<br>
Kosmos Verlag</li>

<li> Unsere Gewinne von 96 bis 100:<br>
Das Buch<br>
&quot;Natur erlernen mit Kindern&quot;<br>
Ulmer Verlag</li>

<li> Unsere Gewinne von 101 bis 105:<br>
Das Buch<br>
&quot;Schmetterlinge im Garten&quot;<br>
Kosmos Verlag</li>

<li> Unsere Gewinne von 106 bis 108:<br>
CD und Buch<br>&quot;Vogelstimmen-Trainer&quot;<br>
AMPLE Verlag</li>

<li> Unsere Gewinne von 109 bis 110:<br>
Die CD<br>
&quot;Vogelstimmen in Feld und Flur&quot;<br>
AMPLE Verlag</li>

<li> Unsere Gewinne von 111 bis 140:<br>
Das Buch<br>
&quot;B&auml;ume und St&auml;ucher&quot;<br>
Kuratorium Baum-des-Jahres</li></ul></p>

<p>Und zum Schluss noch <b>das Impressum</b></p>

<p>Das Projekt Naturdetektive ist ein Kooperationsvorhaben zwischen dem <ul>

<li> <a href="http://www.dainet.de/bmu-cbd/" target="_blank">Deutschen Clearing-House Mechanismus</a>,
<li> des <a href="http://www.bmu.de/fset1024.htm" target="_blank">Bundesministerium
f&uuml;r Umwelt, Naturschutz und Reaktorsicherheit</a> (BMU) <br>

- mit dem <a href="http://www.bfn.de" target="_blank">Bundesamt f&uuml;r Naturschutz</a>,<br>
- und <a href="http://www.san-ev.de/" target="_blank">Schulen ans Netz e.V.</a>, 

<li> dem <a href="http://www.gmd.de" target="_blank">GMD -
Forschungszentrum Informationstechnik GmbH</a>,

<li> dem <a href="http://borneo.gmd.de/" target="_blank">Institut f&uuml;r Autonome
intelligente Systeme</a>

<li> und der Firma <a href="http://www.digivision-net.de/" target="_blank">DigiVision -
B&ouml;sch &amp; Grafenhain GbR</a>.</ul></p>

<p>Die <b>Naturdetektive 2001</b> stehen unter der Schirmherrschaft der
Parlamentarischen Staatssekret&auml;rin des Bundesumweltministeriums, Frau
Simone Probst. </p>

<p><b>Redaktion</b><br>

Redaktionsleitung hat <a href="mailto:freiberg@zadi.de">Dr. Horst
Freiberg</a> vom Deutschen Clearing-House Mechanismus beim <a
href="http://www.zadi.de/de/igr/index.htm"
target="_blank">Informationszentrum f&uuml;r Genetische Ressourcen</a> der
Zentralstelle f&uuml;r Agrardokumentation und -information (ZADI).</p>

<p><b>Realisierung</b><br>

Erstellt wurde diese Site von der Firma <a
href="http://www.digionline.de/" target="_blank">DigiVision B&ouml;sch
&amp; Grafenhain GbR</a>. <br>Webkonzeption &amp; Screendesign: <a
href="mailto:foerster@webway.de">Peggy F&ouml;rster</a>, DigiVision
B&ouml;sch &amp; Grafenhain GbR. <br>Software-Entwicklung:
<a href="mailto:thomas@digionline.de">Thomas Hebinck</a>,
Digivision DigiVision B&ouml;sch &amp; Grafenhain GbR.</p>

<p><b>Kartographische Visualisierung </b><br>

Die kartographischen Pr&auml;sentationen wurden von der <a
href="http://ais.gmd.de/" target="_blank">GMD</a> und der <a
href="http://www.dialogis.de/" target="_blank">Dialogis Software &amp;
Services GmbH</a> entwickelt. </p>

<p><b>&quot;Willy Wurm&quot; und &quot;Raupe Marie&quot;</b><br>

Die Logofirguren &quot;Willy Wurm&quot; und &quot;Raupe Marie&quot;
wurden vom &quot;<a href="http://www.trickstudio.de/"
target="_blank">Trickstudio Lutterbeck GmbH</a>&quot; entwickelt.</p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
