<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white"  link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Ariadne II</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Timo Orava &lt;<a href="mailto:timpsa@nettilinja.fi">timpsa@nettilinja.fi&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						Kaipailin jo kauan Amigaani verkkokorttia, vaikken sit&auml; juuri t&auml;ll&auml; hetkell&auml; tarvitsekaan. Pakottava tarve tuli siit&auml;, ett&auml; Amigassani on jo l&auml;hes kaikki muut laitteet paitsi verkkokortti - pit&auml;&auml;h&auml;n verkkokorttikin olla.
						<p>Kaikki tuntuivat hankkineen PCMCIA-verkkokortin, mutta koska sit&auml; en itse tarpeeksi nopeasti l&ouml;yt&auml;nyt ja koneeni oli jo tarpeeksi palapeli, p&auml;&auml;tin ostaa Ariadne II -verkkokortin, enk&auml; katunut ostostani lainkaan. Broadlinelt&auml;h&auml;n sen tilasin ja maksoin reilut 800 mk postikuluineen. My&ouml;s BNC-terminaattorit sun muut olivat mukana ja totta kai n&auml;tti ohjekirja.
						<p>Seuraavana viikonloppuna p&auml;&auml;sin kokeilemaan korttia Elevator 2000 -tapahtumassa, ja vaikka tapahtuman alussa kiinnostivat huomattavasti eri asiat kuin tietokoneet, sain v&auml;s&auml;tty&auml; koneen verkkoon viidess&auml; minuutissa Miamin avulla. Olinpas c00l. Miami kysyi kaikki asiat suoraan, ja ainoa ongelma oli se, ett&auml; hubi, johon olin kytkeytynyt, oli s&auml;rki, eik&auml; sit&auml; voinut ehj&auml;t&auml;. Siisp&auml; kytkin koneeni toiseen hubiin ja johan toimi. Silti aikaa kului vain viisi minuuttia.
						<p>Siisp&auml; ly&ouml;ty&auml;ni l&auml;hes ainoaan vapaaseen Zorro-paikkaan Ariadnen minun tarvitsi vain asentaa ko. kortin ajuri DEVS:iin, ja asia oli sit&auml; my&ouml;ten selv&auml;. Ariadnen mukana tuli my&ouml;s joku hikinen AmiTCP Genesis, mutta koska modeemia p&auml;&auml;asiassa k&auml;yttelen ja olen jo tottunut Miamiin, p&auml;&auml;tin k&auml;ytt&auml;&auml; sit&auml; nytkin. Ohjekirjassa ja ajurilevykkeell&auml; oli my&ouml;s kaikenmoista s&auml;&auml;t&ouml;kikkailukamaa, jota t&auml;h&auml;n menness&auml; en ole viel&auml; tarvinnut. Johtunee varmaan siit&auml;, ett&auml; Elevator 2000 -tapahtuma on ollut ainoa, jossa verkkokorttia olen p&auml;&auml;ssyt testaamaan.
						<p>Se tosiasia minulle selkeni entisest&auml;&auml;n, ett&auml; hyv&auml; on hyv&auml;&auml;. Ariadnen kanssa ei tarvinnut tehd&auml; mit&auml;&auml;n virityksi&auml; lukuunottamatta pelleilyj&auml; Micronikin Infinitiv-tornin kanssa, joka ei oikein hyv&auml;ksynyt korttia sis&auml;&auml;ns&auml;. Piti viilailla ja sahailla muovia tornista hetken jos toisenkin, jotta BNC-liittimen korttiin kiinni sai. Johan se on kumma, kun Amigan oma torni ei tue Amigan omia kortteja.
						<p>PCMCIA-kulma-adapteri on minulla ylim&auml;&auml;r&auml;isen&auml;, joten jos joku kaipailee sellaista, voi ottaa yhteytt&auml;. Ja muistakaahan kiltit lapsukaiset tulla Proxy-multimedian&ouml;rttinuoritietokonetapahtumaan tuomaan lis&auml;&auml; Amiga-henke&auml;. Osoitteessa <a href=http://www.proxy.kannus.fi>http://www.proxy.kannus.fi</a> voi tsiikailla kaikkee t&auml;rkeet&auml; informaatiota. Kes&auml;ll&auml; Kannuksessa tai Kokkolassa, viel&auml; ei enemp&auml;&auml; tietoa.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href=http://www.villagetronic.com/amiga/index.html>Village Tronic</a>, <a href=mailto:info@village.de>info@village.de</a>, <a href=mailto:support@village.de>support@village.de</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href=http://www.dlc.fi/~broline>Broadline Oy</a>, <a href=mailto:broline@dlc.fi>broline@dlc.fi</a>, puh. (09) 874 7900</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">790 mk (hinnasto 12/99)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekniikkaa:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>10 MBit ethernet, Realtek-piirist&ouml;
							<li>TP- ja BNC-liittimet
							<li>SANAII- ja ACS-ajurit, optiona MNI-ajurit
						</ul>
					</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font><p></center>
	</body>
</html>
