<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>BeOS amigistin n&auml;k&ouml;kulmasta</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Risto M&auml;ki-Pet&auml;ys &lt;<a href="mailto:basscade7@hotmail.com">basscade7@hotmail.com</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">&quot;Niin kuin AmigaOS olisi pit&auml;nyt tehd&auml;&quot;, sanoi Jean Louis Gass&eacute;, BeOSin p&auml;&auml;suunnittelija. Ensi katsomalta BeOS onkin aika paljon AmigaOS:n kaltainen. Virtuaality&ouml;p&ouml;yd&auml;t saa n&auml;kym&auml;&auml;n eri n&auml;ytt&ouml;tiloissa kuten AmigaOS:n screenit, liukupalkkien toiminnan saa samanlaiseksi, ja BeOSista l&ouml;ytyy my&ouml;s n&auml;pp&auml;r&auml; bashin pohjalle rakennettu komentorivitulkki. Ikkunat jopa suljetaan vasemmasta yl&auml;kulmasta.
						<p>Ostin kokeilumieless&auml; BeOS 4.5:n Helsingin Dataclubista. Itse asennus sujui helposti. Asennusohjelma n&auml;ytt&auml;&auml; osiot, joista valitaan haluttu. Jos ei osioita ole, voidaan BeOS asentaa tyhj&auml;lle alueelle, jolloin se t&auml;ytt&auml;&auml; koko levyn. Harmikseni asennusohjelmassa ei ole mahdollisuutta luoda tai venytt&auml;&auml; osioita, joskin CD:ll&auml; toimitetaan karsittu versio Partition Magicista.
						<p>Asennus on jopa miellytt&auml;v&auml;n nopea, noin 15-20 minuuttia (t&auml;ysi asennus ilman japanin kielt&auml;). Asennuksen p&auml;&auml;tteeksi hoidetaan BeOS Boot Managerin asetukset. Valikossa n&auml;kyv&auml;t mahdolliset k&auml;ytt&ouml;j&auml;rjestelm&auml;t, jotka voidaan k&auml;ynnist&auml;&auml;. K&auml;ynnistett&auml;ess&auml; esiin tulee tekstipohjainen valikko, josta voi nuolin&auml;pp&auml;imill&auml; valita halutun k&auml;ytt&ouml;j&auml;rjestelm&auml;n, tai m&auml;&auml;ritetyn ajan kuluessa ajetaan oletusk&auml;ytt&ouml;j&auml;rjestelm&auml;. Asetuksia voi muuttaa milloin tahansa asennuksen j&auml;lkeenkin.</p>
						<center>
							<a href="kuvat/beos_big.jpg" target="_blank"><img height="299" width="400" src="kuvat/beos_small.jpg" border="0" alt=""></a></center>
						<center>
							<i>Kuva: Jaakko Oranen</i></center>
						<p>Asennuksen j&auml;lkeen ty&ouml;p&ouml;yt&auml; on melko minimalistinen mutta ajaa asiansa. Mukana toimitetaan kasa hienoja taustakuvia sek&auml; k&auml;ynnistys&auml;&auml;ni&auml;. Ikonit ovat mielest&auml;ni turhan karut. Niist&auml; tulee mieleen NewIconsin perussetti. Mukana tulee my&ouml;s muutamia pieni&auml; apu- sek&auml; esittelyohjelmia. Mielest&auml;ni positiivista BeOSissa on mukana tuleva ohjelmien kehitysymp&auml;rist&ouml;. Editori sopii my&ouml;s normaaliin tekstink&auml;sittelyyn sek&auml; HTML:n kirjoitukseen.
						<p>Internet-ohjelmisto on aika v&auml;hiss&auml;: CD:ll&auml; toimitetaan selain, NetPositive, joka ei osaa kaikkia selaimen perusominaisuuksia kuten esimerkiksi proxyn toiminnan rajoittamista. Jatkossa BeOSin perusselaimeksi on suunniteltu Operaa, mutta sen nykyinen betaversio on toistaiseksi eritt&auml;in kaatumatautinen. BeOSin mukana toimitettu s&auml;hk&ouml;postiohjelma on my&ouml;s melko karu. S&auml;hk&ouml;postia varten soveltuvat paremmin <a href="http://tucows.kpnqwest.fi">Tucowsista</a> l&ouml;ytyv&auml;t ilmaisohjelmat. My&ouml;s iScribe on tutustumisen arvoinen. Tucowsista l&ouml;ytyy my&ouml;s erilaisia IRC-ohjelmia.
						<p>BeOSia on monesti mainostettu AV-alaan painottuvana k&auml;ytt&ouml;j&auml;rjestelm&auml;n&auml;. Ik&auml;v&auml; kyll&auml; kyseisen alan ohjelmistoa ei hirve&auml;sti ole BeOSille n&auml;kynyt. CD:lt&auml; l&ouml;ytyi perustarpeisiin riitt&auml;v&auml; moniraituri, mutta siit&auml;kin puuttuu varsin paljon tarpeellisia ominaisuuksia. Kuuleman mukaan sekvensseri Logic Audio on k&auml;&auml;nnetty BeOSille. Graafinen puoli on aika v&auml;hiss&auml;. Ohjelmistonkehityspakettiin sis&auml;ltyy hieman Photoshopia muistuttava piirto-ohjelma, joka sis&auml;lt&auml;&auml; jopa kerrokset mutta on edelleen pahasti kehitysvaiheessa. Kokeilin itse k&auml;&auml;nt&auml;&auml; GIMPia (Gnu Image Manipulation Kit) BeOSille, mutta BeOSin asennukseen ei sis&auml;ltynyt l&auml;hesk&auml;&auml;n kaikkia tarvittavia kirjastoja, enk&auml; en&auml;&auml; jaksanut k&auml;yd&auml; niit&auml; jokaista hakemassa koululta, joten luovutin - omalla tuurillani k&auml;&auml;nn&ouml;s olisi tuskin onnistunut muutenkaan.
						<p>Loppujen lopuksi BeOSista j&auml;i harmittamaan l&auml;hinn&auml; etenkin ammattialan ohjelmiston puute. Ymp&auml;rist&ouml; on melko miellytt&auml;v&auml; ja s&auml;&auml;dett&auml;viss&auml;. K&auml;ytt&ouml;j&auml;rjestelm&auml; py&ouml;rii miellytt&auml;v&auml;n nopeasti ja k&auml;ynnistyykin noin kymmeness&auml; sekunnissa. Siin&auml; on huomattavasti etuja muihin k&auml;ytt&ouml;j&auml;rjestelmiin verrattuna, esim. laitteiston tunnistaminen k&auml;ynnistett&auml;ess&auml; konetta ja ikkunan siirt&auml;minen virtuaality&ouml;p&ouml;yd&auml;lt&auml; toiselle vet&auml;m&auml;ll&auml;.
						<p>Ajurituki on melko v&auml;h&auml;inen. Oma kokoonpanoni (Yakumo Y586VX -emolevy, P200MMX, Soundblaster PCI64, S3 Virge DX) sattui toimimaan suoraan. Kaverini kokoonpano (Asustekin emolevy, AMD K6-2/400 MHz, Soundblaster Live, Matrox Millennium G200) toimi hyvin, tosin &auml;&auml;net toimivat vasta kun BeOS p&auml;ivitettiin versioon 4.5.1. Vaihdettuani koneeni uudempaan ei vanha BeOS en&auml;&auml; k&auml;ynnistynyt, vaikka koneesta vaihtui vain emolevy (nyttemmin QDI Titanium IB+) ja prosessori (AMD K6-2/333 MHz). En saanut miss&auml;&auml;n vaiheessa toimimaan verkkokorttia (3COM 3c509b) enk&auml; Soundblaster AWE64:&auml;&auml;, vaikka molemmille oli ajurit. Molemmat tosin ovat ISA/PnP-kortteja, joten toimimattomuus ei ole mik&auml;&auml;n ihme.
						<p>Maaliskuun loppupuolella Be julkaisi BeOS 5.0 Personal Editionin ilmaiseksi. Kokeilin asentaa sit&auml; ja petyin rajoituksiin. Ilmainen Personal Edition ei suostu asentumaan omalle osiolleen, vaan toimii tiedoston sis&auml;ll&auml; olevana valeosiona ja t&auml;ytyy k&auml;ynnist&auml;&auml; Windowsin ty&ouml;p&ouml;yd&auml;n pikakuvakkeesta. Sen lis&auml;ksi moniprosessorituki ei toimi, ja valeosion t&auml;ytyy olla tasan 501 megatavua. Erikseen ostettavassa Pro-versiossa n&auml;m&auml; asiat olisivat kunnossa, mutten viitsinyt en&auml;&auml; sijoittaa siihen rahaa, joten tyydyin Personal Editioniin.
						<p>Valitettavasti koko viritys ei edes k&auml;ynnistynyt. Ensimm&auml;isell&auml; kerralla se vain k&auml;ynnisti Windowsin uudestaan, toisella kerralla j&auml;i jumiin k&auml;ynnistyksess&auml; ja kolmannella kerralla taas k&auml;ynnisti Windowsin uudestaan. En tied&auml;, teink&ouml; jotain v&auml;&auml;rin - ainakaan t&auml;ss&auml; vaiheessa ei ole paljon s&auml;&auml;dett&auml;viss&auml;. Kuuleman mukaan BeOS 5:sta ehdittiin jo julkaista korjausp&auml;ivitys, joka ei kirjoitushetkell&auml; ole viel&auml; ilmestynyt ainakaan Sunetin arkistoihin.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.be.com">Be Incorporated</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Ilmaisversio:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://free.be.com">http://free.be.com</a> tai <a href="ftp://ftp.sunet.se/pub/os/BeOS/beos/BeOS5-PersonalEdition.exe">ftp://ftp.sunet.se</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.dataclub.fi">Dataclub</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">480 mk (versio 4.5 Dataclubista)</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
