<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Buddha Flash</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Lyttinen &lt;<a href="mailto:virgo@vip.fi">virgo@vip.fi</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Sattuipa niin, ett&auml; yhten&auml; p&auml;iv&auml;n&auml; boksikoneeseeni oli selv&auml;sti tarvetta saada CD-ROM-asema ja isompi kiintolevy. Laskiessani kustannuksia, paljonko mahtaisi maksaa A2000:n p&auml;ivit&auml;minen niin ett&auml; CD-ROM, Zip ym. toimisivat sen kanssa ongelmitta osoittautui melko hintavaksi (GuruROM).
						<p>Pohdittuamme ties monettako kertaa Boogien kanssa ongelmaa p&auml;&auml;dyimme Buddha Flashiin, joka oli melko uusi vehje silloin ja antoi paljon paremmat edellytykset koneeni p&auml;ivityksille kuin pelkk&auml; GuruROM. Hintakin oli melko lailla sama, ja Buddha tarjosi kaksi IDE-v&auml;yl&auml;&auml; (yhteens&auml; 4 laitetta) sek&auml; A1200-mallisen kelloportin, johon saisi mm. nopean sarjaporttilaajennuksen. Samalla s&auml;&auml;st&auml;isin laitekustannuksissa, sill&auml; tarvittavat suuremmat kiintolevyt ja CD-ROMit l&ouml;ytyiv&auml;t. Jo jonkin aikaa oli kytenyt idea vaihtaa IDE-laitteet pois ja muuttaa kaikki SCSI-v&auml;yl&auml;isiksi. Boksikoneessa oli 1 Gt SCSI-levy ja ulkoinen swap-levy oli my&ouml;s gigainen. N&auml;m&auml; yhdist&auml;m&auml;ll&auml; sain saman kiintolevykapasiteetin kuin ennenkin. Oli my&ouml;skin toiveita, ett&auml; IDE-v&auml;yl&auml;t toimisivat nopeammin A2000:ssa kuin turbon SCSI-II-v&auml;yl&auml; - outoa sin&auml;ns&auml;.
						<p>Rahdattuani upouuden Buddhan kotiin ja asennettuani sen koneeseen oli edess&auml; seuraava ongelma: A2000:ssahan on melko rajoitetusti 3,5&quot;:n laajennuspaikkoja. A1200:sta vaihdossa tuli melko lailla lis&auml;vehkeit&auml; kuten CD-ROM, joka vei viisivarttisen paikan, LS-SuperDisk (120 Mt) toisen 3,5&quot;:n paikan ja viimeinen j&auml;i koneen omalle korppuasemalle, joten paikat olivat t&auml;ynn&auml;. Kiintolevyjen vaihto sai odottaa. SCSI-levyn jouduin laittamaan t&auml;m&auml;n vuoksi uuteen paikkaan poikittain powerin ja CD-ROMin v&auml;liin, ja ihme kyll&auml; se pysyi siin&auml; melko j&auml;m&auml;k&auml;sti.
						<p>Seuraavaksi testi&auml;, miten Buddha toimisi - olihan se autoboottaava eli mit&auml;&auml;n softaa ei periaatteessa tarvinnut asentaa, jos tyytyi pelkkiin IDE-kiintolevyihin. Koneessahan niit&auml; ei sill&auml; hetkell&auml; ollut, joten virta p&auml;&auml;lle... Normaalit rutinat, ja CD-ROMin ja LS-Diskin ledit v&auml;l&auml;htiv&auml;t, niit&auml; siis nuuskittiin. Buddha tuntui toimivan, mutta WorkBenchiin ei kummastakaan merkkej&auml; tietenk&auml;&auml;n tullut, koska softa oli asentamatta. Levyke sis&auml;&auml;n ja asentamaan. Oudon tutulta se tuntuikin: muokattu IDEFixh&auml;n se siell&auml;. Asentaminen onnistui ensimm&auml;isell&auml; kerralla. Nopeutta oli silminn&auml;hden enemm&auml;n kuin A1200:ssa. Boksin kytkemiseen oli en&auml;&auml; aikaa 15 minuuttia, joten oli parempi j&auml;tt&auml;&auml; homma silt&auml; p&auml;iv&auml;lt&auml; ja keskitty&auml; miettim&auml;&auml;n kiintolevyjen asentamista y&ouml;n ajaksi.
						<p>Y&ouml;n aikana heiver&ouml;iset aivoni olivat l&ouml;yt&auml;neet ratkaisun viimeiseen ongelmaan. P&auml;&auml;lle kaatuvista romukasoista kaapin uumenista kaivoin esiin A1200:n tornitusprojektin aikaiset j&auml;&auml;mist&ouml;t, joihin kuului laiteteline. Siihen pystyi asentamaan 3 kpl 3,5&quot; laitetta. Pikainen backup-ruljanssi ulkoisen kiintolevyn kanssa ja j&auml;lleen A2000 osiksi lattialle ja suunnittelemaan laitetelineen asennusta koneen sisuksiin. Se olikin melko helppoa: viimeisist&auml; laitepaikoista p&auml;&auml;kiskot pois, vain yksi lis&auml;reik&auml; ja teline istui paikallaan kuin tehtaan j&auml;ljilt&auml;. Kiintolevyt (2 kpl) paikalleen ja kotelo kiinni - kaikki toimi kuten viimeksikin. Bootti tosin hoidettiin ulkoisen kiintolevyn avustamana. IDE-levyt n&auml;kyiv&auml;t heti ilman kikkailuja WB:ss&auml;, kuten olin aavistellutkin.
						<p>Osiot oli kuitenkin muokattava uusiksi. HDToolBox esiin ja SCSI_device_name=SCSI.device (entinen GVPSCSI) ja k&auml;yntiin. Systeemi toimi identtisesti A1200:n kanssa, ei ongelmia. Tehty&auml;ni osiot kopioin systeemin takaisin koneen sis&auml;&auml;n IDE-levylle ja boottia - kaikki ok. Pikaiset testit nopeuksille, ja hah - todella IDE oli nopeampi kuin entinen SCSI-levy. Eik&auml; siin&auml; mit&auml;&auml;n, mutta siirto oli tasaisempaa kuin ennen: Delfinan &auml;&auml;nitys onnistui ilman jippoilua p&auml;tkim&auml;tt&auml; heti ensimm&auml;isell&auml; kerralla. Sama ilmi&ouml; toistui muissakin operaatioissa ja mm. poisti er&auml;&auml;n boksia riivanneen ongelman: uploadin aikana SCSI-kiintolevy tallentaessaan tietoja aiheutti sarjaporttiin overflow-ilmi&ouml;n - hyvin &auml;rsytt&auml;v&auml;&auml;. Tuon kiersin siten ett&auml; vedin johdon kiintolevyn valolta suoraan diodin v&auml;lityksell&auml; RTS-pinniin, mutta nyt sit&auml; virityst&auml; ei en&auml;&auml; tarvittu.
						<p>Systeemi toimi, aika siirty&auml; A1200:n p&auml;ivitt&auml;miseen SCSI-levyll&auml;. Illan siin&auml; touhutessani koitti hetki, jolloin kello-ohjattu kytkin k&auml;ynnisti boksin. CD-ROM piti omat rutinansa j&auml;lleen kerran, mutta sitten: pelkk&auml; hijaisuus. Aikaa oli 15 minuuttia. Pikaisen diagnoosin j&auml;lkeen kone ei mill&auml;&auml;n suostunut k&auml;ynnistym&auml;&auml;n. GVP:n kortti ei ilmeisesti tyk&auml;nnyt olla ilman levyj&auml;&auml;n. Pikainen ohjekirjan selaus, ja kyll&auml;, jos levyj&auml; ei ole yht&auml;k&auml;&auml;n, on niit&auml; kontrolloiva jumpperi poistettava. Olisihan se l&auml;htenyt k&auml;yntiin aikansa pohdittuaan, mutta ei auttanut muu kuin ottaa kone auki ja se kirottu jumpperi pois. Kone takaisin l&auml;j&auml;&auml;n, aika alkoi olla tiukalla, mutta lopulta sain koneen nippuun ja k&auml;yntiin hieman ennen m&auml;&auml;r&auml;aikaa.
						<p>Olen aina h&auml;mm&auml;stellyt, miten boksin k&auml;ytt&auml;j&auml;t osaavat aavistaa, milloin olen ropaamassa konetta, koska poikkeuksetta aina joku soittaa juuri silloin kun kone on ep&auml;kunnossa. N&auml;in k&auml;vi t&auml;ll&auml;kin kertaa, mutta ehdinp&auml;s ajoissa... Mutta jos teen backupin ja ajan sit&auml; A1200:lla sen aikaa kun ropaan, ei silloin soittoja kuulu. (Boksi on avoinna 24h ja vastaa numerosta (03) 367 0962.)</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.jschoenfeld.com/eindex.html">Individual Computers</a>, Jens Sch&ouml;nfeld</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi">Gentle Eye Ky</a>, <a href="mailto:ge@vip.fi">ge@vip.fi</a>, puh. (03) 363 0048</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">520 mk (4/2000)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga, Zorro-v&auml;yl&auml;</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekniikkaa:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>autoboottaava (my&ouml;s KS 1.3:ssa)
							<li>kaksi IDE-porttia, max. 4 IDE-laitetta
							<li>ohjelmallisesti muutettava IDE-ajoitus
							<li>A1200-yhteensopiva kelloportti
							<li>laajennuspaikka HyperCOM+-IO-kortille
							<li>64 kt flashrom
						</ul>
					</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
