<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Delfina Lite</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><a href="http://www.saunalahti.fi/halmej/">Joni Halme</a> &lt;<a href="mailto:halmej@saunalahti.fi">halmej@saunalahti.fi</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Koneeni oli pitk&auml;&auml;n ollut ilman mit&auml;&auml;n suurempaa uudistusta. L&ouml;ysin Keltaisesta P&ouml;rssist&auml; ilmoituksen myyt&auml;v&auml;st&auml; Delfina Litesta. Vaikka minulla ei ollut mit&auml;&auml;n erityist&auml; tarvetta &auml;&auml;nikortille, ottivat tunteet niskalenkin j&auml;rjest&auml;ni ja l&auml;hetin s&auml;hk&ouml;postia ilmoittajalle. Parin viikon neuvottelujen j&auml;lkeen menin pankkiin ja nostin opintotukeni. Eip&auml; aikaakaan, kun postiennakkoilmoitus tipahti postiluukusta. Paketti oli nuhjaantunut, sotkettu teipill&auml; ja ep&auml;ilytt&auml;v&auml;n kevyt. Avattuani sen, l&ouml;ysin sielt&auml; pehmustetun kolmion muotoisen kortin, muutaman levykkeen ja ohuen ohjekirjasen. Hommiin.
						<p>L&ouml;ysin kortista kaksi line in -liitint&auml;, CD audio in -liittimen ja yhden line out -liittimen. CD audio in oli sis&auml;inen liitin ja romppuasemani oli ulkoinen, joten siit&auml; ei paljon hupia irronnut. En vaivautunut tutkimaan asennusohjeita, vaan avasin koneeni ja laitoin kortin Zorroon kiinni. Tiukkaa teki, mutta kyll&auml; se siit&auml;. Pari RC-liitint&auml; ja hieman johtoa, ja ohjasin Amigan vanhat audiot toiseen sis&auml;&auml;ntuloon. Sen j&auml;lkeen viel&auml; johto kortin ulostulosta vahvistimeen, ja valmista oli.
						<p>Sitten siirryin softan pariin. Koneessani oli OS 3.5, ja se tuotti ongelmia asennusohjelmalle. K&auml;ynnistin koneen toisen kiintolevyosion kautta, jolla oli viel&auml; OS 3.1. Sinne asennus sujui ongelmitta. Kopioin sitten vain tarpeelliset ohjelmat DOpuksella OS 3.5 -osiolle, ja homma oli valmis. Koneessani oli jo valmiina AHI, mutta jos sit&auml; ei ole, niin se on muistettava asentaa my&ouml;s. Toiveikkaana k&auml;ynnistin koneen uudestaan. Heti ensimm&auml;isen&auml; huomioni kiinnitti kohahdus, joka tuli ulos vahvistimesta k&auml;ynnistett&auml;ess&auml;. My&ouml;hemmin k&auml;vi ilmi, ett&auml; kohahdus kuuluu aina kun ajetaan DelfMem, joka k&auml;ynnist&auml;&auml; kortin. Vaihdoin DelfInit-ohjelmaan, jonka pit&auml;isi toimia paremmin 040- ja 060-prosessoreilla. Mit&auml;&auml;n eroa en kuitenkaan huomannut, mutta ei se kohahdus kyll&auml; mitenk&auml;&auml;n haittaa.</p>
						<center>
							<img height="158" width="390" src="kuvat/delfinaprefs.jpg" border="0" alt=""></center>
						<p>Testasin ensin Amigan omaa audiota. Mit&auml;&auml;n ei kuulunut ja olin ihmeiss&auml;ni. Sitten hokasin k&auml;ytt&auml;&auml; DelfPrefs-ohjelmaa. Sinne oli mykistetty molemmat sis&auml;&auml;ntulot. Sen korjattuani &auml;&auml;net kuuluivat normaalisti. Sitten asensin AHI:n k&auml;ytt&auml;m&auml;&auml;n Delfinaa. Laitoin AHI unit 3:n, jonka kautta kuuntelen MP3:ia, k&auml;ytt&auml;m&auml;&auml;n Delfina 16 bit stereo++ -tilaa. Taajuudeksi laitoin maksimin eli 48000 Hz. Sitten Amplifier V2 p&auml;&auml;lle ja musiikki soimaan. &Auml;&auml;ninautinto oli sanoinkuvaamaton. Ennen pidin Paulan audiota ihan hyv&auml;n&auml;, koska en paremmasta tiennyt, mutta nyt en palaisi siihen mill&auml;&auml;n.</p>
						<center>
							<img height="163" width="390" src="kuvat/amplifier.jpg" border="0" alt=""></center>
						<p>P&auml;&auml;tin siirty&auml; askeleen eteenp&auml;in ja vaihdoin AHI-tilaksi Delfina Hifi 16 bit stereo++. Nyt tulivat ensimm&auml;iset ongelmat. Kone hidasteli todella pahasti. CPU-rasitus oli 100%, ja se oli kummallista, sill&auml; olihan minulla sent&auml;&auml;n 060. Otin yhteytt&auml; myyj&auml;&auml;n, joka sanoi ettei itse koskaan havainnut ongelmia. Otin yhteytt&auml; Gentle Eye:hin, mutta h&auml;nk&auml;&auml;n ei osannut neuvoa. Havaitsin ongelman ilmenev&auml;n hifi stereo -tiloissa. T&auml;m&auml; on minulle yh&auml; mysteeri, ja jos joku tiet&auml;&auml; syyn, olisin kiitollinen ratkaisusta. Mutta koska jo pelk&auml;st&auml;&auml;n normaali- ja fast-tilat ovat laadukkaita, annoin asian olla.</p>
						<center>
							<img height="167" width="193" src="kuvat/delfinaload.jpg" border="0" alt=""></center>
						<p>Er&auml;s huomaamani sivuvaikutus oli se, ett&auml; kaikki AHIn Delfina-tilat viev&auml;t CPU-loadia hieman Paulaa enemm&auml;n, mutta ajattelin ett&auml; kyll&auml;h&auml;n sen kest&auml;&auml;, kun tiet&auml;&auml; kuinka hyv&auml;&auml; se minulle tekee. :) Sit&auml; paitsi, se oli niin pieni nousu, ettei sit&auml; edes tahdo huomata. Virittelin itselleni viel&auml; johdon CD-ROM-asemasta kortin toiseen sis&auml;&auml;ntuloon. Te, jotka ette ole sit&auml; viel&auml; kokeilleet, niin suosittelen l&auml;mpim&auml;sti. CD-audiot luovat Genetic Speciesiin todella mahtavat tunnelmat.</p>
						<center>
							<img height="93" width="249" src="kuvat/delfinadrawer.jpg" border="0" alt=""></center>
						<p>Delfinan mukana tulee joukko ohjelmia. DelfPrefsilla asetetaan sis&auml;&auml;ntulot, &auml;&auml;nenvoimakkuudet ja joitain filttereit&auml; - eritt&auml;in k&auml;tev&auml;. DelFX:ll&auml; voidaan kortissa olevan tehokkaan DSP-piirin avulla lis&auml;t&auml; &auml;&auml;neen jos jonkinmoista efekti&auml; ja tehostetta. DelfLoad taas n&auml;ytt&auml;&auml; kortin prosessorinkulutuksen. Kaikki ohjelmat k&auml;ytt&auml;v&auml;t MUIta, joten ne ovat eritt&auml;in helppok&auml;ytt&ouml;isi&auml; ja hyv&auml;n n&auml;k&ouml;isi&auml;. Hain my&ouml;s DelfMPEG-ohjelman. Se ohjelma tosiaan n&auml;ytt&auml;&auml;, kuinka tehokas Delfinan DSP-piiri todella on: se soittaa MP2-musiikkia ja purkaa sen DSP:ll&auml;. T&auml;m&auml;n ansiosta CPU-kulutus on py&ouml;re&auml; nolla. Pysyn kuitenkin mieluummin perinteisiss&auml; MP-soittimissa, koska DelfMPEGill&auml; ei ole GUI:ta ja se soittaa vain MP2-musiikkia.
						<p>Loppujen lopuksi ainoat edut, jotka kortista itse irti sain, olivat parempi &auml;&auml;nenlaatu ja CDDA, mutta sille joka harrastaa musiikkia enemm&auml;n Amigallaan, on t&auml;m&auml; suomalainen supertuote pakko-ostos. Hanki viel&auml; itsellesi vaikkapa AudioLab16, niin sinulla on k&auml;yt&ouml;ss&auml;si vaarallisen hyv&auml; yhdistelm&auml;.
						<p>Delfina Litest&auml; ovat kirjoittaneet my&ouml;s Teijo Liiri ja Timo Kemppaala Sakussa #23 sek&auml; Esa Lyttinen Sakussa #31. Lue t&auml;st&auml; Sakusta my&ouml;s <a href="delfinaplus.html">juttu Delfina Plus -kortista</a>!
					</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.petsoff.com">Petsoff Limited Partnership</a>, <a href="mailto:petsoff@petsoff.com">petsoff@petsoff.com</a><br>
						K&auml;y katsomassa Delfinan tarkat specsit. T&auml;&auml;lt&auml; l&ouml;yd&auml;t my&ouml;s uusimmat ajurit.</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga, Zorro II, AmigaOS 2.04, 68020, 5 Mt kiintolevytilaa</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga 3000, OS 3.5, CyberStorm MK3 060, CyberVisionPPC, 2 Mt Chip, 64 Mt Fast, 3,2 Gt UW-SCSI, 4,3 Gt IDE, 24x SCSI-CD-ROM, Buddha Flash -IDE-ohjain, A2232</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekniikkaa:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>40 MHz Motorola DSP56002, 24-bittinen datav&auml;yl&auml;
							<li>96kB (32kWords) SRAM, zero-waitstate (12ns)
							<li>Stereo audio codec (Crystal CS4231A)
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Aminet:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://ftp.sunet.se/pub/aminet/mus/play/DelfAIFF.lha">DelfAIFF</a> (23 kt), <a href="http://ftp.sunet.se/pub/aminet/mus/play/DelfMPEG.lha">DelfMPEG</a> (49 kt), <a href="http://ftp.sunet.se/pub/aminet/util/misc/DelfInit.lha">DelfInit</a> (14 kt)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Muita ohjelmia:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.lysator.liu.se/~lcs/ahi.html">AHI</a>, t&auml;rke&auml; ohjelma, jos haluat hy&ouml;ty&auml; kortista.<br>
						<a href="http://amigaamp.amiga-software.com/">AmigaAMP</a> ja <a href="http://www.katodev.de">Amplifier</a>, MP-soitto-ohjelmia.<br>
						<a href="http://kalahari.ton.tut.fi/~k-p/">HippoPlayer</a>, mod-soitto-ohjelma, AHI-tuki.<br>
						<a href="http://www.act-net.com/wenzel/index_e.html">Play16</a>, soittaa eri sampleformaatteja, AHI-tuki.</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
