<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Delfina Plus</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Timo Kemppaala</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Aikaisemmin Delfinan omistajat ovat saaneet k&auml;rsi&auml; hitaasta tiedonsiirrosta muistipalikoille ja/tai medialle Delfina Liten kanssa. Ongelmaa pahensi viel&auml; sekin, jos ei omistanut SCSI-korttia ja nopeata kiintolevy&auml;. Olen kyll&auml; kuullut puhuttavan, ett&auml; nopea kone ja IDE-levy riitt&auml;v&auml;t mainiosti, mutta oma kokemukseni puhuu kyll&auml; toista.
						<p>Amiga-kansan painostuksesta Petsoff teki kuin tekikin kortin muutoksineen. Toisaalta muutokset eiv&auml;t olleet kovinkaan merkitt&auml;vi&auml; Liteen n&auml;hden, mutta arvokkaita kuitenkin. Petsoff l&auml;hti tinkim&auml;&auml;n &quot;luvatusta&quot; Delfina Super -mallista, johon olisi ollut mahdollista tunkea jopa 48 Mt muistia. T&auml;mm&ouml;inen kortti olisi ollut jo jotakin.
						<p>Riitt&auml;&auml; unelmointi. Delfina Plus omaa t&auml;ysin 16-bittisen v&auml;yl&auml;n, jolla se kommunikoi koneen kanssa. Pelkk&auml; v&auml;yl&auml;nopeuden nostaminen ei kuitenkaan Petsoffille riitt&auml;nyt, joten DSP-prosessori koki my&ouml;s muutoksia. Delfina Plussaa vauhdittaa Motorolan 80 MHz DSP56002 ja viel&auml;p&auml; ohjelmoitava sellainen, kuten muissakin Delfina-malleissa. T&auml;h&auml;nk&auml;&auml;n eiv&auml;t tyytyneet, vaan muistiv&auml;yl&auml; sai my&ouml;s muutoksia ja kortin yleisasua muutettiin pikkuisen. Parempi codec ja muuta s&auml;l&auml;&auml; on nyt tiukasti parilla piirill&auml;.
						<p>Aikaisemmin tehdyn Delfina Liten siirtonopeudet olivat alhaisia, jopa niinkin alhaisia, ett&auml; se kulutti CPU:ta liikaa, jos taustalla tehtiin jotakin. Musiikkiohjelmistojen py&ouml;ritys tuotti minunkin koneelleni tuskaa Lite&auml; k&auml;ytett&auml;ess&auml;. Musiikin kuuntelu onnistui vain l&auml;hestulkoon romputtimella ja Liteen kytketyill&auml; kaapeleilla, ja jos halusi kuunnella MOD/S3M-tiedostoja yms., sekin kyll&auml; onnistui, mutta tehonkulutus oli mahtava.
						<p>Delfina Plus taas voittaa er&auml;n kuin er&auml;n miss&auml; k&auml;yt&ouml;ss&auml; tahansa verrattuna Liteen. Musiikkiohjelmiston ajoa ei en&auml;&auml; oikein edes huomaa, kun soittaa kappaleita AHI-ajureilla. Parahiksi uuden kortin saamisen aikoihin tuli erinomainen ohjelma. Mr. Smackina tunnettu Michael Henke koodasi ensimm&auml;isen version AIFF-tiedostoja (AIFF-SSND ja AIFF-ADP4) soittavasta DelfAIFF-ohjelmasta Delfinan DSP-prosessorille. Sit&auml; seurasi melkein heti DelfMPEG, joka soittaa MPEG Layer 2 -formaatissa olevia kappaleita DSP:ll&auml;. Nettailunkin aikana kuuntelen yleens&auml; MP2-formaatissa olevia kappaleita.
						<p>Delfina Plus tarjoaa mahtavia etuja Liteen verrattunna. Plussan muistia on helppo lis&auml;t&auml;. Digitaalinen sis&auml;&auml;nmeno pit&auml;isi tulla l&auml;hiaikoina Petsoffilta. MP3-ohjelmistoa suunnitellaan Delfinalle parasta aikaa, ja jahka se ilmestyy, niin MP3:ia voi kuunnella joko ohjelmalla itsell&auml;&auml;n tai erillisen laitteen (mp3.device) kautta ohjelmilla, jotka antavat device-m&auml;&auml;reen. Totta kai t&auml;m&auml; toimii my&ouml;s vanhemmilla korteilla, mutta jos muistista on osa k&auml;yt&ouml;ss&auml;, vanha Delfina saattaa jumittaa koneen, kun DSP joutuu koville. Uusi Plus jaksaa py&ouml;ritt&auml;&auml;, vaikka taustalla olisi muutama ohjelmakin.
						<p>Kortti on ainakin minulla ahkerassa k&auml;yt&ouml;ss&auml;, ja olen siihen eritt&auml;in tyytyv&auml;inen. Suosittelen kuitenkin ainakin 68030/50 MHz -konetta, sill&auml; AHI-moodissa soittaminen vie tehoa jonkin verran.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.petsoff.com">Petsoff Limited Partnership</a>, <a href="mailto:petsoff@petsoff.com">petsoff@petsoff.com</a></tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2">Hyv&auml;&auml;:</font></td>
						<td width="50%" bgcolor="#d8ecfd">
							<ul>
								<li>hyv&auml; &auml;&auml;nenlaatu (t&auml;ysi 10)
								<li>voimakas DSP
								<li>soitettaessa systeemin reagointi
								<li>ohjelmoitava
								<li>DelfMPEG, DelfAIFF ja efekteri
								<li>moniajo
							</ul>
						</td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2">Huonoa:</font></td>
						<td width="50%" bgcolor="#d8ecfd">
							<ul>
								<li>Zorro II -v&auml;yl&auml;
								<li>muistin v&auml;hyys
							</ul>
						</td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
						<td width="50%" bgcolor="#d8ecfd">98%</td>
					</tr>
					<tr>
						<td width="30%" bgcolor="#d8ecfd"><font size="2">Aminet:</font></td>
						<td width="50%" bgcolor="#d8ecfd"><a href="http://ftp.sunet.se/pub/aminet/mus/play/DelfAIFF.lha">DelfAIFF</a> (23 kt), <a href="http://ftp.sunet.se/pub/aminet/mus/play/DelfMPEG.lha">DelfMPEG</a> (49 kt), <a href="http://ftp.sunet.se/pub/aminet/util/misc/DelfInit.lha">DelfInit</a> (14 kt)<br>
							Lis&auml;&auml; ohjelmavinkkej&auml; t&auml;m&auml;n Sakun <a href="delfinalite.html">Delfina Lite -jutussa</a>!</td>
					</tr>
				</table>
				<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
				<p></center>
		</body>

	</html>
