<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Epsonia Amigaan</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><a href="http://www.saunalahti.fi/halmej/">Joni Halme</a> &lt;<a href="mailto:halmej@saunalahti.fi">halmej@saunalahti.fi</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">	
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jos tarvitset koneeseesi laadukkaan skannerin ja tulostimen, ovat Epsonin tuotteet yksi parhaista vaihtoehdoista. Itse olin etsiskellyt hyv&auml;&auml; paria jo jonkin aikaa, ja sitten se l&ouml;ytyi. Paikallisessa kodinkoneliikkeess&auml; oli sopivaan hintaan Epson Stylus Photo 750 ja GT-7000 Photo. Parin viikon j&auml;lkeen olin n&auml;iden kahden kaunokaisen onnellinen omistaja. Tiesin, ettei viel&auml; silloin l&ouml;ytyisi kunnollisia ajureita Amigalle etenk&auml;&auml;n tulostimeen, mutta Irseesoft oli luvannut piakkoin tehd&auml; p&auml;ivityksen TurboPrint-pakettiinsa. Ajattelin my&ouml;s, ett&auml; jos kerran Amigalle ei ajureita l&ouml;ydy, niin Macintoshille kyll&auml; l&ouml;ytyy, ja kun koneessa on Shapeshifter ja Fusion, niin kyll&auml;h&auml;n se toimii. N&auml;in ei kuitenkaan k&auml;ynyt, kuten my&ouml;hemmin huomaatte.
						<p>Kotona rupesin innoissani purkamaan paketteja. Huomasin heti, ett&auml; Epson laittaa kyll&auml; hyv&auml;t ohjelmistot laitteiden mukaan. Skannerin mukana tuli kolme CD:t&auml;, joista l&ouml;ytyi ajurit, v&auml;riopas ja ohjelmistoa Windowsille ja Macille. Ohjelmista mainittakoon Adobe Photoshop 5.0 Limited edition, Adobe Pagemill, Adobe Acrobat Reader, TextBridge Classic, Presto! Pagemanager ja muuta. Stylus Photon mukana tuli viisi CD:t&auml;: ajurit, Online Guide ja ohjelmia kuten Adobe Photodeluxe 3.0, Epson Photosheet &amp; Spin Panorama sek&auml; Print Adventure Sticker Edition.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Skanneria testaamaan</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p>Skanneria sai USB- ja SCSI-liit&auml;nn&ouml;ill&auml;. Valinta oli minulle ilmiselv&auml;sti SCSI. Paketin mukana tuli my&ouml;s SCSI-ohjain PC:lle. Hankin skanneriin my&ouml;s filmi/dia-adapterin. Skanneri oli helppo asentaa: SCSI-kaapeli Amiga 3000:n taakse ja virtasta pistokkeesta. Skannerissa on sis&auml;inen terminaattori, joten sellaisesta ei tarvitse huolehtia. SCSI ID:n voi valita laitteen takaa.
						<p>P&auml;&auml;tin ensiksi kokeilla mukana tullutta Mac-softaa emulaattorilla. Ajurit asentuivat tuosta vain. Innoissani komensin PhotoShopiani skannaamaan esikatselukuvan, ja kone vastasi yht&auml; innostuneesti ettei k&auml;y. Mac v&auml;itti kivenkovaan, ettei koneeseen ole liitetty skanneria. Testasin Shapeshifter 3.9:&auml;&auml; ja Fusion 3.1:&auml;, mutta molemmat ilmoittivat samoin. Kokeilin ohjelmaa, joka tarkistaa SCSI-laitteita Macilla. Se kertoi, ett&auml; koneesta l&ouml;ytyy Epson GT-7000 Flatbed -skanneri, mutta Epson Twain v&auml;itti toista. Hetken potkimisen j&auml;lkeen luovutin.
						<p>Siirryin AmigaOS 3.1:n puoleen. Olin aiemmin hakenut jo l&auml;j&auml;p&auml;in Epsonin ajureita Aminetist&auml;. Testasin ensin BetaScan-ohjelmaa, joka on karu mutta ilmainen. Se skannasi iloisesti esikatselukuvan ja lopulta koko kuvan. Ohjelma on hyvin yksinkertainen, eik&auml; tosiaan sopinut minun tarpeisiini, mutta se on helppo k&auml;ytt&auml;&auml;. ImageFX 3.0 oli ehdottomasti parempi vaihtoehto minulle. Ohjelma sis&auml;lsi paljon enemm&auml;n optioita ja oli muutenkin k&auml;tev&auml;. Esikatselussa oli vikana se, ett&auml; v&auml;rit olivat hieman sekaisin, mutta t&auml;ll&auml; ei ole mit&auml;&auml;n v&auml;li&auml;. Skannaukset onnistuivat 100 dpi:st&auml; aina 2400:aan. ImageFX:st&auml; voi skannatessa valita erilaisia v&auml;rin, kirkkauden ja kontrastin korjausvaihtoehtoja. Perusasetuksilla tuli kuviin aivan liikaa punaista ja sinist&auml;. T&auml;m&auml; korjaantui vaihtamalla color correctioniin &quot;ink jet&quot; ja gamma correctioniin &quot;printer-b&quot;.
						<p>Seuraavaksi kokeilin hankkimaani filmi/dia-adapteria. Se asennetaan yksinkertaisesti skannerin p&auml;&auml;lle ja vedet&auml;&auml;n johto skannerin option-liittimeen. Mukana tulee my&ouml;s kolme erilaista filmitukea eri negatiiveille. Ensin p&auml;&auml;lle adapteri ja sitten skanneri. IFX:n asetuksiin piti laittaa transparency unit. Testasin ensin diaa ja tulos oli mahtava. Ihan itsekin &auml;llistyin, kun katselin kuvaa, joka oli eritt&auml;in tarkka ja siin&auml; oli kauniit v&auml;rit. Onnistunut testaus. Sitten testasin tavallista kinonegatiivia, ja ensimm&auml;iset ongelmat iskiv&auml;t: v&auml;rit olivat aivan mit&auml; sattuu. Testasin eri asetuksia, mutta mik&auml;&auml;n ei auttanut. Sitten testasin ammattinegatiivia: sama juttu, v&auml;rit olivan aivan liian haaleat. Harmaas&auml;vyill&auml; skannaus oli siedett&auml;v&auml;n rajoissa. Pettymys oli suuri. Testasin my&ouml;s ScanTrax-ohjelman demoa. T&auml;m&auml; skannasi upeasti normaalit kuvat, muttei tukenut adapteria.
						<p>My&ouml;hemmin kuulin ohjelmasta nimelt&auml; ScanQuix. Otin yhteytt&auml; tekij&auml;&auml;n, joka kertoi ett&auml; ScanQuix 5 tukee Epsonia ja adapteria t&auml;ydellisesti. T&auml;m&auml; kuulosti lupaavalta, mutta tilaaminen kuitenkin my&ouml;h&auml;styi, ja siihen asti k&auml;yt&auml;n ImageFX 3:a. SQ5 on jo kuitenkin postissa ja saapunee minulle pian. Skannerissa on my&ouml;s pikaskannauspainike, mutta mik&auml;&auml;n ohjelma ei viel&auml; tue sit&auml;. Toivottavasti SQ5 todistaa toisin. Vaikka skannerin kanssa oli aluksi ongelmia, on se j&auml;lkeenp&auml;in osoittautunut eritt&auml;in hyv&auml;ksi hankinnaksi.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Tulostin kehiin</b></font></center>
					</td>
				</tr>
				<td width="50%" bgcolor="#d8ecfd">
					<p>Tulostin oli upea, kaunis muotoilu hiveli silm&auml;&auml;. Tulostimessa on kolme liitostapaa: rinnakkais-, USB- ja sarjaporttiliitin Macille. Kaksi johtoa kiinni ja paperituki paikoilleen, ja sitten musteiden kimppuun. Mukana tuli yksi v&auml;rikasetti ja yksi musta kasetti. Erikoisuutena Epson Stylus Photo 750:ssa on se, ett&auml; v&auml;rikasetissa on viisi v&auml;ris&auml;ili&ouml;t&auml;. Kahta lis&auml;v&auml;ri&auml; k&auml;ytet&auml;&auml;n antamaan paremmat v&auml;ris&auml;vyt valokuvatulostuksessa. Tuki n&auml;ille lis&auml;v&auml;reille l&ouml;ytyy vasta TurboPrint 7.1:st&auml;. Kasettien asennus on helppoa: kansi auki, revit&auml;&auml;n keltainen teippi kasetista ja kasetti laitetaan sis&auml;&auml;n. Mielest&auml;ni kasetteja ei voi mitenk&auml;&auml;n asentaa v&auml;&auml;rin, mutta eih&auml;n sit&auml; koskaan tied&auml;. ;) T&auml;m&auml;n j&auml;lkeen kone latasi mustetta pari minuuttia.
					<p>Jos luulin, ett&auml; skannerin softat olivat ongelmaisia, niin Photo 750 vasta vaikea olikin. Kuten skannerin kanssakin, testasin ensin Macin ajureita. Asennus meni ongelmitta, mutta loppujen lopuksi ei tulostintakaan voi k&auml;ytt&auml;&auml; t&auml;ll&auml; tavoin. AmigaOS:lle ei l&ouml;ydy Photo 750 -ajureita mist&auml;&auml;n. Korvaavana ajurina voi k&auml;ytt&auml;&auml; Stylus Color 600:n tai 800:n ajureita, mutta ne ovat hyvin rajoitettuja. Olin jo tilannut Gentle Eye:lta TurboPrint 7.0:n, mutta odotellessa testailin mm. TurboPrint 5 Litea. 7.0:ssa ei viel&auml; ollut ajuria Photo 750:lle, mutta koska IrseeSoft oli luvannut tehd&auml; ajurit pikapuoliin, en n&auml;hnyt ongelmaa.</p>
					<center>
						<a href="kuvat/tp_big.jpg" target="_blank"><img height="263" width="350" src="kuvat/tp_small.jpg" border="0" alt=""></a></center>
					<p>Asensin TP7:n. Oppaissa ehdotettiin k&auml;ytt&auml;m&auml;&auml;n sijaisajurina Stylus Color 740:n ajuria. Paketissa oli kuitenkin ajurit Photolle ja Photo 700:lle, jotka my&ouml;s asensin, mutta ne olivat rajoitettuja 360x360-tarkkuuteen, joten se siit&auml;. Color 740 -ajuri toimi suhteellisen hyvin. Tulostelin kuvia TP:n mukana tulleella Graphics Publisher -ohjelmalla. Ik&auml;v&auml; kyll&auml; t&auml;m&auml; ajuri ei tukenut Photon kahta lis&auml;s&auml;vy&auml; ja tarkkuus oli rajoitettu 720x720:een. Tulostelin useita valokuvia ja laatu oli hyv&auml;&auml;, vaikka minusta se olisi saanut olla parempaakin. P&auml;ivitys TurboPrint 7.1:een korjasi n&auml;m&auml; ongelmat ja tulostuslaatu parani kertaheitolla. Sain k&auml;ytt&ouml;&ouml;ni lis&auml;v&auml;rit ja maksimitarkkuus nousi 1440 pisteeseen tuumalle. 7.11b-ajuri antoi viel&auml; lis&auml;&auml; ominaisuuksia kuten erikoispaperikoot jne. Versio 7.1 tukee my&ouml;s PowerPC-tulostusta.</p>
					<center>
						<img height="183" width="350" src="kuvat/escutil.jpg" border="0" alt=""></center>
					<p>Toinen t&auml;rke&auml; ohjelma ihan mille tahansa Epsonin tulostimelle on Epson Stylus Color Utility, lyhyesti ESCUtil, joka l&ouml;ytyy Aminetist&auml;. Ohjelma tarjoaa samat ominaisuudet kuin tulostimen mukana tulleet ohjelmat Macille ja PC:lle, eli graafisen k&auml;ytt&ouml;liittym&auml;n, jolla voi hy&ouml;dynt&auml;&auml; tulostimen sis&auml;isi&auml; toimintoja: suuttimien tarkistus, puhdistus ja kalibrointi, testisivujen tulostus ja paljon muutakin. Se tukee my&ouml;s Epson Stylus Photo -tulostimien musteen m&auml;&auml;r&auml;n tarkistusta. T&auml;m&auml; on eritt&auml;in hieno toiminto, mutta vaatii ik&auml;v&auml; kyll&auml; IO-kortin. ESCUtil l&ouml;ytyy TurboPrint-paketista, mutta kannattaa hakea uusin versio suoraan Aminetist&auml;. Ohjelmaan l&ouml;ytyy my&ouml;s suomalainen k&auml;&auml;nn&ouml;s - allekirjoittaneen tekem&auml;. :)
					<p>Epson Stylus Photo 750 ja Epson GT-7000 Photo ovat molemmat eritt&auml;in laadukkaita laitteita ja sopivat vaativaankin skannaukseen ja tulostukseen. Muista, ett&auml; silloin on TurboPrint 7.1 l&auml;hes pakko-ostos, eik&auml; skanneristakaan saa t&auml;ysi&auml; tehoja irti, ellei osta kunnon ohjelmistoa. Jos ei kuitenkaan tarvitse parasta mahdollista valokuvaj&auml;lke&auml; ja suuria skannaustarkkuuksia, l&ouml;ytyy Epsonilta muitakin hyvi&auml; ja huokeampia malleja. TurboPrinti&auml;, ScanQuixia ja ImageFX:&auml;&auml; myy <a href="http://www.ge.vip.fi">Gentle Eye Ky</a>, <a href="mailto:ge@vip.fi">ge@vip.fi</a>, puh. (03) 363 0048.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.epson.com">Seiko Epson Corporation</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga 3000, OS 3.5, CyberStorm MK3 060, CyberVisionPPC, 2 Mt Chip, 64 Mt Fast, 3,2 Gt UW-SCSI, 4,3 Gt IDE, 24x SCSI-CD-ROM, Buddha Flash -IDE-ohjain, A2232, Viewpoint VP1570VA 15&quot;</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Aminet:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://ftp.sunet.se/pub/aminet/text/print/ESCUtil.lha">ESCUtil</a> (149 kt), <a href="http://ftp.sunet.se/pub/aminet/hard/drivr/BetaScan_2.15.lha">BetaScan</a> (169 kt), <a href="http://ftp.sunet.se/pub/aminet/hard/drivr/BetaScanEpson.lha">BetaScan-ajurit</a> (21 kt)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Muut ohjelmat:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.irseesoft.com">TurboPrint</a>, <a href="http://www.rbm.de">ScanQuix</a>, <a href="http://www.novadesign.com">ImageFX</a></td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
