<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Ison IDE-kiintolevyn asennus Amigaan</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Karppanen &lt;<a href="mailto:janne.karppanen@quicknet.inet.fi">janne.karppanen@quicknet.inet.fi</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Olen ollut Amiga 1200 -koneeni onnellinen omistaja jo kolme vuotta. Ostin vuoden 1997 alussa Escom-version, jonka 170 Mt:n kiintolevy j&auml;i parissa kuukaudessa pieneksi. Seuraavaksi levyksi hankin 3,5-tuumaisen Seagaten 1,2 Gt:n levyn, Randy-merkkisen IDE-portin tuplaajan sek&auml; CD-ROM-aseman. Seagate viettikin Amigassani 2,5 vuotta ja sai jossain vaiheessa kaverikseen Samsungin 560-megaisen levyn. Amigani on kokenut paljon rattoisia hetki&auml; kanssani, se mm. muutti PC:n tornikoteloon ja kolmas turbokorttikin on jo menossa. Itse asiassa alkuper&auml;isest&auml; Amigastani on j&auml;ljell&auml; en&auml;&auml; ROM-piirit ja hiiri, johon asensin vanhasta Microsoft-hiirest&auml; ottamani pienoismikrokytkimet, alkuper&auml;ismallisten kestoik&auml; kun oli vain n. puoli vuotta.
						<p>Maaliskuussa 2000 tuli isomman kiintolevyn asentaminen ajankohtaiseksi. Olin jo vuoden 1999 puolella asentanut k&auml;ytt&ouml;j&auml;rjestelm&auml;n 3.5-version, joten oletin isojen levyjen tuen olevan kunnossa. P&auml;&auml;tin kuitenkin katsoa version-komennolla tiedostoj&auml;rjestelm&auml;n versiotiedot, ja yll&auml;tyksekseni huomasin, ett&auml; scsi.device oli OS 3.5:st&auml; ja asentamastani BoingBag1:st&auml; huolimatta versio 40, kun sen olisi pit&auml;nyt olla v43. Aikani asiaa ihmetelty&auml;ni sain selville, ett&auml; boottauksen yhteydess&auml; ajettava SetPatch-komento p&auml;ivitt&auml;&auml; Kickstartin DEVS:-hakemistossa olevasta tiedostosta &quot;AmigaOS ROM Update&quot;, jonka kopioin sinne BoingBag-paketista. Boottasin Amigan, ja nyt scsi.device oli v43. Fastfilesystemkin n&auml;ytti olevan v45, mutta aikomukseni oli k&auml;ytt&auml;&auml; tiedostoj&auml;rjestelm&auml;n&auml; ainoastaan <a href="http://www.xs4all.nl/~hjohn/">SmartFileSystemi&auml;</a>, jonka uusin versio on 1.84.</p>
						<center>
							<img height="286" width="350" src="kuvat/seagate.jpg" border="0" alt=""></center>
						<center>
							<i>Kuvan copyright &copy; 2000 Seagate Technology Inc.,<br>
							julkaistu Sakussa oikeudenomistajan luvalla</i></center>
						<p>Kaavin kirstun pohjalta viimeisetkin pennoset ja sain kokoon 850 mk, joilla ostin VK Systemsilt&auml; 8,4-gigaisen Seagaten. Levy on aika mielenkiintoisen n&auml;k&ouml;inen, sen p&auml;&auml;ll&auml; on musta kumihuppu, joka on kulmien kohdalta noin sentin paksuinen ja antaa suojaa kolhuja vastaan. Levy onkin selv&auml;sti entist&auml; Seagatea hiljaisempi varsinkin lukuoperaatioiden aikana, eik&auml; edes kuumene kumihupusta huolimatta yht&auml; paljon. Luvatusta 66,6 Mt/s purskenopeudesta ei ole meik&auml;l&auml;isen k&auml;yt&ouml;ss&auml; hy&ouml;ty&auml;, mutta taaksep&auml;in yhteensopivuus on hyv&auml;, joten levy toimii Amigan PIO-0-ohjaimessa.
						<p>340 G:n kesto on aika paljon luvattu, sill&auml; yleens&auml; levyjen taataan kest&auml;v&auml;n vain 75 G:t&auml;, joka vastaa levyn pudottamista 25 sentin korkeudelta 3 mm:n joustavalle alustalle. T&auml;m&auml; malli kest&auml;isi siis pudottamisen 116 sentin korkeudelta. L&ouml;ysin my&ouml;s tiedon, ett&auml; k&auml;ynniss&auml; ollessaan levy kest&auml;&auml; 63 G:n iskun. Paksuutta levyll&auml; on l&auml;hes tuplasti - entinen Seagate oli vain hiukan yli sentin paksuinen. Samsung puolestaan on yht&auml; paksu kuin uusi Seagate. Laskeskelin huvikseni levyn koon tietokonegigoina ja sain 7,8 Gt, joten ROM-piirill&auml; olevan scsi.devicen kahdeksan gigan rajakaan ei ylittynyt. Annoin kuitenkin varmuuden vuoksi ROM Updaten olla DEVS:-hakemistossa.</p>
						<center>
							<img height="130" width="390" src="kuvat/hdtoolbox.jpg" border="0" alt=""></center>
						<p>Nyt kaikki tuntui olevan kunnossa, joten avasin Amigan kotelon ja liitin vapaiden virtajohtojen puutteen takia uuden levyn kakkosporttiin CD-ROM-aseman tilalle. Osioin sen OS 3.5:n HDtoolbox-ohjelmalla siten, ett&auml; Workbench sai tilaa 200 megaa entisen 30:n sijaan. Seuraavaksi laitoin 50 megan osion, johon suunnittelin asentavani pelk&auml;n k&auml;ytt&ouml;j&auml;rjestelm&auml;n ilman mit&auml;&auml;n lis&auml;roinaa, jolloin voin testata jonkun kaatuilevan ohjelman toimivuuden pelk&auml;ll&auml; OS 3.5:lla. Work-osion suurensin 200 megasta 2 gigaan. Olin kuullut Shapeshifterin sotkevan levyn, jos sen osio on 4 Gt:n yl&auml;puolella, joten tyrkk&auml;sin viel&auml; 500 megan osion sit&auml; varten. Loput osiot meniv&auml;tkin kokonaan tai osittain 4 Gt:n yl&auml;puolelle. Laitoin kaikkien osioiden MaxTransfer-arvoksi 0x00FFFF eli 64 kt, koska Randy-palikan mukana tulleessa IdeFix'96-ohjelmistossa on bugi, jonka takia isot tiedostot hajoavat, jos MaxTransfer on yli antamani arvon.</p>
					</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Vaikeuksien kautta voittoon</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Osioinnin j&auml;lkeen boottasin koneen ja pika-alustin kaikki osiot. Aloitin tiedostojen kopioinnin vanhoilta levyilt&auml; uudelle ensin Filemasterilla, joka kuitenkin kaatuili monta kertaa - olisiko sill&auml; jotain ongelmia ison levyn kanssa. Ainakin se n&auml;ytti vapaan tilan aivan pieleen ja k&auml;ytt&ouml;prosentit olivat joillakin osioilla miinusnerkkiset. Kyll&auml;styneen&auml; Filemasterin sekoiluun kopioin loput tiedot ensin Workbenchist&auml; hiirell&auml;, mutta huomasin jossain vaiheessa, etteiv&auml;t ty&ouml;p&ouml;yd&auml;ll&auml; olevat ikonit eiv&auml;t tulleetkaan mukaan.
						<p>T&auml;ss&auml; vaiheessa ty&ouml;p&ouml;yt&auml; olikin jo aika sekava, l&auml;hes kaikki ikonit n&auml;kyiv&auml;t kahteen kertaan, koska olin v&auml;lill&auml; bootannut (samalla SFS herjasi jotain viimeisen osion toimimattomuudesta), ja p&ouml;yd&auml;lle j&auml;tetyt ikonit tulivat n&auml;kyviin my&ouml;s uudelta levylt&auml;. Asiaa pahensi viel&auml; se, ett&auml; kaikkia osioita oli nyt kaksi kappaletta. Ollessani n&auml;in ep&auml;toivoisessa tilanteessa muistin Amigassa olevan shell-ikkunan, jota heti p&auml;&auml;tin k&auml;ytt&auml;&auml; hyv&auml;ksi. Onneksi Amigalla oli sen verran &auml;ly&auml;, etteiv&auml;t osioiden tunnukset olleet samat, vaan uuden levyn osiot olivat saaneet ykk&ouml;sen per&auml;&auml;ns&auml; tyyliin HD0: -&gt; HD0.1:. Shellin avulla sain viimein kaikki kopioitua.
						<p>Poistin vanhat levyt ja laitoin uuden levyn ensimm&auml;iseen IDE-porttiin. Boottasin ja sain taas painaa cancel-nappia SFS:n herjatessa viimeisen osion toimimattomuutta. Kone resetoitui SetPatchin p&auml;ivitetty&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;n ja k&auml;ynnistyksen alettua n&auml;ytt&ouml; j&auml;i pime&auml;ksi. Resetoin, ja taas sama peli: herjaus, cancel ja pime&auml; n&auml;ytt&ouml;. Jossain vaiheessa keksin tutkia Amigan emolevylt&auml; l&auml;htev&auml;&auml; signaalia TV:n kautta. Nyt vika l&ouml;ytyikin: atapi.deviceh&auml;n siell&auml; herjaili, ett&auml; CD-ROM-asema ei toimi. Painoin cancel ja siit&auml; k&auml;ynnistyikin uusi hauska peli: muutaman sekunnin v&auml;lein n&auml;yt&ouml;lle (t&auml;ll&auml; kertaa sek&auml; BVisionin ett&auml; AGAn kautta) pomppasi nelj&auml; SFS:n herjausikkunaa: kaikki osittainkaan 4 Gt:n yl&auml;puolella olevat osiot eiv&auml;t toimineet.
						<p>Aarrrggghhh! Kyll&auml; meinasivat pelihousut revet&auml;. Pienemm&auml;lt&auml; levylt&auml; bootatessa iso levy toimi hienosti, ja nyt t&auml;m&auml;... Pelasin hauskaa cancel-cancel-cancel-cancel-peli&auml; ja poistin CD0:-ikonin DEVS:-hakemistosta. Boottasin. Sama hauska peli alkoi taas. Nyt ep&auml;ilyni kohdistuivat Idefixiin, joten poistin sen ja l&auml;hes kaiken muunkin startup-sequencesta. Sama peli jatkui edelleen. Cancel-nappia painellen laitoin HDToolBoxilla kaikista 4 Gt:n yl&auml;puolella olevista osioista automountin pois p&auml;&auml;lt&auml;. Boottasin, ja nyt tuli vain pari k&auml;yttiksen herjausta puuttuvista osioista. T&auml;ss&auml; vaiheessa katsoin parhaaksi kysell&auml; apua toisilta k&auml;ytt&auml;jilt&auml; ja rynt&auml;sin AmigaFIN-IRC-kanavalle.
						<p>Pulmaani ei l&ouml;ytynyt suoraa ratkaisua, mutta sain pari eritt&auml;in hyv&auml;&auml; vihjett&auml; yli 4 Gt:n levyn k&auml;yt&ouml;st&auml;: kun j&auml;tt&auml;&auml; 4 Gt:n yli menevist&auml; osioista automountin pois p&auml;&auml;lt&auml;, ei tarvitse painaa cancel-nappia kylm&auml;k&auml;ynnistyksen yhteydess&auml;. K&auml;ynnistett&auml;ess&auml; SetPatch asentaa k&auml;ytt&ouml;j&auml;rjestelm&auml;p&auml;ivityksen, boottaa ja katsoo sitten tiedostoa DEVS:Nsdpatch.cfg, johon lis&auml;t&auml;&auml;n rivi: DEVICE scsi.device RDBUNIT 0 ACTIVATE #?, jolloin otetaan k&auml;ytt&ouml;&ouml;n mounttaamatta j&auml;&auml;neet osiot. Kun SFS t&auml;ss&auml; vaiheessa huomaa 4 Gt:n yl&auml;puolella olevat osiot, on scsi.device jo p&auml;ivitetty versioon 43, jolloin herjausikkuna ei avaudu. Lis&auml;ksi t&auml;st&auml; on se hy&ouml;ty, ett&auml; jos k&auml;ynnistet&auml;&auml;n ohittamalla startup-sequence, k&auml;yt&ouml;ss&auml; oleva vanha scsi.device ei voi tuhota 4 Gt:n yl&auml;puolella olevia osioita, koska ne tulevat n&auml;kyviin vasta kun SetPatch on ajettu.
						<p>P&auml;&auml;sin taas pelaamaan cancel-peli&auml; ja kiinnitin vasta nyt huomiota herjaukseen, ettei Pelit-osiota l&ouml;ydy. Eih&auml;n sielt&auml; mit&auml;&auml;n pit&auml;nyt k&auml;ynnistyksen yhteydess&auml; latautua! Nyt l&ouml;ysinkin ongelman aiheuttajan: syyllinen oli xpk.libraryj&auml; k&auml;ytt&auml;v&auml; Artic-pakkausohjelma, jolla olin pakannut yhden hakemiston nyt 4 Gt:n yl&auml;puolelle joutuneella Pelit-osiolla. Poistin Devs:Dosdrivers-hakemistosta Pelit2-ikonin ja boottasin. Ei herjauksia! Uusi levy toimii!
						<p>Nyt pulmana oli, miten puran pakatun hakemiston, koska Artic ei toimi isoilla levyill&auml;. Boottasin vanhalta levylt&auml; ja kopioin sielt&auml; Pelit2:n kautta tiedostot uudelle levylle, jolloin pakkaus samalla purkaantui. K&auml;ynnistin samalla ShapeShifterin ja kopioin sen avulla Mac-osion sis&auml;ll&ouml;n uudelle levylle. Nyt kaikki oli viimein kopioitu ja levy toimi niinkuin pit&auml;&auml;kin. Aikaa t&auml;h&auml;n operaatioon kului pari vuorokautta.
						<p>Vanhat levyt ovat nyt k&auml;yt&ouml;ss&auml; PC:ss&auml;ni, ja j&auml;tin ennen uuden levyn asentamista Amigan pariksi y&ouml;ksi tallentamaan tietoja vanhalta levylt&auml; videonauhalle, jos tuo uusi levy vaikka p&auml;&auml;tt&auml;&auml; hajota. BVisionin ansiosta VideoBackupSystemin k&auml;ytt&auml;minenkin oli ty&ouml;n ja tuskan takana. N&auml;yt&ouml;np&auml;ivitys nauhalle oli luokkaa 2 fps, joten hommasta ei ensin meinannut tulla yht&auml;&auml;n mit&auml;&auml;n. Kokeilin kytke&auml; PowerPC-kortin pois p&auml;&auml;lt&auml; pit&auml;m&auml;ll&auml; 2- tai a-n&auml;pp&auml;int&auml; pohjassa k&auml;ynnistyksen yhteydess&auml;. Nyt pulmaksi tuli pelk&auml;n Chip-muistin riitt&auml;m&auml;tt&ouml;myys yli 20000 tiedostoa sis&auml;lt&auml;v&auml;&auml; osiota kopioitaessa. PPC-kortin flashromin p&auml;ivityspaketista l&ouml;ysin viimein tiedon siit&auml;, ett&auml; BVision saadaan pois p&auml;&auml;lt&auml; pit&auml;m&auml;ll&auml; c-n&auml;pp&auml;int&auml; pohjassa k&auml;ynnistyksen yhteydess&auml;, jolloin VBS:kin alkoi toimia halutulla tavalla.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Malli:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Seagate ST38410</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.seagate.com">Seagate Technology Inc.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://wwnet.fi/vks">VK Systems Oy</a>, Taipalsaari, puh. (05) 454 4789</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">850 mk (3/2000)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekniikkaa:</font></td>
					<td width="50%" bgcolor="#d8ecfd">8,4 Gt, 5400 rpm, hakuaika 8,9 ms, UltraATA/66</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
