<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>LG Flatron 795FT Plus 17&quot;</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Teemu K&auml;rkk&auml;inen &lt;<a href="mailto:wizor@luo.to">wizor@luo.to</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Grafiikkakortin hommattuani alkoi senaikainen monitorin virkaa toimittava NEC Multisync tuntua todella tukkoiselta. Sit&auml; se teki jo AGA tiloilla, mutta sen viel&auml; kesti l&auml;hes valittamatta. N&auml;in sitten p&auml;&auml;tin alkaa etsi&auml; uutta monitoria, ja ajattelin kokeilla vaihteeksi Internetist&auml;. Ensimm&auml;isell&auml; yrityksell&auml; jo t&auml;rpp&auml;si. <a href="http://www.verkkokauppa.com">Verkkokaupan</a> sivuilta l&ouml;ytyi hieno tarjous LG-monitorista ja viel&auml; ilmainen kuljetus kotiin kaupan p&auml;&auml;lle. Hinta nyt oli hieman tyyris 17&quot; putkesta, mutta amigisti kun olen, niin en s&auml;ik&auml;ht&auml;nyt sit&auml; vaan p&auml;&auml;tin, ett&auml; otetaan nyt sitten kunnon laatuputki kerralla. Kertaakaan en ole viel&auml; ostostani katunut!</p>
						<center>
							<img height="190" width="227" src="kuvat/flatron.jpg" border="0" alt=""></center>
						<p>Monitori on valkoinen ja omalla jalustalla varustettu. Kuvaruutu on nimens&auml; mukaisesti t&auml;ysin tasainen, ja alussa tuntui, ett&auml; Workbench olisi sis&auml;&auml;np&auml;in taipunut, kun oli tottunut kalansilm&auml;n malliseen NECiin ja erin&auml;isiin videomonitoreihin. Viivottimella tarkistamalla tulin sitten siihen tulokseen, ett&auml; kyll&auml; ne viivat ovat suoria, ja hetken p&auml;&auml;st&auml; silm&auml;t jo tottuivatkin ruutuun helposti. Monitorin mukana tuli manuaali, virtapiuha ja k&auml;situntumalta ihan hyv&auml;laatuinen SVGA-piuha. Monitori sis&auml;lt&auml;&auml; my&ouml;s USB-hubin nelj&auml;lle laitteelle, ja toivottavasti sillekin tulee k&auml;ytt&ouml;&auml; jossain vaiheessa Amigan tulevaisuutta! My&ouml;s oma johto USB:t&auml; varten tuli mukana. BNC-liittimi&auml; ei monitorissa ole, mutta vaikea olisi kuvitella, miten t&auml;t&auml; kuvanlaatua pystyisi enemp&auml;&auml; parantamaankaan!
						<p>Asennuksessa ei oikeastaan ollut mit&auml;&auml;n ongelmia: piuhat kiinni ja menoksi. Sen j&auml;lkeen pitikin sitten s&auml;&auml;t&auml;&auml; Picasso96:sta n&auml;ytt&ouml;tilat kohdalleen ja my&ouml;s nostaa reilusti pikselikelloa - NEC kun pystyi kuin h&auml;din tuskin 30 kHz:iin asti toimimaan mukisematta. T&auml;ll&auml; monitorilla pystyy manuaalin mukaan 30-96 kHz:n horisontaalitaajuuksiin. Virkistystaajuutta luvataan 50-160 Hz. Maksimiresoluutioksi ilmoitetaan 1600x1200 75 Hz ja siit&auml; saa viel&auml; selv&auml;&auml;, jos omaa hyv&auml;n n&auml;&ouml;n. Merlin tosin jaksaa puskea tuon n&auml;ytt&ouml;tilan vain 8-bittisen&auml; ja lomitettuna. Normaalit k&auml;ytt&ouml;resoluutiot ovatkin t&auml;ll&auml; hetkell&auml; 800x600x16 61 Hz (WB) ja 1024x768x8 77 Hz. J&auml;lkimm&auml;inen tila ei ik&auml;v&auml; kyll&auml; jaksa toimia kunnolla 16-bit-moodissa n&auml;in vanhalla n&auml;ytt&ouml;kortilla. Onneksi monitorissa on j&auml;lkiloistoa sen verran, ettei 61 Hz:n tila v&auml;rise pahasti. Kyll&auml; se aina AGA:n voittaa silti! :)
						<p>N&auml;yt&ouml;n s&auml;&auml;d&ouml;t hoituvat kuvaputken alapuolella olevilla kuudella hipaisun&auml;pp&auml;imell&auml;. Valikot ovat eritt&auml;in selke&auml;t ja s&auml;&auml;d&ouml;t runsaat. N&auml;pp&auml;imet toimivat kuin unelma ja ovat my&ouml;s eritt&auml;in tyylikk&auml;&auml;t. Kuvaputkesta on my&ouml;s turha peilailla itse&auml;&auml;n aurinkoisella ilmalla - putken pinta kun on sit&auml; luokkaa, etten parempaa ole n&auml;hnyt. Testailin sit&auml; my&ouml;s osoittamalla sit&auml; suoraan Maglitell&auml;, eik&auml; valoa juurikaan kimmonnut takaisin silmiin, ja siit&auml;kin suurin osa oli aika sinis&auml;vyist&auml;. Pisteet kotiin t&auml;st&auml;kin. Monitori my&ouml;s tukee MCP:n Power Save -toimintoa t&auml;ydellisesti.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Malli:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://lge.ca/products/monitors_795plus.html">LG Flatron 795FT Plus 17&quot;</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://lge.ca">LG Electronics Canada Inc.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">A1260T/64 MHz, 32 Mt, SCSI-Kit IV (1230scsi.device v8.5), Merlin + XCalibur, Micronik Z2, MFC3, 4+1+1 Gt SCSI HD, 32x CD-ROM, OS 3.5</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Saatavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.verkkokauppa.com">Verkkokauppa</a> 2630 mk + ilmainen kuljetus<br>
						Jumbon Mustap&ouml;rssi 2990 mk</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">10-</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
