<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>PC-Task vs. PCx</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Arto Ekman &lt;<a href="mailto:aekman@iobox.fi">aekman@iobox.fi</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Emulaattorit, joilla on tarkoitus ajaa eri k&auml;skykannan omaavien tietokoneiden ohjelmia, ovat kehittyneet viime vuosien aikana melkoisesti. T&auml;m&auml; koskee my&ouml;s Amigalle saatavissa olevia PC-emulaattoreita. N&auml;ist&auml; tunnetuin on varmasti Chris Hamesin PC-Task, joka oli ensimm&auml;inen varsinaisesti k&auml;ytt&ouml;kelpoinen softapohjainen PC-emulaattori. Toinen, ainakin itselleni varsin uusi tuttavuus on PCx, joka emuloi Intel Pentium -prosessorin k&auml;skykantaa. Tarkoitukseni on kertoa omat kokemukseni kyseisist&auml; emulaattoreista, niiden hyvist&auml; ja huonoista puolista sek&auml; nykyisest&auml; saatavuudesta.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>PC-Task 4.4</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Vuonna 1995 ilmestyneest&auml; versiosta 3 l&auml;htien PC-Task alkoi ymm&auml;rt&auml;&auml; my&ouml;s 286-prosessoria, mik&auml; mahdollisti Windows 3:n ja 3.1:n k&auml;yt&ouml;n. Kuitenkin vasta version 4 ilmestytty&auml; Windowsin k&auml;ytt&ouml;&ouml;n tuli tarvittavaa nopeutta. Aluksi ohjelma tarjosi ainoastaan 486sx-prosessorin emuloinnin, jossa ei ole sis&auml;&auml;nrakennettua liukulukuprosessoria (FPU). T&auml;m&auml;n vuoksi PCx oli liukulukulaskentaa vaativissa ohjelmissa paljon nopeampi. Mutta p&auml;ivityspaketteja ilmestyi, ja versio 4.4 emuloi jo 486dx-prosessoria.
						<p>PC-Taskin nykyversiot tarjoavat mahdollisuuden ajaa emulaattoria kahdella eri tavalla. Interpretive-tilassa emulointi hoidetaan &quot;normaalilla&quot; tavalla, eli jokaista 80x86-k&auml;skyn suoritusta varten tarvitaan useampia 680x0-k&auml;skyj&auml;. Hyv&auml;&auml; ovat nopeat latausajat ja emuloinnin pieni muistinkulutus, huonoa taas emulaation hitaus.
						<p>Dynamic-tilassa ei 80x86-koodia oikeastaan emuloida, vaan se ennemminkin k&auml;&auml;nnet&auml;&auml;n 680x0-koodiksi. My&ouml;s looppeja nopeutetaan etsim&auml;ll&auml; valmista k&auml;&auml;nnetty&auml; koodia suoraan muistista. Puskurimuistin koko voidaan valita: tiny (512 kt), small (1,5 Mt), medium (5,25 Mt), large (9,5 Mt) tai huge (PC:n muisti kerrottuna nelj&auml;ll&auml;, plus 2 Mt). Hyv&auml;&auml; on nopea emulaatio ja mahdollisuus k&auml;ytt&auml;&auml; FPU:ta, huonoa taas runsas muistinkulutus ja nimellisesti pidemm&auml;t latausajat. Dynamic ei my&ouml;sk&auml;&auml;n ole niin luotettava emulaatio kuin Interpretive.
						<p>Huom! Yleens&auml; ottaen kaikki hyvin ohjelmoidut ohjelmat toimivat dynamic-emulaatiossa, mutta ongelmia saattavat aiheuttaa pelit, jotka muuttavat koodiaan. N&auml;it&auml; ovat mm. jotkut 3D-pelit. Ik&auml;v&auml; kyll&auml; Chris Hames ilmoitti pari kuukautta sitten, ettei en&auml;&auml; ole kiinnostunut kehitt&auml;m&auml;&auml;n PC-Taskia. Toivottavasti joku ostaa l&auml;hdekoodin h&auml;nelt&auml; ja k&auml;&auml;nt&auml;&auml; ohjelman PPC:lle...</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>PCx 1.1</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Microcode Solutions on yritys PCx:n takana. PCx ei muuten ole ainoa heid&auml;n valmistamansa emulaattori, vaan tarjolla on my&ouml;s Mac-emulaattori Fusion. PCx:n vahvuus on ehdottomasti nopea n&auml;yt&ouml;np&auml;ivitys my&ouml;s AGA-koneilla. PCx tukee my&ouml;s FPU:ta, edellytt&auml;en tietysti ett&auml; koneestasi sellainen l&ouml;ytyy.
						<p>My&ouml;s PCx kykenee PC-Taskin tavoin k&auml;&auml;nt&auml;m&auml;&auml;n koodia valmiiksi muistiin k&auml;ytett&auml;ess&auml; CPU Transcription -toimintoa. T&auml;m&auml; on tosin toteutettu paljon paremmin PC-Taskissa. Erikoisin puoli PCx:ss&auml; on mielest&auml;ni Sound Blaster -emulaatio; viel&auml; oudompaa on, ettei mik&auml;&auml;n kokeilemani peli tunnistanut sit&auml;! PCx:n mahdollisuudet kehitty&auml; n&auml;ytt&auml;v&auml;t valoisammilta kuin PC-Taskin, koska sen valmistajat ovat kehitt&auml;m&auml;ss&auml; my&ouml;s Mac-emulaattoristaan uljasta PPC-versiota. Mit&auml;&auml;n varmuutta ei tosin ole...</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Molempi parempi?</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">On vaikea alkaa arvioida emulaattoreita numeroilla, joten esit&auml;n arvioinnin sanallisesti. Kummallakin emulaattorilla on kyky suorittaa PC-ohjelmia j&auml;rjellisell&auml; nopeudella (riippuen tietysti Amigasi tehoista ja ajettavasta ohjelmasta). Itse tunnen PC-Taskin suoriutuvan t&auml;st&auml; paljon paremmin.
						<p>Esimerkkin&auml; voi pit&auml;&auml; Police Quest 3 -peli&auml;. Se toimi molemmilla emulaattoreilla, mutta PC-Taskilla pelaaminen oli jouhevaa, kun taas PCx:ll&auml; oli v&auml;lill&auml; hahmon liikkeess&auml; kiusallisia taukoja. Todellisuudessa paremmuus riippuu hyvin paljon oman koneesi resursseista. On siis hyv&auml; kokeilla molempia emulaattoreita.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Saatavuus ja p&auml;ivitykset</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">PC-Task l&ouml;ytyy ainakin <a href="http://www.ge.vip.fi">Gentle Eye Ky:n</a> (puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a>) sek&auml; <a href="http://www.dlc.fi/~broline">Broadline Oy:n</a> (puh. (09) 8747 900, <a href="mailto:broline@dlc.fi">broline@dlc.fi</a>) valikoimista. PCx:n taas saa ainakin Amiga Formatin numeron 134 (maaliskuu 2000) cd-levylt&auml;.
						<p>PC-Taskin nelosversioon on saatavissa nelj&auml; p&auml;ivityspakettia. Ne l&ouml;ytyv&auml;t netist&auml; PC-Taskin <a href="http://www.ozemail.com.au/~pctask">kotisivulta</a>. PC-Task kannattaa p&auml;ivitt&auml;&auml; versioon 4.4 asti, koska vain n&auml;in tekem&auml;ll&auml; saat FPU-emulaation ja v&auml;hemm&auml;n bugeja.</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
