<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>PowerTower - Onko siin&auml; poweria kylliksi?</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Arto Ekman &lt;<a href="mailto:aekman@iobox.fi">aekman@iobox.fi</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Pitk&auml;&auml;n A1200:ani emolevy majaili alkuper&auml;isess&auml; p&ouml;yt&auml;kotelossa, joka ajan oloon k&auml;vi varsin tukalaksi asuinpaikaksi: kuumuuden vuoksi kiintolevylle tuli kirjoitusvirheit&auml; ja sis&auml;inen MicroniK-scandoubler ilmoitti tukalasta olostaan aiheuttamalla h&auml;iri&ouml;juovia kuvaruudulle. Oli selv&auml;&auml;, ett&auml; jotain tarttis tehr&auml;, joten aloin suunnitella koneen siirt&auml;mist&auml; tornikoteloon. Koska olin k&auml;ytt&auml;nyt itse koneen ostoon suhteellisen paljon rahaa, en halunnut kaiken tuhoutuvan sekunneissa kytkiess&auml;ni tee-se-itse-torniini virrat. Siisp&auml; ostin valmiin tornipaketin...</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Yleist&auml; h&ouml;pin&auml;&auml; ja pient&auml; napinaa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tornista tulee minulle mieleen jokin serverikotelo; se on n&auml;et aikamoisen leve&auml;. Ei tosin haittaa laisinkaan, koska ty&ouml;skentelytilaa riitt&auml;&auml; ja johdot mahtuvat hyvin sis&auml;lle. Kotelo on korkeudeltaan normaali AT/ATX-miditorni, ja jos joskus on pakko siirty&auml; PC:n k&auml;ytt&auml;j&auml;ksi, luulisin emolevyn sijoittamisen sujuvan ongelmitta. Powerin tuuletin on melko hiljainen, ja kokonaisuuden pintapuolinen tarkastelu antaa (turhan) positiivisen kuvan. Mutta en osaa selitt&auml;&auml; parin tonnin hintaa muuna kuin ry&ouml;v&auml;yksen&auml;, kun ajattelee seuraavia asioita:
						<ul>
							<li>Kyseess&auml; on kloonitorni; Octekin PC:n voi l&ouml;yt&auml;&auml; aivan samann&auml;k&ouml;isest&auml; tornista, luonnollisesti pienemm&auml;ll&auml; hinnalla.
							<li>Paketin mukana ei tullut powerin virtajohtoa! (Boogie l&auml;hetti sen tosin 2-3 p&auml;iv&auml;&auml; my&ouml;hemmin, mist&auml; kiit&auml;n...)
							<li>Mukana tuli ns. halpan&auml;pp&auml;imist&ouml;, eik&auml; KeyTronic 2000, joka mainitaan vanhoissa mainoksissa (Boogie selitti, ettei KT2000:a en&auml;&auml; valmisteta DIN5-liittimell&auml;).
							<li>Ohjekirjassa sanotaan pakettiin sis&auml;ltyv&auml;n kuusioruuvien ruuvaamiseen tarkoitetun ty&ouml;kalun, mutta omasta paketistani se ainakin puuttui.
						</ul>
						<p>On hyv&auml; muistaa, ett&auml; vaikka Amigan saatavuus olisi miten huono tahansa, ei amigistien tarvitse hyv&auml;ksy&auml; puutteellisia paketteja. Luulisi n&auml;ill&auml; hinnoilla pystytt&auml;v&auml;n laatu takaamaan! Itse asiassa laatuhan edist&auml;&auml; myynti&auml;...</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Kopan kokoaminen</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kokoaminen alkoi koneen purkamisesta osiin. Ty&ouml; vaati varovaisuuteni vuoksi melkoisesti aikaa: yhteens&auml; tornitusprojektiin kului kokonainen viikonloppu. Siihen kannattaa varata aikaa riitt&auml;v&auml;sti! Ty&ouml;ss&auml; tulisi k&auml;ytt&auml;&auml; maadoitusranneketta, jotta staattiset s&auml;hk&ouml;purkaukset eiv&auml;t vaurioittaisi emolevyn piirej&auml;. Itsell&auml;ni ei sellaista ollut... onneksi ei tullut ongelmia! Ohjekirjan (englanninkielinen) ohjeet ovat suurimmaksi osaksi selvi&auml;, mutta esim. emolevyn kiinnityksest&auml; kerrottiin mielest&auml;ni liian v&auml;h&auml;n. Emolevy kiinnittyi kiitett&auml;v&auml;n tiukasti takasein&auml;&auml;n, vaikka en keksinyt er&auml;&auml;lle kiinnikkeelle mit&auml;&auml;n k&auml;ytt&ouml;&auml;.
						<p>Mielenkiintoinen juttu oli reset-painikkeen saattaminen toimintaan. Ohjekirjassa kehotettiin etsim&auml;&auml;n emolevylt&auml; komponentit C5B ja R951B, jotka sijaitsevat Gayle-piirin oikealla puolella. Etsin niit&auml; pidemm&auml;n aikaa, kunnes huomasin niiden sijaitsevat juuri scandoublerini alla! Ja sinne pit&auml;isi juottaa liitin, johon reset-painike kytket&auml;&auml;n. Hetken aikaa olin h&auml;mmennyksen vallassa, kunnes tajusin soittaa tuotetukeen eli Boogielle. Ongelmasta kerrottuani sain heti ratkaisuehdotuksen: unohdetaan kaikki mit&auml; ohjekirjassa sanottiin ja juotetaan liitinpala PCMCIA-portin alta l&ouml;ytyv&auml;n tyhj&auml;n TP1-liitinpaikan kahteen vasemmanpuolimmaiseen nastaan! Eli kun reset-painiketta painetaan, virta p&auml;&auml;see kulkemaan nastasta toiseen ja kone resetoituu.</p>
						<center>
							<img height="100" width="265" src="kuvat/powerjuotos.jpg" border="0" alt=""></center>
						<p>Sitten oli n&auml;pp&auml;imist&ouml;adapterin vuoro. Kyseess&auml;h&auml;n on DIN5-liit&auml;nt&auml;isten Win95-n&auml;pp&auml;imist&ouml;jen k&auml;yt&ouml;n mahdollistava palikka, joka ty&ouml;nnet&auml;&auml;n n&auml;pp&auml;imist&ouml;liit&auml;nt&auml;&auml;n. Ty&ouml;nt&auml;minen vaati jonkin verran voimia, mutta adapteri mahtui kuin mahtuikin sis&auml;&auml;n. DIN5-portti kiinnitet&auml;&auml;n sit&auml; varten tornin taakse sijoitettuun aukkoon. Viel&auml; massamuistilaitteet paikalleen tilavaan torniin ja kaikki liittimet kiinni, ja valmista on! Er&auml;s ik&auml;v&auml; puute oli peitinlevyjen pieni m&auml;&auml;r&auml;, joilla on tarkoitus peitt&auml;&auml; tyhjiksi j&auml;&auml;neet Zorro-paikat. Nyt p&ouml;ly p&auml;&auml;see turhan helposti sis&auml;&auml;n...</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Grande finale</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Lopuksi t&auml;ytyy todeta n&auml;in puolen vuoden koeajan j&auml;lkeen, ett&auml; kyseess&auml; on luotettava torni, kunhan sen saa kasatuksi. Ongelmia ei ole ollut eik&auml; toivottavasti tulekaan. Laajennustilaa l&ouml;ytyy, eik&auml; Blizzardin turbokaan en&auml;&auml; polta ymp&auml;rist&ouml;&auml;&auml;n. Suurimman kiitoksen on varmasti antanut kiintolevyraukkani, joka vihdoin selvisi burnout-tilastaan. Nyt se k&auml;y hiljaisella, joskin varmalla k&auml;ynti&auml;&auml;nell&auml; eik&auml; virheit&auml; ole ilmaantunut. My&ouml;s t&auml;m&auml;n paketin hinta on jo hieman unohtunut, ja olen pystynyt keskittym&auml;&auml;n muuhun mukavaan. Ik&auml;vin asia t&auml;ll&auml; hetkell&auml; on n&auml;pp&auml;imist&ouml;adapteri, joka ei suostu hyv&auml;ksym&auml;&auml;n kahden nuolin&auml;pp&auml;imen samanaikaista painallusta; toivottavasti t&auml;m&auml; korjataan tulevissa paketeissa.</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Valmistaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.powerc.com">Power Computing Ltd.</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi">Gentle Eye Ky</a>, <a href="mailto:ge@vip.fi">ge@vip.fi</a>, puh. (03) 363 0048</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">1850 mk</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p></center>
	</body>

</html>
