<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Zip-asema Amigaan</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Teemu K&auml;rkk&auml;inen &lt;<a href="mailto:wizor@luo.to">wizor@luo.to</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">ZIP-asemia on ollut saatavilla jo pitk&auml;&auml;n eri versioina. Itse ostin kaverilta k&auml;ytettyn&auml; 100 Mt SCSI-version jo pari vuotta sitten. Nyky&auml;&auml;n siit&auml; on jo hienompia ja my&ouml;s kapasiteetiltaan isompia (250 Mt) malleja eri liit&auml;nn&ouml;ille (IDE, parallel ja USB).
						<p>Ensimm&auml;inen kone, johon asennusta kokeilin, oli sen aikainen Amiga 500:ni, jota oli laajennettu 68030/68882-turbolla (4 Mt 32-bit Fast) ja SupraDrive 500XP -SCSI-kiintolevyohjaimella (2 Mt 16-bit muistia). Koneessa oli my&ouml;s KS3.1 ja WB3.1.</p>
						<p>T&auml;m&auml;nhetkinen koneeni on A1260T/64 MHz, 32 Mt fast, SCSI-Kit IV, Merlin-n&auml;ytt&ouml;kortti ja monitorina 17&quot; LG Flatron 795FT Plus (t&auml;st&auml; lis&auml;&auml; toisessa jutussa). Lis&auml;ksi viel&auml; kolme Fujitsun SCSI-kiintolevy&auml;, Toshiba XM-6201TA 32x -SCSI-CD-ROM-asema, SCSI-ZIP 100 ja risa MultiFaceCard, jossa onneksi toimii sent&auml;&auml;n yksi seriaali (kiitti, Apache! ;).</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Ongelmaton asennus</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Fyysinen asennus oli todella helppoa: ZIP-asema kiinni ohjaimen takana olevaan 25-pin-SCSI-liittimeen (Supra) ja sitten ZIPin virtajohto kiinni ja muuntaja sein&auml;&auml;n. Blizzard SCSI-Kit IV:n kanssa tuli muutama ongelma, kun se sis&auml;lsi vain tuon kyseisen 25-pin-liittimen vakiona. Parin p&auml;iv&auml;n kuluttua sainkin sitten kyh&auml;tty&auml; adapterikaapelin, kytkin ZIP-aseman SCSI-ohjaimen per&auml;&auml;n. ZIP-aseman toiseen SCSI-liittimeen kytkin sitten oman kaapelin, johon sain kiinni muut laitteet. (Kaapelin teosta lis&auml;&auml; artikkelin lopussa.)
						<p>ZIPin takana on my&ouml;s pari kytkint&auml;, joilla voidaan valita aseman terminointi (p&auml;&auml;ll&auml;/pois) ja aseman SCSI-ID. My&ouml;s l&auml;pivienti SCSI-v&auml;yl&auml;lle l&ouml;ytyy kahden 25-pin-D-liittimen muodossa. Ellei ZIP-aseman per&auml;&auml;n tule muita laitteita, niin terminointi pit&auml;&auml; olla p&auml;&auml;ll&auml;. ID pit&auml;&auml; valita niin, ettei mik&auml;&auml;n muu SCSI-laite k&auml;yt&auml; samaa ID:t&auml; kuin ZIP.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>K&auml;ytt&ouml;&ouml;notto</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kun kaikki on asennettu, on aika k&auml;ynnist&auml;&auml; kone. Jos ongelmia ilmenee jo t&auml;ss&auml; vaiheessa, niin virrat pois vehkeist&auml; ja tarkistamaan kytkent&auml;.
						<p>Kun WB on latautunut, on t&auml;ss&auml; vaiheessa parikin vaihtoehtoa. Yksi mahdollisuus on laittaa tyhj&auml; ZIP-levy asemaan ja asentaa sen RDB:lle HDToolBoxilla kaikki tarvittava tieto, jotta levy tunnistuu koneen k&auml;ynnistyess&auml; ja p&auml;&auml;ll&auml; ollessa oikein - aivan kuten normaaleille kiintolevyillekin tehd&auml;&auml;n. Levyj&auml; voi sitten vaihdella lennossa, ja Amiga tunnistaa ne aina automaattisesti.</p>
						<p>Haittapuolina voi mainita sen, ett&auml; jos tiedostoj&auml;rjestelm&auml; (PFS/SFS) on optimoitu jollekin tietylle prosessorille ja se on asennettuna RDB:lle, niin ZIP-levy&auml; ei voi k&auml;ytt&auml;&auml; koneissa, joissa on astetta huonompi prosessori. Ongelma on korjattavissa sill&auml;, ett&auml; k&auml;ytt&auml;&auml; 68000- tai ehk&auml; 68020-versioita (kenell&auml; nyt on 68000 en&auml;&auml; tosi k&auml;yt&ouml;ss&auml;? ;). Toinen haittavaikutus on se, ett&auml; levyn alusta varataan pari blokkia RDB:lle, ja levyn kapasiteetti pienenee muutamalla kymmenell&auml; kilotavulla. Plussana voi mainita, ett&auml; ZIP-asemalta voi vaikka k&auml;ynnist&auml;&auml; koneen, kun tarvittavat tiedot ovat RDB:ll&auml;!</p>
						<p>Toinen vaihtoehto on tehd&auml; oma MountList ZIP-asemalle ja sitten Mount-komennolla alustaa ZIP-asema k&auml;ytt&ouml;&ouml;n joka bootin yhteydess&auml;. Itse suosin RDB:n asentamista levylle, koska k&auml;yt&auml;n hieman erilaisia ZIP-levyj&auml; eri tarkoituksia varten. N&auml;in ei tarvitse aina mountata kutakin levy&auml; erikseen. PC- tai Mac-formatoiduille ZIP-levyille on teht&auml;v&auml; MounList-tiedosto aina. T&auml;ss&auml; omani listattuna:</p>
						<p>/* Iomega ZIP100, MacOS */ ZMAC0:<br>
						Device = 1230scsi.device<br>
						Unit = 5<br>
						FileSystem = L:CrossMacFileSystem<br>
						Flags = 0<br>
						Surfaces = 2<br>
						BlocksPerTrack = 64<br>
						SectorSize = 512<br>
						Mask = 0x7ffffffe<br>
						MaxTransfer = 0xfffe00<br>
						Reserved = 0<br>
						Interleave = 0<br>
						LowCyl = 0<br>
						HighCyl = 1535<br>
						Buffers = 150<br>
						BufMemType = 0<br>
						StackSize = 2000<br>
						Priority = 10<br>
						GlobVec = -1<br>
						DosType = 0x4d414300<br>
						#</p>
						<p>/* Iomega ZIP100, FAT-16/MS-DOS */ ZPC0:<br>
						device = 1230scsi.device<br>
						unit = 5<br>
						FileSystem = L:CrossDOSFileSystem<br>
						Flags = 0<br>
						Surfaces = 2<br>
						BlocksPerTrack = 64<br>
						SectorSize = 512<br>
						Mask = 0x7ffffffe<br>
						MaxTransfer = 0xfffe00<br>
						Reserved = 1<br>
						Interleave = 0<br>
						LowCyl = 0<br>
						HighCyl = 1535<br>
						Buffers = 150<br>
						BufMemType = 0<br>
						StackSize = 2000<br>
						Priority = 10<br>
						GlobVec = -1<br>
						DosType = 0x4d534800<br>
						#</p>
						<p>/* Iomega ZIP100, Amiga FFS */ ZIPF:<br>
						FileSystem = L:fastfilesystem<br>
						Device = 1230scsi.device<br>
						Unit = 5<br>
						Flags = 1<br>
						SectorSize = 512<br>
						StackSize = 1000<br>
						Buffers = 150<br>
						BufMemType = 5<br>
						Activate = 1<br>
						Reserved = 0<br>
						Priority = 10<br>
						BlocksPerTrack = 68<br>
						Surfaces = 2<br>
						Interleave = 0<br>
						Highcyl = 1535<br>
						Lowcyl = 0<br>
						GlobVec = -1<br>
						Mask = 0x7ffffffe<br>
						MaxTransfer = 0xfffe00<br>
						DosType = 0x444F5301<br>
						#</p>
						<p>Device ja unit pit&auml;&auml; muuttaa kullekin koneelle erikseen sen mukaan, mihin ZIP on liitetty. Mask- ja maxtransfer-arvot toimivat varmasti ainakin kaikilla SCSI-ohjaimilla, mutta IDE tarvitsee muistaakseni pienemm&auml;t arvot.  esim. Zorro II -liit&auml;nn&auml;ss&auml; oleville ohjaimille mask pit&auml;&auml; olla 0xfffffc, Zorro III -liit&auml;nn&auml;ss&auml; 0xfffffffc ja A1200/A4000:n IDE-liit&auml;nn&auml;lle 0xfffffffc. Suurin osa SCSI-ohjaimista pystyy k&auml;ytt&auml;m&auml;&auml;n maxtranfer-arvona 0xfffe00 (16 Mt) ja IDE-ohjaimille se tulisi asettaa arvoon 0x1fe00 (130 kt).</p>
						<p>Sectorsize-arvon muuttaminen 512 tavusta 1024:&auml;&auml;n tai jopa 2048:aan tavuun nopeuttaa Amigan FastFileSystemin toimintaa huomattavasti. Siirrelless&auml; paljon pikku tiedostoja ZIPille ja takaisin on FFS eritt&auml;in hidas ZIP-aseman lukup&auml;&auml;n siirron hitauden vuoksi. PFS2/3- tai SFS-tiedostoj&auml;rjestelmill&auml; ZIP-asemaa on ilo k&auml;ytt&auml;&auml;, eik&auml; 512 tavun blokkikoko paljoa menoa haittaa!</p>
						<p>Jos k&auml;yt&auml;t mountlisti&auml;, niin muista lis&auml;t&auml; user-startup-tiedostoon rivi &quot;Mount ZIP:&quot;. Voit my&ouml;s tehd&auml; siit&auml; oman tiedostonsa ja siirt&auml;&auml; sen sopivan ikonin kanssa DEVS:DosDrivers-hakemistoon, josta AmigaOS osaa sen my&ouml;s k&auml;ynnist&auml;&auml; automaattisesti, ellei startup-sequencea ole menty muuttelemaan.  SupraDrive 500XP -ohjaimella ZIP-asemalta pystyi k&auml;ynnist&auml;m&auml;&auml;n koneen vain jos tiedostoj&auml;rjestelm&auml;ksi laittoi OFS/FFS:n. T&auml;m&auml; p&auml;ti my&ouml;s normaaleihin kiintolevyihin.</p>
						<p>Nyt onkin sitten aika k&auml;ynnist&auml;&auml; kone uudelleen ja testata, miten asema toimii. K&auml;ynnistyksen j&auml;lkeen ty&ouml;nn&auml; levy sis&auml;&auml;n ZIP-asemaan. Workbenchiin pit&auml;isi ilmesty&auml; ikoni, jossa lukee alla &quot;ZIP:Uninitialized&quot; (OS 3.5) tai &quot;ZIP:NDOS&quot; (OS 2.0-3.1). Klikkaa ikonia kerran ja valitse valikosta Format Disk. Ensimm&auml;isell&auml; kerralla ei kannata tehd&auml; quick formatia, vaan odotella ihan kiltisti, ett&auml; ohjelma k&auml;y jokaisen blokin l&auml;pi yksitellen. T&auml;m&auml;n j&auml;lkeen levyn pit&auml;isikin olla k&auml;ytt&ouml;valmis ja tilaa l&ouml;yty&auml; tiedostoj&auml;rjestelm&auml;st&auml; ja levyn kunnosta riippuen 90-97 megatavua.  Kannattaa my&ouml;s testata, ett&auml; levyjen lennossa vaihto toimii, kun formatoi niit&auml; muutaman lis&auml;&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Suorituskyky</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">SCSI-mallin nopeus on ohjaimesta riippuen n. 1 Mt/sek kumpaankin suuntaan.  IDE-malli hieman hitaampi, ja parallel-malli viel&auml; IDE:t&auml;kin paljon hitaampi. Parallel-malli ei toimi Amigassa ilman radikaaleja muutoksia Amigan parallel-porttiin. Aminetiss&auml; muistaakseni on ohjeet kyseiseen toimenpiteeseen. FastFileSystem on osoittautunut hitaimmaksi tiedostoj&auml;rjestelmist&auml; varsinkin pikku tiedostojen siirtelyss&auml;. PFS2/3 ja SFS ovat nopeimmat.
						<p>Jos aikoo isoja tiedostoja pit&auml;&auml; ZIP-asemalla, niin suositeltavaa on muuttaa blokkikokoa 1024 tavuun tai isommaksi riippuen siit&auml;, mit&auml; tiedostoj&auml;rjestelm&auml; tukee (PFS3 max. 1024 tavua). T&auml;m&auml; my&ouml;s nopeuttaa varmuuskopiointia. RSCP antaa t&auml;ll&auml; hetkell&auml; aseman nopeudeksi 1.2 Mt/sek, SysInfo hieman v&auml;hemm&auml;n. DiskSpeed 3.1 antaa tiedostojen k&auml;sittelynopeudeksi PFS3-levyll&auml;:</p>
						<p>Files/s Create : 632<br>
						Files/s Open/Close : 616<br>
						Files/s Scan : 13872<br>
						Files/s Delete : 891</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>&quot;Click of death&quot;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Valmistusvirhe vai joku muu h&auml;ikk&auml;? Joskus satunnaisesti lukiessa levylt&auml; ZIP-asema p&auml;&auml;st&auml;&auml; aika kovan naksahtavan &auml;&auml;nen ja luku keskeytyy Read Erroriin. Aikansa klikkailemalla tuota uudelleen ilmestyv&auml;&auml; ikkunaa ongelma poistuu. Kuuleman mukaan se saattaa my&ouml;s tapahtua kesken kirjoituksen, ja joitain ongelmia tulee varmasti. Itse en ole kokenut sen kuin kerran ja senkin lukemisen aikana. Sen verran tuota on n&auml;emm&auml; ihmisill&auml; tapahtunut, ett&auml; se on saanut ihan virallisen nimen &quot;Click of death&quot;. Beware...</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Adapterikaapelin valmistaminen</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Adapterikaapeli on melko helppo valmistaa jopa kotioloissa, jos omistaa kolvin ja tinaa. Riitt&auml;&auml; kun ostaa metrin verran 50-pin-lattakaapelia, muutaman SCSI-liittimen (50-pin naaras) ja D-liittimen (25-pin uros).  Sitten leikkaa esim. mattoveitsell&auml; tai partaveitsen ter&auml;ll&auml; lattakaapelin p&auml;&auml;n johtimet erilleen ja kolvaa ne j&auml;rjestyksess&auml; kiinni D-liittimeen alla olevan taulukon mukaisesti :
						<p>25-pin - 50-pin<br>
						1 - 48<br>
						2 - 42<br>
						3 - 50<br>
						4 - 40<br>
						5 - 38<br>
						6 - 36 <br>
						7 - GROUND (20, 22, 24, 28, 30, 34)<br>
						8 - 2 --<br>
						9 - GROUND (20, 22, 24, 28, 30, 34)<br>
						10 - 8  --<br>
						11 - 12<br>
						12 - 14<br>
						13 - 16<br>
						14 - GROUND (20, 22, 24, 28, 30, 34)<br>
						15 - 46  --<br>
						16 - GROUND (20, 22, 24, 28, 30, 34)<br>
						17 - 32 --<br>
						18 - GROUND (20, 22, 24, 28, 30, 34)<br>
						19 - 44  --<br>
						20 - 18<br>
						21 - 4<br>
						22 - 6<br>
						23 - 10<br>
						24 - GROUND (20, 22, 24, 28, 30, 34)<br>
						25 - NOT USED (26) -- </p>
						<p>T&auml;m&auml;n j&auml;lkeen voi lattakaapeliin painaa kiinni niit&auml; 50-pin-liittimi&auml; aina tarpeen mukaan. Esim. vasaralla saa naputeltua ne kiinni helposti.  Kannattaa tarkistaa my&ouml;s, ett&auml; liitin tulee oikein p&auml;in: siin&auml; pit&auml;isi olla pienell&auml; nuolella merkitty ykk&ouml;snastan paikka, ja lattakaapelissa se on punaisella merkitty. T&auml;m&auml; my&ouml;s kannattaa huomioida, kun kolvaa kiinni johtoja 25-pin-liittimeen.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Saatavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">hyvinvarustetut atk-liikkeet ymp&auml;ri Suomen</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Vaihtelee 700-1200 markan v&auml;lill&auml; liit&auml;nn&auml;st&auml; ja mallista riippuen. Amigalla ei parallel-malli toimi ilman muutoksia! USB taas... ehk&auml; joskus?</td>
				</tr>
				</tr>
							<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>A500, 030/882, SupraDrive 500XP (suprascsi.device), 6 Mt Fast, 1 Mt Chip, 500 Mt + 1 Gt SCSI HD, CD-ROM, OS 3.1
							<li>A1240T/40, 32 Mt, SCSI-Kit IV (1230scsi.device v8.5) NEC Multisync, 4 Gt + 1 Gt + 1 Gt SCSI HD, 32x CD-ROM, OS 3.1
							<li>A1260T/64, 32 Mt, SCSI-Kit IV, (1230scsi.device v8.5), Merlin + XCalibur, 17&quot; LG Flatron 795FT+, Micronik Z2, MultiFaceCard 3, 4 Gt + 1 Gt + 1 Gt SCSI HD, 32x CD-ROM, OS 3.5
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">8+</td>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
