<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p><font size="-1"> Bildschirm zu klein? Dann klicke
<a href="mm_wetter.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&uuml;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font>
</p>

<p align=center><font color="#000080" size="7"><b>Das Wetter</b></font></p>

<p>Es gibt eine ganze Reihe von Websites &uuml;ber das Wetter, wie
www.dwd.de, wo man per Knopfdruck das Wetter weltweit beim Deutschen
Wetterdienst abrufen kann oder bei wetter.rtl.de mit einer
Themen&uuml;bersicht auf der Startseite und einer Wetterwette mit "tollen"
Preisen oder die klar struktuierte und benutzerfreundlich aufgebaute Seite
von www.wetter.com oder die aktuellen Vorhersagen weltweit bei
www.wetteronline.de oder oder oder. </p>

<p>Zwei Sites habe ich einmal herausgegriffen und m&ouml;chte sie auch hier
vorstellen: <b> www.wetterspiegel.de </b> und <b> www.donnerwetter.de</b>.
</p>

<p>Beginnen wir mit <b>www.wetterspiegel.de</b>:<br> <img
src="mm_wetter0.gif" width=320 heigth=240 align=left hspace=6> Auch wenn
die Wetterdaten nur dreimal am Tag aktualisiert werden - die Wetter-News
sind wirklich gut. Heute stehen als Highlights:<ul>
<li>Die Nacht der Sternschnuppen und Polarlichter</li>
<li>Wintersportsaison hat begonnen</li>
<li>Tote bei Unwettern in Indien</li>
<li>Hurrican IRIS forderte Menschenleben</li></ul>
und so weiter.... <br> Ich h&auml;tte gerne die Texte und auch Bilder
gezeigt, aber am Schluss steht folgender Satz:<br> Alle auf dieser Site zur
Verf&uuml;gung gestellten Informationen sind urheberrechtlich
gesch&uuml;tzt und d&uuml;rfen ohne schriftliche Genehmigung nicht
weiterverwendet werden. Schade!! <br clear=all></p>

<p>Hier auf dem zweiten Sceenshot k&ouml;nnt ihr die Seite sehen, wenn ich
als Auswahlkriterium meine Heimatgemeinde "Much" eingegeben habe. <br> <img
src="mm_wetter1.gif" width=320 heigth=240 align=left hspace=6> Vor Ort in
Much :</b> <br> &Uuml;bersicht heute, morgen und &uuml;bermorgen<br> mit
detaillierter Beschreibung: <br>

Im Nordosten noch Auflockerungen, sonst vielfach stark
bew&ouml;lkt<br><br>Die Vorhersage f&uuml;r Sonntag, den
21.10.2001:<br><br>Im Nordosten zun&auml;chst noch zeitweise heiter und
trocken. Zum Abend hin auch hier stark bew&ouml;lkt und zeitweise Regen und
Spr&uuml;hregen. Sonst stark bew&ouml;lkt bis bedeckt und langsamer
Durchzug eines Regengebietes. Erst zum Abend lockert die Bew&ouml;lkung im
S&uuml;dwesten wieder auf. 12 bis 15 Grad im Norden, sonst bis 19 Grad.
<br><br>Die weiteren Aussichten f&uuml;r den Wochenstart:<br><br>Am Montag
wechselhaft mit Schauern und vor allem im Nordosten zeitweisem Regen. Am
Dienstag meist bedeckt und regnerisch. Im Norden mit 9 bis 13 Grad deutlich
k&uuml;hler, im S&uuml;den bis 18 Grad. </p>

<p>Wie zu ersehen ist. ist die Aussage nicht auf den eingegebenen Ort zu
beziehen, sondern auf die gesamte Region. Nur habe ich nicht festgestellt,
wie gro&szlig; die Region ist. Im linken Frame kann man die Prognosen auch
nach anderen Gesichtspunkten abrufen. Die Einzelheiten erl&auml;utere ich
aber nun nicht. <br clear=all><hr></p>

<p>Und hier nun die zweite Website <b>www.donnerwetter.de</b>:<br>
<img src="mm_wetter2.gif" width=320 heigth=240 align=left hspace=6> Auf
dieser Startseite gibt es erst einmal Links mit und ohne Einschr&auml;nkung
auf Regionen, St&auml;dte und Gemeinden <ul>
<li> zu kurzfristigen, mittelfristigen und langfristigen Vorhersagen, </li>
<li> zu den Gartentipp, </li>
<li> zur Wetterhotline (0190er Nummer f&uuml;r 3,63 DM/min) f&uuml;r eine
pers&ouml;nliche Auskunft, </li>
<li> zu den anstehenden Bauernregeln, </li>
<li> zu einem Wetterwindow, das beim Surfen immer aktiv bleibt </li>
<li> und zum Biowetter </li></ul><br clear=all></p>

<p><img src="mm_wetter3.gif" width=320 heigth=240 align=left hspace=6> Das
Biowetter wird als Defaulteingabe f&uuml;r Migr&auml;ne ausgegeben, es kann
aber auf folgende Vorgaben ausgerichtet werden:<br> Apendizitis, Blutungen,
Bronchitis, Depressionen, Embolie, Entz&uuml;ndungen, Epilepsie,
Erk&auml;ltungen, Glaukom, Herzinfarkt, Herzinsuffizienz, Hypot. Kollaps,
Koliken, Kopfschmerzen, Migr&auml;ne, Neurosis, Pneumonie, Psychopathie,
Reaktionszeit, Reizbarkeit, Rheuma, Schizophrenie, Schlaftiefe, Spasmen,
Stumpfschmerz, subj. Beschw., Thrombose, Traumat. Enzeph.,
Unfallbereitschaft. <br clear=all></p>


<p>Das heutige Biowetter f&uuml;r Much lautet: <br> Heute sinken Luftmassen
aus gr&ouml;&szlig;eren H&ouml;hen relativ schnell zum Boden ab. Dabei
l&ouml;sen sich die Wolken meist langsam auf. Es treten vermehrt
Erk&auml;ltungskrankheiten auf. Auch migr&auml;neartige Erscheinungen sind
relativ h&auml;ufig zu beobachten. Besonders bei dieser Wetterlage treten
auch seelische St&ouml;rungen auf. </p>

<p>Wenn ich zum Fenster rausschaue, das mit dem Verschwinden der Wolken
stimmt. Aber ansonsten f&uuml;hle ich mich noch sehr gesund. </p>

<p>Die mittelfristige normale Wetterprognose nach Eingabe meiner
Heimatgemeinde: <br> Die Vorhersagen bis zu 14 Tage im Voraus werden auf
Basis von Computermodellen erstellt. Die Wahrscheinlichkeit der Vorhersagen
nimmt -je nach Wetterlage - vor allem ab 10 Tagen deutlich ab. Sie geben
somit einen Hinweis auf den zur Zeit wahrscheinlichsten Wetterverlauf.

<center>
<table border=0><tr><td bgcolor="#ffffff">
<img src="mm_wetter4.gif" width=575 heigth=100>
</td></tr></table></center>

<b>Der Trend f&uuml;r die Region:</b> Auch am Anfang des Novembers liegen
die Temperaturen auf einem deutlich zu hohem Niveau. Es bleibt also
weiterhin zu warm.<hr></p>

<p>Eine Aussage, welche Website nun besser ist, gebe ich nicht von mir. Es
ist wirklich alles subjektiv zu betrachten. Wer sich nun f&uuml;r
Deutschland- oder Weltwetter interessiert ist wohl beim Wetterdienst besser
unterrichtet. Wer aber Backgroundwissen &uuml;ber Themen wie Polarlichter,
Biowetter und Bauernregeln vermittelt bekommen m&ouml;chte, ist auf den
zwei vorgestellten Sites bestens aufgehoben. </p>

<p> &nbsp; <br>
Kein linker Frame? Dann klicke <a href="index.html" target="_top">
<b>hier</b></a></font> </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
