<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief an Andreas Guldener</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Leserbrief II von Kilian Servais an Andreas Guldener</font></center></h1></P><ul>
<p>Hi!<BR>
Erstmal m&#246;chte ich mich auch bei Dir herzlichst f&#252;r die eingereichten Artikel bedanken! Allerdings wollte ich mir es auch nicht nehmen lassen, kurz auf Deinen beigef&#252;gten Brief einzugehen und mache das einfach mal im Rahmen der NoCover.</P>

<p><FONT COLOR="#87CEFA"><i>1.Sicherer erscheinungstermin der NC durch Abgabetermin f&#252;r NC-Artikel, denn die unvorhersehbaren aktuellen Ereignisse,die eine verschiebung
rechtfertigen d&#252;rften nicht sehr h&#228;ufig sein.</i></font></P>

<p>Tja, gegen einen festen Abgabetermin h&#228;tte ich auch nichts einzuwenden, nur ist es leider so, dass ich massiv von der Amiga Aktuell abh&#228;ngig bin. Denn ohne die Amiga Aktuell m&#246;chte und werde ich die NoCover einfach nicht ver&#246;ffentlichen. Und wenn die Amiga Aktuell bei mir etwas sp&#228;ter eingeht, erscheint auch die NoCover etwas versp&#228;tet.</P>

<p><FONT COLOR="#87CEFA"><i>2.Statt seltener Formate (LZH) bekannte oder klar in einer &quot;readme&quot;-datei beschriebene (zb&quot; programm xy in version z wird ben&#246;tigt&quot;) um die NC auf
Disk zu packen.Nachdem ich viel Zeit mit dem dearchivieren der NC durch
testen unz&#228;hliger Programme zum fehlermeldungsfreien zerlegen der 
unterschiedlich gepackten NC-Dateien und Bilder verschwendet habe,hoffe
ich dass die n&#228;chste NC m&#246;glichst mit Installationsroutine ausgeliefert
wird.</i></font></P>

<p>Daf&#252;r m&#246;chte ich mich an dieser Stelle nochmal bei allen Diskettenabonennten entschuldigen. Ich dacchte, dass ein jeder damit zurecht kommen w&#252;rde. Mit dieser Ausgabe wird wieder das gewohnte Installationsscript dabei sein und alles geht vollauf automatisch. Gro&#223;es Sorry daf&#252;r, aber ich war letzten Monat echt froh, dass die NoCover endlich rausgehen konnte und habe mir &#252;ber das Installerscript keine Gedanken mehr gemacht. War sicherlich ein Fehler meinerseits, der nicht mehr vorkommen wird :-)))</P>

<p><FONT COLOR="#87CEFA"><i>3.Weil &#228;nderungen schwer vorhersehbar sind,w&#228;re eine angabe der zuk&#252;nftigen
Rubriken der NC in der vorhergehenden Ausgabe sehr w&#252;nschenswert.Damit 
k&#246;nnen Beitr&#228;ge gleich passend gekennzeichnet werden.</i></font></P>

<p>Das ist in der aktuellen Ausgabe schon geschehen, was auch in den &quot;Richtlinien&quot; dokumentiert wurde. Momentan wird wohl an der Struktur der Rubriken nichts mehr ge&#228;ndert werden - es sei denn, die Leser (also Ihr) kommt mit Vorschl&#228;gen und Ideen an und teilt mir diese mit. Dann k&#246;nnen wir ja schauen, ob das durchsetzbar ist. Im Zweifelsfall gilt aber: Einfach Artikel an mich senden und ich sortiere das dann schon richtig ein.</P>

<p><FONT COLOR="#87CEFA"><i>Ausserdem finde ich eine neue Mitgliederliste kann zwar auch mit Kurzvorstellungen und neuen Eintr&#228;gen komplett runderneuert werden,sollte aber dann auch fest
in der NC eingebaut sein um als verlinkbares Anschriftverzeichnis zu den
Artikelschreibern dienen zu k&#246;nnen.Dass es keine Karteileichen mehr geben
wird w&#252;rde nur mit einer Liste der &quot;Clubmitglieder&quot; funktionieren die vom
verantwortlichen f&#252;r Abo und Clubmitgliedschaft ein-oder ausgetragen werden.
Sobald aber die Leute sich selbst &quot;verwalten&quot; sollen siegt bestimmt die
Faulheit &#252;ber die vernunft.</i></font></P>

<p>Auch diesem Problem habe ich mich inwzischen angenommen wie ein jeder anhand der vorliegenden neuen Ausgabe erkennen kann. Jetzt br&#228;uchte ich nur noch von jedem (aber auch wirklich jedem!) eine aktuelle Vorstellung, damit die Mitgliederliste auch wieder aktuell und nahezu komplett ist. Denn ich wei&#223;
ganz genau, dass die NoCover allein als E-Mil Abo wesentlich h&#228;ufiger rausgeht als Mitglieder in der Datei stehen. Von den Diskabonennten und allen anderen Lesern ganz zu schweigen. Die Mitgliederliste werde ich auch verwalten, damit es da zu keinerlei Problemen kommt. </P>

<p>So, ich danke Dir auf jeden Fall f&#252;r Deine Anregungen und hoffe, ein wenig Klarheit geschaffen zu haben. </P>

<p>See ya,</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
