<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Leserbrief von Kilian Servais</font></center></h1></P><ul>
<p><li><a href="#yonder.html">An Yonder</A><BR></LI>
<li><a href="#rainer.html">An Rainer</A><BR></LI></UL><p></P>

<a name="yonder.html">
<p><b>Hi Yonder!</B><BR>
Auch bei Dir wird nat&#252;rlich gequoted, was das Zeug h&#228;lt:</P>

<p><FONT COLOR="#87CEFA"><i>Erstmal w&#252;nsche ich Dir viel Erfolg bei der Weiterf&#252;hrung der NoCover! Ich glaube fest daran, da&#223; die NC bei Dir in den richtigen H&#228;nden ist. Du hast 
in der Vergangenheit schon oft bewiesen, da&#223; man immer auf Dich z&#228;hlen kann. Wirklich klasse! Bringe die NoCover wieder auf die Spitzenposition aller 
Disk(Online-)Magzine, so wie in den vergangenen Tagen!</i></font></P>

<p>Ich alleine bin leider machtlos, was den weiteren Verlauf der NC angeht. Ich kann nur f&#252;r einen besseren Vertrieb sorgen und hoffen, dass die User auch Beitr&#228;ge einreichen. Ohne Beitr&#228;ge sieht es n&#228;mlich etwas mau aus und man kann die Sache dann gleich wieder vergessen. Ich bin zwar optmistisch, dass es bald etwas besser werden wird, aber momentan ist die Beteiligung dann doch eher mal wieder schwach. Wir werden sehen, wie es weitergeht. Wenn sich ein jeder nur dazu aufraffen w&#252;rde, mal den einen oder anderen Leserbrief zu schreiben, w&#228;re mir ja schon genug geholfen. Aber leider ist das (noch)
nicht der Fall....</P>

<p><FONT COLOR="#87CEFA"><i>Du bist auf dem richtigem Weg, die NoCover bekanntzumachen. Ich habe z. B. bemerkt, da&#223; Du die Ausgabe #90 schon ins Aminet gestellt hast. Das ist ein wichtiger Schritt, damit die User auch wissen, da&#223; das Mag nun Freeware ist und jetzt jeder Artikel schreiben kann, auch ohne Mitglied im APC&amp;TCP zu 
sein. Damit auch frischer Wind in die doch etwas verstaubte NoCover bl&#228;st und somit wieder neues Leben eingehaucht wird.</i></font></P>

<p>Wie schon bei Rainer geschrieben, hielt ich es f&#252;r absolut wichtig, die NC regelm&#228;&#223;ig in`s Aminet zu stellen, damit das Mag auch Usern bekannt wird, die es bisher nicht kannten bzw. damit nichts zu tun haben wollten, weil es einfach zu teuer gewesen ist. Wie am Beispiel der 4ever / Fireball ersichtlich, wurde dieses Prinzip auch lange Zeit von den Usern angenommen, bis es interne Probleme gab. Letzteres wird bei der NC hoffentlich niemals der Fall sein und ich hoffe inst&#228;ndig, dass der NC noch ein langes Leben beschieden ist.</P> 

<p><FONT COLOR="#87CEFA"><i>Es w&#228;re nat&#252;rlich besonders gut, wenn man die Ausgaben der NoCover auch ohne Passwort von der Homepage runterladen k&#246;nnte. Es w&#228;re aber nicht so tragisch, wenn Du zuk&#252;nftig die aktuellen Ausgaben gleich ins Aminet uploadest.</i></font></P>

<p>Ja, die NC soll in Zukunft auch ohne Passwort von der HP geladen werden k&#246;nnen. Macht ja auch Sinn, denn im Aminet braucht man ja auch kein Passwort, um sich die NC zu saugen. Upgeloadet wird die NC &#252;brigens immer so schnell als m&#246;glich, wobei f&#252;r mich pers&#246;nlich das Aminet absolute Priorit&#228;t hat. Ebenso nat&#252;rlich die E-Mail Abo`s, derren Verteiler momentan anw&#228;chst - wer immer daran Interesse hat, braucht mir lediglich eine kleine Mail (an kilian@apc-tcp.de) zu schicken und hat die aktuelle Ausgabe immer p&#252;ntklich im E-Mail Fach.</P>

<p>So, ich hoffe, dass Du mitlerweile ein wenig aus dem Umzugsstress raus bist und auch in Zukunt aktiv an Bord der NC bist. Momentan brauche ich wirklich jeden Schreiberling und insbesondere die alten Hasen sorgen dan nat&#252;rlich f&#252;r eine gute Basis.</P>

<p>Themenwechsel: Inzwischen schon die &quot;Vision&quot; von Stratovarius reingeh&#246;rt? Wenn ja: Hat Dich das Teil nicht v&#246;llig weggefegt?</P>

<p>Allright, mach`s gut!</P>
<hr>
<a name="rainer.html">
<p><b>Hi Rainer!</B><br>
<p>Na, alles klar bei Dir soweit? Kann es mir nat&#252;rlich nicht nehmen lassen, an dieser Stelle auf Deinen Brief einzugehen und werde ab jetzt auch mal h&#228;ufiger quoten.... Here we go:</P>

<p><FONT COLOR="#87CEFA"><i>Besser is et. ;-) Das die NC nicht per Aminet/HP usw. erh&#228;tlich war, habe ich ja schon in einer der letzten Ausgaben angeprangert. Denn zweifellos steht fest, dass dieses Mag dreimal soviele Leser (und somit potenzielle Schreiberlinge) hat, wenn sie erstmal auf &quot;normalem Wege&quot; erh&#228;ltlich ist. Wobei 
ich pers&#246;nlich aber hoffe dass das Disk-Abonnement bestehen bleibt. Ich habe eigentlich weniger Lust mir die NC aus dem Net via PC runterzusaugen, sie m&#252;hsam in &quot;kleinere H&#228;ppchen&quot; zu zerlegen und sie dann anschliessend mit Crossdos auf meinen Amiga zu klatschen. Umst&#228;ndlichkeit hoch Drei :-) ! Da ist mir die bequeme Schneckenpost-Methode lieber...</i></font></P>

<p>Ja, die Vertriebswege der NC werden momentan grundlegend erneuert, wobei mir pers&#246;nlich vor allem die Verbreitung im Aminet und auf den entsprechenden CD`s wichtig war. Per Homepage sollte die NC ab jetzt auch frei angeboten werden, wobei diese im Moment ohnehin von Grund auf neu gemacht wird. Das Diskabo bleibt nat&#252;rlich bestehen und its f&#252;r jeden zum Selbstkostenpreis von 30 DM zu haben. Die Addy daf&#252;r steht im Impressum.</P>

<p><FONT COLOR="#87CEFA"><i>(grins) Das ist ein fast typisches Ph&#228;nomen f&#252;r das Rockhard - und einer der Gr&#252;nde warum ich dieses Mag nie abonnieren w&#252;rde. 08/15 Scheibletten werden dort hochgejubelt...die Xte &quot;We Are Da Real Helloween - Even If We Can`t Play&quot;-Kapelle heimst massig Punkte ein !!! In meinen Augen ist das entweder absolute Verarsche seitens G&#246;tz K&#252;hnemund - oder er ist tats&#228;chlich nicht in der Lage die Highlights vom Erbrochenen zu unterscheiden. Vielleicht w&#252;rde es mir auch so ergehen wenn ich 30 CD`s im Monat in mich aufsaugen m&#252;sste (irgendwann verliert man da automatisch den &quot;Sinn f&#252;r gute Musik&quot; und steigert sich in einen Konsum-rausch rein)...und vielleicht brauchen Rezensenten wie K&#252;hnemund einfach mal wieder Urlaub vom Heavy Metal. ;-) Wie auch immer: Judas Priest sind f&#252;r mich mit ihrem neusten Output endg&#252;ltig Vergangenheit. Rust In Peace kann ich dazu nur sagen...</i></font></P>

<p>Ach, ich mag die Rock Hard mit ihrer sympathischen Einstellung eigentlich sehr. Ist auch das einzigste Mag, welches ich mir regelm&#228;&#223;ig kaufe. Den Hammer lese ich zwar auch so ziemlich jeden Monat, aber nur weil er h&#228;ufig irgendwo umsonst rumliegt (diverse Plattenl&#228;den, zeche etc.). Kaufen w&#252;rde ich 
mir pers&#246;nlich den Hammer nie, denn daf&#252;r missf&#228;llt mir nicht nur das Layout und die Art der Schreiberlinge, sondern vor allem die d&#252;rftigen Interviews. Okay, diese sind auh in der Rock Hard nicht mehr das gelbe vom Ei, aber dennoch ganz okay. In Sachen Interviews ist meiner Meinung nach das Heavy oder was!? Mag f&#252;hrend, auch wenn es leider nur alle zwei Monate erscheint. Was den G&#246;tz angeht: Tja, wenn man im Monat so viele CD`s durchh&#246;ren muss und dann noch Rezensieren muss, dann w&#252;rde mir das auch auf den Senkel gehen und irgendwann hat man halt dann nicht mehr den n&#246;tigen Abstand zu der ganzen Sache. Irgendwie h&#228;tte ich da etwas Angst, mir die Musik mit kaputt zu machen. </P>

<p>Was die Judas Priest angeht: es scheint gen&#252;gend Fans zu geben, die dieser Platte auch noch viel abgewinnen k&#246;nnen. Keine Ahnung warum, aber mir hat sich diese Scheibe immer noch nicht erschlossen und liegt jetzt erstmal wieder im Plattenschrank. Vielleicht waren meine Erwartungen aber nach der Halford Platte einfach zu hoch - keine Ahnung. Aber denke mal nicht, dass Judas Priest in absehbarer Zeit wieder auf altes Niveau zur&#252;ckfinden, zumal der Gitarrist jetzt auch noch an einer Soloplatte arbeitet. Dass das bei Helloween schon zu riesigen Problemen gef&#252;hrt hat, ist ja hinreichend bekannt.</P>

<p>Was sagt Du denn zum Helloween Split? Hatte ja schon seit l&#228;ngerem so etwas im gef&#252;hl, auch wenn es nun etwas spontan gekommen ist. Inzwischen hat sich Herr Weikath auch schon kritisch zum letzten album ge&#228;ussert, aber meine Meinung zu &quot;The Dark Ride&quot; und &quot;Better Than Raw&quot; kennst du ja bereits hinl&#228;nglich. Da halte ich mich lieber an Gamma Ray, die konstant geile Platten rausbringen :-))</P>

<p><FONT COLOR="#87CEFA"><i>Genau das ist der Punkt. Ich frage mich sowieso wie Du das alles unter einen Hut bekommst. ;-) Was f&#252;r legale Substanzen muss man denn nehmen um das alles gebacken zu bekommen (grins) ? Schick` mal was r&#252;ber von dem Zeug !!! :-)))</i></font></P>

<p>Ach, momentan geht es noch. Klar, seitdem ich die NC &#252;bernommen habe, bleibt weniger Zeit zum Artikel schreiben &#252;brig, aber ich habe ja noch die Hoffnung, dass sich auch mal andere User zu Worte melden. Momentan kann man die Schreiberlinge an einer Hand abz&#228;hlen und das finde ich schon echt schade, zumal das ganze ja jetzt ohne Kosten verbunden ist und jeder die NC frei beziehen kann. Ansonsten halbiere ich den Stress ein wenig, in dem ich viel der anfallenden Aufgaben bereits w&#228;hrend meiner Zivildienst Zeit erledige. Die Metal Corner entsteht so bereits - bis auf die HTML Konvertierung - w&#228;hr
end der Arbeitszeit auf einem antiken 486er PC. Ist zwar nicht besonders komfortabel, aber wenigstens schmiert die Kiste mit Win 3.11 nicht ganz so h&#228;ufig ab wie ein Windows 95 / 98 Rechner. Tja, das Zusammenstellen der NC verschlingt auch nicht so wahnsinnig viel Zeit und die Amiga Plus Artikel mache ich grunds&#228;tzlich am Wochenende, da diese schon sorgf&#228;ltiger gemacht werden sollten, als Artikel f&#252;r die NC. Und den 
ganzen Radio Kram mache ich dann halt noch zwischendurch....</P>

<p><FONT COLOR="#87CEFA"><i>Viele m&#246;gen Malmsteen nicht, weil er die typischen Starall&#252;ren vorweist und ziemlich arrogant daherkommt. Pell dagegen ist das genaue gegenteil: Er bleibt stets auf dem Teppich und hat eine ehrliche offene Art (wie eben alle Ruhrp&#246;ttler :-)). Und wie ich glaube ich schon geschrieben habe, Axel Rudi Pell ist die Deutsche Antwort auf Malmsteen. Sprich: in einem Gitarrenduell h&#228;tte der pausb&#228;ckige Malmsteen nicht mehr viel zu lachen. :-))</i></font></P>

<p>Vertue Dich mit Deiner abschlie&#223;enden Aussage nicht. Herr Pell hat zwar einiges an der Gitarre drauf, aber Malmsteen meines Erachtens noch etwas mehr. Aber Herr Pell versteht es daf&#252;r Songdienlich zu schreiben und ist zudme nicht der Meinung, dass ein 10-min&#252;tiges Gitarrensolo in jedem Song von N&#246;ten ist. Ich habe zwar auch die eine oder andere Mlmsteen Scheibe hier stehen, aber mit einigen Sachen kann ich daf&#252;r &#252;berhaupt nix anfangen. Von Pell gef&#228;llt mir eigentlich so ziemlich alles und auch Live ist diese All-Star Truppe gewaltig :-))) IM Fr&#252;hjahr kommt wohl auch ein neues Album raus, wobei
 ich ja inst&#228;ndig hoffe, dass man mla langsam einen anderen Coverzeichner findet. Sieht immer so aus, als ob der Zeichner mit einem Malprogramm mit 32 Farbpalette (blau) arbeitet. Oder ihm ist st&#228;ndig der Farbtopf ausgelaufen :-)))</P>

<p><FONT COLOR="#87CEFA"><i>Du meinst die Streiterein zwischen den beiden ? Nun...ich hoffe ja, dass die Herren Harris und Dickinson sich nicht noch einmal dermassen in die K&#246;pfe kriegen das wieder ein minderwertiger Ersatz (Baley) herhalten muss. :-) &quot;Brave New World&quot; war das beste Album seit &quot;Seventh Son...&quot; - und der Nachfolger wird uns bestimmt komplett die R&#252;be vom Hals fegen :-)). Aber ohne Bruce Dickinson kannst Du das vergessen...da k&#246;nnte man auch der Currywurst die Sauce entziehen. ;-) Apropos Bruce Dickinson: Derweil warte ich noch auf meine Bestellung bei Rising Sun Records, wo es die &quot;Scream For Me Brazil&quot; zum Schleuderpreis von 13 DM gab (und wie es sich geh&#246;rt habe ich nebenbei noch einige Schn&#228;ppchen mehr eingeheimst ;-)) - soll ein aussergew&#246;hnlich gutes Live-Album sein !? </i></font></P>

<p>Ob es auf Dauer gut geht mit den Herren Dickinson und Harris sei mal dahingestellt. Kann ich mir aber eigentlich nicht vorstellen, denn was 1993 und in der Folgezeit da abgelaufen ist, war schon ziemlich heftig, auch wenn beide Seiten wohl Fehler gemacht haben - ganz ohne Frage. Und was die Bayley &#196;ra angeht: Inzwischen finde ich zumindest die &quot;X-Factor&quot; gar nicht mal mehr so schlecht. Damals h&#228;tte ich zugegbenermassen den Kerl zwar am liebsten auf den Mars geschossen, aber inzwischen muss ich eingestehen, dass &quot;X-Factor&quot; zumindest von den Lyrics her das beste Iron Maiden Album &#252;berhaupt ist und auch musikalisch ist es gar nicht so schlecht. &quot;Virtual XI&quot; hat zwar auch die eine oder andere gute Nummer (&quot;The Clansman&quot; ist g&#246;ttlich - und noch besser mit Bruce Dickinson in der Live Version!), f&#228;llt aber klar ab. Die Solokarriere von Bruce Dickinson halte ich nicht nur f&#252;r &#228;ussert interessant, sondern auch musikalisch f&#252;r konstant hochwertig - selbst ungewohnte Alben wie &quot;Skunkworks&quot; und &quot;Balls To Picasso&quot; h&#246;re ich mir super gerne an und ich kann jedem etwas toleranten Maiden Fan diese Platten nur an`s Herz legen. Die &quot;Scream Fo Me Brazil&quot; ist ebenfalls klasse, auch wenn darauf weitestgehend Material von &quot;Accident Of Birth&quot; bzw. &quot;Chemical wedding&quot; verbraten wird. Die Skunkworks &#196;ra wird z.B. gar nicht ber&#252;cksichtigt, aber das ist auch okay so. K&#252;rzlich hat der gute Bruce eine ganz nette Best Of rausgebracht - vielleicht w&#228;re das was f&#252;r Dich? Ein Review dazu gibt es in der aktuellen Metal Corner. </P>


<p><FONT COLOR="#87CEFA"><i>Sagen Dir Bands wie &quot;In The Name&quot;, &quot;Echopark&quot; oder &quot;Mystrez&quot; was ? Hmm...ich selbst hab` keinen Schimmer...aber da einige dieser Scheiben zum Teil f&#252;r unter 5 DM (!) (zwei sogar unter 3 DM (!!!)) bei RSC im Angebot waren, habe ich die mir blind abgegriffen. Bei dem Preis kann man eigentlich nicht viel falsch machen. Aber ich m&#246;chte mein letztes paar Socken darauf verwetten das darunter auch einige Gurken sind... (grins)</i></font></P>

<p>Nee, diese Bands sagen mir absolut gar nix. Aber ich habe mir auch schon h&#228;ufiger blind einige CD`s abgegriffen und es war nicht immer alles Gold, was gl&#228;nzte. Trotzdem kann man vor allem in Second Hand CD L&#228;den mitunter absoluter Schn&#228;ppchen machen - vor gut 4 Jahren habe ich in einem Laden die zweite Steel Prophet Platte gefeunden (&quot;The Goddess Principle&quot;) und habe nun rausgefunden,d ass das Teil eine absolute Rarit&#228;t ist und mit Preisen bis zu 300 DM gehandelt wird. Habe selber damals nur 15 gezahlt :-)))</P>

<p><FONT COLOR="#87CEFA"><i>Wart`s nur ab: N&#228;chstes Jahr treffen sich unsere Mannschaften in der zweiten Liga und dann kann Gladbach einpacken. :-)</i></font></P>

<p>Pah, das habe ich jetzt einfach mal &#252;berh&#246;rt. Gladbach macht seine Sache bisher gut und war gegen Leverkusen, Schalke, Kaiserslautern und St.Pauli einfach zu bl&#246;de, den Sack zu zu machen bzw. eine F&#252;hrung in den letzten 5 Minuten zu verteidigen. W&#228;ren sie etwas cleverer gewesen und w&#252;rden auhc mal hunderprozentige Chancen nutzen, w&#228;ren wir jetzt locker unter den Top 5. Aber auch so habe ich gewettet - und w&#252;rd es immer wieder tun - das Gladbach in diesem Jahr unter den ersten neun Pl&#228;tzen landet. Hans Mayer macht das schon !!</P>

<p>So, das war es wohl auch f&#252;r`s erste wieder. Bis dann!</P>




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
