<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu meckern</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>SPAM</b></font></p>

<p>In der letzten NC hatte ich unter gleichem Titel einen Beitrag gebracht,
was man gegen Spam unternehmen kann. Zwischenzeitig hatte ich vier IP's
eruiert und diese angeschrieben und mich beschwert. In drei F&auml;llen
hatte ich vollen Erfolg, aber nicht im vierten Fall. Dieser Tage bekam ich
zwei Mails, eine von der Adresse, &uuml;ber die ich mich beschert hatte und
eine wahrscheinlich vom Provider selber, der einfach so tat, als wenn ich
gar nicht geschrieben h&auml;tte, sondern registriert sei. Nur sein
angegebenes Reply wurde nicht akzeptiert, und ich bekam meine Mail
zur&uuml;ck. Die Mail der "Dame" war beileibe keine Entschuldigung, sondern
eine unverhohlene Aufforderung ihre Homepage zu besuchen, da sie ab 23.00
Uhr einen tollen Livestrip zeigen wolle. Die Mail habe ich nun sofort
gel&ouml;scht, eine Beschwerde scheint nicht zu fruchten. Die Mail des
Providers habe ich hier nun abgedruckt, damit ihr sehen k&ouml;nnt, womit
man alles Geld verdienen will, wenn man schon die teuren Websites nicht
besucht. Wenn der w&uuml;sste, dass ich einen Amiga habe, wird er sich
bestimmt vor Wut ein Loch in den Bauch bei&szlig;en. </p>

<p>Hier nun die Mail (nur umgesetzt in HTML, da ich das Originalhtml
leider gel&ouml;cht habe). Ein Absender in Klarschrift fehlt:
<center><table border=0 width=90% bgcolor="#fffff0" cellspacing=0>
<tr><td width=10> &nbsp; </td>
<td><br><p>
From: &lt;Newsletter110@informationspost.de&gt;<br>
To: &lt;wozim@t-online.de&gt;                  <br>
Subject: Wichtige Datenschutz- und Sicherheitsinformationen
- BITTE AUSF&Uuml;HRLICH LESEN -w- <br>
Date: Fri, 19 Oct 2001 23:04:04 +0100 </p>


<p>Guten Tag, dies ist keine Spam-Mail. Sie erhalten diese Informationen,
weil Sie sich auf einer Erotik-Seite angeschlossener Webmaster registriert
haben. Gerade auch auf Erotikseiten lauern im Internet f&uuml;r User oft
unkalkulierbare Risiken. Dazu kommen zur Zeit noch nicht einsch&auml;tzbare
Gefahren durch den aktuellen Kriegskonflikt. Webattacken - auch auf private
Nutzer - werden nach Einsch&auml;tzung des FBI enorm zunehmen. Mit den
nachfolgenden Informationen m&ouml;chten wir Sie als Verbraucher
aufkl&auml;ren und Ihnen Hilfsmittel an die Hand geben, wie Sie sich im
Internet wirkungsvoll gegen Angriffe sch&uuml;tzen k&ouml;nnen. Wenn Sie
regelm&auml;&szlig;ig &uuml;ber aktuelle Gefahren im Internet und wirksame
Gegenma&szlig;nahmen informiert werden m&ouml;chten, dann bestellen Sie
doch einfach den kostenlosen Security-Newsletter. Das Anmeldeformular
finden Sie unter: <br>
http://www.mychannel.de/conwathilfe/newsletter-eintragen.html


<p>Unsere Themen:

<p>1. Schutz vor Geb&uuml;hrenfallen im Internet / Connection Watch - bekannt
aus Stern TV - jetzt noch wirksamer

<p>2. Terror im Internet: starke Zunahme von Web-Attacken / Schutz vor
"E-Mail-Bomben"

<p>3. Achtung: Feind liest mit: Schutz vor Spionen auf dem PC

<p>4. Keine Spuren n&auml;chtlicher Internetsitzungen: PC Safetykid f&uuml;r den
Datenschutz zu Hause

<p>5. Stopp dem Datenklau: Schlie&szlig;en Sie Ihren PC digital ab

<p>6. PC Business Desktop / Keine Angriffe von Innen

<p>-------------------------------------------------------

<p>1. Schutz vor 0190-Geb&uuml;hrenfallen im Internet
Connection Watch (bekannt aus Stern TV) warnt vor versteckten Dialern

<p>Eine Telefonrechnung von mehreren tausend DM, die Sie sich nicht
erkl&auml;ren k&ouml;nnen? M&ouml;glicherweise haben Sie einen 0190-Dialer
auf Ihrem Computer, der sich teuer ins Internet einw&auml;hlt. Diese Dialer
sind Einwahlprogramme zum Besuch von Erotikseiten im Internet. Aber: Nicht
alle dieser Dialer sind seri&ouml;s - einige laden sich f&uuml;r die User
unbemerkt auf die Computer, installieren sich selbst&auml;ndig als
Standardverbindung und w&auml;hlen sich - auch wenn Sie ganz normale
Internetseiten besuchen m&ouml;chten - f&uuml;r 3,63 DM/min ins Internet
ein. Einen von Verbrauchersch&uuml;tzern empfohlenen Schutz gibt es mit dem
Sicherheitsprogramm "Connection Watch 1.2" (http://www.connectionwatch.de).
Das in Stern TV vorgestellte Programm sch&uuml;tzt schon weit mehr als 2,5
Millionen deutscher Internetnutzer und bewahrt Sie nachhaltig vor
0190-Betrug im Internet. Der Hersteller - die My Channel Multimedia GmbH
(http://www.mychannel.de) wurde f&uuml;r die Entwicklung mit dem Deutschen
Verbraucherschutz Award 2001 ausgezeichnet.

<p>Das Programm gibt es f&uuml;r nur 8,50 DM unter
http://www.connectionwatch.de . Auf dieser Seite finden Sie auch den
Info-Dienst "0190-News", der Sie st&auml;ndig &uuml;ber aktuelle
0190-Gefahren im Internet informiert.

<p>-------------------------------------------------------

<p>2. Terror im Internet: Schutz vor "E-Mail-Bomben" Starke Zunahme von
Web-Attacken erwartet / FBI warnt vor Viren-Flut Die explosionsartige
Verbreitung des neuen Internetwurms "Nimda" ist m&ouml;glicherweise der
Beginn einer Flut von Web-Angriffen auf Unternehmen und Rechner von
privaten Usern. Das FBI warnt vor der massenhaften Verbreitung neuer,
aggressiver Computerviren. Sie k&ouml;nnten auch unter Bezug auf die
Terroranschl&auml;ge als E-Mail-Anh&auml;nge mit dem Betreff "World Trade
Center" versendet werden. So macht seit drei Tagen auch ein
gef&auml;hrlicher Virus mit dem Namen "WTC.exe" die Runde. Diese Viren
verbreiten sich &uuml;ber die infizierten Rechner weiter und versenden sich
selbst&auml;ndig an alle gespeicherten Mailempf&auml;nger. So k&ouml;nnen
die Viren binnen weniger Stunden hunderttausende Rechner rund um den ganzen
Globus infizieren. <br> Schon bei fr&uuml;heren Konflikten nahmen Anzahl
und Sch&auml;rfe von Web-Attacken zu. Sicherheitskreise erwarten bei einem
milit&auml;rischen Angriff der USA deshalb einen rasanten Anstieg von
Attacken auf Webserver und private User. Schutz bietet f&uuml;r
Internetnutzer ein neues E-Mail-Sicherheitsprogramm mit dem Namen
"Mail-Terror-Blocker" (www.terror-blocker.de). Die Software verhindert,
dass der User-Rechner mit den "script-verseuchten" Mailanh&auml;ngen
infiziert wird und sch&uuml;tzt gleichzeitig den Postausgang vor der
selbst&auml;ndigen Verbreitung der aggressiven Viren. So wird die Gefahr im
Keim erstickt. Denn wenn sich die Viren &uuml;ber die Userrechner nicht
mehr verbreiten k&ouml;nnen, dann k&ouml;nnen sie auch keine anderen
Computer infizieren.

<p>Schon vor der Terrorattacke auf die USA hatte sich die Anzahl der Viren
dramatisch erh&ouml;ht: Im ersten Halbjahr 2001 entdeckten
Sicherheitsexperten 6127 neue Varianten, die weltweit Sch&auml;den in
Milliardenh&ouml;hen anrichteten. Zwei der bekanntesten Viren waren der
Homepage-Virus und der Loveletter-Virus. Da zur Zeit im Internet Millionen
Mails mit Bezug auf das World Trade Center kursieren, nehmen
Sicherheitskreise an, dass potentielle Internet-Angreifer versuchen werden,
ihre Viren mit Bezug auf die Katastrophe in den USA zu tarnen, da die User
solche Mails oft arglos &ouml;ffnen.

<p>Ueber18.de hat den "Mail-Terror-Blocker" mit dem Nimda-Virus und dem
Loveletter-Virus getestet. Beide Viren hatten wir in einer Mail verpackt
und die Anh&auml;nge ge&ouml;ffnet. Und beide Male hat der
"Mail-Terror-Blocker" zuverl&auml;ssig gewarnt, Infizierung und vor allem
Weiterversendung verhindert.

<p>Mehr Infos und Bestellm&ouml;glichkeit (19.50 DM): www.terror-blocker.de

<p>-------------------------------------------------------

<p>3. Achtung: Feind liest mit Schutz vor Spionen auf dem PC Achtung: Feind
liest mit: Sind Sie sicher, dass nur Sie Zugriff auf Ihren Rechner haben?
Millionenfach haben sich im Internet die gef&auml;hrlichen Trojaner "Netbus
und Subseven" verbreitet. Einmal auf Ihrem Rechner erm&ouml;glichen die
Spione Fremden v&ouml;llige Kontrolle &uuml;ber ihren Computer. Jedes Wort,
das Sie in die Tastatur eingeben, kann in Echtzeit von den Angreifern
abgefangen werden. Noch schlimmer kann es f&uuml;r Sie werden, wenn Ihnen
auf diesem Wege auch noch 0190-Dialer oder andere Sch&auml;dlinge
untergeschoben werden, die Ihnen bares Geld kosten. Wirksamen Schutz gegen
"Subseven" und "Netbus" bietet der Trojaner-Killer. Das Schutzprogramm
scannt Ihren PC nach den unsichtbaren Eindringlingen, und per Mausklick
k&ouml;nnen Sie die Trojaner dauerhaft entfernen. Sind Sie nicht infiziert,
dann erscheint eine Positivmeldung.

<p>Gro&szlig;e Sicherheit zum kleinen Preis: F&uuml;r nur 8,50 DM bietet
der Trojaner-Killer Schutz vor Netbus und Subseven

<p>Jetzt bestellen

<p>-------------------------------------------------------

<p>4. Keine Spuren n&auml;chtlicher Internetsitzungen PC Safetykid:
Effektiver Schutz f&uuml;r die ganze Familie / Datenschutz zu Hause Spuren
n&auml;chtlicher Internetsitzungen auf dem Computer? PC Safetykid
sch&uuml;tzt Ihre Dateien und Einstellungen vor den neugierigen Blicken
Ihrer Familie, und PC Safetykid bringt Ihren Kids sichere Computer samt
sicherem Internet. Die Basis daf&uuml;r bieten eigene Desktops f&uuml;r
jedes Familienmitglied. Keiner kann in den Bereich der anderen sehen -
au&szlig;er Ihnen nat&uuml;rlich. Sie haben den gesamten Computer fest im
Griff. So bleiben auch Spuren n&auml;chtlicher Internetsitzungen f&uuml;r
die Kleinen unentdeckt.

<p>Die Eltern konfigurieren den PC f&uuml;r ein oder mehrere Kinder mit
wenigen Mausklicks und legen fest, welche Spiele, welche Lernsoftware, das
jeweilige Kind nutzen darf. Sie bestimmen die Dauer der t&auml;glichen bzw.
w&ouml;chentlichen Rechnerzeit. Schlie&szlig;lich legen Sie fest, ob das
Kind ins Internet darf oder nicht. Mit dem in der Software enthaltenen
Safetykid-Kinderbrowser haben Ihre Kleinen endlich sichere freie Fahrt im
Internet.

<p>Dort greift die Sicherheitstechnolgie auf die Kinderdatenbank
www.safetykid.net zu - mit rund 30.000 redaktionell gepr&uuml;ften,
altersgerechten Internetseiten - eine der gr&ouml;&szlig;ten
Kindersuchmaschinen in ganz Europa. Jeder abgehende Link einer
Internetseite f&uuml;hrt wieder auf den Safetykid-Kinderbrowser und die
Datenbank zur&uuml;ck - ein Ausbrechen ist nicht m&ouml;glich. So
k&ouml;nnen wir Ihnen die gr&ouml;&szlig;tm&ouml;gliche Sicherheit f&uuml;r
Ihre Kinder im Internet garantieren.

<p>Und weil die eingebaute PC-Uhr dar&uuml;ber wacht, dass Ihre Kinder
nicht l&auml;nger als von Ihnen gewollt vor dem Computer sitzen,
k&ouml;nnen Sie Ihre Kids endlich v&ouml;llig alleine an den
Familien-Rechner lassen. Denn es kann nichts passieren. Weder im Internet,
noch auf Ihrem Computer. Und Papas oder Mamas PC wird endlich zum
Familien-PC.

<p>Deshalb wurde PC Safetykid auch von vielen gro&szlig;en
Fachpublikationen mit Lob bedacht. "Computer Easy" hat PC Safetykid in der
neuesten Ausgabe das Pr&auml;dikat "Empfehlenswert" verliehen. Die "PC
Welt" kommt zu dem Urteil: "Verwehrt den Kindern den Blick auf Pornos".
"CD-Info" hat die Schutzsoftware mit "Sehr gut" benotet, das "PC Magazin"
h&auml;lt die Software f&uuml;r "Familientauglich", und "PC Go" kommt zu
dem Urteil "Kindersicher".

<p>PC Safetykid ist eines der sichersten Schutzprogramme f&uuml;r die ganze
Familie. Preis: nur 89,95 DM

<p>Jetzt bestellen.

<p>Mehr Infos unter www.safetykid-shop.de

<p>-------------------------------------------------------

<p>5 .Stopp dem Datenklau: Schlie&szlig;en Sie Ihre PC digital ab PC Lock -
das digitale Sicherheitsschlo&szlig; f&uuml;r den PC Sensible Daten auf dem
Computer? Schlechtes Gewissen, wenn Sie den Rechner mal ein paar Minuten
aus den Augen lassen m&uuml;ssen? Jetzt gibt es endlich PC LOCK - das
digitale Sicherheitsschlo&szlig; f&uuml;r den PC. Effektiver Schutz
f&uuml;r Sie und Ihre Daten. Anders als ein Bildschirmschoner mit
Pa&szlig;wortabfrage l&auml;&szlig;t sich das Sicherheitsprogramm Programm
nicht durch an- und ausschalten &uuml;berlisten. Alle denkbaren
Tasten-Kombinationen und Manipulationsversuche zurDCberwindung der
Sicherheitsbarrieren versagen. Nur Sie pers&ouml;nlich kommen mit Ihrer
Geheimzahl an das Betriebssystem und Ihre Daten. Alle anderen m&uuml;ssen
draussen bleiben. Preis: 29,95 DM.

<p>Jetzt bestellen.

<p>Mehr Infos unter www.pclock.de

<p>-------------------------------------------------------

<p>6. Keine Angriffe von Innen
PC Business Desktop sch&uuml;tzt betriebsinterne IT-Strukturen

<p>Deutsche und internationale Sicherheitsexperten warnen mit Zunahme des
Kriegskonfliktes auch vor Angriffen aus internen IT-Strukturen.
Eingeschleuste Viren, Trojaner und andere Sch&auml;dlinge k&ouml;nnen
Firmennetzwerke binnen Minuten massiv sch&auml;digen oder lahmlegen.
Nachhaltigen Schutz vor internen Angriffen aller Art bietet der PC Business
Desktop (http://www.pclock.de/frameset_Businessdesktop.htm). Das Programm
sch&uuml;tzt ausserdem zuverl&auml;ssig vor ungewollten Anwendungen, die
Firmennetzwerke "verstopfen" oder "blockieren" - wie beispielsweise dem
"Moorhuhn-Spiel". In diesem Monat gibt es die dritte Moorhuhn-Variante zum
kostenlosen Download die wieder in wenigen Tagen von Millionen Nutzern aus
dem Netz geladen wird und die wieder tausende Firmennetzwerke behindern
wird - dazu kommen enorme Arbeitszeitausf&auml;lle durch das "Daddeln" am
Arbeitplatz. <br>
Mit dem PC Business Desktop haben Wie als Arbeitgeber nie wieder
Moorh&uuml;hner, nie wieder unerw&uuml;nschte Programme oder Dateien auf
firmeneigenen Computern. Der PC Business Desktop bietet jedem Arbeitnehmer
einen individuellen, seinen Bed&uuml;rfnissen angepa&szlig;ten Desktop.
Mehr Anwendungen, als der Arbeitgeber f&uuml;r einen Arbeitsplatz
zugelassen hat, sind nicht m&ouml;glich. Der Versuch der Programmsabotage
f&uuml;hrt zum "Absturz" des Rechners. Nur der Administrator hat dann die
M&ouml;glichkeit, den Arbeitsplatz wieder freizuschalten. Die neuartige
Sicherheits-Software l&auml;&szlig;t sich bequem &uuml;ber Firmennetzwerke
administrieren. Ein Security-Programm, das Sch&auml;den in
Millionenh&ouml;hen verhindert - in nur einem einzigen Unternehmen. <br>
Den "PC Business Desktop" gibt es als Einzelplatzvariante f&uuml;r
Workstations und als Netzwerkvariante schon ab 99 Euro. Mit dem "PC
Business Desktop Networks" kann der Administrator alle Konfigurationen
bequem &uuml;ber das Firmen-Netzwerk vornehmen. Lediglich zum Installieren
mu&szlig; der Admin an jeden Einzelplatz. Danach kann er jedeC4nderung von
seinem Rechner aus veranlassen. Mit dem "PC Business Desktop Networks"
k&ouml;nnen zudem Win 95-, Win 98- und Win ME-Betriebssysteme
kosteng&uuml;nstig zum Windows-NT- oder Windows-2000-Standard aufgewertet
werden. <br>
Mehr Infos und Bestellm&ouml;glichkeiten unter: <br>
http://www.pclock.de/frameset_Businessdesktop.htm

<p>-------------------------------------------------------

<p>Wenn Sie regelm&auml;&szlig;ig &uuml;ber aktuelle Gefahren im Internet
und wirksame Gegenma&szlig;nahmen informiert werden m&ouml;chten, dann
bestellen Sie doch einfach den kostenlosen Security-Newsletter. Das
Anmeldeformular finden Sie unter: <br>
http://www.mychannel.de/conwathilfe/newsletter-eintragen.html
</p><br>
</td></tr></table></center>

</p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
