<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Noch 1× der Euro</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p><font size="-1"> Bildschirm zu klein? Dann klicke
<a href="st_euro2.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&uuml;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font></p>

<p align=center><font color="#000080" size="7"><b>Der Euro zum
2ten</b></font></p>

<table border=0 width=100%>
<tr>
 <td width=30% align=center valign=center><font size=7
 color="#008000"><b>PRO</b></font></td>
 <td width=40% align=center><img src="st_euro3.gif" width=200
  heigth=190></td>
 <td width=30% align=center valign=center><font size=7
 color="#ff0000"><b>CONTRA</b></font></td>
</tr>
<tr><td colspan=3 align=center><font size="-1">Artikel und Bild aus
TOMORROW 22/23 2001 </font></td> </tr></table>
<table border=0 width=100%><tr>
<td width=50% valign=top> 
<p>Wirtschaftspublizist Wolfhart Berg </p>

<p>Der Euro kommt Deutschland gerade recht - als Rettungsanker,
Auffangbecken, Hoffnungsschimmer. Denn hohe Inflationsraten, traurige
Arbeitslosenzahlen und d&uuml;steres BIP-Wachstum lassen die Deutschland AG
2001 als Schlusslicht in der EU-Staatenfamilie schlecht aussehen. Die
einstige Wirtschaftswunder Lokomotive steht nicht mehr unter Dampf. Da
hilft auch keine Gold-Deckung. Da kann nur der Euro neue Schubkraft geben.
Die D-Mark-Scheine waren in den letzten drei Jahren sowieso nur noch
Papiertiger eines festgezurrten Eurokurses. Erarbeitet wird die H&auml;rte
einer W&auml;hrung, ob sie nun DM oder Euro hei&szlig;t, nur durch harte
Arbeit, kreative Ideen und Patentrezepte, EU-L&auml;nder wie Holland,
Irland oder Spanien helfen uns da auf die Spr&uuml;nge. Der neue
W&auml;hrungsraum bringt au&szlig;erdem kostensparendeVorteile: kein
Devisenumtausch mehr, billigere Auslandsreisen; Kalkulationssicherheit
f&uuml;r Export-Betriebe; durch die Preistransparenz k&ouml;nnen
Verbraucher die Konkurrenz preiswert vergleichen! Das neue Euroland der 300
Millionen Europ&auml;er wird durch das neue Geld (ohne
W&auml;hrungsreform!) eine un&uuml;berh&ouml;rbare Stimme bei G7 und
Internationalem W&auml;hrungsfonds. Der Euro wird st&auml;rker, weil
attraktiver: Argentinien nimmt ihn in den W&auml;hrungskorb, die Schweiz
will ihn in jedem Urlaubsort als Zahlungsmittel akzeptieren, Osteuropa und
T&uuml;rkei handeln ihn jetzt schon als Zweitw&auml;hrung. Und dem Dollar
wird er ebenb&uuml;rtiger Partner. Nach der Katastrophe von New York
senkten Greenspan und Duisenberg den Leitzins im Parallelschwung. Der Euro
wird erwachsen. </p>

</td><td width=50% valign=top>
<p>Wirtschaftspublizist Paul C.Martin </p>

<p>Jede W&auml;hrung ist so gut wie das, womit sie gedeckt ist: Die D-Mark
war durch beste Sicherheiten gedeckt. 70% davon: Pfandbriefe und
Bankschuldverschreibungen. Daf&uuml;r hafteten Grund und Boden und die
stocksoliden deutschen Banken. 25% waren Staatsanleihen, der Rest
Handelswechsel, daf&uuml;r standen Weltfirmen wie Siemens oder BMW gerade.
Im Euro-System ist die Bundesbank nur eine von vielen Notenbanken, die Geld
ausgeben d&uuml;rfen. Andere k&ouml;nnen Geld gegen Schulden von Staaten
ausgeben, die viel h&ouml;her verschuldet sind als Deutschland. Diese
Deckung ist nichts wert. </p>

<p>Au&szlig;erdem d&uuml;rfen diese Notenbanken Euros gegen Papiere
rausr&uuml;cken, die Banken im Staatsbesitz fabrizieren. Das hat zur Folge,
dass sich Staaten in Geldnot bei ihren Notenbanken direkt "bedienen"
k&ouml;nnen. Sogar gegen Aktien d&uuml;rfen Euros ausgegeben werden! Wie
die st&uuml;rzen, wei&szlig; man. Entsprechend schwach wird der Euro sein,
dem wir nicht mehr ansehen, ob er von der guten Bundesbank oder von einer
Hallodri-Notenbank kommt. Und noch etwas st&ouml;rt mich am Euro: Er kann
von den Regierungen mehrheitlich f&uuml;r "nicht konvertierbar"
erkl&auml;rt werden, die EZB muss dazu nur angeh&ouml;rt werden, hat aber
keine Macht, es zu verhindern. "Nicht konvertierbar" hei&szlig;t: Euros
k&ouml;nnen nicht in Dollar, Yen oder Franken transferiert werden wie heute
die DM. Europa kann sich von der Welt abkoppeln. Eine solche
"Binnenw&auml;hrung" hatten wir schon mal zwischen Weltwirtschaftskrise und
W&auml;hrungsreform. Der gro&szlig;e Liberale Ludwig Erhard warf sie dann
auf den M&uuml;ll der Geschichte. </p>

</td></tr></table>

<p> &nbsp; <br>
Kein linker Frame? Dann klicke <a href="index.html" target="_top">
<b>hier</b></a></font> </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
