<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p><font size="-1"> Bildschirm zu klein? Dann klicke
<a href="st_europa.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&#252;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font>
</p>

<p><center><font color="#000080" size="7"><b>Europa, zum 2.</b></font></center>
</p>

<p><img src="st_europa1.gif" width=440 heigth=550 align=left hspace=6> In
Erg&#228;nzung zumBeitrag in der NC-91 m&#246;chte ich heute das
Schwergewicht auf die Behauptung legen: Europa wird effektiver. </p>

<p>Nach intensiven Verhandlungen hat der Europ&#228;ische Rat, das
Gipfeltreffen der Staats- und Regierungschefs der EU, am 11.Dezember 2000
in Nizza ein "Reformpaket" gebilligt. das als Vertrag von Nizza in die
Geschichte eingehen wird. Der Vertrag wurde am 26.Februar 2001 in Nizza von
den Au&#223;enministern der Europ&#228;ischen Union unterzeichnet und muss
nun noch von den nationalen Parlamenten aller Mitgliedsstaaten ratifiziert,
d.h. gebilligt werden. </p>

<p>In Nizza ging es vor allem um die Reform der Institutionen der EU, um
diese fit zu machen f&#252;r die Aufnahme neuer Mitglieder. Eine
Regierungskonferenz, an der neben Vertretern der 15 Regierungen auch Beamte
der Kommission und Abgeordnete des Europ&#228;ischen Parlaments teilnahmen,
hatte mit dieser Arbeit am 14.Februar 2000 begonnen und das Ergebnis dem
Europ&#228;ischen Rat in Nizza vorgelegt. In einigen wichtigen Fragen
konnte erst auf dem Gipfel selbst Einigkeit erzielt werden. </p>

<p>Der Vertrag von Nizza ist das entscheidenste Signal an die
Beitragskanditaten, dass es jetzt allein an ihnen liegt, ihre
Beitrittsf&#228;higkeit herzustellen. Es ist dar&#252;ber hinaus auch ein
klares Signal an alle Partner der EU, dass sie in der Lage sind, ihre
Handlungsf&#228;higkeit auch nach Aufnahme neuer Mitgliedstaaten zu
bewahren. </p>

<p>Es gelang in Nizza, f&#252;r die schwierigen Fragen der
Stimmengewichtung im Rat, der Gr&#246;&#223;e und Struktur der Kommission
sowie des Übergangs zu Mehrheitsentscheidungen einen tragf&#228;higen
Gesamtkompromiss zu finden. Dar&#252;ber hinaus wurde das Instrument der
"Verst&#228;rkten Zusammenarbeit" weiterentwickelt. F&#252;r das
Europ&#228;ische Parlament wurde eine neue Sitzverteilung festgelegt. Auch
die Struktur der &#252;brigen Organe und Institutionen der Gemeinschaft
wurde auf eine gr&#246;&#223;ere Zahl von Mitgliedstaaten ausgerichtet.
Schlie&#223;lich schafft der Vertrag von Nizza ein "Fr&#252;hwarnsystem",
mit dem die Union auf die drohende Verletzung ihrer Prinzipien, wie
Freiheit, Demokratie, Achtung der Menschenrechte und Grundfreiheiten sowie
Rechtstaatlichkeit in einem Mitgliedstaat, k&#252;nftig rasch reagieren
kann. <br clear=all></p>

<p>Die Betrittskandidaten
<table><tr><td valign=top>Land </td><td align=right>Bev&#246;lkerung <br>
in Mio. </td></tr>
<tr><td>Bulgarien</td><td align=right>8,3</td></tr>
<tr><td>Estland</td><td align=right>1,4</td></tr>
<tr><td>Lettland</td><td align=right>2,4</td></tr>
<tr><td>Litauen</td><td align=right>3,7</td></tr>
<tr><td>Malta</td><td align=right>0,4</td></tr>
<tr><td>Polen</td><td align=right>38,7</td></tr>
<tr><td>Rum&#228;nien</td><td align=right>22,5</td></tr>
<tr><td>Slowakische Republik</td><td align=right>5,4</td></tr>
<tr><td>Slowenien</td><td align=right>2,0</td></tr>
<tr><td>Tschechische Republik</td><td align=right>10,3</td></tr>
<tr><td>T&#252;rkei</td><td align=right>63.4</td></tr>
<tr><td>Ungarn</td><td align=right>10,1</td></tr>
<tr><td>Zypern</td><td align=right>0,7</td></tr>
</table>
</p>

<p>Zur Vervollst&#228;ndigung:<br>
Die drei Staaten, die mit der EU den EWR bilden, sind Island, Norwegen und
Liechtenstein. </p>

<p> &nbsp; <br>
Kein linker Frame? Dann klicke <a href="index.html" target="_top">
<b>hier</b></a></font> </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
