<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Der heilige Isidor</b></font></p>

<p>In NC-85/Wolf-Info hatte ich berichtet, dass der Papst in diesem
Fr&uuml;hjahr den heiligen Isidor von Sevilla zum Schutzpatron des
Internets erkl&auml;rt hat. Da auf meine Meldung hin &uuml;berhaupt keine
Reaktion erschien und auch die &Ouml;ffentlichkeit wohl so ziemlich
dar&uuml;ber hinweggeht, habe ich einen vorbereiteten Artikel nicht
nachgelegt. Da aber diese NC sehr d&uuml;nn auszufallen scheint, sollt ihr
doch etwas zu lesen bekommen. Und so platziere ich meinen Artikel halt
jetzt. </p>

<p>Der hl. Isidor von Sevilla. der Nationalheilige Spaniens, lebte im
7.Jahrhundert. Er war einer der gelehrtesten M&auml;nner seiner Zeit. Seine
Geschwister waren der hl. Leander, Erzbischof von Sevilla, Fullgentius,
ebenfalls Bischof und die hl. Florentina. Viele Irrlehren verbreiteten sich
in dieser Zeit. Es war daher verst&auml;ndlich, dass Leander, der Bischof
von Sevilla, seinem kleinen Bruder Isidor, den er zum Studium der
Wissenschaften zu sich nach Sevilla hatte kommen lassen, eine gute, strenge
Ausbildung erm&ouml;glichen wollte. Aber Isidor fiel das Lernen sehr
schwer. Bald wurde er dessen &uuml;berdr&uuml;ssig und lief einfach kurz
entschlossen davon. </p>

<p>Vom langen Laufen ermattet, setzte ersich an den Rand eines
Ziehbrunnens. Da sah er zu seinen F&uuml;&szlig;en einen Stein, der viele
L&ouml;cher aufwies und am Brunnen sah er eine Walze, welche von einem
Seil, das dar&uuml;ber gewunden war, viele Einschnitte hatte. Er sann
dar&uuml;ber nach, welches wohl die Ursache dieser L&ouml;cher im Stein und
die Einschnitte in der Walze sei. Da kam eine Frau um Wasser zu
sch&ouml;pfen. Sie fragte ihn verwundert, was er da mache und woher
gekommen sei. Isidor aber fragte dagegen wie die L&ouml;cher in den Stein
und die Einschnitte in die Walze gekommen seien? Sie erkl&auml;rte ihm
freundlich, dass nach und nach die herabfallenden Wassertropfen die
L&ouml;cher ausgeh&ouml;hlt und das Seil durch das Auf- und Abwinden in die
Walze die Einschnitte gemacht habe. Der Knabe dachte nach und
pl&ouml;tzlich war es ihm, als sagte eine geheime Stimme zu ihm: "Wenn der
harte Stein durch die fallenden Wassertropfen ausgeh&ouml;hlt worden ist
und die Walze diese Einschnitte durch das &ouml;ftere Auf- und Abwinden
erhalten hat, um wie viel mehr kann ich mir viele Kenntnisse sammeln, wenn
ich an jedem Tag auch nur ein wenig und das gut lerne." Dieser Gedanke gab
ihm neuen Mut, und sogleich kehrte er wieder zu seinem Bruder nach Sevilla
zur&uuml;ck, wo er nun mit beharrlichem Eifer in der Schule lernte und nach
und nach die gr&ouml;&szlig;ten Fortschritte in der Wissenschaft erzielte.
</p>

<p>Zum Priester geweiht, bildete sein Wissen die Grundlage f&uuml;r seinen
Kampf gegen die Irrlehrer, gegen die er mutig antrat. All sein K&ouml;nnen
setzte er zum Wohle der katholischen Kirche ein. Nach dem Tode seines
Bruders wurde Isidor zu dessen Nachfolger gew&auml;hlt. Als Bischof
f&ouml;rderte er die Wissenschaften und gr&uuml;ndete Schulen und
Kl&ouml;ster. Das Hauptanliegen des heiligen Bischofs war, seiner
Priesterschaft die geistigen Waffen zu verschaffen, damit sie den Angriffen
der Irrlehrer gewachsen waren und sich durch ihr Wissen und ihre Bildung
hervorhoben. Isidor waren 35 Jahre segensreichen Wirkens als Bischof
verg&ouml;nnt. Er wurde zu Lebzeit und nach seinem Tode durch Wunder
ausgezeichnet. Als er den Tod nahen f&uuml;hlte, lie&szlig; er sich von
zwei Diakonen gest&uuml;tzt, in die Kirche bringen, wo er an den Stufen des
Altars am 4.April 636 sein Leben aushauchte. Sein Leib wurde im Dom von
Sevilla neben seinen Geschwistern beigesetzt. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
