<html>
<head>
<!-- Author = Cord Hagen -->
<title>WinXP</title>
</head>
<body text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#deffff">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>WinXP</b></font></p>

<h3>Das Ende der Evolution heisst XP? </h3>

<p>Viele von uns kennen nicht nur das Amigasystem. Windows begegnet uns ja
wirklich nahezu t&auml;glich und &uuml;berall. Oft genug ert&ouml;nt
irgendwo der immer selbe Windows-Startsound, - glotzt man auf fast immer
denselben einheitlich un&uuml;berraschenden Desktop. Mal etwas bunt, mal
etwas bunter doch jetzt kommt WindowsXP und zeigt, da&szlig; alles noch
viel bunter geht. </p>

<p>Als H&auml;ndler kommt man verst&auml;ndlicherweise besonders schnell
und zwangsl&auml;ufig an neue Betriebssysteme und vielleicht interessiert
sich ja jemand f&uuml;r meinen ersten Eindruck zum neuen Windows. </p>

<p>Dadurch, da&szlig; eben soviele Anwender, die hier mitlesen auch das
Standart-Windows-System recht gut kennen, schon mal gesehen haben oder sich
gar t&auml;glich damit herum&auml;rgern m&uuml;ssen, dachte ich mir - es
k&ouml;nne ja nicht schaden, meine ersten Eindr&uuml;cke des j&uuml;ngsten
Microsoft-Sprosses kundzutun. </p>

<p>Geht es nach den Untertanen des K&ouml;nigs Bill Gates, - so wird
WindowsXP als endlich erwartete Vollendung der Windowsevolution gehandelt.
Erstmalig flie&szlig;en die Heimanwenderversionen und die wesentlich
teureren Businessversionen ineinander und bilden ein einheitliches
St&uuml;ck Software. </p>

<h3>Kurzer R&uuml;ckblick zur Windows-32Bit-Geschichte </h3>

<p>Die &Auml;ra des f&uuml;r Ottonormalverbraucher gedachten Windows auf
32Bit-Basis begann mit Windows95. Seinerzeit bereits auff&auml;llig durch
die ungew&ouml;hnliche Versionsbennenung. So gab es die eigentliche
Versionnummer nur noch f&uuml;r internre Gebrauchszwecke und f&uuml;r den
allgemeinen Rufnamen der Version verwendete man einfach das Jahr der
Erstver&ouml;ffentlichung. </p>

<p>Auf die &auml;lteren Windiwsversionen gehe ich hier nicht ein, da es
sich dabei NICHT um ein Betriebssystem, sondern um einen sogenannten
Betriebssystemaufsatz gehandelt hat. Windows wurde bis zur Version 3.11 auf
das eigentliche Betriebssystem MS-DOS lediglich aufgesetzt. </p>

<p>Mit Windows95 waren die PC-User ersteinmal mehr oder oft weniger
zufrieden. Etliche kamen bereits in dieser Zeit nicht mit der eigenartigen
grafischen Bedienung zurecht und waren hoffnungslos &uuml;berfordert. Der
Arbeitsmarkt im Bereich Softwaresupport hatte Hochkonjunktur. </p>

<p>Umsteigern von der &auml;lteren grafischen Benutzeroberfl&auml;che
Windows3.x wurden Hilfen eingebaut, welche aber meist brach lagen, da sie
teilweise undokumentiert blieben. Auch der Kompatiblit&auml;t wegen blieben
etliche DOSund Alt-Windowsbestandteile auch noch in Windows95 enthalten.
</p>

<p>Es ging weiter und gro&szlig; umworben wurde der n&auml;chste Schritt,
der lange auf sich hat warten lassen m&uuml;ssen. Besser, stabiler,
schneller und viel einfacher hie&szlig; es. Und in der Tat, - auf manchen
Rechnern lief das neue, alte System besser und andere Anwender
schw&ouml;rten weiterhin auf ihr stabil laufendes Windows95. Ob sich
Windows98 wirklich Update nennen durfte wurde viel diskutiert. Und auch
unsere eigenen Diskussionen im Amigamarkt fallen mir hier ein, denn
dasselbe Spiel trennte die Geister ja beispielsweise auch beim
Versionssprung 3.5 auf 3.9 des AmigaOS. </p>

<p>Wieder passierte lange Zeit nichts. Eine neue Windowsversion war
geplant, aber die Entwicklung ging zu langsam voran und viele Anwender
hatten mit den zahlreichen Fehlern in Windows98 zu k&auml;mpfen. Eine
stabilere SE wurde noch zwischen gestopft. Das K&uuml;rzel SE stand hierbei
f&uuml;r SecondEdition, also ein zweiter Aufguss von Windows98, da&szlig;
ja eigentlich auch nur auf der Originalplattform von Windows95 aufgebaut
war. </p>

<p>Im professionellen Bereich hingegen versuchte Microsoft mit einem
reinrassigen 32Bit-System mit sehr &auml;hnlichen Bedienungsmerkmalen
Anwender von etablierten Netzwerkbetriebssystemen abzuwerben. In der Tat
lief Windows NT von Anfang an erheblich stabiler. Die Windows9x-Systeme
waren ein Mix aus 8Bit, 16Bit und 32Bit-Anteilen. Ein Durcheinander, das
zwar erm&ouml;glichte, da&szlig; selbst Software noch funktionierte, die
nach so vielen Jahren niemand mehr einsetzen wollte, aber eben kompatibel
zu allem, was bislang auch lief. Das so eine Mischung auch wackelig sein
kann, leuchtet dann allerdings auch ein. NT hingegen h&auml;tte sich solche
Labilit&auml;ten gar nicht leisten k&ouml;nnen. Und es tat es dennoch in
gewisser Weise, denn im Vergleich zu Systemen wie UNIX und deren Ableger
oder NOVELL und IBMs OS/2 sahen die NT-Systeme recht wacklig aus. So gab es
auch unter NT eigentlich zuviele Abst&uuml;rze. WindowsNT hatte es, wie
auch alle anderen Windowsversionen seiner einfachen grafischen
Benutzerf&uuml;hrung und dem perfekten Marketing Microsofts zu verdanken,
da&szlig; es dennoch immer st&auml;rker am Markt eingesetzt wurde. Man
schimpfte dar&uuml;ber und kaufte dennoch das n&auml;chste Update. </p>

<p>Schon in dieser Zeit war der Weg f&uuml;r Windows l&auml;ngst geplant.
Die Heimanwenderversionen sollten nach und nach den alten Ballast verlieren
und die NT-Systeme sollten multimediaf&auml;higer werden, damit irgendwann
nur noch eine Version verkauft werden brauchte. </p>

<p>Schon bei WindowsMe, dem Nachfolger von Windows98SE zum
Jahrtausendwechsel gab es schon die ersten Pl&auml;ne, eine gemeinsame
Version auf der WindowsNT-Plattform herauszubringen. Aber die
Kompatiblit&auml;tsprobleme zu etlichen Spielen und Anwendersoftware waren
noch zu gro&szlig;. Der Umstieg w&auml;re noch zu abruppt gewesen. Der Plan
wurde schnell &uuml;ber Bo(a)rd geworfen und abermals musste die gute alte
Windows9x-Plattform f&uuml;r ME herhalten. </p>

<p>Die geplante Version, in der Heimanwender und Profianwender gemeinsam
bedient werden sollten, wurde als reiner NT-Nachfolger unter
Windows2000-Label noch vor der ME-Version ver&ouml;ffentlicht. Dennoch gab
es bereits viele Gemeinsamkeiten. Still und heimlich verschwand die
MS-DOS-Eingabeaufforderung immer weiter in Unterverzeichnisse im
Startmen&uuml;. Und die ursprp&uuml;ngliche DOS-Umgebung wurde nur noch
mehr oder weniger emuliert und nicht mehr real zur Verf&uuml;gung gestellt.
An den Kern des Systems kommt der Anwender nicht mehr ohne weiteres heran.
Doch eigentlich waren ME und Windows2000 nur ein kleiner Zwischenschritt
zum eigentlich entg&uuml;ltigen Windows, - DEM Windows! </p>


<h3>Buntw&auml;sche WindowsXP </h3>

<p>Seit Ende Oktober gibt es sie nun, - die Windowsversion, die
Heimanwender und gro&szlig;e Firmen gleicherma&szlig;en zufriedenstellen
soll. Das Ende der Evolution zweier Systeme, die in ein Einziges verpackt
wurden. Hat man nun einen PC zuhause stehen, der eigentlich auch noch nicht
sonderlich zu alt w&auml;re, um WindowsXP zu installieren, stellt sich die
Frage - hole ich es mir, oder hole ich es mir nicht? </p>

<p>Vorab von mir die Antwort basierend auf meiner Meinung - Ja, aber noch
nicht jetzt! </p>

<p>WindowsXP ist sehr einfach und gr&ouml;&szlig;tenteils automatisch zu
installieren. Am bequehmsten ist das Ganze, wenn man bereits ein Windows
installiertund noch eine freie Festplatte oder Festplattenpartition zur
Verf&uuml;gung hat. Wer genug Platz hat, entscheidet sich gern f&uuml;r die
zus&auml;tzliche Installation der neuen Version. Ein Bootmen&uuml; wird
automatisch erstellt, so da&szlig; man nach dem Einschalten des Rechners
entscheiden kann, ob man mit dem bisherigen System arbeiten m&ouml;chte,
das im &Uuml;brigen g&auml;nzlich unangetastet zur Verf&uuml;gung steht,
oder aber lieber mit dem neuen XP experimentieren m&ouml;chte. </p>

<p>WindowsXP hat nun einen ganz entscheidenen Vorteil, es l&auml;uft um ein
Erhebliches stabiler, als alle bisher dagewesenen Windowsversionen. Schon
bei der Installation ist das zu sp&uuml;ren. Wenn man so wie ich ein eher
&auml;u&szlig;erst ungew&ouml;hnliches PC-System hat, kommt zB. ein
WindowsNT und 2000 l&auml;ngst nicht mehr mit jeder exotischen Hardware
zurecht. Die Installation von Windows2000 war eine irrsinnige Bastelarbeit,
wenn sie nicht in einem Bluescreen enden sollte. WindowsXP hingegen
pr&uuml;ft und &uuml;berspringt Hardwarekomponenten, die ein System
lahmlegen, bevor die Installation versagt. XP konnte einwandfrei
installiert werden und war damit recht schnell einsatzbereit. </p>

<p>Das neue System ist zudem flexibler und vielf&auml;ltiger dem Anwender
anpassbar. Mag man die Bonbonfarben der neuen Oberfl&auml;che nicht, so
l&auml;sst sich nat&uuml;rlich auch die langweiligere klassische
Oberfl&auml;che konfigurieren, so da&szlig; der Anwender nicht zwingend auf
eine gewohnte Umgebung verzichten muss. </p>

<p>Fast alles hat etwas mehr Automatik bekommen, um dem Anwender die Arbeit
zu erleichtern. Es gibt kaum noch Stellen im System, wo nicht
zwangsl&auml;ufig irgendwann ein Assistent aufpoppt, um einem seine Hilfe
aufzudr&auml;ngen. Der F&uuml;llstand der Festplatten wird bereits sofort
nach dem Start &uuml;berpr&uuml;ft und ein Assistent m&ouml;chte sich
sofort an die Aufr&auml;umarbeiten machen. Men&uuml;eintr&auml;ge
verschwinden, welche man bislang nie ben&ouml;tigte, um die
Men&uuml;struktur &uuml;bersichtlicher zu halten. Schon das Startmen&uuml;
bevormundet den Anwender, was sich wie schon erw&auml;hnt aber schnell und
einfach &auml;ndern l&auml;sst. Die Systemprogramme sind eine Sammlung der
Vorg&auml;ngerversionen WindowsMe und 2000 und decken alle
Standartbed&uuml;rfnisse zun&auml;chst einmal ab. Auch an die
Videobearbeitung wurde wieder gedacht. Noch viel einfacher ist der Umgang
mit DVD-ROMLaufwerken und CD-Brennern geworden. Ein CDRW-Brenner wird wie
ein gew&ouml;hnliches Laufwerk eingebunden. Dateien lassen sich dadurch
simpel und ohne zus&auml;tzliche Software per Windows-Explorer auf CD
bringen. Videofilme auf DVD k&ouml;nnen im Mediaplayer angesehen werden.
Vermisst habe ich immer noch die integrierte Unterst&uuml;tzung meiner
TV-Karte, um auch bereits standartm&auml;&szlig;ig in Windows fernsehen zu
d&uuml;rfen und den Videotext zu nutzen. Fast schon ein Kinderspiel ist das
Einrichten eines Netzwerkes. Ein Assistent nimmt viele l&auml;stige
Arbeiten und Einstellungen ab. Wer sich mit Grundbegriffen eines Netzwerkes
vertraut f&uuml;hlt, hat recht schnell ein funktionierendes Heimnetzwerk
aufgebaut, ob nun nur zwei PCs per Crossover-Verbindung, oder ein LAN
&uuml;ber HUB oder Switch. </p>


<h3>Kein Windows ohne Probleme </h3>

<p>Nun, warum empfehle ich, noch zu warten? Ich fand besonders
erschreckend, was WindowsXP noch NICHT alles an Treibersoftware f&uuml;r
meine eingebauten Hardwarekomponenten mitbrachte. W&auml;hrend mein
Tintenstrahldrucker Canon BJC7000 v&ouml;llig problemlos sofort
eingerichtet wurde, fehlte in WindowsXP der Treiber zu meinem Laserdrucker
HP Laserjet 3150. HP arbeitet sehr eng mit Microsoft zusammen und ich
h&auml;tte vor der Windowsver&ouml;ffentlichung Geld verwettet, da&szlig;
komplett alle aktuellen HP-Druckertreiber integriert sein w&uuml;rden. Auch
mein CD-Wechsler von der ebenfalls nicht namenlosen Marke TEAC wird nicht
korrekt unterst&uuml;tzt. Hier wird der Wechsler nur als einzelnes
CDLaufwerk angesprochen. Alles nicht so schlimm, man k&ouml;nnte sich ja
den aktuellen XP-Treiber direkt von den Downloadseiten der Hersteller
herunterladen, aber hier musste ich leider feststellen, da&szlig; fast alle
Hersteller noch am programmieren neuer Treiber sind. Selbst f&uuml;r meine
Soundkarte Soundblaster Live! 5.1 gibt es noch keine XP-Treiber. Somit sind
zus&auml;tzliche Funktionen dieser Karte nicht nutzbar. Auf den
Laserdrucker mu&szlig; ich ersteinmal verzichten oder mit anderen
LaserjetTreibern herum experimentieren. Einige Laufwerke sind ebenfalls
nicht nutzbar, da ein zus&auml;tzlicher ATA-Controller noch nicht
unterst&uuml;tzt wird. Auch auf mein zwar &auml;u&szlig;erst
empfehlenswertes, aber nicht von XP unterst&uuml;tztes COMone-USB-Modem
werde ich vorerst unter XP wohl verzichten m&uuml;ssen. Sicherlich werde
ich noch etwas herumt&uuml;fteln und das ein oder andere zum laufen
bringen, aber dem normalen Anwender ist soetwas sicherlich noch nicht
zumutbar. </p>

<p>Auch zu Software, vor allem Spiele, aber auch etlichen Anwendungen ist
WindowsXP nicht mehr kompatibel - es muss &uuml;berall ein Update her. Das
kostet viel Zeit, Geld und sicherlich auch Nerven. </p>


<h3>Meine klare Empfehlung also </h3>

<p>Einfach WARTEN und Tee trinken. Es dauert noch einige Zeit, bis alle
Hersteller von Hard- und Software WindowsXP unterst&uuml;tzen und der
gesamte Softwaremarkt sich darauf eingeschossen hat. Bis dahin ist mit
etlichen Problemen zu rechnen, da viel Software erneuert werden muss, aber
noch gar nicht existiert. Wer ein stabil laufendes Windows bereits hat,
kann sich mehr Zeit lassen, wer aber eher mit seinem jetzigen System zu
k&auml;mpfen hat, f&uuml;r den kommt h&ouml;chstens eine zus&auml;tzliche
Installation in Frage. Immer auf Nummer sicher geht man, wenn man sich alle
Hardwarekomponenten des eigenen PC-Systems zur Brust nimmt und f&uuml;r
alle Einzelteile erst die aktuellen XP-Treiber besorgt und erst bei
Vollz&auml;hligkeit zu WindowsXP greift. Dann aber hat man endlich ein
stabil funktionierendes und gut bedienbares Windows-System. </p>

<p>Ich hoffe nun wirklich, da&szlig; wir schon bald erste Erfahrungen
&uuml;ber ein neues AmigaOS oder einen neuen Amiga erleben werden, denn
soviel ist ganz sicher - der Markt muss Alternativen anzubieten haben.
Immer wieder &uuml;ber den Tellerrand zu schauen hat noch nie geschadet.
</p>

<p>Wenn Fragen zu WindowsXP sind, kann ich Diese in einem weiteren Bericht
gern beantworten. </p>

<p>Higgins <br>
(Cord Hagen) </p>

<p> &nbsp; </p>

<h3>Hier die Testrechner-Konfiguration: </h3><ul>

<li> AMD Athlon 800MHz  </li>
<li> FIC SD-11 Mainboard  </li>
<li> 768 MByte SD-RAM PC133  </li>
<li> TriOS-Multiboot-Festplattensystem mit 3 x 20GByte  </li>
<li> f&uuml;r drei physikalisch getrennte Bootfestplatten (3 PCs in Einem) </li>
<li> weitere 60GByte Festplattenkapazit&auml;t </li>
<li> Voodoo 3000 AGP-Grafikkarte mit TV-Out 16MByte </li>
<li> Wint TV/FM Fernseh/Radiokarte mit Fernbedienung  </li>
<li> Highpoint ATA66-Controller 4x UDMA plus 4fach-USB-Hub </li>
<li> Adapterec 2940UW-SCSI-Hostadapter </li>
<li> Realtec 10/100MBit LAN-Netzwerkkarte  </li>
<li> Soundblaster Live! Player 5.1 Surround-Soundkarte mit EAX </li>
<li> DB SmartCardReader </li>
<li> Externer SCS-Tower 8fach mit 7 St. SCSI-CD-ROM-Laufwerken von HP </li>
<li> und CD-Brenner von Plextor 4x/12x </li>
<li> weiterer interner AT-CDRW-Brenner mit Burn-Proof von Sony 8x/4x/32x </li>
<li> Toshiba DVD-ROM-Laufwerk 12x/40x </li>
<li> int. CD-ROM-Laufwerk ESSA ATA 44x </li>
<li> int. CD-Wechsler 6-fach TEAC 8x </li>
<li> LAN 8fach-Switch, Printer 4fach-Switch </li>
<li> Drucker Canon BJC 7000 & HP Laserjet 3150 Drucker/Fax/Kopierer </li>
<li> Com One USB 56k V.92 Modem </li>
<li> Aiptec PenCam VGA II Digitalkamera </li>
<li> Logitech iFeel-Opticalmouse & i-Touchmediakeyboard </li>
<li> AOC 9Glr 19"-Monitor </li>
<li> 2x SM-Video-Audio-Funkfern&uuml;bertragungssystem Empf&auml;nger & Sender </li>
<li> Nokia-Intellisync-Station for Communicator </li>
<li> Thrust Wheel-Gamecontroller </li></ul>

<p>(Angaben nur zum Verst&auml;ndnis, was WindowsXP bei seiner Installation
alles ber&uuml;cksichtigen musste) </p>

</td></tr></table>
<br>
</body>
</html>
