<HTML>
<HEAD><TITLE>AmZeiger 06/97 - Buchkritik &quot;Azrael&quot;</TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif">
<CENTER><H1><U>Wolfgang Hohlbein`s</U><BR>&quot;AZRAEL&quot;</H1><BR>
Romankritik<BR>von<BR><A HREF="mailto:G.Franz@BBrandes.berlinet.de">Gregor Franz</A></CENTER><P>

<B>Mark</B> Sillmann, Sohn des Industriellen und Chemikers, h&auml;lt es an seinem 18. Geburtstag nicht mehr
im Internat. Ab heute will er sein Leben selbst in die Hand nehmen. Er verschwindet, um nach
Berlin zu reisen, wo der Vater eine Fabrik und ein Wohnhaus besitzt und sich die Mutter seit
Jahren in einer Nervenklinik befindet. W&auml;hrend der Zugfahrt wird er von ungew&ouml;hnlichen und
be&auml;ngstigenden Tr&auml;umen um einen Todesengel heimgesucht.<P>

W&auml;hrenddessen passieren in Berlin eine Reihe bizarrer Selbstmorde(?). Die Polizei steht vor
einem R&auml;tsel. Der Polizist Bremer, der Zeuge eines dieser Selbstmorde geworden ist, bekommt von
einem der h&ouml;chsten Kriminalermittler Berlins, Inspektor Sendig, ein ungew&ouml;hnliches Angebot zur
Zusammenarbeit.<P>

Dieser war vor sechs Jahren an den Ermittlungen eines angeblichen Ungl&uuml;cksfalles in Sillmanns
Chemiefabrik beteiligt, welcher mehrere Todesopfer und Geistesgest&ouml;rte hinterlassen hatte.
Ursache war ein schiefgegangenes Drogenexperiment, welches damals von offizieller Seite
vertuscht wurde.<P>

Bremer beginnt Schatten zu sehen und sp&uuml;rt, da&szlig; sich etwas unglaublich gef&auml;hrliches heranbildet.
Kaum greifbar, aber doch real. Beginnt sich der fatale Vorgang von damals zu
wiederholen?<P>

Durchaus eine spannende Sache, die uns Wolfgang Hohlbein da kredenzt. Wie bei ihm gewohnt, ist
die Darstellung plastisch, die Charakt&auml;re kantig und meist glaubhaft.<P>

Aber was hei&szlig;t hier 'meist'?<P>

Seine Protagonisten zeigen, wie schon in einigen anderen seiner `Mystery- Romane`, ein
grunds&auml;tzliches Kommunikationsproblem. Geheimnisse bleiben auch bei engstem pers&ouml;nlichen Kontakt
gewahrt, selbst wenn Informationen lebenswichtig werden. Die beiden Hauptfiguren, aus deren
Sicht man den Gro&szlig;teil der Handlung erf&auml;hrt, Mark (Sillmann) und der Polizist Bremer, haben
leider (wie sollte es anders sein) gar keine Ahnung, was eigentlich wirklich vorgeht. Sie tappen
im Dunkeln, so wie der Leser.<P>

Selbst wenn Mark gegen&uuml;ber ein Teil des Geheimnisses gel&uuml;ftet werden soll, so will er es
pl&ouml;tzlich auch gar nicht mehr wissen und l&auml;uft davon. Oder wenn Bremer endlich (ziemlich in der
Mitte des Buches) unnachgiebig in seinen Vorgesetzten Sendig dringt, ihm die Fakten mitzuteilen
(- Oh, der Leser kann das ja so gut verstehen), wird er st&auml;ndig nur hingehalten ("Nur noch zwei
Minuten und ein paar Telefongespr&auml;che") und schlie&szlig;lich vertr&ouml;stet ("Fahren Sie dort und
dorthin. Ich treffe Sie dann da sp&auml;ter."). Schon sind ein paar weitere Szenen gerettet. Auch
eine Methode, den Spannungsbogen zu halten bzw. zu dehnen. Oder?<P>

Ich jedenfalls kam mir verschaukelt vor, knallte das Buch mitten in der Nacht auf den Tisch und
ging schlafen. Bei wirklich spannenden (aber sozusagen 'mit offenem Visier k&auml;mpfenden') B&uuml;chern
schaffe ich es kaum, sie vor dem Ende aus der Hand zu legen, was nat&uuml;rlich auch manchmal
unpraktisch sein kann. ;)<P>

Der Spannungsbogen wirkt also &uuml;berdehnt, die Vertr&ouml;stungen und Andeutungen immer unglaubw&uuml;rdiger
und man beginnt schon einiges zu erraten, von dem, was zum Schlu&szlig; mit einer gro&szlig;en Detonation
als Finale pr&auml;sentiert werden soll, so da&szlig; genau dort die beabsichtigte Wirkung (eigentlich
unn&ouml;tig) abgeschw&auml;cht wird.<P>

Viel bildhafter, eindringlich beschriebener Horror und einige grausam zugerichtete Leichen hier
und da k&ouml;nnen aber nicht dar&uuml;ber hinwegt&auml;uschen, da&szlig; eigentlich die Substanz der Story nur d&uuml;nn
ist. - Nicht zu d&uuml;nn, um einen guten Roman zu tragen, aber doch zu wenig, um diese L&auml;nge
&uuml;berzeugend zu f&uuml;llen. Meiner Meinung nach w&auml;re mindestens ein Drittel des Umfangs, ohne etwas
Wesentliches zu entfernen, problemlos wegla&szlig;bar gewesen.<P>

Ein Schwachpunkt ist weiterhin der st&auml;ndige Wechsel der Szenen, also im Grunde der vom Leser
`begleiteten` Figuren. Zuerst im wesentlichen auf Mark und Bremer beschr&auml;nkt, kommen sp&auml;ter im
Verlauf der Handlung, eine Menge weiterer hinzu, die es meist nicht lange
machen.<P>

An den Schriftsteller stellt dies sicher hohe Anforderungen in Hinsicht der Koordination des
Ganzen und an seine Umstellungsf&auml;higkeit, aber dies gilt auch ebenso
f&uuml;r den Leser.<P>

Nicht, da&szlig; man nicht mehr folgen k&ouml;nnte, aber zu oft ist es einfach nervig, wenn die
Handlungsstr&auml;nge zerrissen werden und an einem anderen Ende weitergemacht wird. Es st&ouml;rt einfach
die Straffheit der Erz&auml;hlweise und dient vielleicht doch zu sehr dem Aufbl&auml;hen des Umfangs.
Weniger w&auml;re hier mehr gewesen.<P>

Wobei auch auff&auml;llt, da&szlig; Hohlbein zum Schlu&szlig; nicht mehr aus der Sicht von Mark berichtet,
sondern auf andere Alternativen ausweicht, obwohl gerade hier diese am Interessantesten zu
werden versprach. Zum Schlu&szlig; bleiben, neben dem absichtlich etwas offenen Ende, auch Fragen zur
Handlung offen, die nicht befriedigend oder &uuml;berhaupt nicht gekl&auml;rt wurden. (Wie wurde seine
Mutter wirklich verr&uuml;ckt? War seine Freundin am Schlu&szlig; nun real oder nicht? usw.) Dabei gehe ich
gar nicht auf die Glaubhaftig-oder Vorstellbarkeit ein, denn diesen Aspekt des fantastischen
Romans zu akzeptieren, mu&szlig; und wird man schon vor dem Lesen bereit
sein.<P>

Alles in allem kein schlechtes Buch, das sogar wirklich gut h&auml;tte werden k&ouml;nnen. Solide erz&auml;hlt,
aber auf, f&uuml;r diesen Umfang, zu wackliger Grundlage, wurde die Spannung &uuml;berbeansprucht, so da&szlig;
der Showdown an Wirkung verliert, ja mich sogar entt&auml;uschte.<P>

Meine sehr pers&ouml;nliche Wertung: `Note 3`.<P>

<CENTER>
<B>&quot;AZRAEL&quot; von Wolfgang Hohlbein</B><BR>
Wilhelm Heyne Verlag, Best.Nr. 01/9882<BR>
2. Auflage 1996 - 14,90 DM - 496 Seiten<BR>
</CENTER>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../AmZ0697/media.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../MMX/GF_SH.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</FONT></A></TD></TR></TABLE>
</BODY>
</HTML>

