<HTML><HEAD><TITLE>AmZeiger 06/97 - Schauerhauer</TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif"><CENTER>
<H1><U>Schauerhauer</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrandes.berlinet.de">Gregor Franz</A><P></CENTER>
Langsam schlurfte er vorw&auml;rts.
 Die Schritte hinter ihm, auf dem feuchten Strassenasphalt
wurden schneller, so da&szlig; auch er seinen Gang beschleunigte.
Ohne sich umzudrehen schlug er, nun schon fast im Rennen,
seinen Kragen hoch. Die n&auml;chtliche Dunkelheit schien sich
zwischen die menschenleeren H&auml;userschluchten zu ducken,
w&auml;hrend um ihn knisterndes Laub herumwirbelte.<P>
 Jetzt konnte er sich doch nicht mehr halten und warf einen
kurzen Blick zur&uuml;ck. Nur noch ein paar Meter hinter ihm
folgte eine d&uuml;stere Gestalt seinem Schatten.<P>
 Sie war in einen wallenden Mantel geh&uuml;llt, der sich kaum vom
dunklen Hintergrund abhob. Das Gesicht des Mannes war nicht
zu erkennen, zumindest schrieb er die funkelnden und hervor-
stehenden spitzen Eckz&auml;hne seiner Einbildungskraft zu.<P>
 Trotzdem war ihm nicht geheuer, denn diese Person verfolgte
ihn, Marc Narston, nun schon, seitdem er die kleine Eckspelunke
am Polson-Square verlassen hatte.<P>
 Schnell rannte er um die Ecke eines der H&auml;user, da&szlig; sich mit
seiner schmutziggrauen Fassade und seinen zugehangenen, tr&uuml;ben
Fenstern in nichts von den anderen unterschied.<P>
 Doch hier ging es nicht mehr weiter, vor ihm ragte ein Wand
steil in die H&ouml;he. Nach einem kurzen, suchenden Blick erkannte
Marc sofort, da&szlig; ihm kein anderer, als der R&uuml;ckweg offen stand.<P>
 Schaudernd wandte er sich um, denn langsam beschlich ihn doch
ein irgendwie ungutes Gef&uuml;hl. Tats&auml;chlich hatten die Schritte
f&uuml;r einen Moment aufgeh&ouml;rt. Aufmerksam starrte er in die Tor-
einfahrt, aber niemand zeigte sich.<P>
 Vorsichtig begann er durchzuatmen, als sich mit einem Schaben
eine Gestalt vor die schwach leuchtenden Stra&szlig;enfunzeln schob.
"Wer sind sie und was wollen sie von mir ?", stie&szlig; er unge-
wollt etwas aufgeregt hervor.<P>
 Und gleichzeitig einen z&auml;hen No-Name-Kaugummi, an dem er sich
auch prompt verschluckte. Pl&ouml;tzlich begann er zu keuchen und
zu r&ouml;cheln, bis sich Marc schlie&szlig;lich im feuchten Dreck der
Stra&szlig;e wand.<P>
 Die Gestalt begann auf ihn zuzust&uuml;rzen und fa&szlig;te ihn am Arm,
was Narstons Gem&uuml;tszustand nicht eben verbesserte.<P>
 "Heh, hab ich sie erschreckt ?", fragte er mit freundlicher
Stimme, "Haben sie etwa einen billigen Billig-Bubble-Gum
gebabbelt? Wie sie sehen ist das ungesund in Stre&szlig;-
situationen!"<P>
 "Wmblgrf?", w&uuml;rgte Marc Narston mit hervorquellenden Augen.
"Ja, wenn ich sie als Vertreter von FriendBlend-Gums vorher
erreicht h&auml;tte, w&auml;re da&szlig; vielleicht nicht passiert. Aber
so..."<P>
 Betr&uuml;bt wandte sich der freundliche Vertreter von der
erstarrenden Leiche ab, um seine Z&auml;hne zu blecken. "Nun ja,
damit`s nicht ganz umsonst war", sagte er, w&auml;hrend er Marc`s
Hals freimachte, "schlie&szlig;lich kriege ich diesmal keine
Provision!"<P>
 Dann waren schmatzende Ger&auml;usche zu h&ouml;ren.
In einer einsamen Gasse, in einer verlassenen Stadt.<P>
<HR WIDTH=30%><P><CENTER><FONT SIZE=2>
(Im November 93 w&auml;hrend einer langweiligen Informatikstunde
unmotiviert in die Tasten eines alten Macintosh eingedroschen
und jetzt im Nov. 94 aus Daffke schnell auf meinem Amiga
abgetippert.)<BR>&copy; Gregor Franz</FONT></CENTER>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN =LEFT><A HREF="../MMX/BK_WH1.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../AmZ0697/wanted.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</FONT></A></TD></TR></TABLE>
</BODY></HTML>
