<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Willkommen zur Coder's Corner!</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Willkommen zur Coder's Corner!</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Die Coder's Corner...
</P><P>F&uuml;r den Redakteur der Coder's Corner, <B>Carsten Jahn</B>, habe ich f&uuml;r diese
Ausgabe die Vertretung &uuml;bernommen, da er aus aktuellen Gr&uuml;nden (Studium)
verhindert war. Viel Gl&uuml;ck f&uuml;r die Pr&uuml;fungen, Carsten, bzw. gute Erholung
nach dem Streﬂ! (...auf das Du das n&auml;chste Mal hier wieder das Zepter
schwingst!)</P><P>
Trotzdem gibt es ein kurzweilig kommentiertes <a href="9812lot.htm">C-Listing</a> von Carsten,
das sich dem Thema <B>Lottozahlen</B> widmet. Ob man dann bessere Chancen auf
einen Sechser hat? Bei Miﬂerfolgen wenden Sie sich bitte an unseren
Programmautor!
</P><P>
Mit dem n&auml;chsten Teil des <a href="9812bb.htm">BlitzBasic-Kurses</a> k&ouml;nnen Sie weiter in die
programmiertechnischen Abgr&uuml;nde dieses leistungsf&auml;higen Basic-Dialektes
eintauchen. Z.B. wurde mit ihm (neben Worms) auch der &uuml;berwiegende Teil
des Spiels <a href="../sw/9812foun.htm">Foundation</a> (Test in dieser Ausgabe) geschrieben oder das
Anwenderprogramm <a href="../sw/9809geo.htm">GeoWorld</a> (Test u.a. in der letzten Ausgabe). Aber ich
schweife schon wieder ab - diese Einf&uuml;hrung bekomme ich schon voll, das
w&auml;re doch gelacht! ;)
</P><P>
Die im letzten AmZeiger eingef&uuml;hrte <a href="9812pb.htm">Projektb&ouml;rse</a> harrt weiterer
Eintr&auml;ge. Wer talentiert ist und weitere Talente, F&ouml;rderer oder
Produzenten sucht (bzw. umgekehrt) ist hier genau richtig, denn
&uuml;ber dieses Forum k&ouml;nnen Kontakte angebahnt werden.
</P><P>
Vorschl&auml;ge, Kritik, Tips, Listings, Geld? Bitte alles an Carsten Jahn:
<A HREF="mailto:c.jahn@gmx.de">C.Jahn@gmx.de</A> (Heute ist wieder mein groﬂz&uuml;giger Tag! ;) Ich verzieh
mich jedenfalls erst einmal wieder in meine angestammten Bereiche...
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../hw/9812a2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812pb.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
