<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses6.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses8.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>7. Amiga-OS3.1-Upgrade f&uuml;rs CDTV angek&uuml;ndigt</H3>
<P>
&raquo;PRESSE-MITTEILUNG: 15. Dezember 1998
</P>
<P>
Amiga of Minnesota Interest Groups Alliance (A.M.I.G.A.)
</P>
<P>
freut sich ank&uuml;ndigen zu k&ouml;nnen, dass die Entwicklung des Projekts zur
Aufr&uuml;stung von CDTV den Status der Freigabe erreicht hat. Die bisherigen
Tests zeigten, dass CDTV unter OS 3.1 richtig arbeitet, wenn die neuen
PROM-Chips eingebaut sind, und dass das eingebaute CD-Laufwerk einwandfrei
l&auml;uft. F&uuml;r die Aufr&uuml;stung ist es notwendig, dass das ROM-Chip f&uuml;r OS 3.1
eingebaut wird und dass die beiden internen PROMs, die f&uuml;r den Betrieb des
CDTV zust&auml;ndig sind, ausgetauscht werden.
</P>
<P>
Das 3.1-ROM ist das gleiche Bauteil, dass im A500 oder A2000 verwendet
wird. Die beiden PROMs k&ouml;nnen wegen der Lizenzvereinbarung mit Amiga Int.
nur &uuml;ber A.M.I.G.A. bezogen werden.
</P>
<P>
Die Test werden fortgef&uuml;hrt, aber bis jetzt steht fest, dass der CDTV von
einem 880-KByte-Laufwerk, in dem die 3.1-Workbench-Diskette liegt, gebootet
werden kann und sich genauso wie ein A500/2000 verh&auml;lt, au&szlig;er dass er ein
voll funktionsf&auml;higes CD-Laufwerk und einen S-VHS-Ausgang hat. Damit ist
der CDTV zur Zeit das einzige von CBM entwickelte Ger&auml;t mit einem
Videoausgang dieser hohen Qualit&auml;t.
</P>
<P>
Er bootet auch mit den CD-ROMS aus der Fred-Fish-Sammlung, die von
Hypermedia Concepts herausgegeben worden sind, zu einer 1.3.1-Workbench mit
aktivem Diskettenlaufwerk. ABER sobald man den Auswurfknopf f&uuml;r die CD
bet&auml;tigt, wird ein Reset ausgel&ouml;st.
</P>
<P>
Wenn Sie Zugang zu eMail haben, fordern Sie Informationen an von
&lt;<A HREF="mailto:thedoctor@wavetech.net">thedoctor@wavetech.net</A>&gt;, worauf Sie ein eMail-Bestellformular erhalten
werden. Bitte tragen Sie als Betreff &quot;CDTV UPGRADE PROJECT&quot; ein.
</P>
<P>
Wenn Sie die normale (Schnecken-) Post benutzen m&uuml;ssen, schreiben Sie an:
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">A.M.I.G.A.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">c/o Ben Deemer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">14501 Sunfish Lake Blvd&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Ramsey, MN.&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">U.S.A.&nbsp;</TD><TD VALIGN="TOP">55303-4578&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Sie erhalten ein Bestellformular per Post, die Kosten erh&ouml;hen sich dadurch
um $0.35.
</P>
<P>
Dies ist ein &quot;nicht-profitables&quot; Vorhaben einer User-Gruppe und die Lizenz
ist auf dieses Projekt beschr&auml;nkt. Deshalb ist die VORAUSZAHLUNG f&uuml;r die
PROMs der Aufr&uuml;stung notwendig. Durch Sondervereinbarung wird ein Discount
auf das 3.1-ROM gew&auml;hrt, wenn es gleichzeitig bestellt wird. Folgende
Preise sind g&uuml;ltig:
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">CDTV-PROM-Satz mit Beschreibung $23 US.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">OS-3.1-ROM, falls mit PROMs bestellt $30 US.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Der Versand erfolgt mit &quot;US Postal Priority System&quot; in 2 - 3 Tagen.
Postgeb&uuml;hren sind wie folgt:
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">US&nbsp;</TD><TD VALIGN="TOP">- $3.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Kanada, Mexico, West-Europa, Mittlerer Osten&nbsp;</TD><TD VALIGN="TOP">- $3.75&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Pazifik-Randstaaten, S&uuml;d-Amerika&nbsp;</TD><TD VALIGN="TOP">- $4.95&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die Auftr&auml;ge werden nur bearbeitet, wenn der AUFTRAGSVORDRUCK mit den
erforderlichen Informationen und der Unterschrift ZUR&Uuml;CKGESANDT WURDE und
wenn die ZAHLUNG IN US-W&Auml;HRUNG (keine pers&ouml;nlichen oder Firmenschecks)
EINGEGANGEN IST.
</P>
<P>
Dieser Aufr&uuml;stsatz von 2 PROMs ist von anderer Stelle nicht erh&auml;ltlich und
ist nur solange lieferbar, wie der Bestand an Teilen, die inzwischen nicht
mehr gefertigt werden, ausreicht. Das 3.1-ROM ist ein Sonderangebot und
wird von A.M.I.G.A nur an Upgrade-Besteller abgegeben.
</P>
<P>
thedoctor (nicht Mediziner) Ben Deemer&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
