<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>PowerUp-to-date</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerUp1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="PowerUp.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="PowerUp3.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
PowerUp-to-date
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Status des G3-Projekts von ESCENA</H3>
<P>
&raquo;Braunschweig, den 22. Dezember 1998
</P>
<P>
Status des G3-Projekts!
</P>
<P>
Aus Zeitgr&uuml;nden hatten wir zur Messe zun&auml;chst ein vereinfachtes
Speicherinterface implementiert und auf den, f&uuml;r den Test-
/Demonstrationsbetrieb nicht notwendigen, Master-Modus des Zorro-III
verzichtet. Da das Board nicht rechtzeitig zur Messe produziert werden
konnte, haben wir nun den vollst&auml;ndigen Memory-Kontroller implementiert.
</P>
<P>
Urspr&uuml;nglich war diese Implementierung erst vorgesehen, wenn das Testboard
l&auml;uft und mit der Serienproduktion begonnen wird. Dabei sind wir auf ein
paar Probleme gesto&szlig;en, die wir zun&auml;chst l&ouml;sen mu&szlig;ten, die uns nun aber
sp&auml;ter nicht mehr aufhalten werden.
</P>
<P>
M&ouml;glich geworden ist uns das Vorziehen auch deshalb, weil wir in die Lage
versetzt wurden, eine SUN UltraSPARC zu nutzen, die deutlich gr&ouml;&szlig;ere
Ressourcen f&uuml;r die Verilog-Simulationen bietet, als der bisher genutzte PC.
Allerdings k&ouml;nnen die Platinen aufgrund der Weihnachtstage und des
Jahresanfangs erst im Januar produziert werden.
</P>
<P>
Zusammenfassend sind wir leicht im Zeitplan hinterher (wenn auch nicht so
stark, wie man aufgrund der sp&auml;ten Fertigung der Prototypen schlie&szlig;en
k&ouml;nnte). Daher bitten wir um Ihr Verst&auml;ndnis, zumal es sich insbesondere
beim Speicherinterface um eine technisch sehr anspruchsvolle L&ouml;sung
handelt. Unser Ziel bleibt aber weiterhin, gegen Ende des 1. Quartals die
Boards ausliefern zu k&ouml;nnen.&laquo;
</P>
<P>
(Quelle: ESCENA)
</P>
<P ALIGN="RIGHT">
<A HREF="PowerUp1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="PowerUp3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
