<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P>
Hi!
</P>
<P>
Es ist vollbracht! Ihr haltet den AMIGA aktuell Spieleteil Januar 1999 vor
Euren Augen. Diesen Monat wurde eine Entscheidung gef&auml;llt, die
m&ouml;glicherweise sehr sehr wichtig f&uuml;r die Existenz des Amiga Spielemarktes
ist: Village Tronic produziert das 3DFX VoodooI Zusatzmodul f&uuml;r die
PicassoIV. Mit diesem Modul wird es unglaubliche neue M&ouml;glichkeiten der
Spieleentwicklung geben. PC Umsetzungen werden keine gr&ouml;&szlig;eren Probleme mehr
darstellen. Dies ist sicherlich der gr&ouml;&szlig;te Schritt in Richtung Zukunft seit
der Einf&uuml;hrung der PowerPC Karten.
</P>
<P>
Das gr&ouml;&szlig;te Problem des Amiga Spielemarktes ist leider immer noch die
Raubkopiererei. Auch wenn es viele nicht wahrhaben k&ouml;nnen oder wollen: Es
gibt noch gen&uuml;gend Amiga User, die meisten allerdings raubkopieren einfach
nur. Dies wird besonders deutlich aus dem IRC Interview mit Titan Computer:
Es wurden in Italien 19 Exemplare von The Shadow of the 3rd Moon verkauft,
es kamen aber &uuml;ber 100 Anfragen von Shadow of the 3rd Moon Benutzern. So
k a n n  der Spielemarkt nicht &uuml;berleben. Viele werden sich z.B. fragen,
warum Titan Computer jetzt erst Siedler II umsetzt und nicht gleich den 3.
Teil des Spiels. Die Antwort liegt auf der Hand: Siedler III ist ein extrem
teures Spiel, dies w&auml;re ein viel zu hohes Risiko f&uuml;r Titan Computer. So hat
man erstmal die Lizenz f&uuml;r Siedler II erworben, um zu testen, wieviele
Exemplare davon verkauft werden. Wenn keiner das Spiel mehr raubkopiert,
w&auml;ren das mehr als genug und wir k&ouml;nnten getrost eine Umsetzung von Siedler
III erwarten. Ich m&ouml;chte also hiermit dazu aufrufen: Kauft Euch Spiele die
Euch interessieren! Nur so kann der Amiga diese schwere Zeit &uuml;berstehen.
Wenn jeder einen kleinen Teil, dazu beitr&auml;gt, ist es &uuml;berhaupt kein
Problem. Es verlangt keiner, dass Ihr Euch mit Spielen einh&auml;uft. Aber ein
Spiel im Monat, tut keinem weh. So, dass musste einmal gesagt werden. Den
Anstoss zu diesem Thema bekam ich bei der IRC Konferenz mit Titan Computer.
Es kann einfach nicht angehen, dass sich so ein Hit wie Shadow of the 3rd
Moon so schlecht verkauft. F&uuml;r Anregungen, Meinungen, Kritik zu diesem
Thema bin ich immer offen.
</P>
<P>
Lesercharts gibt es leider nicht mehr in dem Spieleteil. Insgesamt haben
nur drei Leute mir ihre Top 10 geschickt, es ist also klar entschieden,
Lesercharts sind nicht mehr von gro&szlig;en Interesse. Den drei Leuten trotzdem
danke f&uuml;rs Einsenden. Ich werde mich aber bem&uuml;hen, einige Verkaufscharts in
den Spieleteil zu bringen.
</P>
<P>
Nachdem ich zum letzten Spieleteil, bis auf eine Ausnahme, nur positive
Kritik bekam, habe ich mich entschlossen, im Gro&szlig;en und Ganzen alles beim
Alten zu belassen. Ein paar kleine &Auml;nderungen gibt es zwar in der Emulator-
sowie Neues aus dem Aminet Rubrik, sonst ist aber alles wie gewohnt.
Allerdings habe ich das letzte Mal vergessen, mein System mit anzugeben,
das m&ouml;chte hiermit nachholen: Getestet wird auf einem A1200 mit Blizzard
1240 40mhz, AGA, 16MB FastRam, 2MB ChipRam und 8x CD-ROM.
</P>
<P>
Bleibt mir also nur noch zu sagen, was Ihr in dieser Ausgabe lesen k&ouml;nnt:
Ein ausf&uuml;hrliches Review zur neuen Beat em Up Referenz OloFight, ein
Preview zu MaxRally und nat&uuml;rlich das neueste an Spiele- und Emulator News.
</P>
<P>
Okay, soweit sogut. Jetzt viel Spa&szlig; mit dieser Ausgabe!
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
