<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Blittersoft will FUBAR ver&ouml;ffentlichten
</LI>
</UL>
<P>
Blittersoft hat FUBAR, welches von Q-Software entwickelt wird, unter Lizenz
genommen. Die Kriegssimulation FUBAR k&ouml;nnte den Features nach ein Megahit
werden, denn laut den Entwicklernkann man es mit bis zu 16 Spielern
spielen, Computer oder Menschen. Auch soll Spielen &uuml;ber Internet m&ouml;glich
sein. Durch den modularen Aufbau kann man ganz einfach seine eigenen
Levels, Grafiken usw. einbauen. Au&szlig;erdem gibt es FMV Sequenzen sowie Audio
Tracks von einer englischen Band. Das Spiel ben&ouml;tigt AGA, mindestens einen
030 Prozessor, 20MB freien Festplattenplatz, viel Fast Ram. AHI und PPC
werden selbstverst&auml;ndlich unterst&uuml;tzt.
</P>
<UL>
<LI> clickBOOM l&auml;sst w&uuml;nschen
</LI>
</UL>
<P>
Der bekannte Publisher clickBOOM sucht mal wieder ein Spiel zum Umsetzen
auf den Amiga. Zur Auswahl stehen auch Spiele wie z.B. Unreal (!!). Man
darf also gespannt sein welches Spiel demn&auml;chst von clickBOOM umgesetzt
wird.
</P>
<UL>
<LI> Marble Eyes sucht Programmierer
</LI>
</UL>
<P>
F&uuml;r das TCP/IP Addon zu Genetic Species sucht Marble Eyes einen in
Netzprogrammierung erfahrenen Programmierer. Interessierte k&ouml;nnen sich bei
Martin Halberg &lt;<A HREF="mailto:fuzzy@marble-eyes.dk">fuzzy@marble-eyes.dk</A>&gt; melden.
</P>
<UL>
<LI> Moonbases Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Im Aminet gibt es die endg&uuml;ltige Demoversion von Moonbases. Laut Verkosoft
soll das Spiel schon sehr bald erscheinen. Die Demoversion liegt in zwei
Version vor: Eine AGA und eine RTG (Grafikkarten) Version. Allerdings sieht
die Grafik des Spiels nicht sehr beeindruckend aus. Hier kann nur auf
Nachbesserung gehofft werden.
</P>
<UL>
<LI> Max Rally Demoversion ver&ouml;ffentlicht
</LI>
</UL>
<P>
Eine Demoversion des Draufsicht Racers Max Rally wurde von Fortress
Software ver&ouml;ffentlicht. Eine Preview k&ouml;nnt ihr in dieser Ausgabe lesen.
</P>
<UL>
<LI> Blittersoft sucht Mitarbeiter
</LI>
</UL>
<P>
Blittersoft, die gerade erst in den Amiga Spielemarkt eingestiegen sind,
suchen Mitarbeiter zur Umsetzung von PC-Spielen. Insbesondere werden
gesucht Grafiker, C Programmierer, 3D Grafik- und AI Programmierer.
Interessierte k&ouml;nnen sich an <A HREF="mailto:programmer@blittersoft.com">programmer@blittersoft.com</A> wenden.
</P>
<UL>
<LI> Napalm wurde fertiggestellt
</LI>
</UL>
<P>
Der geniale Command&amp;Conquer Clone Napalm wurde Anfang Dezember
fertiggestellt und wird wohl die n&auml;chsten Tage erscheinen. Es gibt also in
der n&auml;chsten AMIGA aktuell h&ouml;chstwahrscheinlich einen Test des Spiels.
</P>
<UL>
<LI> Neues Adventure: The Last Seal
</LI>
</UL>
<P>
The Last Seal von ANCOR wird ein Action-Adventure im Stil von Lucas Arts
mit einigen extra Nettigkeiten wie z.B. 5 verschiedene Sichtwinkel,
Raytracing Animationen und Sprachausgabe. Die Hintergr&uuml;nde wurden allesamt
mit dem Raytracer erstellt. The Last Seal ben&ouml;tigt AGA, mindestens einen
030er und 16MB Ram.
</P>
<UL>
<LI> Digital Visionaries sucht weitere Mitarbeiter
</LI>
</UL>
<P>
F&uuml;r das Spiel The Holy Trinity brauchen Digital Visionaries noch mehr
Mitarbeiter. Momentan sucht man je zwei 3D Grafiker und Programmierer.
Au&szlig;erdem wird noch ein Musiker gesucht. Interessierte melden sich bei
Michael Pittaro &lt;<A HREF="mailto:totallyamiga@yahoo.com">totallyamiga@yahoo.com</A>&gt;.
</P>
<UL>
<LI> Explorer 2260 erscheint im 3. Quartal 1999
</LI>
</UL>
<P>
The World Foundry hat bekanntgegeben, dass Explorer 2260 weiterentwickelt
wird. Bei dem Spiel handelt es sich um ein 3D Handel/Simulation Spiel.
</P>
<UL>
<LI> The Real Ologram gestaltet Homepage neu
</LI>
</UL>
<P>
Die Homepage der OloFight Entwickler The Real Ologram
(<A HREF="http://www.ologram.com" TARGET="_TOP">http://www.ologram.com</A>) wird momentan general&uuml;berholt. Wenn ihr dies lest,
wird sie aber wahrscheinlich wieder abrufbar sein. Also schaut mal vorbei!
</P>
<UL>
<LI> DeepCore Entertainment News
</LI>
</UL>
<P>
<A HREF="img/wildtracks.png"><IMG SRC="thumb/wildtracks.jpg" WIDTH="120" HEIGHT="87" ALT="Screenshot" ALIGN="LEFT" BORDER="0"></A>
Bei DeepCore Entertainment hat man`s anscheinend gro&szlig; vor, denn hier
arbeitet man an WildTracks, was laut eigenen Angaben besser (!!) als Need
for Speed 3 werden soll. Das Spiel soll f&uuml;r 68k und nat&uuml;rlich PPC
erscheinen. Auch wenn das Spiel schon auf einem 68030 mit 50mhz l&auml;uft, so
soll es zum Vergn&uuml;gen erst auf einem 060er mit Grafikkarte werden. Dort
k&ouml;nnte man dann um die 25fps erwarten. Bei der PPC Version sehen die
Anforderungen dann schon etwas h&ouml;her aus: 603e/200mhz, 32MB Ram, 8x CD-ROM
m&uuml;ssen schon da sein. Permedia2 soll ebenfalls unterst&uuml;tzt werden. Ein Demo
soll um Weihnachten ver&ouml;ffentlicht werden. Au&szlig;erdem arbeitet man noch an
einem Pinball Spiel namens Pinball Pro. Es soll ein stark erweitertes
Pinball Dreams werden. &Uuml;brigens: Das im letzten Jahr angek&uuml;ndigte Total
Construction 3D wird nicht mehr erscheinen.
</P>
<UL>
<LI> Digital Images News
</LI>
</UL>
<P>
In einer IRC Konferenz hat Digital Images best&auml;tigt, dass sie den
kompletten Quelltext sowie alle dazugeh&ouml;rigen Dateien von WipeOut2097
bekommen haben. Das Digital Images Team besteht aus 21 (!!) Leuten, davon
arbeiten drei an der WipeOut2097 Umsetzung. Unter anderem soll auch der
ADoom Programmierer f&uuml;r Digital Images arbeiten. WipeOut2097 wird nur f&uuml;r
PPC erscheinen.
</P>
<P>
AGA und Grafikkarte werden unterst&uuml;tzt. Man steht auch mit Haage &amp; Partner
in Kontakt. Es wird also h&ouml;chstwahrscheinlich Warp3D unterst&uuml;tzen. Eine
Demo soll Anfang 1999 ver&ouml;ffentlicht werden.
</P>
<P>
Man will noch einige Extras einbauen, die es weder in der PC- noch in der
PSX Version gab. Au&szlig;erdem arbeitet man bei Digital Images noch am
umstrittenen Space Station 3000, einem 3D Fussballspiel und einem Tekken
Clone.
</P>
<UL>
<LI> Musiker gesucht
</LI>
</UL>
<P>
Blueblack Solution, die Entwickler von Operation: Counterstrike, dem neuen
Echtzeit Strategie Spiel im Stil von Dune2000 &amp; Alarmstufe Rot, suchen
einen Musiker, f&uuml;r Hintergrundmusik und Soundeffekte. Interessierte d&uuml;rfen
emailen an: <A HREF="mailto:music@thesnakepit.demon.co.uk.">music@thesnakepit.demon.co.uk.</A>
</P>
<UL>
<LI> Psygnosis meldet sich
</LI>
</UL>
<P>
Offenbar hat Psygnosis Interesse f&uuml;r die n&auml;chste Amiga Generation Spiele zu
produzieren. Dies geht aus dem Log der Digital Images IRC Konferenz hervor.
</P>
<UL>
<LI> Titan Computer IRC Konferenz - Bald auch Siedler III?
</LI>
</UL>
<P>
Auch mit Titan Computer wurde im Dezember eine IRC Konferenz gef&uuml;hrt.
Anwesend waren der Gr&uuml;nder Michael Garlich, der Claws of the Devil
Programmierer Alex Deising sowie Michael Siegel, der Siedler II
Programmierer. Titan stellte klar, dass Claws of the Devil auf der Computer
`98 nur auf einem 68060er lief. PPC User k&ouml;nnen also beruhigt sein. Mit
Siedler II will Titan Computer einen Test starten, ob sich aufwendige
Spieleproduktionen am Amiga noch lohnen. Sollte sich das Spiel gut
verkaufen, steht einer Siedler III Umsetzung nichts mehr im Wege. Zugleich
machte man deutlich, dass es dem Amiga nicht an Usern mangele, sondern an
potentiellen K&auml;ufern. Dies verdeutlichte Michael Garlich durch die
Situation in Italien: Man verkaufte 19 (!!) Shadow of the 3rd Moon
Exemplare, bekam aber &uuml;ber 100 Mitteilungen von Shadow of the 3rd Moon
'Benutzern'. Trotzdem arbeitet man an Shadow of the 3rd Moon 2. Au&szlig;erdem
plant Titan weitere Umsetzungen, vorausgesetzt es gibt gute Verkaufszahlen.
Siedler II soll Ende Februar und Claws of the Devil Ende M&auml;rz
ver&ouml;ffentlicht werden. Ob Warp3D unterst&uuml;tzt wird, ist noch unklar.
</P>
<UL>
<LI> Warp3D Version von ADescent erschienen
</LI>
</UL>
<P>
Wie angek&uuml;ndigt ist mit dem erscheinen von Warp3D auch eine Warp3D
unterst&uuml;tzende Version von ADescent ver&ouml;ffentlicht worden. Die stark
optimierte Version soll bedeutend schneller als die normale ADescent
Version sein. Im Aminet gibt`s ADescent Warp3D unter
game/shoot/ADescent0x0-08.lha, ca. 315kb.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
