<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Tests.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Update: So senkt ihr eure Telekom-Rechnung!</H3>
<P>
Das Jahr 1999 beginnt &auml;hnlich schwungvoll wie 1998. Damals str&ouml;mten mit der
Aufhebung des Telekommunikations-Monopols im Festnetz zahlreiche neue
Anbieter auf den Markt, die der Deutschen Telekom laut einer Erhebung der
Regulierungsbeh&ouml;rde binnen eines Jahres etwa ein Drittel der
Ferngespr&auml;chsminuten abnahmen.
</P>
<P>
Das ist ohne Zweifel der Hauptgrund, warum der Telekommunikations-Riese
seine Preise im Ferngespr&auml;chsbereich zum Jahreswechsel 98/99 drastisch
gesenkt hat.
</P>
<P>
Wer gedacht hat, dass die Konkurrenten diesem Schritt teilnahmslos
zuschauen w&uuml;rden, hat sich get&auml;uscht: Die Deutsche Telekom wird nach wie
vor von nahezu allen anderen bekannten Ferngespr&auml;chs-Anbietern unterboten.
</P>
<P>
F&uuml;r Aufsehen hat gleich in dreifacher Hinsicht die bekannte
Telekommunikationsgesellschaft Mobilcom gesorgt:
</P>
<UL>
<LI> Mitte Dezember hat das Unternehmen einen Internet-Pauschaltarif
  angek&uuml;ndigt: F&uuml;r 77 Mark (umgerechnet etwa 39,50 Euro) pro Monat kann man
  werktags zwischen 19 und 7 Uhr, am Wochenende sogar den ganzen Tag &uuml;ber,
  beliebig lang und so oft man will im Internet surfen - ohne weitere
  Zugangskosten, wie etwa Telefongeb&uuml;hren! Das Angebot gilt ab sofort. Eine
  Anmeldung ist auf der WWW-Homepage <A HREF="http://www.tomorrowleser.de" TARGET="_TOP">http://www.tomorrowleser.de</A> m&ouml;glich.
</LI>
<LI> Kurz vor Weihnachten hat Mobilcom bekannt gegeben, dass am 25. und 26.
  Dezember von 19 bis 24 Uhr Ferngespr&auml;che innerhalb Deutschlands
  kostenlos(!) sind.
<P>
  Es war zwar schwer, eine freie Leitung zu bekommen, aber l&auml;ngst nicht
  unm&ouml;glich, wenn man etwas Geduld bewies. Insbesondere zu
  fortgeschrittener Stunde klappte es manchmal gleich beim ersten Versuch!
</P>
</LI>
<LI> Zu Weihnachten platzte Mobilcom mit der Nachricht heraus, dass ab 1.
  Januar 1999 Verbindungen innerhalb Deutschlands von 19 bis 24 Uhr, die
  weniger als 1 Minute dauern, kostenlos sind! Achtung: Dies gilt jedoch
  nur f&uuml;r Kunden, die sich auf der Mobilcom-Homepage
  (<A HREF="http://www.mobilcom.de" TARGET="_TOP">http://www.mobilcom.de</A>) daf&uuml;r anmelden!
</LI>
</UL>
<P>
Aber damit noch nicht genug: Es kursieren auch Ger&uuml;chte, dass das
Unternehmen noch dieses Jahr eine Ortsgespr&auml;ch-Pauschale einf&uuml;hren wird,
wie das in den USA seit langem &uuml;blich ist. Gegen Zahlung der monatlichen
Geb&uuml;hr w&auml;ren Ortsgespr&auml;che dann kostenlos!
</P>
<P>
Die Deutsche Telekom sieht sich nun einem massiven Druck ausgesetzt, und
Vorstandschef Ron Sommer hat verlauten lassen, dass man bereits 1999 &uuml;ber
die Telekom innerdeutsche Ferngespr&auml;che f&uuml;r 6 Pfg. pro Minute f&uuml;hren k&ouml;nnen
werde. Im Moment st&uuml;nden zwei Varianten zur Diskussion, die durchgerechnet
werden m&uuml;ssten.
</P>
<P>
Somit bleibt festzustellen, dass sich der Telekommunikationsmarkt in
Deutschland innerhalb eines einzigen Monats grundlegend gewandelt hat.
</P>
<P>
Dies hat auch Auswirkungen auf die tabellarische &Uuml;bersicht, die drastisch
zusammengefasst werden konnte:
</P>
<P>
G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestgeb&uuml;hr, etc.):
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Netz&nbsp;</TD><TD VALIGN="TOP">werktags 9-18 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">werktags 18-9 Uhr, ansonsten ganzt&auml;gig&nbsp;</TD></TR>
<TR><TD COLSPAN="4"><HR></TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Fest-&gt;Fest&nbsp;</TD><TD VALIGN="TOP">Viatel (01079), 16 Pfg.&sup1;&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">TelDaFax (01030), 9 Pfg.&sup2;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Fest-&gt;Mobil&nbsp;</TD><TD VALIGN="TOP">Viatel (01079), 73 Pfg.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Viatel (01079), 36 Pfg.&sup3;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&sup1;:&nbsp;</TD><TD VALIGN="TOP">Bei Verbindungen von bis zu etwa 1 Minute Dauer ist TelDaFax (01030) mit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">17 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&sup2;:&nbsp;</TD><TD VALIGN="TOP">Werktags zwischen 2 und 5 Uhr nachts ist die Deutsche Telekom mit 6 Pfg.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">der g&uuml;nstigste Anbieter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&sup3;:&nbsp;</TD><TD VALIGN="TOP">An Feiertagen, die nicht aufs Wochenende fallen, ist zwischen 9 und 18&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Uhr TelDaFax (01030) mit 48 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 136 Pfg.!)
</P>
<P>
Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige
Anmerkungen:
</P>
<UL>
<LI> Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.
</LI>
<LI> 'werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.
</LI>
<LI> Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
<P>
  Auf <A HREF="http://www.muc.de/~hm/telefon-tarife/tarifzonen.html" TARGET="_TOP">http://www.muc.de/~hm/telefon-tarife/tarifzonen.html</A> k&ouml;nnt ihr
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte
  es mal passieren, dass ihr &quot;f&auml;lschlicherweise&quot; einen der alternativen
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom -
  und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.
</P>
</LI>
<LI> Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen
  l&auml;sst. Mein Favorit: <A HREF="http://www.teltarif.de/db/index.html" TARGET="_TOP">http://www.teltarif.de/db/index.html</A>
</LI>
</UL>
<P>
Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise
unterschiedlich:
</P>
<UL>
<LI> TelDafax rechnet sekundengenau ab, d.h. ihr zahlt hier
  wirklich nur f&uuml;r die Zeit, die die Verbindung dauert.
</LI>
<LI> Viatel berechnet bei Verbindungen bis 30 Sekunden Dauer die gesamten 30
  Sekunden, danach wird exakt abgerechnet. ACHTUNG: An Feiertagen, die
  nicht aufs Wochenende fallen, rechnet Viatel nach dem Werktags-Tarif ab.
</LI>
</UL>
<P>
F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Tests.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
