<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Workshops / Hintergrundberichte / Buchvorstellungen</H2>
<H3>1. Workshop: Internet-Zugang &uuml;ber Planet Interkom (von J&uuml;rgen B&uuml;denbender)</H3>
<P>
&raquo;Hallo Leute,
</P>
<P>
ich habe mir mal die M&uuml;he gemacht, mich mit meinem Amiga bei der &quot;Viag
Interkom&quot; anzumelden. Und auch wenn die Dokumentation etwas lang geraten
ist, sollte man sich die Zeit nehmen und alles aufmerksam lesen, sofern man
mit Planet Interkom online gehen m&ouml;chte.
</P>
<P>
Leider gibt es keinerlei technischen Support f&uuml;r den Amiga, bei Planet
Interkom, so der Name der Internet-Abteilung.
</P>
<P>
Aus diesem Grund war es sehr aufwendig, ohne gro&szlig;es Feedback ist es immer
etwas bl&ouml;d. Und das, was ich an Nerven dabei gelassen habe, wird nie wieder
jemand gut machen k&ouml;nnen.
Aber es hat sich gelohnt.
</P>
<P>
Also, es gibt zwei M&ouml;glichkeiten, um mit &quot;Planet-Interkom&quot; online zu gehen.
Als erstes vermute ich mal, dass ihr schon irgendeinen anderen Provider
habt, da es ja sonst komisch w&auml;re, wenn ihr euch das gerade ohne Zugang
gesaugt habt.
</P>
<P>
Das erm&ouml;glicht uns, die einfache Variante zu benutzen.
</P>
<P>
(Habt ihr die Doku von der Aminet-CD-ROM, und ihr habt bislang keinen
Internet-Zugang, gibt es noch eine andere M&ouml;glichkeit. Die wird etwas
weiter unten erkl&auml;rt.
</P>
<P>
Denn man kann auch ohne einen Provider online gehen, um sich anzumelden.
</P>
<P>
Zur&uuml;ck zu Teil 1.
</P>
<P>
Zuerst solltet ihr euch unter folgender Adresse anmelden:
<A HREF="https://anmeldung.planet-interkom.de">https://anmeldung.planet-interkom.de</A>
</P>
<P>
(Die Voraussetzung daf&uuml;r ist allerdings, dass ihr euch vorher das
Starterkit der Viag per Telefon unter folgender Nummer bestellt habt: 0800
/ 10 90 000 oder 0800 / 55 222 55. Das dauert ein paar Tage, davon braucht
ihr die auf der R&uuml;ckseite angegebene Serien- und Aktivierungs-Nummer, die
CD-ROM k&ouml;nnt ihr getrost in den M&uuml;ll werfen oder euch an die Wand h&auml;ngen,
was ich getan habe.)
</P>
<P>
Das &quot;s&quot; hinter http steht &uuml;brigens f&uuml;r Sicherheit, das hei&szlig;t, dass alle
Angaben, die ihr da macht, streng gesch&uuml;tzt sind.
(So habe ich mir das auf jeden Fall erkl&auml;ren lassen.)
Ihr haltet euch einfach an die vorgegebenen Fragen und beantwortet alles,
was die Jungs so wissen wollen.
</P>
<B>Vorab:</B>
<P>
Ein kleiner Trick noch, wenn ihr im Men&uuml; seid, habt ihr die einmalige
Gelegenheit, das was in eurer E-Mail-Adresse vor dem @ steht, selbst zu
w&auml;hlen.
</P>
<P>
Zum Beispiel &quot;Zorro&quot;, &quot;Amiga&quot;, &quot;Arschnase&quot;, oder sonst was.
Nach erfolgter Anmeldung ist das nicht mehr m&ouml;glich.
</P>
<P>
Das habe ich leider verpennt (es gibt halt doch ein paar Sachen, die findet
man erst dann raus, wenn es zu sp&auml;t ist), doch das wollte ich euch nicht
vorenthalten, ist doch ganz sch&ouml;n.
</P>
<P>
Wie auch sonst bei Passw&ouml;rtern, solltet ihr euch vor der Anmeldung eins
&uuml;berlegen und am besten erst mal aufschreiben.
</P>
<P>
Der Einfachheit halber gebe ich im weiteren Verlauf des Textes das
unmissverst&auml;ndliche Wort &quot;Eierfeile&quot; als Passwort an.
</P>
<P>
Wenn die Anmeldung geschafft ist (ist doch gar nicht so schwer), geht es
wie folgt weiter:
</P>
<P>
&quot;Miami&quot; &ouml;ffnen, PPP anw&auml;hlen.
</P>
<P>
<A HREF="img/PlanetInterkom01.png"><IMG SRC="thumb/PlanetInterkom01.jpg" WIDTH="120" HEIGHT="67" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Bei &quot;Username&quot; gebt ihr eure vollst&auml;ndige E-Mail-Adresse ein, in der Regel
<A HREF="mailto:Vorname.Nachname@planet-interkom.de">Vorname.Nachname@planet-interkom.de</A> .
</P>
<P>
(Es sei denn, ihr habt den ersten Teil eurer E-Mail-Adresse selbst
ge&auml;ndert, dann lautet er z.B.: <A HREF="mailto:Arschnase@planet-interkom.de">Arschnase@planet-interkom.de</A> , klar, oder?)
Bei &quot;Passwort&quot; gebt ihr dasselbe Wort ein, wie auch in eurer Anmeldung, in
unserem speziellen Fall &quot;Eierfeile&quot;.
</P>
<P>
Bei PAP/CHAP auf keinen Fall &quot;Wie im W&auml;hlmodul&quot; anklicken, da das W&auml;hlmodul
anders eingestellt ist, und zwar so:
</P>
<P>
W&auml;hlmodul anw&auml;hlen.
</P>
<P>
<A HREF="img/PlanetInterkom02.png"><IMG SRC="thumb/PlanetInterkom02.jpg" WIDTH="120" HEIGHT="68" ALT="Screenshot"  BORDER="0"></A>
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Telefonnummer zur Einwahl lautet: 01090 019 17 00&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&quot;Login ID&quot;: Vorname.Nachname&nbsp;</TD><TD VALIGN="TOP">(oder aber &quot;Arschnase&quot;)&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&quot;Passwort&quot;:&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&quot;Eierfeile&quot;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">So, Miami fertig.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
IBrowse, mein bevorzugter Browser, wird im Prinzip gar nicht eingestellt,
im Gegenteil, da die Viag nicht mit Proxies arbeitet (was zwar ungew&ouml;hnlich
ist, l&auml;uft aber auch), nehmt ihr in der Konfiguration vom Browser unter
Netzwerk alle Proxies raus.
</P>
<P>
<A HREF="img/PlanetInterkom03.png"><IMG SRC="thumb/PlanetInterkom03.jpg" WIDTH="120" HEIGHT="72" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Und auch wenn ihr Voyager benutzt, funktioniert es genauso, hab' ich
getestet. Das ist eigentlich alles, muss man aber erst mal wissen!
</P>
<P>
Bei YAM habe ich mich etwas schwer getan. Nach ca. 50 Telefonaten mit der
technischen Hotline und mit meinem &gt;Bruder (Zodiac, King of Amiga) habe ich
es dann doch geschafft.
</P>
<P>
Als erstes &ouml;ffnet ihr mal YAM.<BR>
Dann in der Konfiguration:<BR>
</P>
<P>
<A HREF="img/PlanetInterkom05.png"><IMG SRC="thumb/PlanetInterkom05.jpg" WIDTH="120" HEIGHT="59" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Start, &quot;Voller Name&quot; und &quot;E-Mail-Adresse&quot; sollte wohl klar sein.
&quot;Pop3-Server&quot;: pop.planet-interkom.de
&quot;Passwort&quot;: &quot;Eierfeile&quot;
</P>
<P>
Empfange, &quot;Pop3-Benutzer-ID&quot;: Vorname.Nachname (oder, ihr wisst schon...)
</P>
<P>
<A HREF="img/PlanetInterkom06.png"><IMG SRC="thumb/PlanetInterkom06.jpg" WIDTH="120" HEIGHT="62" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Senden, &quot;SMTP-Server2: mail.planet-interkom.de
</P>
<P>
<A HREF="img/PlanetInterkom07.png"><IMG SRC="thumb/PlanetInterkom07.jpg" WIDTH="120" HEIGHT="61" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
So, jetzt MUSS alles laufen. Ich kann euch noch den Tip geben, dass ihr
euch bei Problemen an den technische Support wendet, die Nummer lautet 0800
/ 55 222 55. Denn letztendlich habe ich es auch nur geschafft, weil ich
beim technischen Support beharrlich genug war und die Leute am Telefon bis
zum Umfallen genervt habe mit meinen Fragen.
</P>
<P>
Wenn ihr wollt, k&ouml;nnt ihr mir auch eine E-Mail schicken, und ich werde
versuchen, euch so gut ich kann zu helfen.
</P>
<P>
So, jetzt f&uuml;r diejenigen unter euch, die noch keinen Internet-Zugang haben.
Ihr sollt auch nicht leben wie ein Hund.
Also keine Angst, im Prinzip ganz einfach.
</P>
<P>
Jetzt zur zweiten M&ouml;glichkeit. Ihr habt das Textfile von der CD-ROM und
keinen Internet-Zugang.
</P>
<P>
Als erstes m&uuml;sst ihr euch folgende Programme beschaffen, was aber
normalerweise nicht schwer ist: Ihr braucht MIAMI, um euch einzuloggen,
einen BROWSER f&uuml;r das Internet, ich bevorzuge IBrowse, aber das das kann ja
jeder selbst entscheiden, und YAM f&uuml;r eure E-Mails.
</P>
<P>
Die Programme sind auf verschiedenen Aminet-CD-ROMs enthalten.
</P>
<P>
Au&szlig;erdem braucht ihr auch das Starterkit der Viag, wie oben schon erw&auml;hnt
ben&ouml;tigt ihr die Serien- und Aktivierungsnummer auf der R&uuml;ckseite des
Booklets.
</P>
<P>
Wenn ihr dann online gehen wollt, um euch anzumelden, gebt ihr in der
Konfiguration von MIAMI folgendes ein:
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">PPP &ouml;ffnen&nbsp;</TD><TD VALIGN="TOP">&quot;Username&quot;: <A HREF="mailto:neukunde@vi-registrierung.de">neukunde@vi-registrierung.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&quot;Passwort&quot;: ganzeinfach&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<A HREF="img/PlanetInterkom01.png"><IMG SRC="thumb/PlanetInterkom01.jpg" WIDTH="120" HEIGHT="67" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
W&auml;hlmodul, Telefonnummer: 010 90 019 1700
&quot;LoginID&quot; <A HREF="mailto:neukunde@vi-registrierung.de">neukunde@vi-registrierung.de</A>
&quot;Passwort&quot; ganzeinfach
</P>
<P>
<A HREF="img/PlanetInterkom02.png"><IMG SRC="thumb/PlanetInterkom02.jpg" WIDTH="120" HEIGHT="68" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Speichern nicht vergessen!
</P>
<P>
Danach &ouml;ffnet ihr euren Browser und stellt sicher, dass keine Proxies
enthalten sind. Das macht ihr, indem ihr in die Konfiguration &quot;Netzwerk&quot;
geht und dort bei HTTP, FTP und Gopher eventuell gespeicherte Proxies
rauswerft, und zwar ohne etwas Neues einzutragen. Wieder Speichern!
</P>
<P>
<A HREF="img/PlanetInterkom03.png"><IMG SRC="thumb/PlanetInterkom03.jpg" WIDTH="120" HEIGHT="72" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Dann geht ihr in &quot;Allgemeines&quot; und tragt folgende Homepage ein:
<A HREF="https://anmeldung.planet-interkom.de">https://anmeldung.planet-interkom.de</A>. Die k&ouml;nnt ihr ja sp&auml;ter gegen eure
Lieblings-Startseite auswechseln.
</P>
<P>
<A HREF="img/PlanetInterkom04.png"><IMG SRC="thumb/PlanetInterkom04.jpg" WIDTH="120" HEIGHT="72" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Nur zur Dokumentation, ich habe, wie viele andere Leute auch, das Aminet
als Startseite, <A HREF="http://ftp.uni-paderborn.de/aminet/recent.html" TARGET="_TOP">http://ftp.uni-paderborn.de/aminet/recent.html</A> .
</P>
<P>
Auf der Seite kann man alles downloaden, was in den letzten 7 Tagen neu ins
Aminet upgeloaded wurde.
</P>
<P>
So, das ist schon alles. Jetzt k&ouml;nnt ihr mit MIAMI online gehen und eure
Anmeldung mit dem Browser ausf&uuml;llen.
</P>
<P>
Ich war 10 Sek. nach der richtigen Konfiguration online.
Allerdings war es bis dahin ein steiniger Weg.
</P>
<P>
Wenn ihr dann angemeldet seid, m&uuml;sst ihr Miami und YAM so, wie oben
gezeigt, umstricken.
</P>
<P>
Wenn Ihr online seid und trotzdem noch Probleme habt, meldet euch einfach.
Meine E-Mail-Adresse steht in der Kopfzeile.
</P>
<P>
Wenn ihr mir eine E-Mail schickt, schreibt bitte in den Betr.
Planet-Interkom.
</P>
<P>
Oder ruft den technischen Support der Viag an: 0800 55 222 55
</P>
<P>
Noch was f&uuml;r alle, die Viag ist vielleicht nicht der billigste Anbieter,
doch folgendes ist nicht zu verachten: 10 Pfg. pro Minute, minutengenaue
Abrechnung, keine Grundgeb&uuml;hr, and many more. Am besten informiert ihr euch
einfach mal selbst &uuml;ber die verschiedenen Tarife, dann werdet ihr sehen,
warum ich mir die Arbeit gemacht habe.
</P>
<P>
Au&szlig;erdem ist es ratsam, sich sowieso erst mal an einen Alternativanbieter
zu binden, auch f&uuml;r die Ferngespr&auml;che. (Das ist der beste Weg, den
Kommunikations-Riesen mit dem &quot;T&quot; in die Knie zu zwingen. Konkurrenz belebt
bekanntlich das Gesch&auml;ft, soweit sie auch genutzt wird!!)
Ich arbeite zwar nicht f&uuml;r die Viag Interkom und normalerweise mache ich
auch keine Schleichwerbung, doch das komplette Paket, das die Viag
anbietet, ist bestimmt nicht das schlechteste, und als Kunde der Interkom
muss ich sagen, dass ich trotz des fehlenden Supports, den ich hiermit
stelle, zufriedener bin als zum Beispiel mit Terrokom oder anderen
Anbietern.
</P>
<P>
Was mir bei Ultra-Billig-Anbietern am meisten fehlte, war eine E-Mail-
Adresse. Und bei gr&ouml;&szlig;eren Anbietern st&ouml;rte mich der Preis.
</P>
<P>
Wenn man bedenkt, dass bei der Interkom in den 10 Pfg. die Telefongeb&uuml;hr
enthalten ist, kann auch die &quot;T&quot; nicht konkurrieren.
</P>
<P>
<A HREF="img/PlanetInterkom00.png"><IMG SRC="thumb/PlanetInterkom00.jpg" WIDTH="100" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Aber genug der Worte.
</P>
<P>
Geht online und lebt.
</P>
<P>
Viel Spa&szlig; w&uuml;nscht euch Han Solo.
</P>
<P>
AMIGA 4 EVER
</P>
<P>
Mein Baby:
</P>
<P>
A1200 infinitiv<BR>
Blizzard 68040/40<BR>
IDEFIX<BR>
Toshiba CD-Laufwerk 16X<BR>
Zyxel V32b Fax-/Voice-Modem<BR>
Quantum Fireball 1.6 GB<BR>
Canon BJC 240<BR>
RocTec DD 3,5&quot;<BR>
Toshiba DD 3,5&quot;<BR>
Nec Multisync 3D<BR>
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">J&uuml;rgen B&uuml;denbender&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">E-Mail: <A HREF="mailto:juergen.buedenbender@planet-interkom.de">juergen.buedenbender@planet-interkom.de</A>&nbsp;</TD><TD VALIGN="TOP">&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
