<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga-yhteis&ouml; 2000</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Sami O. Hauhio</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amigaa kymmenen vuotta k&auml;ytt&auml;neen&auml; ja Amigani vihdoin vuosi sitten myyneen&auml; on tullut j&auml;&auml;ty&auml; py&ouml;rim&auml;&auml;n erilaisiin Amiga-ympyr&ouml;ihin. Porukkaa on aina ollut monenlaista; mielenkiintoista, tyls&auml;&auml;, nerokasta ja s&auml;&auml;litt&auml;v&auml;&auml;, laidasta laitaan. Amigistina, eli v&auml;hemmist&ouml;ryhm&auml;n edustajana, sai tutustua my&ouml;s v&auml;hemm&auml;n nerokkaisiin ja mielenkiintoisiin Amiga-vihaajiin.
						<p>Amiga-harrastukseni alkoi joskus 1980-luvun loppupuolella, jolloin Amiga-yhteis&ouml;ni koostui kahdesta itse&auml;ni vanhemmasta kaveristani. C64:t olivat viel&auml; silloin valta-asemassa suomalaisten p&ouml;ydill&auml;, eik&auml; PC pelikoneena ollutkaan viel&auml; vaihtoehto, joten muistaakseni n&auml;m&auml; kaksi amigistia olivatkin tuttavapiirin ainoat 16-bittisen koneen omistajat.</p>
						<p>Jo siihen aikaan minulla oli hieman kokemusta tietokoneista, ensimm&auml;iset muistoni ovatkin jostain eritt&auml;in varhaiselta ajalta, kun pelasin Pooyania jollain &auml;idin t&ouml;ist&auml; saamalla vehkeell&auml;. Sen j&auml;lkeen kotiin oli kannettu Aquarius ja viel&auml;p&auml; Atari 800XL minun ja siskoni yhteiseksi pelikoneeksi. Vietin kuitenkin paljon aikaa tietenkin pelaamalla kaverini A500:lla ja viel&auml; enemm&auml;n aikaa katsellessani toisella kaverilla koodausta, mudaamista ja sen aikaisia Amiga-demoja (nyky&auml;&auml;n viimeksi mainittu kaveri on er&auml;&auml;ss&auml; PC-pelifirmassa t&ouml;iss&auml;).</p>
						<p>Oli sanomattakin selv&auml;&auml;, ett&auml; seuraavan tietokoneeni pit&auml;isi olla Amiga, ja A500:n hankinkin. Samaan tulokseen oli p&auml;&auml;sty ilmeisesti muuallakin, sill&auml; jo kolme rinnakkaisluokkalaistani paljastuivat A500:n omistajiksi. Pelej&auml; ja muuta ei vaihdeltu hirve&auml;sti, ja luulenkin syyn olleen l&auml;hinn&auml; muiden kitsaissa asenteissa ja tietysti siin&auml;, ett&auml; olin jo t&auml;ss&auml; vaiheessa l&ouml;yt&auml;nyt trackerit ja musiikin tekemisen el&auml;m&auml;&auml;ni. Olipahan kuitenkin muutama tuttu, jonka kanssa pystyi vaihtamaan kuulumisia Amigasta, uusista peleist&auml; ja lis&auml;laitteista.</p>
						<p>Seuraava askel oli ep&auml;ilem&auml;tt&auml; modeemin hankkiminen, joka kasvatti Amiga-yhteis&ouml;&auml;: minulle r&auml;j&auml;hdysm&auml;isesti ja muille yhdell&auml; Kuutiolla. Purkeissa hengaileminen tuottikin paljon tuttavuuksia, jotka ovat viel&auml; voimassa t&auml;n&auml;&auml;nkin, puhumattakaan siit&auml; potkusta, mink&auml; Amiga-harrastukseen sai uusien ja ennen kaikkea nykyaikaisten ohjelmien ja pelien muodossa.</p>
						<p>Purkit olivat, ennen Internet-buumia, parhaimmillaan eritt&auml;in miellytt&auml;v&auml; ymp&auml;rist&ouml;, jossa tietty ryhm&auml; ihmisi&auml; pystyi keskustelemaan, v&auml;ittelem&auml;&auml;n ja hyvin usein my&ouml;s riitelem&auml;&auml;n asioista - niin t&auml;rkeist&auml; kuin v&auml;hemm&auml;n t&auml;rkeist&auml;kin. Minullakin oli omat vakiopurkkini, joista kahmin viestit kerta toisensa j&auml;lkeen ja opin tunnistamaan muita amigisteja jopa nimelt&auml;. T&auml;t&auml; vaihetta ei valitettavasti kest&auml;nyt kauaa, sill&auml; isommat systeemit, ensin MBnet, sitten Internet, alkoivat ime&auml; ihmisi&auml; yksilinjaisista purkeista ja messuilusta reaaliaikaisiin chatteihin ja valtaviin tiedostoarkistoihin.</p>
						<p>MBnet-aikoihin tuli tutustuttua er&auml;isiin Suomen aktiivisimpiin amigisteihin, ja jossain vaiheessa Saku-yhdistys lehtineen tuli my&ouml;s kuvioihin. MBnetin viestialueilta l&ouml;ytyi paljon asiantuntevaa v&auml;ke&auml; ja neuvoja hilseet ylitt&auml;viin ongelmiin. MBnetin chatissa kartutin my&ouml;s henkil&ouml;kohtaisia tuttavuuksiani Amiga-maailmassa.</p>
						<p>Ennen Internet-aikaan astumistani Amigan k&auml;ytt&auml;j&auml;kuntaa oli jo alkanut nakertaa Commodoren konkurssi ja kaiken maailman sekoilut Amigan eri ostajien ja myyjien v&auml;lill&auml;. Vaikka Amiga-yhteis&ouml; ehk&auml; kutistuikin hieman, se my&ouml;s tiivistyi, ja tulokset ovatkin n&auml;kyneet Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n esimerkillisess&auml; toiminnassa sek&auml; Amiga-yhteis&ouml;n sosiaalisen ja hy&ouml;tytoiminnan parantumisessa.</p>
						<p>Viimeinen naula otsaan oli kuitenkin Internet ja IRC. Ensiaskeleeni #amigafin-kanavalla onnistuivat joten kuten aikaisempien kokemusten kautta haalimieni tuttavuuksien avulla, ja minusta kehkeytyikin lyhyess&auml; ajassa kanavan vakiorasite. Vaikka nyky&auml;&auml;n #amigafin on minulle l&auml;hes koko Amiga-yhteis&ouml;, se tarjoaa silti p&auml;iv&auml; toisensa j&auml;lkeen monipuolisen valikoiman viihdett&auml; ja ajanvietett&auml;. Puheenaiheena on itse asiassa nyky&auml;&auml;n yh&auml; v&auml;hemm&auml;ss&auml; m&auml;&auml;rin Amiga, mutta silti l&auml;hes jokaisella kanavalaisella on useiden vuosien kokemus Amigasta, vaikka itse kone olisikin myyty jo eteenp&auml;in ja vaihdettu toiseen merkkiin. Satunnaisesti melko anarkistinenkin meininki ja tietyt persoonalliset henkil&ouml;t kuitenkin sitovat t&auml;t&auml; - ainakin jossain el&auml;m&auml;ns&auml; vaiheessa - Amigaa tunnustaneiden porukkaa yhteen.</p>
						<p>Amigisteja l&ouml;ytyy aina jostain, vaikka luulisi niiden kadonneen ajat sitten. IRC-kanavien, Saku-lehden ja sfnet.atk.amiga-uutisryhm&auml;n lis&auml;ksi l&ouml;ytyy my&ouml;s Amiga-aiheinen postituslista ainakin <a href="http://dot.tml.hut.fi" target="_blank">http://dot.tml.hut.fi</a>-osoitteesta. Valitettavasti viime aikoina Amiga-yhteis&ouml;ss&auml; ovat nousseet esille fanaatikot, jotka tekev&auml;t kaikkensa pit&auml;&auml;kseen oman Amigansa el&auml;m&auml;ns&auml; rakkauden kohteena ja hy&ouml;kk&auml;&auml;v&auml;t raivoisasti, kun v&auml;h&auml;nkin muista konemerkeist&auml; puhuu, mutta n&auml;m&auml; valitettavat yksil&ouml;t tekev&auml;t ainoastaan haittaa Amiga-yhteis&ouml;lle - p&auml;invastoin kuin ilmeisesti luulevat. Haluan painottaa, ett&auml; n&auml;m&auml; yksil&ouml;t eiv&auml;t kuitenkaan edusta koko amigistikuntaa. Paljon yst&auml;v&auml;llisi&auml; ja hauskoja ihmisi&auml;kin on kuvioissa.</p>
						<p>Amiga on osaltaan juuri harvinaisuutensa ja ongelmiensa takia pystynyt luomaan ymp&auml;rilleen pienen mutta uskollisen k&auml;ytt&auml;j&auml;kunnan, joka on esimerkillinen ja ennenn&auml;kem&auml;t&ouml;n muihin k&auml;ytt&auml;j&auml;ryhmiin verrattuna. Suomalaiset, nimenomaan Suomen Amiga-k&auml;ytt&auml;j&auml;t, ovat saaneetkin tunnustusta itselt&auml;&auml;n Amigan johtoportaalta asti. Vaikka itse myin viimeisenkin Amigani jo vuosi sitten, on pakko sanoa, ett&auml; vastaavaa ryhm&auml;henke&auml;, yritteli&auml;isyytt&auml; ja positiivista sekop&auml;isyytt&auml; on eritt&auml;in vaikea l&ouml;yt&auml;&auml; muualta kuin juuri Amiga-yhteis&ouml;st&auml;. Sen takia viihdynkin siell&auml;. Satunnaisista Amiga-mollaajista, eksentrikoista ja fanaatikoista huolimatta, amigistien yhteishenki ei l&auml;hde kulumallakaan.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
