<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga-kuoret k&auml;nnykk&auml;&auml;n</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Saksalainen <a href="http://www.airbrush-design.com" target="_blank">Airbrush Paradise Tingler</a> maalaa k&auml;sity&ouml;n&auml; mm. k&auml;nnyk&ouml;iden kuoria ja PC:n hiiri&auml;. Yrityksen k&auml;nnykk&auml;tuotevalikoimaan kuuluu my&ouml;s nelj&auml; erilaista Amigan virallisesti lisensoimaa kuorta Nokian suosituimpiin GSM-puhelimiin. Tuorein tulokas on Nokian perusmalliin 3210:een sopiva v&auml;rikuori. Kun Saku 99:&auml;&auml;n emme kuoria saaneet esittelyyn, p&auml;&auml;tti p&auml;&auml;toimittaja tilata mokomat omaan puhelimeensa yhdistyksen vuosikokouksen kynnyksell&auml;. Tilaus hoitui n&auml;pp&auml;r&auml;sti firman kotisivulla olevan <a href="http://www.airbrush-design.com/cgi-bin/inno-ecomm.pl/apt" target="_blank">online-kaupan</a> kautta.
						<center>
							<p><a href="kuvat/kannykat_iso.jpg" target="_blank"><img height="249" width="380" src="kuvat/kannykat.jpg" border="0" alt=" "></a></p>
						</center>
						<p>Kaikkien Amiga-kuorien kappalehinta on 99 Saksan markkaa (50,61 euroa), ja postiennakkokulujen kera hintaa tuli noin 380 Suomen markkaa. Kuoret voi maksaa joko etuk&auml;teen tai tilata postiennakolla, joten luottokorttia ei tarvita. Postiennakko lienee k&auml;tevin ratkaisu Suomeen tilaaville. Kotisivut ovat iloista saksan ja englannin sekasotkua, mutta ainakin minulta tilaaminen onnistui vaivatta, vaikka en saksaa osaakaan muutamaa sanaa enemp&auml;&auml;.</p>
						<p>Tilaus tuli perille noin viikossa. Ainakin minun l&auml;hipostiini taitaa tulla eurooppalaisia postiennakkoja varsin v&auml;h&auml;n p&auml;&auml;tellen siit&auml;, kuinka monimutkaista hommaa maksun rekister&ouml;inti ja perille saaminen oli. Onnistuihan se viimein - saksalainen k&auml;siala ei ole sit&auml; Euroopan selvint&auml;, jos postiennakko-osoitekorttiin on uskominen. Onneksi paketin sis&auml;ll&auml; oli my&ouml;s tietokoneella tulostettu lasku, josta oikeat summat ja vastaanottajat saatiin tulkattua.</p>
						<p>Itse kuorissa ei ole valittamista. Maalausj&auml;lki on hyv&auml;&auml;, samoin lakkausj&auml;lki. Ainoat narinat annan pakkauksesta, sill&auml; kuoret tulivat kyll&auml; pehmustetussa kuplapussissa, mutta ne olivat lis&auml;ksi v&auml;lj&auml;ss&auml; kovamuovisessa kotelossa, jonka sis&auml;ll&auml; kuoret p&auml;&auml;sev&auml;t liukumaan vapaasti postituksen aikana. Takakannessa oli pieni&auml; hankaumia ilmeisesti juuri t&auml;st&auml; syyst&auml;. Mik&auml;li tilaatte kuoria, voi olla fiksua pyyt&auml;&auml; firmaa pehmustamaan kuoria hieman paremmin tai ainakin pakkaamaan ne tiukahkoon muovipussiin tai vastaavaan naarmuuntumisen v&auml;ltt&auml;miseksi.</p>
						<p><a href="http://www.airbrush-design.com" target="_blank">Kotisivujen</a> lis&auml;ksi firmaa voi l&auml;hesty&auml; my&ouml;s s&auml;hk&ouml;postitse osoitteeseen <a href="mailto:rtingler@airbrush-design.com">rtingler@airbrush-design.com</a> tai etanapostilla osoitteeseen Airbrush&nbsp;Paradise Tingler, Marxstrasse 17, D-78628 Rottweil, Germany.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
