<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Digitaaliajan kotiteatteri - kotiteatteria rakentamaan</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Heikkinen &lt;<a href="mailto:oh4kju@sci.fi">oh4kju@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><a href="kotiteatteri_1.html" target="_self"><font size="2">Historiasta nykyp&auml;iv&auml;&auml;n</font></a><font size="2"> | Kotiteatteria rakentamaan | <a href="kotiteatteri_3.html" target="_self">S&auml;&auml;t&ouml;&auml; ja elokuviin</a></font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Hyv&auml;laatuisen kotiteatterin rakentaminen on varsin kallista. Pelkk&auml;&auml;n &auml;&auml;nentoistoon uppoaa helposti 10-20 kilomarkkaa. Tarkoitus ei kuitenkaan ole, ett&auml; kotiteatteriharrastus olisi vain isorikkaiden puuhaa. T&auml;ytyy muistaa, ettei ole v&auml;ltt&auml;m&auml;t&ouml;nt&auml; ostaa kaikkea kerralla tai tinki&auml; laitteiden laadusta, vaan aivan hyvin voi hankkia laitteita yksi kerrallaan ja aloittaa esimerkiksi vahvistimesta tai DVD-soittimesta. Ostelemalla laitteita v&auml;hitellen tulee lopputuloksesta parempi siksikin, ett&auml; on aikaa valita jokainen laitteiston komponentti huolellisesti ajan kanssa ja varmistua eri laitteiden yhteensopivuudesta.
						<p>Minimilaitteisto, jolla p&auml;&auml;see nauttimaan DVD-elokuvista on soitin, digitaalinen AV-vahvistin, viisi kaiutinta, subwoofer sek&auml; mahdollisimman iso televisio, mielell&auml;&auml;n 16:9-kuvasuhteella. Jo t&auml;llainen peruspaketti maksaa 15000 markasta yl&ouml;sp&auml;in, joten laitteiden hankkiminen yksitellen on j&auml;rkev&auml;&auml;. Yl&auml;rajaahan ei juurikaan ole, jos haluaa vaikkapa huippuluokan AV-vahvistimen, kannattaa varautua maksamaan siit&auml; 15-20 kmk!</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>DVD-soitin</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jos talossa on jo ennest&auml;&auml;n analoginen kotiteatterij&auml;rjestelm&auml; Dolby Pro Logic -AV-vahvistimella, voi laitteiston p&auml;ivityksen aloittaa hankkimalla DVD-soittimen. T&auml;ll&auml; tavoin p&auml;&auml;see nauttimaan DVD:n kuvanlaadusta, ja my&ouml;s &auml;&auml;ni tulee jonkin verran parempana kuin videonauhalta tai televisiosta, vaikkakin se joudutaan t&auml;ss&auml; tapauksessa downmixaamaan kaksikanavaiseksi Pro Logic -vahvistinta varten. T&auml;ll&auml; tavoin Pro Logicilla toistettuna DVD:n &auml;&auml;ni on viel&auml; hyvin kaukana monikanavaisesta. Nyrkkis&auml;&auml;nt&ouml;n&auml; voisi sanoa, ett&auml; ero Dolby Digitalin ja Dolby Pro Logicin v&auml;lill&auml; on samaa luokkaa kuin ero monon ja stereon v&auml;lill&auml;.
						<p>Kaikissa DVD-soittimissa on downmixausmahdollisuus, eli monikanavainen Dolby Digital -&auml;&auml;niraita muokataan soittimessa kaksikanavaiseksi Dolby Surround -&auml;&auml;niraidaksi, joka tulee ulos analogisista RCA-liittimist&auml; videonauhurin tapaan. On my&ouml;s olemassa DVD-soittimia, joissa on sis&auml;inen Dolby Digital -dekooderi ja ns. 5.1-ulostuloliit&auml;nn&auml;t. T&auml;m&auml; tarkoittaa sit&auml;, ett&auml; monikanava&auml;&auml;ni puretaan soittimen sis&auml;ll&auml; ja se tulee analogisessa muodossa ulos kuudesta RCA-liit&auml;nn&auml;st&auml;. T&auml;llainen soitin on noin tuplasti kalliimpi kuin ilman dekooderia olevat mallit, mutta toisaalta t&auml;m&auml;n kaveriksi riitt&auml;&auml; analoginen 5.1-sis&auml;&auml;ntulolla varustettu vahvistin, joka on halvempi kuin aidot digitaalivahvistimet.</p>
						<p>Pitk&auml;ll&auml; t&auml;ht&auml;imell&auml; on kuitenkin suositeltavampaa hankkia tavallinen soitin, jossa ei ole sis&auml;ist&auml; dekooderia mutta digitaalinen &auml;&auml;nil&auml;ht&ouml;, joka tukee sek&auml; Dolby Digitalin AC3-formaattia ett&auml; DTS-formaattia. N&auml;in siksi, ett&auml; vahvistimissa on vain yksi analoginen 5.1-monikanavasis&auml;&auml;nmeno. T&auml;m&auml; rajoittaa monikanava&auml;&auml;nen k&auml;ytt&ouml;mahdollisuuden vain DVD-soittimelle. Tulevaisuudessa on kuitenkin mahdollista nauttia monikanava&auml;&auml;nest&auml; mm. digitaalisen TV:n kautta, joten tarve useampaan monikanavaiseen &auml;&auml;nil&auml;hteeseen on ilmeinen. Siksi monikanava&auml;&auml;ni kannattaa vied&auml; digitaalisena vahvistimelle asti - k&auml;tev&auml;sti yht&auml; johtoa tai valokuitua pitkin. Digitaalisia &auml;&auml;nisis&auml;&auml;nmenoja on vahvistimissa yleens&auml; useita.</p>
						<p>DVD-soittimella on mahdollista kuunnella my&ouml;s CD-levyj&auml;, vaikkakaan soitin ei ole t&auml;ss&auml; k&auml;yt&ouml;ss&auml; yht&auml; hyv&auml; kuin tavallinen CD-soitin. DVD-levyjen tiheys on tavallista CD:t&auml; korkeampi, ja siksi DVD-soittimen laserlukup&auml;&auml;n s&auml;de on huomattavasti ohuempi kuin CD-soittimessa. N&auml;in ollen s&auml;de lukee vain hyvin kapeaa alaa &quot;leve&auml;n&quot; CD-datauran keskelt&auml;. Alkuper&auml;isell&auml; CD-levyll&auml; homma pelaa, mutta jos DVD:hen ladataan itsepoltettu CD-R-levy, ei homma yleens&auml; toimi. Ostettaessa kannattaa pit&auml;&auml; mieless&auml;, ettei CD-R-levyjen toimiminen ei ole kaikissa soittimissa taattua!</p>
						<p>Ongelma ei sin&auml;ns&auml; ole paha, koska DVD-soitinta ei yleens&auml; hankita CD-soittimen korvaajaksi. Jos erillist&auml; CD-soitinta ei kuitenkaan ennest&auml;&auml;n ole, olisi k&auml;tev&auml;&auml;, jos my&ouml;s CD-levyt toimisivat. Lis&auml;ksi l&auml;hes kaikilla DVD-soittimilla on mahdollista katsella VideoCD-levyj&auml;. VideoCD:t ovat tavallaan DVD:n esiasteita, Philipsin 1990-luvun alkupuolella lanseeraama j&auml;rjestelm&auml;. Se j&auml;i kuitenkin harvinaiseksi lukuunottamatta Kaukoit&auml;&auml;, jossa niit&auml; massatuotetaan hurjia m&auml;&auml;ri&auml;. Muun muassa Amigan CD32:lla oli mahdollista katsella VideoCD-levyj&auml; hankkimalla siihen videomoduli, jota ei kuitenkaan k&auml;yt&auml;nn&ouml;ss&auml; saanut mist&auml;&auml;n... :-)</p>
						<center>
							<p><img height="263" width="350" src="kuvat/baja.jpg" border="0" alt=" "></p>
						</center>
						<p><i>Kuvassa Taiwanista tuotu VideoCD-elokuva Baja, p&auml;&auml;osissa Lance Henriksen ja Molly Ringwald. Tekstitykset ovat aina paikallisella kielell&auml;, mutta &auml;&auml;niraita on yleens&auml; alkuper&auml;inen. Elokuvat viev&auml;t yleens&auml; kaksi tai useampia levyj&auml;, ja niiss&auml; on massatuotantokannet ja -painatukset.</i></p>
						<p>VideoCD:ss&auml; kuva on MPEG-1-pakattua ja vastaa laadultaan VHS-laatua. &Auml;&auml;ni on kaksikanavainen stereo, ja my&ouml;s Dolby Surround -&auml;&auml;nitys toimii. Vaikka VideoCD onkin elokuvalevyill&auml; l&auml;nsimaissa kuollut formaatti, on se kotik&auml;ytt&auml;j&auml;n kannalta mielenkiintoinen siihen asti, kun kaupasta alkaa saada kirjoittavia DVD-asemia ja -levyj&auml; edullisesti. Jos omistaa kirjoittavan CD-aseman, on mahdollista valmistaa sill&auml; omia VideoCD-levyj&auml; varsin helposti. Mik&auml;p&auml;s sen mukavampaa kuin omat videokuvaukset k&auml;tev&auml;sti CD:ll&auml;, jonka sitten vain tyrkk&auml;&auml; DVD-soittimeen. T&auml;ss&auml; yhteydess&auml; CD-R-levyjen tulisi toimia DVD:ss&auml;.</p>
						<p>Siksi joissakin uudemmissa DVD-soittimissa on CD:n lukemista varten toinen lasers&auml;de. T&auml;llainen soitin toimii varmimmin kaikenlaisten levyjen kanssa. Er&auml;s esimerkki kaksoiss&auml;teell&auml; varustetusta soittimesta on Pioneerin DV-525, jollaisen itsekin p&auml;&auml;tin hankkia. Myyj&auml;n mukaan se lukisi jopa CD-RW-levyj&auml;, mutta t&auml;t&auml; en ole itse kokeillut. DV-525 on varsin suosittu laite kotiteatteriharrastajien keskuudessa, ja se tarjoaakin varsin edulliseen hintaan t&auml;ydellisen DVD-tuen, sill&auml; se sis&auml;lt&auml;&auml; mm. kaikki &auml;&auml;niformaatit unohtamatta 24-bit 96 kHz DVD-audiolevyj&auml;k&auml;&auml;n.</p>
						<center>
							<p><img height="107" width="380" src="kuvat/pioneer.jpg" border="0" alt=" "></p>
						</center>
						<p>Pioneer n&auml;ytt&auml;isi toimivan my&ouml;s naarmuisten tai muulla tapaa liev&auml;sti viallisten DVD-levyjen kanssa paremmin kuin jotkut muut soittimet. K&auml;tev&auml;&auml; on my&ouml;s mahdollisuus tallentaa kesken katsotun elokuvan paikka ja asetukset pysyv&auml;sti muistiin, niin ett&auml; levyn saa jopa poistaa laitteesta ja jatkaa katselua joskus my&ouml;hemmin. DV-525 ei sis&auml;ll&auml; &auml;&auml;nidekoodereita, mutta siit&auml; on olemassa my&ouml;s dekoodereilla varustettu rinnakkaismalli.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>DiViDo</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Er&auml;s mielenkiintoinen vaihtoehto on Bestcom DiViDo -DVD-soitin, jota sain kunnian testata hiljattain. Laitteen merkitt&auml;vin ominaisuus on Pioneerin tapaan kaikkien levyjen (DVD, CD, CD-R, CD-RW) toisto, mutta erikoista on, ett&auml; laite tunnistaa my&ouml;s CD-ROM-levyt, joissa on MP3-kappaleita! Se k&auml;y siten sellaisenaan MP3-soittimeksi. MP3-rompun ei tarvitse olla mitenk&auml;&auml;n erityisesti DiViDolle suunniteltu, vaan laitteelle kelpasivat sellaisenaan MP3-kokoelmaromppuni, joita olin Amigalla poltellut ISO9660 Level II -formaattiin!
						<p>DiViDon erikoisuus on my&ouml;s se, ett&auml; sen saa aluekoodittomaksi n&auml;pp&auml;ilem&auml;ll&auml; kaukos&auml;&auml;timest&auml;. Oletusarvoisesti laite on koodattu alueelle 2, mutta menem&auml;ll&auml; huoltovalikkoon voi aluekoodiksi asettaa &quot;BYPASS&quot; ja asettaa samalla Macrovisionin pois p&auml;&auml;lt&auml;. Erillist&auml; maksullista modifiointia ei siten tarvita. T&auml;m&auml; tekeekin DiViDosta ehk&auml; halvimman DVD-soittimen (2300 mk), jos otetaan huomioon muiden soittimien modifiointikustannukset.</p>
						<center>
							<p><img height="89" width="380" src="kuvat/divido.jpg" border="0" alt=" "></p>
						</center>
						<p>Halvalla hinnalla on kuitenkin varjopuolensa. Ensimm&auml;isen&auml; panin merkille kuvassa n&auml;kyv&auml;t vinoraidat. Se oli jokin h&auml;iri&ouml;, joka syntyi laitteessa itsess&auml;&auml;n. H&auml;iri&ouml;t&auml; ei olisi ilmennyt k&auml;ytett&auml;ess&auml; RGB-ulostuloa, mutta DiViDon scartista puuttui jostain syyst&auml; kokonaan ohjaus, joka komentaa television RGB-tilaan - selv&auml; suunnitteluvirhe! Testattuani DiViDoa erilaisilla levyill&auml; havaitsin, ettei sen DVD-tuki ole t&auml;ysin yhteensopiva. Levyill&auml;, joissa on runsaasti ekstroja ja monimutkainen hakemistorakenne, tuntui soitin toisinaan sekoilevan, ja tietyt valinnat aiheuttivat soittimen menemisen stop-tilaan tai palaamisen samaan valikkoon, jossa jo oltiin (silmukkatilanne).</p>
						<p>Testi-DVD on k&auml;tev&auml; tapa selvitt&auml;&auml; laitteen ominaisuudet ja puutteet. N&auml;in havaitsin mm. sen, ettei 24-bittinen 96 kHz DVD-audio toimi, vaan DiViDo konvertoi sen ilmeisesti 48 kHz:lle. L&auml;hinn&auml; t&auml;st&auml; voi olla haittaa tulevaisuudessa, jos nuo 96 kHz:n DVD-audio-levyt yleistyv&auml;t. Musiikki toki kuului, mutta jos k&auml;ytt&auml;j&auml; hakee nimenomaan ylivoimaista &auml;&auml;nenlaatua hankkimalla 96 kHz:n levyj&auml;, ei soitin palvele tarkoitustaan.</p>
						<p>Sitten kokeilin DTS-testiraitoja. Yll&auml;tys oli suuri, sill&auml; osa niist&auml; toistui mykkin&auml;. Vahvistin kyll&auml; tunnisti DTS-signaalin ja meni DTS-tilaan, mutta mit&auml;&auml;n ei kuulunut. Asiaa tovin kummasteltuani p&auml;&auml;tin kokeilla DTS-&auml;&auml;nell&auml; varustettuja elokuvia, ja ladattuani Sotamies Ryanin DTS-version karu totuus sitten paljastui: alussa olleen DTS-promon j&auml;lkeen ei kuulunut en&auml;&auml; mit&auml;&auml;n - koko elokuva oli alusta loppuun mykk&auml;! Pahemman luokan bugi. Dolby Digital -levyt vaikuttivat toimivan muuten ok, paitsi ett&auml; Disneyn levyt (esimerkiksi Tarzan) eiv&auml;t suostu toimimaan DiViDossa lainkaan. T&auml;ss&auml; lienee kyse valikoiden yhteensopimattomuudesta. Toistoyritykset p&auml;&auml;tyv&auml;t stop-tilanteeseen.</p>
						<p>Erikoista DiViDossa on sen NTSC -&gt; PAL -muunnos, jota tavallinen DVD ei tee. Laitteen valikoista voi valita TV-j&auml;rjestelm&auml;ksi joko NTSC, PAL tai Multi. Normaalit soittimet toimivat Multi-tilassa, eli ne antavat aina sen kuvaformaatin signaalia ulos, jossa toistettava levy on. DiViDo sen sijaan muuttaa NTSC:n PALiksi. Muunnos ei kuitenkaan ole n&auml;kym&auml;t&ouml;n, sill&auml; kuvan kuvasuhde muuttuu hieman (kuva on ylikorkea) ja kuvataajuuden muutos aiheuttaa nykimist&auml;, joka n&auml;kyy kiusallisen selv&auml;sti esim. kamerapanoroinneissa. Eik&auml; kuvanlaatukaan ole en&auml;&auml; samaa tasoa kuin ilman konversiota. Mielenkiintoinen lis&auml;toiminto silti, ja mik&auml; t&auml;rkeint&auml;, k&auml;ytt&auml;j&auml; saa itse p&auml;&auml;tt&auml;&auml;, mit&auml; signaalia haluaa ulos.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Vahvistimen valinta</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Koko laitteiston keskipiste on digitaalinen AV-vahvistin. Digitaalisuus tarkoittaa t&auml;ss&auml; yhteydess&auml; sit&auml;, ett&auml; laite sis&auml;lt&auml;&auml; digitaaliset &auml;&auml;nisis&auml;&auml;nmenot joko optisena (valokuituliit&auml;nn&auml;t) tai koaksiaalisena (RCA-liit&auml;nt&auml;) sek&auml; v&auml;hint&auml;&auml;n Dolby Digital -dekooderin. Vaihtoehtoisesti vahvistin voi olla my&ouml;s analogista tyyppi&auml;, jossa on 5.1-sis&auml;&auml;nmeno ja dekoodaus tehd&auml;&auml;n DVD-soittimessa, kuten edell&auml; kuvailtiin.
						<p>Vahvistimen hankinnassa t&auml;rkeint&auml; on se, ett&auml; laite tukee niit&auml; &auml;&auml;niformaatteja, joita ostaja on aikonut k&auml;ytt&auml;&auml;. Esimerkiksi DTS-tukea ei l&ouml;ydy halvimmista vahvistimista. DTS:n puuttuminen est&auml;&auml; DTS-elokuvien lis&auml;ksi monikanavaisen musiikin nauttimisen DTS-CD-levyilt&auml; (n&auml;ist&auml; lis&auml;&auml; j&auml;ljemp&auml;n&auml;). Koska Dolby Digital on ylivoimaisesti k&auml;ytetyin &auml;&auml;niformaatti DVD-elokuvissa, l&ouml;ytyy sille tuki varmasti kaikista digitaalivahvistimista ja DVD-soittimista.</p>
						<p>Lyhenne AV tulee siit&auml;, ett&auml; vahvistimessa on pelkkien &auml;&auml;niliit&auml;nt&ouml;jen lis&auml;ksi my&ouml;s kuvaliit&auml;nn&auml;t. Vahvistin itsess&auml;&auml;n ei k&auml;sittele kuvasignaalia (korkeintaan laitteen kuvaruutun&auml;yt&ouml;t tulevat kuvan &quot;p&auml;&auml;lle&quot;), mutta se kytkee kuunneltavaksi valitun laitteen kuvasignaalin monitor-ulostuloon eli toimii n&auml;pp&auml;r&auml;n&auml; videosignaalivalitsimena. Kuvaliit&auml;nn&auml;t l&ouml;ytyv&auml;t tavallisesti RCA-tyyppisin&auml; komposiittisignaalille ja MiniDIN-tyyppisen&auml; S-video-signaalille.</p>
						<p>S-video-liit&auml;nt&ouml;j&auml; ei v&auml;ltt&auml;m&auml;tt&auml; ole kaikissa vahvistimissa, tai niit&auml; ei ole kaikille laitteille. Vahvistin ei konvertoi signaalia S-video-liittimist&auml; komposiitiksi tai toisin p&auml;in. Vahvistinta hankittaessa kannattaa S-video-liittimien olemassaololle antaa arvoa, vaikkei parhaillaan omistaisikaan sit&auml; tukevaa TV:t&auml; tai monitoria. Tulevaisuudessa saattaa tulla hankintaan esimerkiksi videotykki, jolloin S-video-liit&auml;nt&auml; nousee kokonaan uuteen arvoon. S-video-liit&auml;nn&auml;ss&auml; kuvan v&auml;ri- ja mustavalkoinformaatiot johdetaan erillisi&auml; johtimia pitkin, ja se tarjoaa huomattavasti paremman kuvanlaadun kuin perinteinen komposiittiliit&auml;nt&auml;.</p>
						<p>RGB-liit&auml;nt&ouml;j&auml; vahvistimissa ei yleens&auml; ole. Ilman niit&auml;kin on tyypillisen AV-vahvistimen takapaneeli varsin mutkikkaan n&auml;k&ouml;inen varsinkin vasta-alkajalle. Pidemm&auml;lle ehtineelt&auml; taas liit&auml;nn&auml;t loppuvat kesken, vaikka niit&auml; olisi kuinka paljon. Kuvanauhureille on luonnollisesti sek&auml; sis&auml;&auml;nmeno- ett&auml; ulostuloliit&auml;nn&auml;t, kun taas pelk&auml;st&auml;&auml;n toistaville laitteille on pelkk&auml; sis&auml;&auml;nmeno. Monissa VHS-videoissa on ainoastaan scart-liit&auml;nt&auml; &auml;&auml;ni- ja kuvasignaaleille, ja t&auml;ll&ouml;in on hankittava v&auml;lijohdot, joissa toisessa p&auml;&auml;ss&auml; on scart ja toisessa p&auml;&auml;ss&auml; kasa RCA-liittimi&auml; vahvistimen taakse liitett&auml;v&auml;ksi. DVD-soitin kannattaa ehdottomasti liitt&auml;&auml; S-video-johdolla, muutoin DVD:n kuvanlaatu ei p&auml;&auml;se oikeuksiinsa. Vaihtoehtoisesti voi k&auml;ytt&auml;&auml; suoraa RGB-scart-johtoa DVD:lt&auml; televisiolle, mutta t&auml;ll&ouml;in vahvistimen kuvavalinta ei tietenk&auml;&auml;n toimi DVD:lle.</p>
						<p>Kun kaikki laitteet on liitetty vahvistimen kautta toisiinsa, k&auml;yv&auml;t erilaiset toiminnot kuten esimerkiksi kopiointi videolle eri l&auml;hteist&auml; todella n&auml;pp&auml;r&auml;sti ilman johtojen irrottelua. Joissakin vahvistimissa voi &quot;lukita&quot; erillisell&auml; valitsimella tallennukseen k&auml;ytett&auml;v&auml;n kuval&auml;hteen, mink&auml; j&auml;lkeen katseltavaa ja kuunneltavaa l&auml;hdett&auml; voi vaihdella ilman ett&auml; t&auml;m&auml; vaikuttaa tallennukseen. T&auml;ll&auml; tavoin on mahdollista esimerkiksi elokuvan nauhoitus satelliittivirittimelt&auml;, samalla kuin katselee vaikkapa DVD:t&auml;.</p>
						<p>My&ouml;s erikoistemput voivat olla mahdollisia, mm. kuva- ja &auml;&auml;nisignaaleiden vapaa valinta siten, ettei niiden tarvitse tulla samasta l&auml;hteest&auml;. T&auml;m&auml;n avulla voi valita edell&auml;mainitusta nauhoituksesta n&auml;kyviin pelk&auml;n kuvan ja poimia &auml;&auml;neksi vaikkapa CD-levyn, mik&auml;li ei halua kuunnella elokuvan &auml;&auml;niraitaa. T&auml;ss&auml; tilassa kuvaa seuraamalla on mahdollista editoida esim. mainoskatkot pois, ja musiikin kuuntelusta huolimatta nauhalle tallentuu alkuper&auml;inen elokuvan &auml;&auml;ni. Kaikkien n&auml;iden erikoistoimintojen hallinta saattaa olla mutkikasta, joten ostettaessa kannattaa kiinnitt&auml;&auml; huomiota siihen kuinka homma on toteutettu, mik&auml;li arvelee tarvitsevansa toimintoja usein. N&auml;pp&auml;rint&auml; olisi, jos vahvistimessa olisi erillinen source-valitsin (katseltava/kuunneltava l&auml;hde) ja REC-valitsin (tallennukseen valittu l&auml;hde). REC-valitsimen ei tarvitse toimia kaukos&auml;&auml;timest&auml; (parempi onkin, vahinkojen v&auml;ltt&auml;miseksi).</p>
						<p>Kaikissa nykyajan AV-vahvistimissa on Dolby Pro Logic -kytkent&auml; riippumatta siit&auml;, onko vahvistimessa dekoodereita digitaali&auml;&auml;nille. Digitaalisissa vahvistimissa Dolby Pro Logic -dekoodaus tehd&auml;&auml;n kuitenkin DSP:ll&auml;, joten t&auml;llainen vahvistin tarjoaa monessa tapauksessa laadukkaamman surround-&auml;&auml;nen my&ouml;s analogisista l&auml;hteist&auml; toistettaessa kuin vanhempi t&auml;ysin analoginen Pro Logic -kytkent&auml;. Digitaalisesti prosessoivassa vahvistimessa on my&ouml;s usein tilatehosteita musiikin kuunteluun.</p>
						<p>Digitaalisuutta ei pid&auml; kuitenkaan palvoa, jos laite on halpa. Halvasti toteutettu digitaalinen Pro Logic voi olla huonompi kuin analoginen. Hyvin paljon ratkaisee se, mink&auml;laatuisena vahvistin digitoi analogisen 2-kanava&auml;&auml;nen digitaalista prosessointia varten. Jos digitaalivahvistinta aikoo k&auml;ytt&auml;&auml; runsaasti analogisten l&auml;hteiden, esimerkiksi VHS-videon tai satelliittivirittimen kanssa perinteisess&auml; Dolby Pro Logic -tilassa, kannattaa ostettaessa kiinnitt&auml;&auml; erityist&auml; huomiota &auml;&auml;nenlaatuun t&auml;ss&auml; toimintatilassa.</p>
						<p>Varmasti mik&auml; tahansa digitaalivahvistin antaa hyv&auml;n &auml;&auml;nen DVD:lt&auml; (ja liikkeess&auml; laitetta taatusti my&ouml;s esitell&auml;&auml;n DVD:lt&auml;), jolloin ostaja ei v&auml;ltt&auml;m&auml;tt&auml; muista kiinnitt&auml;&auml; huomiota analogisten tilojen &auml;&auml;nenlaatuun. Joissakin laitteissa saattaa olla my&ouml;s direct-toiminto, jonka avulla kaikki digitaalitekniikka voidaan kytke&auml; pois p&auml;&auml;lt&auml;, ja vahvistin toimii t&auml;m&auml;n j&auml;lkeen kuin analoginen kaksikanavainen vahvistin. T&auml;ss&auml; toimintatilassa &auml;&auml;nens&auml;vyn s&auml;&auml;timetkin ohitetaan. T&auml;m&auml; tila sopii parhaiten CD-musiikin kuunteluun.</p>
						<p>Digitaalisen vahvistimen valinta ei ole helppo teht&auml;v&auml;. Ominaisuuksia laitteissa on vaikka kuinka, ja niist&auml; pit&auml;isi osata valikoida sellaiset joita itse kokee tarvitsevansa. My&ouml;s liit&auml;nt&ouml;jen m&auml;&auml;r&auml; vaihtelee, jopa niinkin, ett&auml; kalliimmassa mallissa voi olla v&auml;hemm&auml;n liit&auml;nt&ouml;j&auml;. Kannattaa mietti&auml; tarkasti, mit&auml; kaikkea aikoo vahvistimeen liit&auml;&auml; ja tarkistaa, riitt&auml;v&auml;tk&ouml; liit&auml;nn&auml;t. Esimerkiksi digitaalisia &auml;&auml;nisis&auml;&auml;nmenoja ei v&auml;ltt&auml;m&auml;tt&auml; ole monta. Yksi tarvitaan DVD:lle ja toinen CD-soittimelle, mutta tulevaisuudessa digitaalinen TV tulee tarjoamaan monikanavaista &auml;&auml;nt&auml;, ja viimeist&auml;&auml;n siin&auml; vaiheessa tarvitaan kolmas liit&auml;nt&auml;. Ovatko liit&auml;nn&auml;t sopivaa tyyppi&auml; (optinen tai koaksiaalinen RCA) liitett&auml;vien laitteiden ulostuloille?</p>
						<p>Koska kehitys jatkuu ja on mahdollista, ett&auml; tulevaisuudessa k&auml;ytet&auml;&auml;n jopa 8-kanavaista &auml;&auml;nij&auml;rjestelm&auml;&auml;, voi uusimmista vahvistimista l&ouml;yty&auml; analoginen 7.1-sis&auml;&auml;ntulo ja l&auml;hd&ouml;t lis&auml;p&auml;&auml;tevahvistimille, joiden avulla vahvistin on k&auml;ytett&auml;viss&auml; analogisena vahvistimena viel&auml; tuolloinkin. N&auml;ht&auml;v&auml;ksi j&auml;&auml;, tuleeko n&auml;ille liit&auml;nn&ouml;ille koskaan tarvetta.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Kaiuttimet</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jos olemassa on jo ennest&auml;&auml;n Dolby Surround (Pro Logic) -kotiteatteri, voidaan vanhoja kaiuttimia hy&ouml;dynt&auml;&auml; v&auml;liaikaisesti. Yleens&auml; t&auml;llaisessa kotiteatterissa on kuitenkin pienet takakaiuttimet, koska niist&auml; kuuluu vain keski&auml;&auml;nialue. Digitaalisessa kotiteatterissa kaikki kanavat ovat tasa-arvoisia, koko kuuloalueella toimivia, joten v&auml;hint&auml;&auml;n ne pienet sardiinipurkit sielt&auml; huoneen takaosasta tulisi korvata koko &auml;&auml;nialueen toistavilla, mahdollisimman samankaltaisen toiston etukanaviin n&auml;hden omaavilla kaiuttimilla. Keskikanavaakaan ei saa unohtaa, koska sill&auml; on varsin merkitt&auml;v&auml; osa elokuvan &auml;&auml;nimaailmasta. My&ouml;s keskikanavan tulisi omata mahdollisimman paljon p&auml;&auml;kanavia muistuttava toistok&auml;yr&auml;. Jos keskikaiutin sijoitetaan television l&auml;heisyyteen, tulee sen olla magneettisuojattua mallia.
						<p>Parhaaseen tulokseen p&auml;&auml;see, jos raaskii ostaa viisi kappaletta samanlaisia, mahdollisimman hyv&auml;laatuisia kaiuttimia. Rahaa t&auml;h&auml;n kyll&auml;kin uppoaa, sill&auml; halvimmat hyv&auml;laatuiset kaiuttimet itse rakennettuina rakennussarjoista maksavat nekin 1200-1500 markkaa kappale. Kannattaa tutustua Hifi-lehden rakennussarjoihin ja kasata niist&auml; kaiuttimet itse. Itse hankin t&auml;ll&auml; tavoin viisi kappaletta Hifi 12/2 -tyyppisi&auml; kaiuttimia, ne maksavat noin 1300 markkaa kappale itse rakennettuina. T&auml;m&auml; kaiutin ei ehk&auml; ole parhaimmillaan kotiteatterik&auml;yt&ouml;ss&auml;, mutta koska omistin niit&auml; ennest&auml;&auml;n parin, p&auml;&auml;tin hankkia kotiteatterin p&auml;ivityksen yhteydess&auml; kolme lis&auml;&auml;. T&auml;ss&auml;kin kannattaa muistaa, ett&auml; ellei pysty ostamaan kerralla kunnollisia, ei saa sortua halpakaiuttimiin. Mieluummin ostaa v&auml;hitellen kunnollisia ja k&auml;ytt&auml;&auml; esim. takana v&auml;liaikaisia kaiuttimia. Lopussa kiitos seisoo - viiden samanlaisen kaiuttimen luoma elokuvan &auml;&auml;nimaisema on todella mukavaa kuultavaa!</p>
						<p>Subwoofer eli subbari toistaa kaikista matalimmat &auml;&auml;net. Sen tulee olla aktiivista tyyppi&auml;, eli siin&auml; on joko itsess&auml;&auml;n vahvistin tai sen yhteydess&auml; on erillinen p&auml;&auml;tevahvistin sek&auml; suodin. Subbaria ei v&auml;ltt&auml;m&auml;tt&auml; tarvita, jos omistaa ennest&auml;&auml;n erinomaisen bassotoiston omaavat p&auml;&auml;kanavat. Edullisen subbarin j&auml;re&auml;ll&auml; bassotoistolla saa esimerkiksi rakentamalla Hifi 100/1 -tyyppisen kaapin, johon on valittavissa erilaisia kaiutinelementtej&auml;. Halvimmat elementit irtoavat alle tuhannen markan, joten puuosineen saattaa itse kaapin saada kasaan jopa tonnilla.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Kuvan esitys</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jotta DVD:n kuvanlaatu p&auml;&auml;sisi oikeuksiinsa, tulisi kuvaa esitt&auml;&auml; v&auml;hint&auml;&auml;n 16:9-kuvasuhteella varustetussa televisiossa. Useimmille levyille kuva on tallennettu anamorfisena ja tarkoitettu esitett&auml;v&auml;ksi 16:9-muodossa. Signaali tulisi vied&auml; joko S-video-liit&auml;nn&ouml;in vahvistimen kautta tai RGB-muodossa suoraan scart-kaapelilla televisioon. Komposiittiliit&auml;nn&auml;n tarjoama kuvanlaatu ei ole riitt&auml;v&auml; DVD-k&auml;yt&ouml;ss&auml;. Sen perusongelmia ovat mm. v&auml;ripintojen ep&auml;tasaisuus, ter&auml;vien yksityiskohtien sekoittuminen toisiinsa ja juoksevat v&auml;riraidat kirkkaiden yksityiskohtien ymp&auml;rill&auml;. Kuva on silminn&auml;hden huonompi kuin S-video- tai RGB-liit&auml;nt&ouml;jen kautta.
						<p>Hyvill&auml; liit&auml;nn&ouml;ill&auml; televisioon saadaan erinomainen kuva DVD:lt&auml;. Itse asiassa se on niin tarkka, ettei katsoja kykene erottamaan siit&auml; kaikkia yksityiskohtia. Perusongelma onkin television liian pieni kuva. Vaikka televisio olisi laajakuvamallia, j&auml;&auml; kuva varsin pieneksi. Kun laajakuvamallin tuumat mitataan samalla tapaa kulmasta kulmaan kuin perinteisiss&auml;kin televisioissa, on esimerkiksi 28&quot; laajakuvatelevisiossa jonkin verran matalampi kuva kuin perinteisess&auml; mallissa. Kuvaa voi yritt&auml;&auml; parantaa hankkimalla suuremman television, mutta niiden hinta kohoaa nopeammin kuin tuumat. Yli 30-tuumaisen laajakuvatelevision hinnalla saa jo keskinkertaisia videotykkej&auml;.</p>
						<p>Videotykki onkin paras tapa kuvan esitt&auml;miseen kotiteatterissa. Kuvan tuumakoolla ei t&auml;m&auml;n j&auml;lkeen ole muuta rajaa kuin k&auml;ytetyn huoneen koko eli kuinka kaukaa kuvan saa heijastettua. Ongelma onkin usein siin&auml;, ett&auml; kuvasta tulee liian iso, jos tykki ja kangas sijoitetaan niille parhaiten sopiviin paikkoihin. Suuri kuva tarjoaa kuitenkin enemm&auml;n. Pienetkin yksityiskohdat nousevat esiin ja esitys saa elokuvateatterimaisen ilmeen. Kolikon k&auml;&auml;nt&ouml;puoli on sitten videotykkien korkeahko hinta. Kunnollinen tykki maksaa kymmeni&auml; tuhansia, t&auml;ydellinen jopa sata tuhatta tai ylikin. Jos ei halua sijoittaa niin paljon, on pakko tyyty&auml; kompromisseihin.</p>
						<p>Videotykkej&auml; on kahdenlaisia. Aito videotykki on kolmella kuvaputkella toteutettu suurikokoinen ja raskas laite, jonka kuvan konvergointi on aikaaviev&auml; toimenpide. Huonona puolena on l&auml;hes t&auml;ydellinen kiinteys: jos tykki&auml; v&auml;h&auml;nkin siirret&auml;&auml;n, on kuva konvergoitava uudelleen. Lis&auml;ksi kuvaa on todella vaikea saada virheett&ouml;m&auml;ksi, aina tahtoo j&auml;&auml;d&auml; johonkin nurkkaan konvergenssivirheit&auml;.</p>
						<p>Konvergoinnin vaikeuden tajuaa, kun tarkastelee kuvanluontitekniikkaa. Tykiss&auml; on kolme mustavalkoista kuvaputkea, joiden kuva heijastetaan eriv&auml;risten (punainen, vihre&auml; ja sininen) lasien ja eritt&auml;in valovoimaisten linssien l&auml;pi valkokankaalle. N&auml;m&auml; kolme kuvaa pit&auml;&auml; sijoittaa tarkalleen p&auml;&auml;llekk&auml;in, jotta muodostuisi v&auml;rikuva. Siksi kuvan s&auml;&auml;t&ouml;j&auml; t&auml;llaisessa laitteessa on kymmenitt&auml;in. Ajan oloon putket kuluvat, ja muutaman tuhannen k&auml;ytt&ouml;tunnin j&auml;lkeen alkaa kuvanlaatu pudota. Edess&auml; on kallis remontti, putkien uusinta.</p>
						<p>Edullisien tykkien kirous on se, ett&auml; kun TV-kuva heijastetaan suureksi, tulevat vaakajuovat n&auml;kyviin ik&auml;v&auml;n selv&auml;sti. Siksi paremmissa malleissa onkin juovatuplain, joka nostaa juovataajuuden SVGA-tasoiseksi ja t&auml;ll&auml; tavoin kuvan juovituksesta tulee tuplasti tihe&auml;mpi. Hyv&auml;n&auml; puolena n&auml;iss&auml; putkilaitteissa on kuitenkin niiden l&auml;hes t&auml;ydellinen hiljaisuus ja parempi kuva verrattuna saman hintaluokan LCD-tykkeihin. Perinteist&auml; putkitykki&auml; edustaa mm. Selecon SVP350, joka on edullisen hintansa vuoksi (noin 25000 mk) varsin suosittu kotiteatteriharrastajien keskuudessa. T&auml;m&auml; malli korvaa television, se sis&auml;lt&auml;&auml; TV-virittimen ja teksti-TV:n ja siin&auml; on kaukos&auml;&auml;din. Juovatuplaimella varustettu malli on noin tuplasti kalliimpi.</p>
						<p>Putkitykin vaihtoehto on lampulla toteutettu videotykki, yleisemmin videoprojektoriksi kutsuttu. Se toimii diaprojektorin tavoin; valo tulee lampusta ja dian paikalla on LCD- tai mikropeilipaneeli - LCD-pohjaiset ovat yleisimpi&auml;. LCD-projektori voi olla hyvinkin pieni ja kevyt laite. Laitteen siirtely on vaivatonta, ja koska kuva tulee yhdest&auml; linssist&auml; ulos, ei tarkennuksen lis&auml;ksi muuta s&auml;&auml;t&ouml;&auml; tarvita. Kuvan konvergenssi on aina kohdallaan. Siksi LCD-tykit ovatkin yleistyneet datak&auml;yt&ouml;ss&auml;. Samalla niist&auml; on tullut mielenkiintoinen vaihtoehto kotiteatteriharrastajalle edullisen hintansa vuoksi.</p>
						<p>Kannattaa kuitenkin katsoa mit&auml; hankkii - halpa dataprojektori ei toisinaan sovellu laisinkaan videok&auml;ytt&ouml;&ouml;n, koska sit&auml; ei ole suunniteltu siihen. Se, ett&auml; laitteessa on liit&auml;nn&auml;t videosignaalille ei takaa sen soveltumista videok&auml;ytt&ouml;&ouml;n. Videosignaali on lomitettua, ja jotkut tykit eiv&auml;t t&auml;t&auml; hallitse - vaakasuuntaiset liikkeet aikaansaavat kuvan hajoamisen juoviksi yms. Kannattaa aina katsoa, ennen kuin ostaa. Kaikkien lampulla toimivien projektorien kirous ovat niiden tuulettimet. Mallista riippuen &auml;&auml;nt&auml; l&auml;htee enemm&auml;n tai v&auml;hemm&auml;n, eik&auml; t&auml;h&auml;n sovellukseen ole olemassa &quot;noise killereit&auml;&quot;.</p>
						<p>LCD-projektoreiden hinnat alkavat noin viidest&auml;tuhannesta markasta. Halvimmissa malleissa kuvan pikselit ovat suuria ja n&auml;ytt&auml;&auml; kuin kuvan p&auml;&auml;ll&auml; olisi verkko. Lampun teho voi olla my&ouml;s alhainen, ja se rajaa suurimman mahdollisen kuvan koon. Halvimmissa projektoreissa k&auml;ytet&auml;&auml;n diaprojektorin tapaan halogeenipolttimoa. Yleisempi on kuitenkin metallihalidilamppu, joka antaa huomattavasti kirkkaamman kuvan. Maksimaalista kirkkautta ei kuitenkaan kannata hakea. Kirkkaudella on my&ouml;s k&auml;&auml;nt&ouml;puolensa - kirkas lamppu antaa niin paljon valoa, ett&auml; musta alkaa muuttua harmaaksi, koska paneelin ollessa &quot;kiinni&quot; valoa p&auml;&auml;see viel&auml; siit&auml; l&auml;pi. Ongelma poistuu jos kuvakokoa suurentaa.</p>
						<p>LCD-projektorien huonona puolena ovat kontrastiongelmat, eli jos kuvaa vertaa TV-kuvaan, tahtoo joko vaaleasta tai tummasta p&auml;&auml;st&auml; j&auml;&auml;d&auml; osa yksityiskohtia toistumatta. Ongelmallisimpia ovat h&auml;m&auml;r&auml;ss&auml; kuvatut osuudet, samoin kuin ulkona kuvatut osuudet, joista vaikkapa taivaalla olevat pilvet helposti katoavat valkoiseksi pinnaksi. Paperilla puhutaan usein kontrastisuhteesta. Parempilaatuisissa LCD-projektoreissa on yhden v&auml;rillisen LCD-paneelin sijasta kolme mustavalkoista, ja n&auml;iden kuvat yhdistet&auml;&auml;n v&auml;rilliseksi v&auml;rilasien ja optiikan avulla. N&auml;in saavutetaan parempi kontrastisuhde.</p>
						<p>Videotykki on toteutuksestaan riippumatta kallis laite. Lis&auml;ksi on syyt&auml; muistaa, ett&auml; my&ouml;s k&auml;ytt&ouml; maksaa. Putkitykkien putket kuluvat loppuun 5000-10000 tunnissa, ja uudet putket maksavat jopa tuhansia markkoja kappale. Halpojen LCD-projektoreiden halogeenipolttimot kest&auml;v&auml;t muutamia satoja tunteja ja maksavat pari kolme sataa. Metallihalidilamput kest&auml;v&auml;t tuhansia tunteja ja maksavatkin tyypillisesti muutamia tuhansia markkoja. Videotykin k&auml;ytt&ouml; maksaa toteutustavasta riippumatta keskim&auml;&auml;rin markan tunnissa.</p>
						<p>Tykkiesitys vaatii l&auml;hes t&auml;ydellisen pimeyden. Kuva kyll&auml; n&auml;kyy h&auml;m&auml;r&auml;ss&auml;kin, mutta v&auml;rikyll&auml;isyys k&auml;rsii. Mit&auml; suurempi kuva, sit&auml; pime&auml;mpi huone tarvitaan. Onhan elokuvateatterissakin t&auml;ysin pime&auml;&auml;, vaikka projektoreiden xenon-lamput ovat kilowattien tehoisia ja konehuone on siksi usein kuuma paikka ty&ouml;skennell&auml;. Omakotitalossa kannattaa rakentaa kotiteatterihuone kellariin, mik&auml;li se on mahdollista. Pienet ikkunat on helppo peitt&auml;&auml; pysyv&auml;sti. Jos rakentaa teatterin olohuoneeseen, on hankittava tehokkaat pimennysverhot tai rajoitettava k&auml;ytt&ouml; ainoastaan pimeisiin syksy- ja talvi-iltoihin.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Teatterihuoneen rakentaminen</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">J&auml;rjestelm&auml;n rakennus kannattaa aloittaa siit&auml;, ett&auml; suunnittelee katselutilaksi aiotun huoneen sijoittelun. Jos huone ei ole neli&ouml;m&auml;inen, tulee katselusuunta valita siten, ett&auml; se on samansuuntainen huoneen pituuden kanssa. Sohvan tai istuinten taakse tulisi j&auml;&auml;d&auml; tilaa.
						<p>Lopullinen &auml;&auml;nentoisto riippuu kaiuttimien (ja varsinkin subbarin) sijoituksesta. 100/1-tyyppisen subbarikaapin tulisi olla pystyasennossa. Ennen johtojen pysyv&auml;&auml; kiinnitt&auml;mist&auml; olisikin hyv&auml;, jos kaiuttimet voisi kytke&auml; vahvistimeen v&auml;liaikaisesti, jolloin erilaisia sijoituksia voisi vapaasti kokeilla ja etsi&auml; sen parhaiten soivan vaihtoehdon. Kokeiluissa kannattaa kuunnella bassotoiston puhtautta, koska se muuttuu eniten. Matalia sinitaajuuksia sis&auml;lt&auml;v&auml; testilevy on korvaamaton apu t&auml;ss&auml; vaiheessa.</p>
						<p>Pyri l&ouml;yt&auml;m&auml;&auml;n ratkaisu, jossa eri bassotaajuudet kuulostavat yht&auml; voimakkailta ja ett&auml; esim. bassorummun aikaansaama ly&ouml;nti&auml;&auml;ni ei &quot;kumise&quot; tai &quot;j&auml;&auml; soimaan&quot; huoneeseen. Jos mahdollista, huone tulisi akustoida parhaan &auml;&auml;nentoiston saavuttamiseksi. Bassokorostumien korjaus vaatii esim. Helmholzin resonaattorin, jonka suunnittelu ja rakennus on varsin vaativa teht&auml;v&auml;. Kaikkien kaiuttimien tulisi olla loitolla sein&auml;st&auml; noin metrin verran. K&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml; on yleens&auml; varsin hankala toteuttaa varsinkin uusissa taloissa, joissa on todella pienet huoneet.</p>
						<p>Takavuosina huoneen aiheuttamat resonanssit sai osittain kuriin k&auml;ytt&auml;m&auml;ll&auml; taajuuskorjainta. Digitaalisessa kotiteatterissa t&auml;m&auml; ei en&auml;&auml; ole mahdollista, vaan kuuntelutilan akustiikka ja kaiuttimet on viritett&auml;v&auml; soimaan niin hyvin kuin mahdollista. Huone on laitteiston heikoin lenkki, ja se vaikuttaa kaikkein eniten lopputulokseen - jos akustiikka on huono, ei auta vaikka olisi kuinka kallis laitteisto. Siksi t&auml;h&auml;n vaiheeseen kannattaa todella k&auml;ytt&auml;&auml; aikaa!</p>
						<p>Kun huoneen asettelu on selvill&auml; ja kaiuttimet paikoillaan, voidaan tuumia sopiva sijoituspaikka itse laitteistolle. Laitteiston tulisi olla helposti k&auml;ytett&auml;viss&auml; katselupaikalta v&auml;hint&auml;&auml;n kaukos&auml;&auml;timen avulla.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Laitteiston liit&auml;nn&auml;t</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">AV-vahvistimissa on tyypillisesti viisi p&auml;&auml;teastetta. T&auml;m&auml; tarkoittaa sit&auml;, ett&auml; laitteen per&auml;&auml;n voidaan kytke&auml; viisi kaiutinta, jotka toistavat digitaalisen monikanava&auml;&auml;nen viisi tasa-arvoista kanavaa: vasen, oikea ja keskikanava sek&auml; vasen ja oikea takakanava. Subbarille ei ole p&auml;&auml;teastetta, vaan s&auml;&auml;tyv&auml;tasoinen linjal&auml;ht&ouml;, joka kelpaa sellaisenaan subbarin p&auml;&auml;tevahvistimelle. Aktiivisuodinta ei digitaalisessa kotiteatterissa tarvita, sill&auml; AV-vahvistimen teht&auml;v&auml; on ohjata matalimmat &auml;&auml;net subbarille ja leikata sama taajuusalue pois p&auml;&auml;kanavilta. Joissakin vahvistimissa jakotaajuutta voi s&auml;&auml;t&auml;&auml;.
						<p>Itse ohjelmal&auml;hteiden liit&auml;nn&auml;t on neuvottu laitteiden k&auml;ytt&ouml;ohjeessa varsin selke&auml;sti. Jonkinlaiseksi standardiksi ovat kuitenkin muodostuneet erilaiset liittimien v&auml;rit vahvistimen takapaneelissa. Keskiosaltaan keltaiset RCA-liittimet ovat tyypillisesti komposiittisignaalille tarkoitettuja. T&auml;t&auml; signaalia saadaan kaikista videol&auml;hteist&auml;. S-video-liittimet ovat takapaneelin tasossa (ei koholla) olevia py&ouml;reit&auml; nelinapaisia naarasliittimi&auml;, joissa on yksi suurempi kolo keskiosan tienoilla. S-video-signaalia saa mm. DVD-soittimelta tai S-VHS videonauhurilta.</p>
						<p>Valkoisilla ja punaisilla sis&auml;osilla varustetut RCA-liit&auml;nn&auml;t ovat analogisia &auml;&auml;niliit&auml;nt&ouml;j&auml;. Valkoinen on vasen kanava ja punainen oikea. Monikanavaiset analogiset sis&auml;&auml;nmenot tai l&auml;hd&ouml;t ovat yleens&auml; erillisen&auml; kuuden tai kahdeksan RCA-liittimen rypp&auml;in&auml;. Niiss&auml; k&auml;ytet&auml;&auml;n kanavien indikointiin esimerkiksi seuraavia lyhenteit&auml;: FL=etuvasen (front left), FR=etuoikea (front right), C = keskikanava (center), SL=takavasen (left surround), SR=takaoikea (right surround), LFE=subbari (low frequency effects). N&auml;it&auml; liit&auml;nt&ouml;j&auml; ei tarvita, mik&auml;li vahvistimessa on dekooderi digitaaliselle monikanava&auml;&auml;nelle.</p>
						<center>
							<p><img height="263" width="350" src="kuvat/mystery.jpg" border="0" alt=" "></p>
						</center>
						<p><i>Harrastuksen edetess&auml; ja liit&auml;nt&ouml;jen t&auml;yttyess&auml; kehittyy tilanne t&auml;m&auml;n n&auml;k&ouml;iseksi vahvistimen takana.</i></p>
						<p>Digitaalinen monikanava&auml;&auml;ni liitet&auml;&auml;n joko koaksiaalisella kaapelilla RCA-liit&auml;nt&auml;&auml;n tai valokuidulla toslink-tyyppiseen liit&auml;nt&auml;&auml;n, ei siis molemmilla! Optisissa toslink-liit&auml;nn&ouml;iss&auml; on muoviset suojatupit, jotka saa vet&auml;m&auml;ll&auml; pois. Digitaalisen &auml;&auml;nikaapelin lis&auml;ksi muita kytkent&ouml;j&auml; &auml;&auml;nelle ei tarvita - kaikki kanavat menev&auml;t k&auml;tev&auml;sti yht&auml; kaapelia pitkin. My&ouml;s tavallinen CD-soitin kannattaa kytke&auml; digitaalikaapelilla, mik&auml;li soittimessa on digitaalinen l&auml;ht&ouml;. T&auml;ll&auml; tavoin my&ouml;s DTS-CD-levyjen kuuntelu tulee mahdolliseksi.</p>
						<p>Vahvistin tunnistaa digitaali&auml;&auml;nen formaatit automaattisesti, joten samoja liit&auml;nt&ouml;j&auml; voi k&auml;ytt&auml;&auml; niin monikanavaisessa kuin CD-toistossakin. Digitaaliset &auml;&auml;niliit&auml;nn&auml;t voivat olla joko tiettyyn laitteeseen sidottuja tai osoitettavia, jolloin liit&auml;nn&auml;t ovat numeroituja (Optical 1, Optical 2 jne.) ja vahvistimen asetuksista m&auml;&auml;r&auml;t&auml;&auml;n, mik&auml; laite on miss&auml;kin digitaalitulossa. Mik&auml;li on tarvetta nauhoittaa analogisilla laitteilla CD:lt&auml; tai esimerkiksi DVD:lt&auml; videolle, joudutaan my&ouml;s analogiset &auml;&auml;niliit&auml;nn&auml;t kytkem&auml;&auml;n kaksikanavaista &auml;&auml;nt&auml; varten. Vahvistin ei konvertoi digitaali&auml;&auml;nt&auml; &auml;&auml;nitysliit&auml;nt&ouml;ihin. &Auml;l&auml; koskaan liit&auml; koaksiaalista digitaali&auml;&auml;nt&auml; analogisiin &auml;&auml;nisis&auml;&auml;nmenoihin, vaikka liittimet ovatkin samanlaisia.</p>
						<p><font size="2">Elokuvan &auml;&auml;nimaailmasta ja kotiteatterin historiasta ja nykytilanteesta voit lukea lis&auml;&auml; artikkelin ensimm&auml;isest&auml; osasta, <a href="kotiteatteri_1.html" target="_self">&quot;Historiasta nykyp&auml;iv&auml;&auml;n&quot;</a>. Oman kotiteatterin laitteiston s&auml;&auml;d&ouml;ist&auml; ja levyjen hankinnasat jatkaa artikkelin kolmas osa, <a href="kotiteatteri_3.html" target="_self">&quot;S&auml;&auml;t&ouml;&auml; ja elokuviin&quot;</a>.</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font size="2">Monikanavaisista &auml;&auml;nij&auml;rjestelmist&auml; l&ouml;yt&auml;&auml; lis&auml;tietoja mm. osoitteista <a href="http://www.dolby.com" target="_blank">www.dolby.com</a> ja <a href="http://www.dtstech.com" target="_blank">www.dtstech.com</a>.</font>
						<p><font size="2">Dolby ja tupla-D-symboli ovat Dolby Laboratoriesin rekister&ouml;ityj&auml; tavaramerkkej&auml;. DTS ja DTS Digital Surround ovat Digital Theater Systems Inc.:n rekister&ouml;ityj&auml; tavaramerkkej&auml;. Kaikki oikeudet pid&auml;tet&auml;&auml;n.</font></td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
