<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Digitaaliajan kotiteatteri - historiasta nykyp&auml;iv&auml;&auml;n</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Heikkinen &lt;<a href="mailto:oh4kju@sci.fi">oh4kju@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><font size="2">Historiasta nykyp&auml;iv&auml;&auml;n | <a href="kotiteatteri_2.html" target="_self">Kotiteatteria rakentamaan</a> | <a href="kotiteatteri_3.html" target="_self">S&auml;&auml;t&ouml;&auml; ja elokuviin</a></font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="370" width="350" src="kuvat/title.jpg" border="0" alt=" "></center>
						<p>Jos vapaa-ajan vietto elokuvien parissa on tullut tavaksi ja olet jo paikallisen elokuvateatterin kanta-asiakas, niin eik&ouml; olisi mukava katsella elokuvia my&ouml;s kotona? Television pieni kuva ja laimea &auml;&auml;nentoisto eiv&auml;t tietenk&auml;&auml;n houkuttele verrattuna siihen esitystapaan, jota leffalipulla saa. Mutta ent&auml;p&auml; jos edes &auml;&auml;nentoisto olisi kotona samaa luokka kuin teatterissa?</p>
						<p>Mik&auml;p&auml; olisi tehokkaampaa rentoutumista kuin unohtaa hetkeksi arkihuolet uppoutumalla mielielokuvan tapahtumiin suuren kuvan ja monikanavaisen digitaali&auml;&auml;nen siivitt&auml;m&auml;n&auml;? Suuri kuva ja ymp&auml;rille aukeava &auml;&auml;nimaisema tuntuvine tehosteineen tempaavat katsojan mukaan elokuvan tapahtumiin. Esitys on niin miellytt&auml;v&auml;, ettei mik&auml;&auml;n &auml;rsyt&auml; siin&auml; - ja katsoja voi itse p&auml;&auml;tt&auml;&auml; esimerkiksi &auml;&auml;nenvoimakkuudesta. Kaiken huomionsa voi kiinnitt&auml;&auml; elokuvasta nauttimiseen, eik&auml; tarvitse kantaa huolta muusta. Ty&ouml;p&auml;iv&auml;n tapahtumista j&auml;&auml;nyt stressi alkaa hiljakseen laantua elokuvan edetess&auml;...</p>
						<p>Pelk&auml;ll&auml; televisiolla ei t&auml;llainen tietenk&auml;&auml;n toteudu. Ensinn&auml;k&auml;&auml;n elokuva ei p&auml;&auml;se oikeuksiinsa pieness&auml; ruudussa, ja varsinkin &auml;&auml;ni kokee TV:n kaiuttimissa kovan kohtalon. Ja juuri kun elokuvan tapahtumat alkavat kehitty&auml;, r&auml;m&auml;ht&auml;v&auml;t ruutuun kova&auml;&auml;niset mainokset. Puhumattakaan siit&auml;, ett&auml; kyseisen kanavan esitt&auml;m&auml; versio elokuvasta on sensuroitu, lyhennetty ylisuuren mainosmyynnin vuoksi ja survottu v&auml;kisin TV-ruudun mittasuhteille, jolloin alkuper&auml;isest&auml; kuvasta puuttuu l&auml;hes puolet. Stressik&auml;yr&auml; alkaa nousta sen sijaan ett&auml; se laskisi. Taas katsojaa halvennetaan.</p>
						<p>T&auml;m&auml; artikkeli perehdytt&auml;&auml; lukijan kotiteatteriharrastuksen saloihin. Termi kotiteatteri on aika uusi, koska elokuvien esitt&auml;minen kotona mahdollisimman korkealaatuisena - teatterimaisesti - on ollut mahdollista vasta v&auml;h&auml;n aikaa. Kuvapuolella kotiesitykset ovat viel&auml; roimasti j&auml;ljess&auml; teattereiden 35 mm filmin laadusta televisiotekniikan hitaan kehityksen vuoksi. Televisiokuvan tarkkuus ei ole juurikaan parantunut siit&auml; mit&auml; se on ollut televisiotoiminnan alussa, ja kaikki kotiesityksiin k&auml;yt&ouml;ss&auml; olevat tekniikat perustuvat siihen. Sen sijaan &auml;&auml;nipuolella on edistytty viimeisten kahden vuosikymmenen aikana suurin harppauksin.</p>
						<p>Elokuvateattereiden &auml;&auml;nentoisto on ollut aina askeleen edell&auml; kotona esitett&auml;vien elokuvien &auml;&auml;nentoistoa, mutta viime vuosina ero on alkanut tasaantua. T&auml;m&auml; artikkeli keskittyykin p&auml;&auml;osin &auml;&auml;nentoistoon, mutta my&ouml;s kotiteatterin kuvan toistoa k&auml;sitell&auml;&auml;n lyhyesti. Artikkelissa my&ouml;s kerrotaan oikeiden elokuvateattereiden &auml;&auml;nentoistosta, ja lukija p&auml;&auml;see kurkistamaan konehuoneen puolellekin.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Alussa oli mono...</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">1920-luvulla elokuvien &auml;&auml;nentoisto oli hyvin toissijainen seikka, ja l&auml;hinn&auml; olikin hienoa, ett&auml; elokuvissa ylip&auml;&auml;t&auml;&auml;n oli &auml;&auml;ni. Hyvin pitk&auml;&auml;n elokuvia katseltiin mono&auml;&auml;nen varassa, ja elokuvateattereissa k&auml;ytetyt kaiuttimet olivat hyvin heikkolaatuisia toistoltaan. Filmille &auml;&auml;ni tallennettiin optisesti, niin ett&auml; se saatettiin lukea teattereissa varsin yksinkertaisesti valokennon avulla.
						<p>Varsin pian &auml;&auml;nielokuvien yleistytty&auml; kehittyi my&ouml;s kaiutintekniikka, mutta valitettavasti se ei tuonut parannusta teatteri&auml;&auml;neen, sill&auml; asennuksissa p&auml;&auml;paino oli edelleen saada &auml;&auml;nentoisto mykkiin teattereihin. T&auml;m&auml; vei resurssit muiden teattereiden &auml;&auml;nentoiston parantamiselta. Tuonaikaiset elokuvat jouduttiin &auml;&auml;nitt&auml;m&auml;&auml;n siten ett&auml; ne kuuluivat hyvin yleisimmill&auml;, heikkolaatuisilla kaiuttimilla. Siten parempaa kaiutintekniikkaa ei p&auml;&auml;sty hy&ouml;dynt&auml;m&auml;&auml;n vaikka sellaiset olisivatkin olleet asennettuina.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Kun stereo keksittiin</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">1950-luvulla alkoi televisio yleisty&auml;. Se tiesi menetyksi&auml; elokuva-alalle, sill&auml; nyt ihmisill&auml; oli mahdollisuus katsella elokuvia kotona. Kilpajuoksu katsojista oli alkanut. Oli aika keksi&auml; jotain, jolla saada ihmiset pois televisioidensa &auml;&auml;rest&auml;. Niinp&auml; syntyi uusi filmiformaatti, 70 mm Cinemascope-filmi, joka toi leve&auml;n kuvan teattereihin. Samalla my&ouml;s &auml;&auml;ni laitettiin uusiksi. Siin&auml; hy&ouml;dynnettiin alan viimeisint&auml; tekniikkaa, ja n&auml;in 70-millinen filmi sai laidoilleen magneettiset &auml;&auml;niraidat. Mutta montako kanavaa tarvittaisiin tuottamaan mahdollisimman luonnollinen &auml;&auml;nimaisema?
						<p>Harva on kuullut koskaan siit&auml;, ett&auml; alkuper&auml;inen stereoj&auml;rjestelm&auml; 1930-luvulla k&auml;sitti kolme kanavaa. My&ouml;hemmin, kun stereoj&auml;rjestelm&auml;&auml; alettiin tuoda kotik&auml;ytt&ouml;&ouml;n 1950-luvun loppupuolella, oli siin&auml; vain kaksi kanavaa. N&auml;in siksi, ett&auml; tuolloin jo standardiksi muodostunut LP-levy ei kyennyt tarjoamaan tallennusmahdollisuutta useammille kanaville. Niinp&auml; kaksikanavaisesta muodostui standardi, jota mm. radiokanavat alkoivat my&ouml;hemmin noudattaa. Ihmiskunnan t&auml;n&auml; p&auml;iv&auml;n&auml; tuntema stereoj&auml;rjestelm&auml; onkin todellisuudessa karsittu versio alkuper&auml;isest&auml;...</p>
						<p>Kenties suomalainen &auml;&auml;nentoistoguru Tapio K&ouml;ykk&auml;kin tiesi t&auml;m&auml;n kehitelless&auml;&auml;n 1970-luvulla kolmikanavaista Ortoperspekta-stereotaan, joka matriisin avulla loi kaksikanavaisesta &auml;&auml;nityksest&auml; varsin avaran &auml;&auml;nikuvan kolmella kaiuttimella. K&ouml;yk&auml;n el&auml;m&auml;nty&ouml;t&auml; jatkaa viel&auml; nyky&auml;&auml;nkin Kino&auml;&auml;ni-niminen yritys, joka markkinoi Ortoperspektaan pohjautuvaa Voima Opus 3D -vahvistintaan. Ortoperspekta ei koskaan saavuttanut suuren yleis&ouml;n suosiota, mutta sill&auml; on yh&auml; nykyp&auml;iv&auml;kin vankka kannattajajoukkonsa (aivan kuin Amigalla tietokonepiireiss&auml;).</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Monikanava&auml;&auml;nt&auml; jo 50-luvulla!</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Elokuva-alan ammattilaisillekaan ei kaksi kanavaa riitt&auml;nyt. Niinp&auml; 70-millisiin ymp&auml;ttiin parhaimmillaan jopa seitsem&auml;n erillist&auml; &auml;&auml;nikanavaa, joista viisi ohjattiin salin etuosaan, valkokankaan taakse sijoitettuihin kaiuttimiin ja kaksi salin takaosassa oleviin kaiuttimiin. Viel&auml; nyky&auml;&auml;nkin elokuvateatterit rakennetaan siten, ett&auml; etukaiuttimet ovat valkokankaan takana. Teattereiden valkokankaat on valmistettu akustisesti l&auml;pin&auml;kyv&auml;st&auml; materiaalista, ts. ne l&auml;p&auml;isev&auml;t &auml;&auml;nt&auml; muuttamatta sit&auml; juuri laisinkaan. L&auml;helt&auml; katsottuna teatterikangas on t&auml;ynn&auml; pieni&auml; reiki&auml;.
						<p>My&ouml;s 35-millisill&auml; filmeill&auml; voitiin k&auml;ytt&auml;&auml; nelj&auml;&auml; magneettista &auml;&auml;niraitaa, samalla kun leve&auml; 70-millisen filmin kuva &quot;puristettiin&quot; 35-milliselle anamorfisella linssill&auml;. Kun elokuvaa esitett&auml;ess&auml; k&auml;ytettiin samanlaista linssi&auml;, saatiin leve&auml; kuva takaisin, aivan kuin olisi esitetty 70-millist&auml; filmi&auml;. N&auml;in ollen samoja elokuvia oli mahdollista esitt&auml;&auml; kummaltakin filmileveydelt&auml;. Samalla oli syntynyt nykyaikaisen monikanava&auml;&auml;nen esiaste.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Taantuma takaisin monoon</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">70-luvulla elokuva-ala koki jonkinlaisen laman, ja yleiseksi muodostunut monikanavainen 70-millinen formaatti alkoi k&auml;yd&auml; liian kalliiksi levityskustannuksiltaan. Lis&auml;ksi magneettinen &auml;&auml;niraita kesti huonosti k&auml;yt&ouml;ss&auml;. V&auml;hitellen 70-milliset alkoivat kaikota teattereista ja palattiin takaisin 35-millisiin monokopioihin optisella &auml;&auml;niraidalla.
						<p>Optisella raidalla varustettu filmi on k&auml;tev&auml; levitt&auml;&auml;, koska &auml;&auml;ni kopioituu samalla kuvan kanssa, eik&auml; &auml;&auml;nen vuoksi aiheudu lis&auml;kustannuksia. Lis&auml;ksi optinen &auml;&auml;niraita kest&auml;&auml; k&auml;ytt&ouml;&auml;. Leve&auml; kuva oli kuitenkin tullut j&auml;&auml;d&auml;kseen, ja niinp&auml; se muodostui standardiksi huippuelokuvissa. Leve&auml;t kuvasuhteet ovat k&auml;yt&ouml;ss&auml; nyky&auml;&auml;nkin - valtaosa elokuvista on anamorfisesti tallennettuja, ja esitett&auml;ess&auml; k&auml;ytet&auml;&auml;n Cinemascope-optiikkaa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Nykyaikaisen &auml;&auml;nen kehitys</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">70-luvulla stereofonisuus yleistyi kotik&auml;yt&ouml;ss&auml; ja termi HiFi oli tuolloin muotisana. Nyt kotona oli parempi &auml;&auml;nentoisto kuin elokuvateatterissa, mutta hifilaitteita ei k&auml;ytetty elokuvien &auml;&auml;nentoistoon, koska niiden mono&auml;&auml;ni toimi aivan hyvin my&ouml;s television omalla kaiuttimella.
						<p>Kymmenyksen loppupuolella Dolby Laboratories esitteli uuden &auml;&auml;nentoistotekniikan elokuvateattereihin. Nyt optinen mono&auml;&auml;niraita oli jaettu kahdeksi &auml;&auml;niraidaksi, joihin oli patentoidulla tekniikalla tallennettu kanavien keskin&auml;ist&auml; vaihe-eroa hy&ouml;dyksik&auml;ytt&auml;en nelj&auml; &auml;&auml;nikanavaa. Elokuvaa esitett&auml;ess&auml; nuo kaksi kanavaa johdettiin matriisiin, joka erotteli kanavat. Kahdesta lis&auml;kanavasta toinen sijaitsi salin edess&auml; keskell&auml;, vasemman ja oikean kanavan v&auml;liss&auml; valkokankaan takana ja toinen salin per&auml;p&auml;&auml;ss&auml; jaettuna useisiin rinnankytkettyihin kaiuttimiin.</p>
						<p>Uusien kanavien lis&auml;ksi tekniikka toi mukanaan Dolby A:ksi kutsutun kohinanvaimennuksen, joka kadotti optisen &auml;&auml;niraidan rahinat kuulumattomiin. Koska Dolbyn menetelm&auml; oli optinen, se nostanut filmien levityskustannuksia ja siten se yleistyikin varsin nopeasti, ainakin suurimpiin teattereihin.</p>
						<p>My&ouml;s kotik&auml;ytt&ouml;&ouml;n sai Dolby Surround-dekoodereita, joilla kaksikanavaisesta stereo&auml;&auml;nest&auml; sai esiin kolmannen kanavan, ns. Surround-kanavan, joka johdettiin katsojan takana sijaitseviin kaiuttimiin. J&auml;rjestelm&auml; ei kuitenkaan viel&auml; ollut kovin yleinen, ja perusongelmana elokuvia ajatellen oli se, ettei stereofonisia elokuvia saanut kuin LaserDiscill&auml;. Joillakin videonauhoilla saattoi olla stereo&auml;&auml;ni, mutta ennen hifivideoiden yleistymist&auml; se oli varsin heikkolaatuinen.</p>
						<p>Vuonna 1987 esitteli Dolby parannetun version j&auml;rjestelm&auml;st&auml;&auml;n, Dolby SR:n (Spectral Recording). Se pohjautui edelleen samaan optiseen formaattiin, mutta tarjosi paremman taajuustoiston ja dynamiikan kuin Dolby A. Samaan aikaan my&ouml;s kotik&auml;ytt&ouml;&ouml;n julkaistiin uusi j&auml;rjestelm&auml;, Dolby Pro Logic. Se noudatti samaa toimintaperiaatetta kuin teattereiden Dolby SR ja toi viimein my&ouml;s nelj&auml;nnen kanavan (keskikanavan) kotik&auml;ytt&auml;jille. Hifivideoita alkoi nyt saada yleisesti kaupasta ja samalla my&ouml;s vuokranauhojen &auml;&auml;niraidat muuttuivat monosta hifi-stereoksi. Elokuvateatterista tuttu &auml;&auml;nentoisto oli nyt mahdollista kotona!</p>
						<p>Vuosikymmenen vaihduttua alkoivat stereofoniset TV-l&auml;hetykset suomessakin, kun digitaalinen nicam-&auml;&auml;ni otettiin k&auml;ytt&ouml;&ouml;n. Uusimmat hifivideot sis&auml;lsiv&auml;t nicam-dekooderin ja niinp&auml; omat stereonauhoitukset tulivat mahdollisiksi. Kotiteatteriharrastajat saivat j&auml;lleen syyn p&auml;ivitt&auml;&auml; laitteistoaan. Kun TV-l&auml;hetyksi&auml;kin saattoi nyt vastaanottaa stereona, alkoivat Dolby Surround ja Pro Logic laitteet kiinnostaa ihmisi&auml; laajemminkin, ja termi kotiteatteri alkoi yleisty&auml;.</p>
						<p>Kovimmat harrastajat eiv&auml;t kuitenkaan tyytyneet TV-kanavien ja videovuokraamojen torsoihin, vaan ostivat elokuvansa yksitt&auml;in LaserDiscill&auml;, joka takasi CD-tasoisen digitaalisen kaksikanava&auml;&auml;nen ja widescreen-kuvan, joka noudatti samoja kuvasuhteita kuin elokuvateatterissakin. 90-luvun alkupuoli olikin LaserDiscin kulta-aikaa. LaserDisc oli kuitenkin analoginen j&auml;rjestelm&auml;, ts. kuvasignaali on tallennettu levylle analogisena.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Digitaali&auml;&auml;ni tulee</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Dolby-dekoodereiden (matriisien) perusongelmana oli kuitenkin mm. takakanavan rajallinen taajuusvaste. Kaksikanavaisen vaihe-erotallennuksen vuoksi ei takakanavaan dekoodattua &auml;&auml;nisignaalia voitu esitt&auml;&auml; t&auml;ydell&auml; taajuusvasteella, vaan takakaiuttimista ajettiin ulos vain keski&auml;&auml;nialuetta. Siksi takakaiuttimiksi riittiv&auml;t pienet efektikaiuttimet p&auml;&auml;kanavien huolehtiessa valtaosasta &auml;&auml;nentoistoa. Muutenkin p&auml;&auml;kanavien &auml;&auml;nen sekaan koodattujen lis&auml;kanavien &auml;&auml;nimaisema oli varsin riippuvainen p&auml;&auml;kanavien &auml;&auml;nimateriaalista, eik&auml; parhaimmallakaan matriisilla kyetty erottelemaan eri kanavia toisistaan t&auml;ydellisesti.
						<p>Digitaalisen &auml;&auml;nentoiston yleistymisen johdosta olikin jo aika laittaa elokuvateattereiden &auml;&auml;nentoisto uusiksi. Dolby oli j&auml;lleen asialla, ja vuonna 1992 k&auml;ytt&ouml;&ouml;n tulleena j&auml;rjestelm&auml;n&auml; t&auml;ll&auml; kertaa Dolby SRD (Spectral Recording Digital) eli Dolby Digital. T&auml;m&auml; j&auml;rjestelm&auml; on k&auml;yt&ouml;ss&auml; nyky&auml;&auml;nkin. Nyt kanavia on kuusi, joista viisi on t&auml;yden taajuusalueen kanavaa ja yksi ns. subwoofer-kanava, joka sis&auml;lt&auml;&auml; vain kaikkein matalimmat &auml;&auml;net. Matriisij&auml;rjestelm&auml; sai lopulta j&auml;&auml;d&auml; toissijaiseksi, vanhempien teattereiden tekniikaksi. Kaiuttimien sijoitteluun uusi j&auml;rjestelm&auml; ei vaikuta, standardiksi oli jo muodostunut kolme kanavaa edess&auml; plus takakanava, mutta nyt takakanava jakaantuu vasemmaksi ja oikeaksi takakanavaksi.</p>
						<p>Uuden j&auml;rjestelm&auml;n tarjoama taajuusvaste on tietenkin viivasuora ja dynamiikka j&auml;risytt&auml;v&auml;. Merkitt&auml;vin ero matriisiin on kuitenkin siin&auml;, ett&auml; kaikki kuusi kanavaa ovat t&auml;ysin riippumattomia toisistaan, ja nyt oli ensi kertaa mahdollista &auml;&auml;nitt&auml;&auml; jokaiselle raidalle t&auml;ysin erilaista &auml;&auml;nimateriaalia. Uusi digitaalinen &auml;&auml;ni t&auml;ytt&auml;&auml; salin aivan eri tavalla kuin vanha; jokainen kanava omaa oman itsen&auml;isen &auml;&auml;nimaailmansa. Filmille &auml;&auml;ni on tallennettu Dolbyn tapaan - optisena! Dolby Digital -&auml;&auml;niraita on piilotettu filmin toiseen laitaan vetoreikien v&auml;liin (ks. kuva), samalla kun my&ouml;s vanha analoginen Dolby SR -&auml;&auml;niraita on mukana. Koska tilaa on v&auml;h&auml;n, on &auml;&auml;nidata s&auml;&auml;st&ouml;koodattu digitaalisesti. T&auml;ll&auml; tavoin voitiin kuitenkin edelleen mahdollistaa &auml;&auml;nen kopioituminen kuvan mukana, mik&auml; takasi helpon filmilevityksen ja digitaali&auml;&auml;nen samalla filmill&auml; analogisen kanssa, jotta filmi olisi toistettavissa kaikissa teattereissa.</p>
						<center>
							<p><img height="170" width="350" src="kuvat/filmi.jpg" border="0" alt=" "></center>
					</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Kilpailijat kehittyv&auml;t</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Dolby ei kuitenkaan kokenut 90-luvun digitaaliaikaa yksin. Niinp&auml; Dolby Digital sai nopeasti kilpailevia j&auml;rjestelmi&auml;, joista merkitt&auml;vin on vuonna 1993 esitelty DTS (Digital Theater System). T&auml;m&auml; j&auml;rjestelm&auml; eroaa Dolby Digitalista siten, ettei &auml;&auml;nt&auml; ole tallennettu filmille. Sen sijaan filmill&auml; on optisten &auml;&auml;niraitojen vieress&auml; aikakoodiraita, jonka avulla CD-ROM-levyilt&auml; tuleva &auml;&auml;niraita tahdistetaan filmiin. Koska DTS-&auml;&auml;ni on tyypillisesti parilla kolmella CD-ROM-levyll&auml;, on tilaa &auml;&auml;nelle runsaammin kuin Dolby Digitalissa ja siksi voidaan k&auml;ytt&auml;&auml; lievemp&auml;&auml; s&auml;&auml;st&ouml;koodausta.
						<p>DTS tarjoaakin paremman &auml;&auml;nenlaadun kuin Dolby Digital. Yksi DTS:n tavaramerkki on sen nollaan hertsiin asti ulottuva taajuustoisto (Dolby Digitalissa alin taajuus 20 Hz), joka tuo &auml;&auml;nitehosteisiin tuntumaa! Kanavarakenteeltaan DTS on samanlainen kuin Dolby Digital. DTS on kuitenkin eritt&auml;in mukautuva j&auml;rjestelm&auml;, ja sit&auml; voidaan k&auml;ytt&auml;&auml; hyvinkin erilaisissa formaateissa. Esimerkiksi tavallinen musiikki-CD voidaan &auml;&auml;nitt&auml;&auml; monikanavaiseksi DTS:n avulla, ja t&auml;ll&auml; tavoin &auml;&auml;nitettyj&auml; musiikkilevyj&auml; on saatavilla. T&auml;m&auml; tekeekin DTS:st&auml; mielenkiintoisen ja monik&auml;ytt&ouml;isen formaatin kotik&auml;ytt&ouml;&ouml;n.</p>
						<center>
							<p><img height="291" width="350" src="kuvat/kino1.jpg" border="0" alt=" "></p>
						</center>
						<p><i>Elokuvateatterin &auml;&auml;nentoistolaitteistoa. Yll&auml; DTS-6D, laite synkronoi CD-ROM-levylt&auml; tulevat DTS-&auml;&auml;niraidat filmilt&auml; luettuun aikakoodiin ja muuttaa ne analogiseen muotoon. Keskell&auml; Dolby CP500 -&auml;&auml;niprosessori, joka tukee optisia &auml;&auml;niraitoja: Mono, Dolby A, Dolby SR, Dolby SRD (Dolby Digital). DTS-&auml;&auml;ni sy&ouml;tet&auml;&auml;n analogisena 5.1-sis&auml;&auml;nmenon kautta. Alinna elokuvakoneen k&auml;ytt&auml;j&auml;n &auml;&auml;nimonitori. N&auml;ist&auml; &auml;&auml;ni sy&ouml;tet&auml;&auml;n alapuolella oleville kolmelle stereop&auml;&auml;tteelle (eiv&auml;t n&auml;y kuvassa), joilla kaikki kuusi kanavaa vahvistetaan. Tehoa p&auml;&auml;terykelm&auml;st&auml; l&ouml;ytyy 6 x 600W.</i></p>
						<p>Kolmas digitaali&auml;&auml;nij&auml;rjestelm&auml; elokuvateattereissa on SDDS (Sony Dynamic Digital Sound), joka ei ole kuitenkaan kovin yleinen. Koko maailmassa on vain muutama sata SDDS-&auml;&auml;nell&auml; varustettua teatteria. SDDS on suunniteltu suuriin elokuvateattereihin (valkokankaat kymmenien metrien levyisi&auml;), jolloin kolme etukanavaa ei en&auml;&auml; riit&auml; luomaan portaatonta suuntavaikutelmaa etu&auml;&auml;niin. SDDS pohjautuukin vanhaan 70-milliseen formaattiin, ja siin&auml; on viisi etukanavaa, kaksi takakanavaa sek&auml; subwoofer-kanava (ns. 7.1-formaatti).</p>
						<p>SDDS-&auml;&auml;niraita on tallennettu optisesti filmin laidoille, josta se luetaan samaan tapaan kuin Dolby Digital -&auml;&auml;niraitakin. &Auml;&auml;niraidan sijoitus on kuitenkin ongelmallinen. Projektoreiden filmiradat on rakennettu siten, ett&auml; ne tarttuvat filmiin ainoastaan laidoista - jotta kuva-alueelle ei tulisi naarmuja. Niinp&auml; kaikki naarmut tulevat filmin laitoihin - SDDS-raidan p&auml;&auml;lle. Sama ongelma vaivaa osin Dolby Digital -&auml;&auml;niraitaakin. Optisten SDDS- ja Dolby Digital -j&auml;rjestelmien toiminta ei ole aivan samaa luokkaa DTS:n kanssa, jossa filmill&auml; on vain aikakoodi, joka sekin sijaitsee turvassa naarmuilta aivan kuva-alueen vieress&auml;.</p>
						<center>
							<p><img height="224" width="350" src="kuvat/kino2.jpg" border="0" alt=" "></p>
						</center>
						<p><i>Elokuvaprojektorin filmiradan loppup&auml;&auml;t&auml;. Huomaa filmi&auml; k&auml;sittelevien osien muotoilu. Keskivasemmalla n&auml;kyy optinen analogi&auml;&auml;nen lukulaite.</i></p>
						<p>Sony ei aio tuoda SDDS-j&auml;rjestelm&auml;&auml; kotik&auml;ytt&auml;jien ulottuville. Toisaalta siit&auml; ei olisi mit&auml;&auml;n iloakaan kotona, koska kolmellakin etukanavalla saadaan pieness&auml; tilassa riitt&auml;v&auml;n tarkka etusuuntaavuus. T&auml;m&auml; ei kuitenkaan tarkoita kehityksen pys&auml;htymist&auml; 5.1-kanavaiseen j&auml;rjestelm&auml;&auml;n. Jo nyt on olemassa 6.1-j&auml;rjestelm&auml;t Dolby Digital EX ja DTS-ES, joissa taaksekin on lis&auml;tty keskikanava. Takakeskikanava saadaan aikaan lis&auml;&auml;m&auml;ll&auml; Pro Logic -tyyppinen matriisi takakanaville. Digitaalinen &auml;&auml;niraita itsess&auml;&auml;n ei muutu miksik&auml;&auml;n, kyse on vain toistotekniikasta, eli mik&auml;li kumpaankin takakanavaan on &auml;&auml;nitetty sama informaatio, kuuluu t&auml;m&auml; uudessa j&auml;rjestelm&auml;ss&auml; takakeskikanavasta.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>THX</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Vastoin varsin yleist&auml; kuvitelmaa Lucasfilmin THX ei ole &auml;&auml;nentoistoj&auml;rjestelm&auml;. THX on er&auml;&auml;nlainen sertifikaatti, joka m&auml;&auml;rittelee, kuinka elokuvateatteri tulee rakentaa, asentaa ja kalibroida. THX-normi ottaa kantaa teknisiin, kuvan- ja &auml;&auml;nentoistoon liittyviin seikkoihin. Normin tarkoitus on taata katsojalle, ett&auml; THX-hyv&auml;ksytyss&auml; teatterissa on paras mahdollinen kuva sek&auml; &auml;&auml;ni. THX m&auml;&auml;r&auml;&auml; esimerkiksi sen, millainen kuuntelusalin tulee olla mm. taustametelin ja akustiikan osalta, samoin &auml;&auml;nenvoimakkuudet kullekin kanavalle. Ne katsojat, jotka valittavat ett&auml; &auml;&auml;ni on teatterissa liian kovalla, eiv&auml;t ole THX-normin mukaan rakennettuja ihmisi&auml;, eik&auml; heit&auml; t&auml;ll&ouml;in ole lupa k&auml;ytt&auml;&auml; THX-sertifioidussa teatterissa katsojina! ;-)
						<p>Jos rakennettavalle teatterille aiotaan hakea THX-hyv&auml;ksynt&auml;&auml;, tulee se rakentaa eritt&auml;in tarkkojen normien mukaan. L&auml;hes jokainen asia on m&auml;&auml;ritelty, jotkut yksityiskohdat ovat jopa varsin huvittavia. Elokuvateatterin valmistuttua se joutuu testiin, ja mik&auml;li kaikki on kunnossa, my&ouml;nnet&auml;&auml;n sertifikaatti. Koko touhu on tietenkin tuhottoman kallista, ja kielt&auml;m&auml;tt&auml; touhussa haisee rahastuksen maku. Voihan salin kuitenkin pyrki&auml; rakentamaan THX-sertifikaatin mukaiseksi, vaikkei sille hyv&auml;ksynt&auml;&auml; hakisikaan.</p>
						<p>My&ouml;s kotik&auml;ytt&ouml;&ouml;n on saatavissa THX-sertifioituja laitteita, joiden hinta on tietenkin tavallisia runsaasti korkeampi. Kotiteatterilleen voi jopa hankkia THX-sertifioinnin, mik&auml;li omaa runsaasti ylim&auml;&auml;r&auml;ist&auml; valuuttaa, eik&auml; mill&auml;&auml;n keksi mihin ne tuhlaisi...</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>P&auml;ivityskierteeseen kotonakin</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Muutama vuosi Dolby Digitalin julkaisusta se tuli mahdolliseksi my&ouml;s kotik&auml;yt&ouml;ss&auml;. Vuonna 1995 julkaistiin ensimm&auml;iset LaserDisc-levyt, joissa oli Dolby Digital -koodattu &auml;&auml;niraita. Nyt tarvittiin soitin, jossa oli ns. AC-3-formaatin mukainen digitaalinen &auml;&auml;niulostulo sek&auml; Dolby Digital -dekooderilla varustettu vahvistin. Valitettavasti j&auml;rjestelm&auml; oli mahdollinen vain NTSC-levyill&auml;, joissa oli digitaali&auml;&auml;nen lis&auml;ksi my&ouml;s analoginen kaksikanava&auml;&auml;ni. NTSC oli kuitenkin LaserDisceiss&auml; &quot;de facto&quot; -standardi, sill&auml; suurin osa julkaistusta materiaalista oli nimenomaan NTSC-formaatissa. N&auml;in siksi, ett&auml; LD oli eritt&auml;in suosittu Yhdysvalloissa. L&auml;hes kaikki uudet elokuvat oli mahdollista ostaa LaserDiscin&auml;.
						<p>Yksi suurimmista esteist&auml; LaserDiscin yleistymiselle koko kansan ulottuville oli levyjen korkeahko hinta sek&auml; suomenkielisen tekstityksen puuttuminen. LaserDisceill&auml;h&auml;n ei juuri tekstityst&auml; k&auml;ytetty, joskin joillakin levyill&auml; oli closed caption -j&auml;rjestelm&auml;n mukainen tekstitys kuulemisesteisille tai sitten monikielinen tekstitys teksti-TV:n avulla. Teksti&auml; ei kuitenkaan saanut n&auml;kyviin ilman asianmukaisia laitteita tai teksti-TV:t&auml;. Niinp&auml; LaserDisc olikin suosittu vain kovimpien harrastajien keskuudessa, jotka antoivat enemm&auml;n painoarvoa kunnolliselle kuvalle ja monikanava&auml;&auml;nelle kuin suomenkieliselle tekstille.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>DVD tulee</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tekstitysongelma ratkesi lopullisesti, kun DVD esiteltiin vuonna 1997. Nyt samalla levyll&auml; saattoi olla tekstitys jopa kymmenill&auml; eri kielill&auml;, ja my&ouml;s &auml;&auml;niraitoja voi olla lukuisia, esimerkiksi dubbaukset eri kielill&auml;. Samalla my&ouml;s kuvanlaatu koki aimo harppauksen eteenp&auml;in, kun kuvakin muuttui t&auml;ysin digitaaliseksi, MPEG-2 standardin mukaisesti pakatuksi dataksi. LP-levyn kokoinen paksu ja raskas levy muuttui CD-levyn kokoiseksi, mutta tarjosi kuitenkin kaiken sen mit&auml; LaserDisc - ja enemm&auml;nkin. Koska DVD on huomattavasti edullisempi valmistaa kuin LD, oli selv&auml;&auml; ett&auml; LaserDisc-levyt alkoivat v&auml;henty&auml; ja tilalle astuivat DVD:t.
						<center>
							<p><img height="255" width="350" src="kuvat/dvdvsld.jpg" border="0" alt=" "></p>
						</center>
						<p><i>Kuvassa Terminator 2 ennen ja nyt. Yll&auml; LaserDisc-versio, joka k&auml;sitt&auml;&auml; kaksi k&auml;&auml;nnett&auml;v&auml;&auml; levy&auml;. Elokuvan esityksen aikana tulee kaksi taukoa, ensin k&auml;&auml;nnet&auml;&auml;n levy ja toisella kerralla vaihdetaan. Toisen levyn B-puolella on puolen tunnin dokumentti elokuvan teosta. Levyill&auml; on digitaalinen, kaksikanavainen PCM-&auml;&auml;niraita. Vasemmalla alhaalla Terminator 2 Ultimate Edition DVD, kaksipuoleinen DVD-levy, jonka A-puolella on elokuvasta kolme erilaista versiota. Alkuper&auml;isen teatteriversion lis&auml;ksi levyll&auml; on toinen 15 minuuttia pidempi ja kolmas viel&auml; 5 minuuttia sit&auml;kin pitempi versio, ja kumpikin sis&auml;lt&auml;&auml; kohtauksia, jotka on j&auml;tetty alun perin pois! Kaikissa versioissa on kolme &auml;&auml;niraitaa, Dolby Digital Stereo, Dolby Digital 5.1 EX ja DTS 5.1 ES. Levy on THX-sertifioitu ja sis&auml;lt&auml;&auml; THX-testiraidat. Levyn B-puolella on useita tunteja extramateriaalia, useita dokumentteja ja mm. elokuvan k&auml;sikirjoitus. Levyll&auml; on my&ouml;s DVD-ROM osuus.</i></p>
						<p>Tyypillisell&auml; DVD:ll&auml; on ekstroja, eli erilaisia taustatietoja levyll&auml; olevasta elokuvasta, &quot;behind the scenes&quot; -tyyppisi&auml; dokumentteja, n&auml;yttelij&ouml;iden haastatteluja, &auml;&auml;niraidat elokuvan l&auml;pi n&auml;yttelij&ouml;iden omilla kommenteilla, interaktiivista viihdett&auml;, pelej&auml;, elokuvatrailereita yms. Vain julkaisijan mielikuvitus asettaa rajat sille, mit&auml; kaikkea oheismateriaalia DVD:ll&auml; voi olla mukana. Oheismateriaalin m&auml;&auml;r&auml; riippuukin julkaisijasta. Joillakin levyill&auml; on l&auml;hinn&auml; vain pelkk&auml; elokuva ja aneeminen alkuvalikko, josta voi valita tekstityksen sek&auml; &auml;&auml;niraidan kielet ja halutun kohtauksen, kun taas toisilla levyill&auml; on upeat animoidut ja &auml;&auml;nell&auml; varustetut valikot monimutkaisine puurakenteineen, ja lis&auml;sis&auml;lt&ouml;&auml; voi olla jopa tunteja!</p>
						<p>DVD itsess&auml;&auml;n on vapaa formaatti kuten CD:kin, eli sen ei v&auml;ltt&auml;m&auml;tt&auml; tarvitse olla videolevy. Samalla DVD:ll&auml; voi olla videon lis&auml;ksi my&ouml;s DVD-ROM-osuus, jota voi k&auml;ytt&auml;&auml; DVD-ROM-asemalla varustetussa tietokoneessa. Esimerkiksi elokuvassa Matrix on DVD-ROM-osuus. DVD:t&auml; aiotaan tulevaisuudessa k&auml;ytt&auml;&auml; my&ouml;s &auml;&auml;nilevyn&auml;, sill&auml; DVD:lle mahtuu moninkertainen m&auml;&auml;r&auml; dataa CD:hen verrattunam ja siten sille voidaan tallentaa musiikkia studiolaatuisena, esimerkiksi 24-bittisen&auml; 96 kHz n&auml;ytetaajuudella, tai monikanavaisena. Tavallinen CD k&auml;ytt&auml;&auml; 16-bittisi&auml; n&auml;ytteit&auml; 44,1 kHz n&auml;ytetaajuudella.</p>
						<p>Levyjen edullisuuden vuoksi DVD:st&auml; on alkanut tulla koko kansan formaatti. Nyky&auml;&auml;n my&ouml;s soittimien hinnat ovat pudonneet, eik&auml; kulu kauan, kun DVD l&ouml;ytyy l&auml;hes jokaisesta kodista. Ja mik&auml; parasta - monikanavainen &auml;&auml;ni kuului DVD:n perusominaisuuksiin heti alusta asti!</p>
						<p>DVD:ll&auml;k&auml;&auml;n ei Dolby Digital ollut pitk&auml;&auml;n se ainoa formaatti. Se sai heti kaverikseen MPEG Multichannel -&auml;&auml;nityksen, joka kuitenkin j&auml;i varsin harvinaiseksi ja katosi lopulta kokonaan. Sen sijaan teattereista tuttu DTS on olemassa DVD-levyjen vaihtoehto&auml;&auml;niraitana, ja se tarjoaa entist&auml;kin luonnonmukaisemman &auml;&auml;nentoiston. Koska DTS-&auml;&auml;ni vie kuitenkin enemm&auml;n tilaa levylt&auml; kuin Dolby Digital, se on viel&auml; toistaiseksi varsin harvinaista herkkua ja l&ouml;ytyy l&auml;hinn&auml; valikoiduista huippuelokuvista, ja kuinkas muuten kuin pohjoisamerikkalaisista NTSC-levyist&auml; ilman suomenkielisi&auml; tekstej&auml;...</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Aluekoodit</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">DVD:ll&auml; on n&auml;ht&auml;viss&auml; sama ilmi&ouml; kuin LaserDisceill&auml;kin. Pohjoisamerikkalaisten NTSC-levyjen tarjonta on moninkertainen eurooppalaisiin verrattuna ja elokuvat ovat huomattavasti uudempia. Ehk&auml;p&auml; filmiyhti&ouml;t olivat jo LD:n aikana havainneet, ett&auml; levyj&auml; tilattiin innokkaasti Yhdysvalloista Eurooppaan, ja levyll&auml; saattoi jopa saada samoja elokuvia, jotka py&ouml;riv&auml;t vasta teattereissa! Teatterivoittojen maksimoimiseksi elokuvien julkaisuaikoja haluttiin kontrolloida, ja DVD-j&auml;rjestelm&auml;&auml;n luotiin kotik&auml;ytt&auml;jien kiusaksi aluekoodij&auml;rjestelm&auml;.
						<p>J&auml;rjestelm&auml;n ideana on jakaa maapallon mantereet eri alueiksi siten, ettei toisen alueen levyj&auml; voi toistaa toiselta alueelta ostetussa soittimessa. Esimerkiksi Yhdysvallat ja Kanada k&auml;sitt&auml;v&auml;t aluekoodin 1 (harrastajien keskuudessa puhutaan region 1:sta tai R1:sta), kun taas Eurooppa kuuluu Japanin kanssa alueeseen 2 (R2). Alueilla myyd&auml;&auml;n vain kyseisen alueen koodilla varustettuja levyj&auml; ja soittimia. Levyt voivat olla my&ouml;s koodivapaita tai sis&auml;lt&auml;&auml; useita aluekoodeja, mutta esimerkiksi Suomesta ostetulla soittimella ei voi toistaa Yhdysvalloista ostettua uutuusleffaa, vaikka jokainen DVD-soitin osaisi toistaa my&ouml;s NTSC-levyj&auml; PAL-levyjen lis&auml;ksi!</p>
						<p>Sanomattakin on selv&auml;&auml;, etteiv&auml;t harrastajat katsoneet asiaa hyv&auml;ll&auml;, ja niinp&auml; DVD-soittimia alettiin hakkeroida. Hyvin nopeasti maakoodien hakkeroinnista muodostui laajamittainen bisnes, jota t&auml;n&auml;kin p&auml;iv&auml;n&auml; py&ouml;ritt&auml;v&auml;t useat firmat Suomessakin. Todenn&auml;k&ouml;isesti mink&auml; tahansa kaupasta saatavan DVD-soittimen voi muutattaa maakoodittomaksi, ja se maksaa muutamasta satasesta noin tuhanteen markkaan.</p>
						<p>P&auml;&auml;syy t&auml;h&auml;n hakkerointiin l&ouml;ytyy kuitenkin elokuvayhti&ouml;iden p&auml;&auml;tt&auml;jist&auml;, jotka pit&auml;v&auml;t huolen siit&auml;, ett&auml; elokuvat ilmestyv&auml;t Euroopassa DVD:lle todella hitaasti, ja valikoima rajoittuu vain suosituimpiin nimikkeisiin, joiden arvellaan myyv&auml;n parhaiten. Miksip&auml; tyyty&auml; vain Euroopan levyihin, jos tulee toimeen ilman suomenkielist&auml; tekstityst&auml;kin?</p>
						<p><font size="2">[Toim.huom.: t&auml;m&auml; tilanne on tosin pikku hiljaa muuttumassa, sill&auml; R2-nimekkeiden m&auml;&auml;r&auml; on viimeisen vuoden aikana kasvanut l&auml;hes eksponentiaalisesti. Lis&auml;ksi dollarin huima kurssi t&auml;ll&auml; hetkell&auml; (7 markan hujakoilla) on sy&ouml;nyt R1-levyjen tilaamisen etua.] </font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Macrovision</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Koska DVD:n digitaalinen kuvanlaatu on ylivoimainen, olisi siit&auml; mahdollista tehd&auml; t&auml;ydellisi&auml; VHS-kopioita, joiden kuvanlaatu ylitt&auml;isi vuokrakasettien kuvanlaadun. Kun &quot;viisaat&quot; elokuvayhti&ouml;iden p&auml;&auml;tt&auml;j&auml;t tiesiv&auml;t DVD:n ylivoimaisesta kuvanlaadusta, olivat he heti huolissaan laajamittaisesta piratismista. Niinp&auml; DVD sai kotik&auml;ytt&auml;jien riesaksi toisenkin rajoituksen, VHS-vuokranauhoista tutun Macrovision-suojauksen. Se est&auml;&auml; elokuvan nauhoittamisen VHS-videonauhurilla. Suojatun materiaalin kopiointiyritys aikaansaa todella huonolaatuisen kopion, jossa kuvan kirkkaus ja v&auml;rit menev&auml;t sekaisin. Kuvasta tulee katselukelvoton.
						<p>Macrovision perustuu videosignaalin n&auml;kym&auml;tt&ouml;mille alueille (teksti-tv juovat sek&auml; juovatahdistuspulssien ja kuvasignaalien v&auml;linen musta alue) sijoitettuihin voimakkaisiin h&auml;irint&auml;pulsseihin. N&auml;m&auml; pussit sekoittavat jokaisessa VHS-videossa olevan automaattisen kuvasignaalin tasons&auml;&auml;d&ouml;n, joka tavallisesti s&auml;&auml;t&auml;&auml; sis&auml;&auml;ntulevan videosignaalin tason sopivaksi nauhoitusta varten. J&auml;rjestelm&auml; on tavallaan sama kuin automaattinen &auml;&auml;nitystason s&auml;&auml;t&ouml;. Televisiossa ei t&auml;llaista s&auml;&auml;t&ouml;&auml; ole, ja siksi Macrovision-suojattua materiaalia voidaan esitt&auml;&auml; h&auml;iri&ouml;tt&auml; useimmissa televisioissa.</p>
						<p>Idea Macrovisionin sis&auml;llytt&auml;misest&auml; DVD-soittimiin oli kuitenkin huono. On nimitt&auml;in olemassa televisioita ja videotykkej&auml; (mm. Sony-merkkisin&auml;), jotka eiv&auml;t ole yhteensopivia Macrovision-j&auml;rjestelm&auml;n kanssa. Suojaus aiheuttaa h&auml;iri&ouml;it&auml; kuvaan jopa katseltaessa elokuvaa ilman mit&auml;&auml;n laittomia kopiointiyrityksi&auml;. Lis&auml;ksi j&auml;rjestelm&auml; ei est&auml; mill&auml;&auml;n muotoa laajamittaista piratismia, sill&auml; ammattilaisilla ja my&ouml;s kotik&auml;ytt&ouml;&ouml;n on hankittavissa laitteita joilla suojauksesta p&auml;&auml;see eroon. Niinp&auml; Marcovision on pelkk&auml; riesa, joka sekin on suosittu hakkeroinnin kohde DVD-soittimissa.</p>
						<p>Onneksi Macrovision-signaali ei liity DVD-levyill&auml; olevaan kuvadataan mill&auml;&auml;n muotoa. Levyll&auml; on ainoastaan bitti, joka m&auml;&auml;r&auml;&auml; onko suojaus p&auml;&auml;ll&auml; vai ei. Varsinainen h&auml;irint&auml;signaali luodaan itse soittimessa, tarkemmin sen videoenkooderipiiriss&auml;, joka rakentaa digitaalisesta videodatasta analogista videosignaalia. N&auml;in ollen suojaus on mahdollista ohittaa samalla tavalla kuin maakoodikin, ja Macrovisionin poistosta maakoodimodifikaation yhteydess&auml; onkin muodostunut er&auml;&auml;nlainen &quot;standardi&quot;. K&auml;yt&auml;nn&ouml;ss&auml; soittimen modifiointi tarkoittaa soittimessa olevan ohjelmiston p&auml;ivityst&auml;, joka samalla lakkauttaa laitteen takuun l&auml;hes poikkeuksetta.</p>
						<p><font size="2">Oman kotiteatterin rakentamisesta ja laitteiden hankkimisesta jatkaa artikkelin toinen osa, <a href="kotiteatteri_2.html" target="_self">&quot;Kotiteatteria rakentamaan&quot;</a>. Laitteiden s&auml;&auml;d&ouml;st&auml; ja elokuvien hankinnasta kertoo kolmas osa, <a href="kotiteatteri_3.html" target="_self">&quot;S&auml;&auml;t&ouml;&auml; ja elokuviin&quot;</a>.</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font size="2">Monikanavaisista &auml;&auml;nij&auml;rjestelmist&auml; l&ouml;yt&auml;&auml; lis&auml;tietoja mm. osoitteista <a href="http://www.dolby.com" target="_blank">www.dolby.com</a> ja <a href="http://www.dtstech.com" target="_blank">www.dtstech.com</a>.</font>
						<p><font size="2">Dolby ja tupla-D-symboli ovat Dolby Laboratoriesin rekister&ouml;ityj&auml; tavaramerkkej&auml;. DTS ja DTS Digital Surround ovat Digital Theater Systems Inc.:n rekister&ouml;ityj&auml; tavaramerkkej&auml;. Kaikki oikeudet pid&auml;tet&auml;&auml;n.</font></td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
