<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Digitaaliajan kotiteatteri - s&auml;&auml;t&ouml;&auml; ja elokuviin</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Heikkinen &lt;<a href="mailto:oh4kju@sci.fi">oh4kju@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><a href="kotiteatteri_1.html" target="_self"><font size="2">Historiasta nykyp&auml;iv&auml;&auml;n</font></a><font size="2"> | <a href="kotiteatteri_2.html" target="_self">Kotiteatteria rakentamaan</a> | S&auml;&auml;t&ouml;&auml; ja elokuviin</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Vahvistimen asetukset</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Digitaalidekoodereilla varustetussa vahvistimessa on runsaasti asetuksia. Ne tulee k&auml;yd&auml; l&auml;pi k&auml;ytt&ouml;ohjeen kera laitteen ensimm&auml;isell&auml; k&auml;ytt&ouml;kerralla. T&auml;rkeimm&auml;t asetukset ovat kaiuttimia koskevat. P&auml;&auml;kanavista on asetettavissa niiden koko (large/small), k&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml; tarkoittaa niiden bassotoistoa. Asetus toimii siten, ett&auml; large-asentoon asetetuille kaiuttimille menee t&auml;ysi taajuusalue ja small-asentoon asetetuilta kaiuttimilta leikataan bassoalue pois ja se johdetaan joko subbarille tai p&auml;&auml;kanaville riippuen niiden asetuksista. Jos et k&auml;yt&auml; erillist&auml; subbaria, aseta etukanavat asentoon large, jolloin vahvistin ohjaa basso&auml;&auml;net niihin. Jos sinulla on pienet takakaiuttimet, aseta niihin small, jolloin takakanavien basso&auml;&auml;net ohjataan etukanaviin. Sama koskee keskikanavaa. Jos k&auml;yt&auml;t subbaria, voit asettaa kaikki kaiuttimet small-asentoon, subbarille on my&ouml;s on/off-asetus.
						<p>Jos sinulla on hyv&auml;n bassotoiston omaavat p&auml;&auml;kanavat ja lis&auml;ksi viel&auml; subbarikin, voit kokeilla asettaa etukanavat asentoon large ja subbarin p&auml;&auml;lle. T&auml;ll&ouml;in subbariin menee pelkk&auml; LFE-kanava kuunneltaessa monikanava&auml;&auml;nt&auml;. T&auml;ss&auml; on kuitenkin vaarana, ett&auml; kaksikanavaisia l&auml;hteit&auml; kuunneltaessa kuuluvat samat bassotaajuudet sek&auml; subbarista ett&auml; p&auml;&auml;kanavista. T&auml;llaista tilannetta ei saisi synty&auml;, koska se sotkee bassotoiston totaalisesti! Mik&auml;li subbarin jakotaajuus on asetettavissa, aseta se reilusti p&auml;&auml;kanaviesi toistoalueen alarajan yl&auml;puolelle, esimerkiksi 80-100 Hz. Jakotaajuus on se rajataajuus, joka rajaa subbarille menev&auml;t taajuudet p&auml;&auml;kanaville menevist&auml; taajuuksista. Jakotaajuudella voi vaikuttaa my&ouml;s bassotoistoon varsin paljon, joten paras arvo l&ouml;ytyy viimek&auml;dess&auml; kuuntelemalla.</p>
						<p>Perusasetusten j&auml;lkeen tulee kunkin kaiuttimen et&auml;isyys metreiss&auml; s&auml;&auml;t&auml;&auml;. Mittaa v&auml;limatkat ja sy&ouml;t&auml; ne vahvistimeen. T&auml;m&auml;n tiedon avulla kanavien &auml;&auml;nisignaalia viiv&auml;stet&auml;&auml;n siten, ett&auml; kaikkien kanavien &auml;&auml;ni saapuu kuulijan korvaan mahdollisimman tarkasti samalla hetkell&auml;. T&auml;m&auml; on t&auml;rke&auml;&auml;, jotta tilavaikutelma v&auml;littyisi mahdollisimman todentuntuisena.</p>
						<p>Lopuksi on vuorossa kanavien keskin&auml;isen voimakkuuden s&auml;&auml;t&ouml;. Mik&auml;li sinulla on viisi samanlaista kaiutinta suurin piirtein yht&auml; et&auml;&auml;ll&auml; kuuntelupaikalta, selvi&auml;t helpolla: t&auml;ll&ouml;in voit asettaa kaikkien kanavien tasoksi 0 dB eli s&auml;&auml;t&ouml;alueen keskelle. Muussa tapauksessa s&auml;&auml;t&ouml; k&auml;ynnistet&auml;&auml;n aktivoimalla testikohina, joka kuuluu vuorollaan eri kanavista. Yrit&auml; s&auml;&auml;t&auml;&auml; voimakkuudet siten, ett&auml; kohina kuulostaa yht&auml; voimakkaalta kaikista kaiuttimista.</p>
						<p>Vaikeinta on subbarin tasons&auml;&auml;t&ouml;. L&auml;hes poikkeuksetta subbari soi liian kovalla aloittelevalla kotiteatteriharrastajalla. Oikea taso l&ouml;ytyy vasta pitk&auml;llisen kuuntelun tuloksena. Matalia sinitaajuuksia sis&auml;lt&auml;v&auml;&auml; testilevy&auml; kannattaa k&auml;ytt&auml;&auml; apuna ja pyrki&auml; siihen, ett&auml; toiston siirtyminen p&auml;&auml;kanavilta subbarille jakotaajuuden kohdalla tapahtuisi mahdollisimman tasaisesti ja ett&auml; eri bassotaajuudet kuulostaisivat yht&auml; voimakkailta. Sopivan alkuasetuksen l&ouml;yt&auml;&auml;, kun kuuntelee reilusti jakotaajuuden yl&auml;puolelta (esim. 150 Hz) ja sen alapuolelta (esim. 40 Hz) olevia sinitaajuuksia vuorollaan ja yritt&auml;&auml; s&auml;&auml;t&auml;&auml; n&auml;iden keskin&auml;isen voimakkuuden samaksi. Testitaajuuksia kannattaa muutella, kuitenkin siten ett&auml; alempi taajuus menee subbarin toistoalueelle ja toinen p&auml;&auml;kanavien.</p>
						<p>Mik&auml;li sinulla on analoginen, 5.1-liit&auml;nn&ouml;in varustettu kotiteatterivahvistin ja dekooderilla varustettu DVD-soitin, l&ouml;ytyv&auml;t edell&auml; kuvatut s&auml;&auml;d&ouml;t DVD-soittimesta.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>DVD:n asetukset</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">My&ouml;s dekooderittomissa DVD-soittimissa on asetuksia, jotka s&auml;&auml;det&auml;&auml;n olemassa olevalle laitteistolle sopiviksi. Esimerkiksi digitaalinen &auml;&auml;nil&auml;ht&ouml; (digital out) vaatii perusasetusten tekemisen, jotta erilaiset &auml;&auml;niformaatit toistuisivat oikein. Dolby Digital -monikanava&auml;&auml;nen ulostuloformaatti pit&auml;&auml; asettaa. Yleens&auml; t&auml;ss&auml; asetuksessa on kaksi vaihtoehtoa; Dolby Digital tai esim. bitstream tarkoittaa, ett&auml; Dolby Digital tulee ulos monikanavaisena, digitaalisesti pakattuna signaalina. Mik&auml;li sinulla on dekooderilla varustettu vahvistin, valitse t&auml;m&auml; vaihtoehto. Toinen vaihtoehto on PCM, joka tarkoittaa ett&auml; monikanava&auml;&auml;ni downmixataan kaksikanavaiseksi ja sy&ouml;tet&auml;&auml;n ulos samassa formaatissa kuin CD-soittimelta tuleva pakkaamaton musiikkidata. PCM-asetusta k&auml;ytet&auml;&auml;n vain jos vahvistin ei sis&auml;ll&auml; Dolby Digital -dekooderia, mutta siin&auml; on kuitenkin digitaalinen &auml;&auml;nisis&auml;&auml;nmeno.
						<p>Jos DVD-soitin tukee MPEG Multichannel -&auml;&auml;nij&auml;rjestelm&auml;&auml;, l&ouml;ytyy sillekin edell&auml; kuvatut asetukset. MPEG Multichannel ei koskaan yleistynyt, joten sit&auml; tapaa varsin harvalla levyll&auml;. My&ouml;sk&auml;&auml;n kaikki vahvistimet eiv&auml;t sit&auml; tue. N&auml;in ollen PCM-asetukselle l&ouml;ytyy t&auml;ss&auml; kohdassa useammin k&auml;ytt&ouml;&auml;, jotta &auml;&auml;nen saa kuuluviin edes kaksikanavaisena. Tosin en usko, ett&auml; on olemassa yht&auml;&auml;n DVD:t&auml;, jossa olisi pelkk&auml; MPEG Multichannel -&auml;&auml;ni eik&auml; lainkaan Dolby Digitalia vaihtoehtona.</p>
						<p>DTS-tukea varten ei yleens&auml; ole edell&auml; kuvattuja asetuksia. Sen voi yleens&auml; asettaa vain p&auml;&auml;lle tai pois, PCM-konvertointimahdollisuutta ei ole. Jos vahvistimessasi on DTS-dekooderi, aseta DTS-ulostulo p&auml;&auml;lle.</p>
						<p>Seuraavana tulevat kuvasuhteen m&auml;&auml;ritykset. Vaihtoehtoja on tavallisesti kolme: 4:3 Pan&amp;Scan, 4:3 Letterbox ja 16:9 Widescreen. N&auml;m&auml; m&auml;&auml;ritell&auml;&auml;n sen mukaan, millainen televisio sinulla on. Mik&auml;li TV:si tukee 16:9-kuvasuhdetta, aseta kuvasuhde sellaiseksi. Silloin kuva tulee ulos anamorfisena. Kun TV asetetaan 16:9-tilaan (DVD antaa 16:9 ohjauksen scartin kautta, jos se on kytketty suoraan TV:hen), tapahtuu tavallaan sama kuin elokuvateatterissa Cinemascope-linssill&auml;. T&auml;ll&auml; tavoin DVD:lt&auml; saadaan paras kuvanlaatu. Jos 16:9 ei ole tuettuna, valitse kuvasuhteeksi 4:3 Letterbox, jolloin DVD-soitin konvertoi anamorfisen kuvan normaalin TV:n kuvasuhteelle ja asettaa kuvan ruudun keskelle yl&auml;- ja alalaidan j&auml;&auml;dess&auml; mustiksi. Pan&amp;Scan-vaihtoehtoa ei kannata koskaan valita, koska silloin osa kuvasta voi j&auml;&auml;d&auml; n&auml;kym&auml;tt&ouml;miin.</p>
						<p>Jos olet liitt&auml;nyt DVD-soittimen scart-kaapelilla televisioosi, aseta DVD:n asetuksista RGB-ulostulo p&auml;&auml;lle. Asetus vaikuttaa vain scart-liittimeen. T&auml;ll&auml; tavoin saat TV-ruudulle ter&auml;vimm&auml;n mahdollisen kuvan. Jos k&auml;yt&auml;t soittimen S-video-l&auml;ht&ouml;&auml; ja signaali menee vahvistimen kautta televisiolle, on kuva k&auml;yt&auml;nn&ouml;ss&auml; hyvin l&auml;hell&auml; RGB-laatuista kuvaa, eik&auml; scart-kaapelia tarvitse k&auml;ytt&auml;&auml;.</p>
						<p>Joissakin soittimissa voi valita k&auml;ytett&auml;v&auml;n videonormin, PAL, NTSC tai Multi. T&auml;m&auml; asetus ei vaikuta RGB-ulostuloon. Asetuksella m&auml;&auml;r&auml;t&auml;&auml;n se v&auml;rij&auml;rjestelm&auml;, jonka mukaisena TV:si vastaanottaa signaalia. Multi-asennossa v&auml;rij&auml;rjestelm&auml; m&auml;&auml;r&auml;ytyy k&auml;ytetyn levyn mukaan. K&auml;yt&auml; t&auml;t&auml;, jos sinulla on moninormitelevisio. Jos et omista sellaista, voit kokeilla asettaa v&auml;rij&auml;rjestelm&auml;ksi PAL. Silloin soitin toimii siten, ett&auml; NTSC-levyilt&auml; tulee ulos 60 Hz PALia. T&auml;m&auml; ei ole aivan standardin mukainen signaali, sill&auml; kuvataajuus on NTSC:n mukainen, mutta v&auml;rij&auml;rjestelm&auml;n&auml; on PAL. Jotkut vanhemmat televisiot osaavat kuitenkin n&auml;ytt&auml;&auml; t&auml;llaista signaalia aidon NTSC:n sijasta.</p>
						<p>DiViDo on siit&auml; erikoinen, ett&auml; t&auml;m&auml; asetus vaikuttaa my&ouml;s kuvataajuuteen. NTSC-levyt konvertoituvat standardiksi 50 Hz PAL-signaaliksi, jota voi esimerkiksi nauhoittaa videolle. Normaalistihan NTSC-levyilt&auml; ei voi nauhoittaa tavallisella videonauhurilla. Kuvataajuuden muutos aiheuttaa kuitenkin nykimist&auml;, ja kuvanlaatu heikkenee muutenkin.</p>
						<p>DVD:ss&auml; on my&ouml;s kieliasetuksia. Oletuskieli tekstitykselle kannattaa asettaa suomelle. Suomenkielinen tekstitys k&auml;ynnistyy jatkossa automaattisesti, mik&auml;li sellainen levylt&auml; l&ouml;ytyy. My&ouml;s &auml;&auml;niraidan oletuskielen voi valita. T&auml;h&auml;n kannattaa my&ouml;s m&auml;&auml;ritell&auml; suomi, jos soittimessa joskus toistetaan jotakin suomenkielisell&auml; dubbauksella varustettua lastenelokuvaa. Muihin DVD-elokuviin t&auml;m&auml; asetus ei vaikuta, koska Suomessa ei (luojan kiitos) dubata kaikkia elokuvia. Jos soitin ei l&ouml;yd&auml; suomenkielist&auml; &auml;&auml;niraitaa, valitsee se oletus&auml;&auml;nen (yleens&auml; englanti).</p>
						<p>Joissakin soittimissa voi valita my&ouml;s DVD:n valikkokielen (DVD language). T&auml;h&auml;nkin voi m&auml;&auml;ritell&auml; suomen, valinta toimii silloin, jos levyll&auml; on suomenkieliset valikot (lastenlevyill&auml;). Muihin levyihin valinta ei vaikuta. Erikoisempi kieliasetus, joka on ainakin Pioneerissa, on tekstityksen poisto &auml;&auml;niraidan mukaan (subtitle off). T&auml;ll&auml; voi est&auml;&auml; esimerkiksi suomenkielisen tekstityksen automaattisen k&auml;ynnistymisen silloin kun &auml;&auml;niraitakin on suomenkielinen.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Elokuvien asetukset</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kun laitteiston asetukset ovat kunnossa, p&auml;&auml;set nauttimaan ensimm&auml;isest&auml; DVD-esityksest&auml; kotonasi. Maltti on kuitenkin viel&auml; tarpeen, vaikka olisikin jo kova hinku p&auml;&auml;st&auml; nauttimaan vaivalla tehdyst&auml; ty&ouml;st&auml; ja kalliista hankinnoista. Yleisin virhe, jonka voi malttamattomuuttaan kiirehtim&auml;ll&auml; tehd&auml;, on unohtaa &auml;&auml;niraidan valinta. T&auml;m&auml; sattuu toisinaan vanhemmallekin harrastajalle. Joissakin levyiss&auml; on oletus&auml;&auml;niraitana kaksikanavainen Dolby Digital Stereo -&auml;&auml;niraita, joka toistuu vahvistimelta perinteisen Pro Logic -j&auml;rjestelm&auml;n kautta, ja aito monikanava&auml;&auml;ni j&auml;&auml; kokematta. Vahvistimesi kyll&auml; tukee erilaisia &auml;&auml;niraitavaihtoehtoja ja &auml;&auml;ni kuuluu, valitsipa mit&auml; hyv&auml;ns&auml; - mutta onko &auml;&auml;ni paras mahdollinen?
						<p>Elokuvan k&auml;ynnistyminen riippuu levyst&auml;. Joissakin levyiss&auml; elokuva alkaa suoraan, kun levyn asettaa soittimeen. T&auml;ll&ouml;in &auml;&auml;ni- ja tekstitysasetukset tulevat soittimeen tehtyjen valintojen mukaisesti. Yleisemp&auml;&auml; on kuitenkin se, ett&auml; levyss&auml; siirryt&auml;&auml;n valikkoon heti k&auml;ynnistyksest&auml;. Jos valikosta ei tee mit&auml;&auml;n valintoja, vaan k&auml;ynnist&auml;&auml; elokuvan &quot;play movie&quot; yms. kohdasta, tulee k&auml;ytt&ouml;&ouml;n joko soittimeen tehdyt oletusasetukset tai jotakin muuta, jota levyn julkaisija on valikkoj&auml;rjestelm&auml;&auml;n ohjelmoinut. Siksi olisi aina viisainta k&auml;yd&auml; valitsemassa &auml;&auml;niraita &quot;sound setup&quot; valikosta ja halutut tekstit kohdasta &quot;subtitles&quot; ennen esityksen aloittamista. Valikoiden toteutus on levykohtaista, hienoimmissa valikoissa on el&auml;v&auml;t taustat ja &auml;&auml;niraita. Valikoissa liikutaan kaukos&auml;&auml;timen nuolin&auml;pp&auml;imill&auml; ja enterill&auml;.</p>
						<p>T&auml;rke&auml;t &auml;&auml;ni- ja tekstitysvalikot l&ouml;yt&auml;&auml; nopeimmin painamalla kaukos&auml;&auml;timen audio- tai subtitle-painiketta. Oikea valikko pit&auml;isi tulla silloin esiin. Samoja painikkeita voi k&auml;ytt&auml;&auml; my&ouml;s elokuvan toiston aikana &auml;&auml;niraidan tai tekstityksen valitsemiseksi &quot;lennossa&quot;. Joillakin levyill&auml; t&auml;m&auml; on voitu est&auml;&auml;, ja painikkeista tulee vain estosta kertova ikoni hetkeksi ruudulle. T&auml;ll&ouml;in on siirrytt&auml;v&auml; takaisin levyn valikkoon painamalla menu-n&auml;pp&auml;int&auml;.</p>
						<p>Mit&auml; &auml;&auml;nivalikosta sitten pit&auml;isi valita? Seuraavassa pieni taulukko yleisimmist&auml; vaihtoehdoista ja mit&auml; mik&auml;kin niist&auml; tarkoittaa:</p>
						<p>
						<table border="0" cellpadding="4" cellspacing="0" width="100%">
							<tr>
								<td valign="top">PCM:</td>
								<td>Kaksikanavainen, pakkaamaton stereo&auml;&auml;ni, k&auml;yt&ouml;ss&auml; monilla musiikkilevyill&auml;.</td>
							</tr>
							<tr>
								<td valign="top">Dolby&nbsp;Digital&nbsp;1.0:</td>
								<td>Dolby Digital -koodattu mono&auml;&auml;ni, kuuluu vain keskikanavasta.</td>
							</tr>
							<tr>
								<td valign="top">Dolby&nbsp;Digital&nbsp;Stereo:</td>
								<td>Dolby Digital -koodattu kaksikanavainen &auml;&auml;niraita. Toimii joko perinteisen&auml; stereona tai Dolby Pro Logic -kytkenn&auml;n kautta riippuen vahvistimen toimitilasta.</td>
							</tr>
							<tr>
								<td valign="top">Dolby&nbsp;Digital&nbsp;2.0:</td>
								<td>Sama kuin edell&auml;.</td>
							</tr>
							<tr>
								<td valign="top">Dolby&nbsp;Digital&nbsp;2.1:</td>
								<td>Sama kuin edell&auml;, mutta sis&auml;lt&auml;&auml; LFE-kanavan.</td>
							</tr>
							<tr>
								<td valign="top">Dolby&nbsp;Digital&nbsp;5.0:</td>
								<td>Dolby Digital -koodattu monikanava&auml;&auml;ni ilman LFE-kanavaa.</td>
							</tr>
							<tr>
								<td valign="top">Dolby&nbsp;Digital&nbsp;5.1:</td>
								<td>Dolby Digital -koodattu monikanava&auml;&auml;ni, jossa mukana LFE-kanava. Valtaosassa uusista elokuvista l&ouml;ytyy t&auml;m&auml; &auml;&auml;niraita, ja mik&auml;li levyll&auml; ei ole DTS-&auml;&auml;nt&auml;, valitse aina t&auml;m&auml; vaihtoehto.</td>
							</tr>
							<tr>
								<td valign="top">DTS:</td>
								<td>DTS-koodattu monikanava&auml;&auml;ni. Jos t&auml;m&auml; vaihtoehto on k&auml;ytett&auml;viss&auml; ja vahvistimessasi on DTS-dekooderi, k&auml;yt&auml; t&auml;t&auml; parhaimman &auml;&auml;nenlaadun saavuttamiseksi. My&ouml;s DTS:n yhteydess&auml; voidaan k&auml;ytt&auml;&auml; vastaavia numerolyhenteit&auml; kuin edell&auml;.</td>
							</tr>
						</table>
						</p>
						<p>Yhteenvetona voisi todeta, ett&auml; aina kun &auml;&auml;niraitatieto on esitetty numeroin (esim. 5.1), tarkoittaa ensimm&auml;inen numero kanavien m&auml;&auml;r&auml;&auml; ja toinen numero LFE-kanavan olemassaoloa. Edellisess&auml; taulukossa esitettyjen lis&auml;ksi voi esiinty&auml; muitakin kokoonpanoja - er&auml;&auml;ll&auml;kin DTS CD:ll&auml; on nelikanavaisesti &auml;&auml;nitetty&auml; musiikkia (DTS 4.0), eli keskikanava ja LFE ovat mykki&auml;. Valitun &auml;&auml;niraidan kanavien m&auml;&auml;r&auml;n voi havainnollisesti n&auml;hd&auml; joidenkin DVD-soittimien tai vahvistimien etupaneelista. &Auml;&auml;niraidan tyypin mukaan aktiiviset kaiutinsymbolit syttyv&auml;t n&auml;ytt&ouml;&ouml;n.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Levyj&auml; ostettaessa</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kun hankit uusia DVD-elokuvia, huomioi muutamia seikkoja. Jos ostat levyj&auml; Suomesta, ei maakoodista yleens&auml; tarvitse huolehtia, eik&auml; my&ouml;sk&auml;&auml;n silloin jos soittimesi on modifioitu. Maakoodi mainittu levyss&auml; symbolilla:
						<center>
							<p><img height="82" width="195" src="kuvat/maakoodi.jpg" border="0" alt=" "></p>
						</center>
						<p>Jos saat ostotilanteessa selailtua DVD-levyj&auml; suoraan hyllyst&auml;, kertovat DVD-koteloiden takasivut hyvin paljon oleellista tietoa. Jos taas ostat netin kautta, l&ouml;ytyv&auml;t t&auml;rkeimm&auml;t tiedot jokaisesta levyst&auml; kunnollisesta nettikaupasta. Ainakin seuraaviin asioihin kannattaa kiinnitt&auml;&auml; huomiota:</p>
						<p>Jos haluat, ett&auml; elokuvassa on suomenkielinen teksti, tarkista l&ouml;ytyyk&ouml; se (Finnish subtitles). Tarkista my&ouml;s, l&ouml;ytyyk&ouml; v&auml;hint&auml;&auml;n Dolby Digital 5.1 -&auml;&auml;niraitaa ENGLANNINkielisen&auml;! Monissa yhteyksiss&auml; k&auml;ytet&auml;&auml;n lyhennett&auml; DD5.1. Joissakin levyiss&auml; k&auml;ytet&auml;&auml;n neli&ouml;m&auml;ist&auml; symbolia, jossa mustat t&auml;pl&auml;t tarkoittavat kanavien lukum&auml;&auml;r&auml;&auml; (kuva). Joskus saatat tavata ansoja, levyj&auml; joissa on DD5.1-&auml;&auml;niraita dubattuna esimerkiksi saksaksi, ja englanniksi l&ouml;ytyy vain DD2.0. Muista, ett&auml; pelkk&auml; Dolby Digital -logo ei viel&auml; takaa monikanava&auml;&auml;nt&auml;, ja maininta Dolby Digital Stereo tarkoittaa kaksikanavaista &auml;&auml;nt&auml;!</p>
						<center>
							<p><img height="94" width="380" src="kuvat/tiedot.jpg" border="0" alt=" "></p>
						</center>
						<p><i>Esimerkkilevyss&auml; on DTS-&auml;&auml;nitetty monikanava&auml;&auml;ni 5.1-muodossa englannin kielell&auml; sek&auml; kaksikanavainen Dolby Surround -&auml;&auml;ni englanninkielisen&auml;. Huomaa neli&ouml;n malliset symbolit, niit&auml; k&auml;ytet&auml;&auml;n yleisesti. Maininta Dual Layer levyn tiedoissa tarkoittaa kaksikerroslevy&auml;. DVD:ll&auml; voi olla kaksi informaatiokerrosta, ja n&auml;in kapasiteetti tuplautuu. Kerros vaihtuu automattisesti, mutta joissakin elokuvissa se saattaa aiheuttaa lyhyen tauon.</i></p>
						<p>Ihmisen n&auml;k&ouml;kentt&auml; on leve&auml;, muttei kovin korkea. Elokuvan mittasuhteet on valittu sellaisiksi, ett&auml; ne sopivat n&auml;k&ouml;kentt&auml;&auml;n mahdollisimman hyvin ja tarjoavat siten maksimaalisen elokuvanautinnon. Television kuva on l&auml;hes neli&ouml;m&auml;inen (4:3) eik&auml; t&auml;yt&auml; n&auml;k&ouml;kentt&auml;&auml;. Koska television ja elokuvan mittasuhteet ovat hyvin erilaiset, ei elokuvaa voi esitt&auml;&auml; televisiossa siten ett&auml; kuva t&auml;ytt&auml;isi koko ruudun. Yksi ihmiskunnan kirotuimmista keksinn&ouml;ist&auml; on kuitenkin pan&amp;scan, tapa jolla leve&auml;st&auml; kuvasta valitaan pieni palanen, joka sitten t&auml;ytt&auml;&auml; TV-ruudun. Alkuper&auml;isest&auml; kuvasta poimitaan tavallaan zoomaamalla esiin vain oleellinen, ja esimerkiksi tausta tai osa ihmisist&auml; poistetaan t&auml;ll&auml; tavoin kuvasta. Koska alkuper&auml;ist&auml; elokuvaa ei ole kuvattu t&auml;llaista esityst&auml; silm&auml;ll&auml;pit&auml;en, menee elokuva pilalle. Kotimaisilla TV-kanavilla esitett&auml;vist&auml; elokuvista valtaosa on raiskattu t&auml;ll&auml; tavoin pilalle, samoin my&ouml;s vuokravideot.</p>
						<p>Onneksi DVD tuo muutoksen t&auml;h&auml;n, ja valtaosa myyt&auml;vist&auml; levyist&auml; on alkuper&auml;isell&auml; kuvasuhteella tai v&auml;hint&auml;&auml;n 16:9-kuvasuhteella. Kuitenkin levy&auml; ostettaessa kannattaa muistaa kuvasuhde, sill&auml; ansojakin on olemassa. Levyj&auml;, jotka sis&auml;lt&auml;v&auml;t maininnan 4:3 pan&amp;scan, fullscreen tai 1.33:1 kannattaa v&auml;ltt&auml;&auml;, ellei kyseess&auml; ole TV-sarjan jaksoja tai muuta materiaalia, joka on alun perinkin kuvattu t&auml;lle kuvasuhteelle. Maininnat widescreen, 16:9, 1.85:1, 2.35:1 tai sit&auml;kin suuremmat tarkoittavat alkuper&auml;ist&auml; laajakangasformaattia. Maininta anamorfinen tarkoittaa sit&auml;, ett&auml; saat parhaimman mahdollisen kuvan 16:9-kuvasuhteella esitett&auml;ess&auml; - t&auml;m&auml; ei kuitenkaan takaa sit&auml;, ett&auml; kuva t&auml;ytt&auml;isi koko ruudun 16:9-televisiossa!</p>
						<p>Leve&auml; kuvasuhde elokuvissa nousee merkitt&auml;v&auml;&auml;n asemaan varsinkin tykkiesityksiss&auml;. Se, mik&auml; TV:ss&auml; t&auml;ytt&auml;&auml; koko ruudun, on suurella kuvalla ik&auml;v&auml;&auml; katseltavaa. Kuva on niin korkea, ettei sit&auml; voi seurata ilman p&auml;&auml;n tai silmien liikuttelua, ja niinp&auml; kokonaisen elokuvan katselu t&auml;llaisella kuvasuhteella rasittaa silmi&auml;.</p>
						<p>Lopuksi viel&auml; yksi asia, jota ei kuitenkaan voi tarkistaa levyn kansiteksteist&auml;, nimitt&auml;in sensuuri. Jotkut 2-alueen DVD-levyt on sensuroitu esim. Saksassa tai Englannissa vallalla olevan tiukan videolain mukaisiksi, ja niinp&auml; sellaisistakin elokuvista, joista Suomessa olisi saanut olla leikkaamattomat versiot, saattaa DVD:ll&auml; olla leikattuja versioita. Levyt ovat varsinaisia ansoja, sill&auml; jopa huippuelokuvista (James Bond jne.) l&ouml;ytyy saksittuja versioita!</p>
						<p>Parasta olisikin suunnitella DVD-ostoksensa etuk&auml;teen ja k&auml;v&auml;ist&auml; tarkistamassa vaikkapa <a href=" http://www.darkfantasy.mork.net/sensuuri/dvd.htm" target="_blank">Dark Fantasy ry:n nettisivulta</a>, l&ouml;ytyyk&ouml; kyseisest&auml; DVD:st&auml; leikkauksia. Kattavaa tietoa brittil&auml;n saksinnoista l&ouml;ytyy <a href="http://www.bwescombe.freeserve.co.uk/" target="_blank">UK DVD Cuts List -sivustolta</a>. Siell&auml; on usein mainittu my&ouml;s kyseisten elokuvien leikkaustilanne muiden alueiden osalta.</p>
						<p>Jos suomenkielist&auml; tekstityst&auml; ei kaipaa, omistaa modifioidun DVD-soittimen ja laitteisto kykenee esitt&auml;m&auml;&auml;n NTSC-formaatin mukaista kuvaa, kannattaa harkita elokuvien tilaamista esim. Yhdysvalloista. Valikoima on toistaiseksi huomattavasti laajempi kuin Euroopassa, ja my&ouml;s monia sellaisia elokuvia l&ouml;ytyy, joita ei ole Suomessa n&auml;hty edes teattereissa! Huippuelokuvista on saatavilla my&ouml;s DTS-&auml;&auml;nitetyt versiot, joita kannattaa hankkia, jos omistaa DTS-dekooderilla varustetun vahvistimen.</p>
						<p>Yhdysvalloissa hallitaan my&ouml;s DVD-tuotanto, ja levyjen laatuun panostetaan. Luulisi nimitt&auml;in, ett&auml; kun PAL-formaatissa on enemm&auml;n juovia, olisi PAL-levyiss&auml; parempi kuvanlaatu. Usein homma on kuitenkin toisin p&auml;in - ykk&ouml;salueen NTSC-levylt&auml; tuleva kuva pesee monesti eurooppalaisen veljens&auml; kuvanlaadussa mennen tullen! Ykk&ouml;salueen levyss&auml; voi olla my&ouml;s enemm&auml;n extramateriaalia kuin saman elokuvan Euroopan versiossa.</p>
						<p><font size="2">[Toimitus ei t&auml;ysin yhdy t&auml;h&auml;n n&auml;kemykseen. R2- ja R4-levyjen (Australia, PAL-j&auml;rjestelm&auml; siell&auml;kin) laatu on viimeisen vuoden aikana parantunut roimasti alkuaikojen taaperteluista, ja kuvanlaatu on nyky&auml;&auml;n usein parempi kuin NTSC-veljiens&auml;. Levyt tehd&auml;&auml;n usein samasta masterista, mutta onpa n&auml;it&auml;kin tapauksia, ett&auml; jenkkilevyn masterina k&auml;ytetty filmikopio on huono ja naarmuinen. N&auml;in on k&auml;ynyt mm. Braveheartin R1-versiolle, jonka kuvanlaatu on kaikkea muuta kuin optimaalista DVD-tasoa. Joulukuussa tuleva R2-versio (ja kaiketi my&ouml;s R4-versio) on todenn&auml;k&ouml;isesti remasteroitu tai tehty kokonaan eri masterista.]</font></p>
						<p>Pohjois-Amerikasta tilaaminen hoituu nyky&auml;&auml;n nopeasti ja helposti. Levyj&auml; voi tilata nettikaupasta ja maksaa luottokortilla. Jos maksat n&auml;in, k&auml;yt&auml; ainoastaan sellaista nettikauppaa jossa korttinumero v&auml;litet&auml;&auml;n salatun yhteyden yli. Luottokortin numeroa ei saa l&auml;hett&auml;&auml; Internetiin sellaisenaan.</p>
						<p>Ainoa ongelma Yhdysvalloista tilattaessa on Suomen tullik&auml;yt&auml;nt&ouml;. Voit tilata ilman tullia tavaraa noin 50 euron edest&auml;, joten k&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml;n hetkisill&auml; taalan kursseilla yksi 19,95 taalan DVD-levy ja 8 taalan postikulut tekev&auml;t sen verran, ettei samaan tilaukseen uskalla ottaa en&auml;&auml; toista levy&auml;, jos ei halua maksaa tullia ja arvonlis&auml;veroa. Yksitellen tilattuna levyjen hinnaksi muodostuu kovasta taalan kurssista johtuen helposti l&auml;hes 200 mk/kpl, joista postikulujen osuus yli 50 mk. Paketti tulee lentopostina suoraan kotiin noin viikon kuluttua tilauksesta.</p>
						<p><font size="2">[Toim.huom.: Osa nettikaupoista l&auml;hett&auml;&auml; levyt vaikkapa erikseen pakattuina, ilman postikuluja tai jopa Englannin postileimoilla varustettuna (vaikka firma toimiikin Kanadassa), joten kannattaa ottaa toimitusehdoista ja -mahdollisuuksista selv&auml;&auml; ennen tilaamista. Hyv&auml;t ohjeet ja suosituksia ulkomailta tilaamiseen l&ouml;ytyy Dark Fantasyn <a href="http://darkfantasy.mork.net/osoitteet/tilausfaq.htm" target="_blank">DVD-tilausohjesivulta</a>.]</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Monikanavaista musiikkia</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">My&ouml;s monikanavaisesti &auml;&auml;nitetty&auml; musiikkia on saatavilla DTS CD-levyill&auml;. DTS CD on periaatteessa tavallinen CD-musiikkilevy, mutta tavallisen &auml;&auml;nen sijasta levylle on tallennettu DTS-koodattu monikanavainen &auml;&auml;nidata. Jos levy&auml; kuuntelee sellaisenaan tavallisessa CD-soittimessa, kuuluu levylt&auml; vain ik&auml;v&auml;&auml; digitaalista kohinaa. Kun levy toistetaan digitaalisella l&auml;hd&ouml;ll&auml; varustetussa DTS-dekooderilla varustettuun vahvistimeen liitetyss&auml; CD- tai DVD-soittimessa, aukeaa kuulijalle monikanavainen, 20-bittinen monikanavaesitys, jonka j&auml;lkeen tavalliset CD-levyt kuulostavat melkeinp&auml; vanhanaikaisilta rautalanka&auml;&auml;nitteilt&auml;.
						<p>DTS-CD-levyj&auml; l&ouml;ytyy eniten sielt&auml; mist&auml; DVD-levyj&auml;kin, Yhdysvalloista. Tarjonta on enimm&auml;kseen klassista, mutta my&ouml;s kevyemp&auml;&auml; l&ouml;ytyy, mm. Police, Belinda Carlisle, Alan Parsons yms. Levyt tarjoavat mukavan lis&auml;arvon digitaaliselle kotiteatterilaitteistolle, koska niiden toisto ei vaadi uusien lis&auml;laitteiden hankkimista.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Digitaalinen TV</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">L&auml;hivuosina digitaali-TV tulee korvaamaan analogiset l&auml;hetykset my&ouml;s maanp&auml;&auml;llisiss&auml; l&auml;hetyksiss&auml;. Satelliittitaivaalla digitalisoituminen on parhaillaan menossa kovaa vauhtia. Valitettavasti digitalisoinnissa edet&auml;&auml;n vaihe vaiheelta, eik&auml; asioita tehd&auml; kerralla loppuun asti. Niinp&auml; esimerkiksi Canal Digitalin kanavilla ei viel&auml; l&auml;hetet&auml; monikanavaista &auml;&auml;nt&auml;. T&auml;ll&auml; hetkell&auml; Canal Digitalin asiakkaille jaettavassa, Philipsin valmistamassa digitaalivirittimess&auml; ei ole edes digitaalista l&auml;ht&ouml;&auml; &auml;&auml;nelle.
						<p>Monikanavaisia koel&auml;hetyksi&auml; on kuitenkin jo tehty, ja ennen kaikkea uusi digitaalinen TV-j&auml;rjestelm&auml; tukee my&ouml;s monikanavaista &auml;&auml;nt&auml;. Ehk&auml;p&auml; j&auml;rjestelm&auml; alkaa yleisty&auml; tulevaisuudessa. Odotus tuntuu samalta kuin kymmenisen vuotta sitten, kun odoteltiin monofonisten TV-l&auml;hetysten muuttumista nicam-normille. Viel&auml; pitk&auml;&auml;n t&auml;m&auml;n j&auml;lkeen l&auml;hetti mm. MTV3 elokuvat mono&auml;&auml;nell&auml;. Joten ehk&auml;p&auml; viiden vuoden p&auml;&auml;st&auml; voisi jo olettaa, ett&auml; monikanava&auml;&auml;ni alkaa olla TV-l&auml;hetysten vakiostandardi. Samalla my&ouml;s kapea TV-kuva j&auml;&auml; lopullisesti historiaan, kun l&auml;hetykset muuttuvat 16:9-normin mukaisiksi.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Postituslista</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Mik&auml;li jollekulle lukijalle j&auml;i jotakin kysytt&auml;v&auml;&auml; kotiteatteriaiheesta, laitteiden asetuksista tai muuten vain tarve keskustella aiheesta, olette kaikki tervetulleita jokin aika sitten perustamalleni postituslistalle! Listalle voi liitty&auml; osoitteessa <a href="http://fi.egroups.com/group/kotiteatteri" target="_blank">http://fi.egroups.com/group/kotiteatteri</a>, ja keskustelu on suomenkielist&auml;.
						<p>Lista perustettiin, koska uutisryhmiss&auml; ei voi en&auml;&auml; nyky&auml;&auml;n juuri keskustella joutumatta sp&auml;mmilistalle, mink&auml; j&auml;lkeen oma postilaatikko t&auml;yttyy asiattomista mainoksista, eik&auml; loppua tule ikin&auml;. Postituslista on suljettu lista, jonne ulkopuoliset eiv&auml;t voi postittaa, vaan listalle t&auml;ytyy ensin liitty&auml;. Listaposti tulee aina tietyst&auml; osoitteesta, ja subject-rivill&auml; olevan tunnuksen avulla listaposti on helppo ohjata omaan kansioonsa s&auml;hk&ouml;postiohjelmissa. Niinp&auml; listalla mukanaolo sujuu vaivattomasti, etk&auml; tarvitse muuta kuin olemassa olevan s&auml;hk&ouml;postiosoitteen.</p>
						<p>Lopuksi esit&auml;n kiitokset tuttavalleni &quot;Kemmille&quot;, joka toimii Pieks&auml;m&auml;ell&auml; Kinomania-nimisen elokuvateatterin hoitajana.</p>
						<p><font size="2">Elokuvan &auml;&auml;nimaailmasta ja kotiteatterin historiasta ja nykytilanteesta voit lukea lis&auml;&auml; artikkelin ensimm&auml;isest&auml; osasta, <a href="kotiteatteri_1.html" target="_self">&quot;Historiasta nykyp&auml;iv&auml;&auml;n&quot;</a>. Oman kotiteatterin rakentamisesta ja laitteiden hankkimisesta jatkaa artikkelin toinen osa, <a href="kotiteatteri_2.html" target="_self">&quot;Kotiteatteria rakentamaan&quot;</a>.</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font size="2">Monikanavaisista &auml;&auml;nij&auml;rjestelmist&auml; l&ouml;yt&auml;&auml; lis&auml;tietoja mm. osoitteista <a href="http://www.dolby.com" target="_blank">www.dolby.com</a> ja <a href="http://www.dtstech.com" target="_blank">www.dtstech.com</a>.</font>
						<p><font size="2">Dolby ja tupla-D-symboli ovat Dolby Laboratoriesin rekister&ouml;ityj&auml; tavaramerkkej&auml;. DTS ja DTS Digital Surround ovat Digital Theater Systems Inc.:n rekister&ouml;ityj&auml; tavaramerkkej&auml;. Kaikki oikeudet pid&auml;tet&auml;&auml;n.</font></td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
