<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>LinuxPPC 2000 Amigaan</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Tommi Nieminen &lt;<a href="mailto:tec@luukku.com" target="_blank">tec@luukku.com</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Varoituksen sana heti aluksi: Linuxin asentaminen ei ole v&auml;ltt&auml;m&auml;tt&auml; niin helppoa, voit esimerkiksi tuhota kiintolevysi sis&auml;ll&ouml;n todella helposti, ellet et ole varovainen! Tied&auml;n sen, sill&auml; itse melkein tuhosin 4 Gt kiintolevyni sis&auml;ll&ouml;n ensimm&auml;isess&auml; asennuksessani!
						<p>J&auml;rke&auml; k&auml;ytt&auml;en &auml;l&auml; aivan sokeasti seuraa ohjeitani, jotka saattavat sis&auml;lt&auml;&auml; virheit&auml;, joten &auml;l&auml; syyt&auml; minua jos esim. tuhoat kiintolevysi, hajotat koneesi, humanoidit abduktoivat Amigasi ja menet&auml;t y&ouml;unesi tai vastaavaa, koska se ei ole minun vastuullani.</p>
						<p>Jos on jotain kysytt&auml;v&auml;&auml; tai kommentoitavaa, autan ja neuvon mielell&auml;ni parhaimpani mukaan, vaikken mik&auml;&auml;n tosi Linux-guru kuitenkaan ole. L&auml;het&auml; s&auml;hk&ouml;postia osoitteeseen <a href="mailto:tec@luukku.com" target="_blank">tec@luukku.com</a>. Nyt itse asennuksen kimppuun.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Linuxista</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Linux on kotimaista alkuper&auml;&auml; oleva ilmainen k&auml;ytt&ouml;j&auml;rjestelm&auml;. Sen vahvuuksia ovat mm. nopeus vanhoillakin koneilla, ilmaiset kaupallista tasoa olevat ohjelmat, kasvava k&auml;ytt&auml;j&auml;m&auml;&auml;r&auml; ja laitteistotuki, vapaa l&auml;hdekoodi sek&auml; stabiilit j&auml;rjestelm&auml;osat. Se on my&ouml;s eritt&auml;in suosittu Internet-palvelink&auml;yt&ouml;ss&auml;.
						<p>Itse alun perin asensin Linuxin koneelleni, koska halusin vaihtoehtoisen j&auml;rjestelm&auml;n enk&auml; halunnut maksaa uudesta koneesta. T&auml;m&auml;n j&auml;lkeen huomasin sen olevan eritt&auml;in mielenkiintoinen, etenkin koska siit&auml; voi muuttaa kaiken niin kuin itse haluaa ja sille on suuri ja jatkuvasti kasvava valikoima ilmaisohjelmia, mik&auml; tietenkin sopii opiskelijan budjetille todella mainiosti. :)</p>
						<p>Linux/APUS tarkoittaa Linux for Amiga Power Up Systems. Se on projekti, joka pyrkii tuomaan Linuxin PowerPC-Amigoille. Projekti on onnistunut melko hyvin, mutta se tarvitsee lis&auml;&auml; aktiivisia ohjelmoijia.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Mik&auml; Linux?</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Ensimm&auml;iseksi t&auml;ytyy ottaa selv&auml;&auml;, mitk&auml; Linuxit toimivat koneellasi. Jos koneessasi on PowerPC-prosessori, voit k&auml;ytt&auml;&auml; koneessasi esim. LinuxPPC:t&auml;. K&auml;yt&auml;n sit&auml; itse sen vuoksi, ett&auml; se on todettu toimivaksi parhaiten Amigassa, ja my&ouml;s suurin osa APUS-ryhm&auml;n asennustiedostoista on tehty toimivaksi juuri LinuxPPC:n kanssa. Suse:n sek&auml; Debianin PPC-versioiden pit&auml;isi my&ouml;skin toimia PPC-Amigoissa, mutta yleisesti ottaen kannattaa valita LinuxPPC sen (l&auml;hes) varman toimivuuden takia.
						<p>Jos p&auml;&auml;t&auml;t hankkia Debian Linuxin, muista ettei se ole t&auml;ysin yhteensopiva esim. LinuxPPC:n tai muiden RedHat-pohjaisten levityspakettien kanssa. Siin&auml; tapauksessa, ettei koneessasi ole PowerPC:t&auml;, voit k&auml;ytt&auml;&auml; Linux/m68k:ta, mutta silloin koneessasi t&auml;ytyy olla v&auml;hint&auml;&auml;n 030-prosessori MMU:lla ja FPU:lla.</p>
						<p>Kaikkien Linuxien pit&auml;isi tukea B/CVisionPPC:ta, CV64:&auml;&auml; ja muita n&auml;ytt&ouml;kortteja sek&auml; AGA/ECS-n&auml;ytt&ouml;j&auml;. Toimiva Internet-yhteys Amigassa on oikeastaan pakollinen, sill&auml; joudut hakemaan paljon eri tiedostoja sit&auml; mukaa kuin niit&auml; tarvitaan. Muista testata, ett&auml; koneesi boottaa Linuxin <b>ennen kuin</b> ostat/poltat/imuroit mit&auml;&auml;n!</p>
						<p>T&auml;ss&auml; asennusohjeessa keskityn LinuxPPC 2000:n asentamiseen, mutta ohjeet p&auml;tev&auml;t suurilta osin muihinkin levityksiin, l&auml;hinn&auml; kuitenkin RedHat-pohjaisiin. Ohjeet perustuvat l&auml;hinn&auml; omiin virityksiini ja LinuxAPUS FAQ:n tekstiin, johon kannattaa tutustua. LinuxAPUS FAQ:n saat osoitteesta: <a href="ftp://linux-apus.sourceforge.net/pub/linux-apus/docs/" target="_blank">ftp://linux-apus.sourceforge.net/pub/linux-apus/docs/</a></p>
						<p>Huomaa, ett&auml; readme-tiedostoissa mainitut email- ja nettiosoitteet saattavat olla vanhentuneita. Lopun Linkkej&auml;-osassa olen listannut joitakin t&auml;ll&auml; hetkell&auml; voimassa olevia nettiosoitteita.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Mist&auml; Linux?</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">LinuxPPC 2000 on muiden Linuxien tapaan saatavilla my&ouml;s ilmaiseksi. Sen voi hakea osoitteesta <a href="http://www.linuxppc.com/" target="_blank">http://www.linuxppc.com/</a>. Kannattaa ottaa CD-image-tiedosto (noin 650 Mt), jonka voit polttaa CD:ksi, t&auml;ll&ouml;in saat oikeat tiedostot ja hakemistorakenteen. Muista polttaa se HFS-muotoon (Mac), jotta Installer ymm&auml;rt&auml;isi sen.
						<p>DataClub myy tiet&auml;&auml;kseni ainoana Suomessa itse LinuxPPC 2000 -pakettia. Sen saa kahdessa eri paketissa, jotka molemmat toimivat suoraan my&ouml;s Macintoshissa. Pelk&auml;t kaksi CD:t&auml; (tiedostot ja l&auml;hdekoodit) maksavat reilut 200 mk. Samat CD:t sek&auml; lyhyt manuaali ja tyylik&auml;s L-kokoinen T-paita maksaa noin satasen enemm&auml;n. Myynniss&auml; on my&ouml;s SuSe:n PPC-versio, joka maksaa noin 350 mk. Kauppa sijaitsee Helsingin Sanoma-talossa, kotisivu l&ouml;ytyy osoitteesta <a href="http://www.dataclub.fi/" target="_blank">http://www.dataclub.fi/</a>.</p>
						<p>Gentle Eye myy Amiga Unix Compendium -nimist&auml; kokoelmaa, joka sis&auml;lt&auml;&auml; LinuxPPC'99:n lis&auml;ksi my&ouml;s Linux/m68k:n (koneille ilman PPC:t&auml;) ja NetBSD-nimisen UNIX-kloonin. CD:ll&auml; pit&auml;isi olla oikeat RAMDiskit ja kernelit asennusta ja k&auml;ytt&ouml;&auml; varten. Hintaa noin 250 mk. Linux RedHat 5.1 CD on tarkoitettu vain m68k-koneille. Gentle Eye sijaitsee Tampereella, kotisivu on osoitteessa <a href="http://www.ge.vip.fi/" target="_blank">http://www.ge.vip.fi/</a>.</p>
						<p>Linuxin saa tietenkin kopioida kaverilta, sill&auml; se on GPL-lisenssin alla, eli (l&auml;hes) kaikki ohjelmat ovat ilmaisia ja niiden l&auml;hdekoodi on saatavilla. Mutta my&ouml;s Linuxille on saatavilla joitakin kaupallisia ja rekister&ouml;it&auml;vi&auml; shareware-ohjelmia, joita ei tietenk&auml;&auml;n saa kopioida. Tarkista asian laita ennen kopiointia. Esimerkiksi Dataclub myy PPC-versioita suosituista PC-peleist&auml; kuten Quake 3 ja Myth 2.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Linuxin testaus</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Nyt voitkin hakea tarvittavia tiedostoja Amigaasi. T&auml;rkeimm&auml;t tiedostot, jotka tarvitset testausta, asennusta ja k&auml;ytt&ouml;&auml; varten ovat:
						<p><a href="http://sourceforge.net/projects/linux-apus/" target="_blank">http://sourceforge.net/projects/linux-apus/</a></p>
						<p><b>vmapus-2.2.10-20000814</b>, .lha- tai .gz-muodossa<br>
						Kernel, eli Linuxin ydin. Et voi k&auml;ytt&auml;&auml; LinuxPPC:n kerneleit&auml;, ne on tehty Macintosh-koneille toimiviksi. K&auml;yt&auml; APUS-ryhm&auml;n tekem&auml;&auml; versiota, joka sis&auml;lt&auml;&auml; tuen Amigan hardwarelle. &Auml;l&auml; ota kernelin testiversiota (vmapus-2.*.*-test*), se ei ole stabiili.</p>
						<p><b>ramdisk.image.gz</b><br>
						Ramdisk-image-tiedosto sis&auml;lt&auml;&auml; Linuxin tarvitsemat ohjelmat.</p>
						<p><b>bh000629.lha</b><br>
						Boothack on Linuxin boottamista varten. PC:ll&auml; k&auml;ytet&auml;&auml;n yleens&auml; ohjelmaa nimelt&auml; LILO (LInux LOader).</p>
						<p><a href="ftp://linux-apus.sourceforge.net/pub/linux-apus/contrib/" target="_blank">ftp://linux-apus.sourceforge.net/pub/linux-apus/contrib/</a></p>
						<p><b>APUS_AmigaFormat.lha</b><br>
						Suositeltavaa on my&ouml;s hakea t&auml;m&auml; paketti. Siit&auml; l&ouml;ytyy mm. LinuxLauncher, MUIRexxi&auml; k&auml;ytt&auml;v&auml; graafinen k&auml;ynnistysohjelma, joka helpottaa huomattavasti Linuxin k&auml;nnistysprosessia ja eri kernelien/RAMdiskien k&auml;ytt&ouml;&auml;. Huomaa, ett&auml; ohjelma tarvitsee MUI:n MUIRexx-laajennuksen. L&ouml;yd&auml;t liitteen&auml; olevasta <a href="linuxcnf.zip">zip-paketista</a> my&ouml;s kolme valmista asetustiedostoa, joita voit k&auml;ytt&auml;&auml; ainakin esimerkkin&auml;.</p>
						<p><a href="http://ftp.sunet.se/~aminet/" target="_blank">AmiNET</a></p>
						<p><b>lha ja gzip sek&auml; (de)tar<br>
						</b>N&auml;it&auml; tarvitset pakettien purkamiseen Amigalla. Lha on .lha- ja .lzh-paketteja varten, gzip on .gz- ja .tgz-paketteja varten ja (de)tar on .tar-paketteja varten.</p>
						<p><b>MUI ja MUIRexx</b></p>
						<p>Pura APUS_AmigaFormat johonkin kiintolevyllesi, miss&auml; on v&auml;hint&auml;&auml;n 25 Mt tilaa. LhA luo tarvittavat hakemistot valmiiksi.</p>
						<p>Pura &quot;vmapus-2.2.10-2000081&quot; esim. LinuxAPUS/Storage-hakemistoon ja kopioi sielt&auml; &quot;vmapus-000814&quot; LinuxAPUS/Kernels-hakemistoon. Kernelin nimen pit&auml;&auml; alkaa &quot;vmapus&quot; tai &quot;vmlinux&quot;. Kopioi &quot;ramdisk.image.gz&quot; LinuxAPUS/RAMDisks-hakemistoon, &auml;l&auml; pura RAMDiskej&auml; (ja nimen pit&auml;&auml; p&auml;&auml;tty&auml; &quot;.gz&quot;). Pura &quot;bh000629.lha&quot; Storage-hakemistoon ja kopioi boot#? ja ppcboot_#? tiedostot LinuxAPUS-hakemistoon. Asenna MUIRexx, jos koneellasi ei sit&auml; viel&auml; ole.</p>
						<p>Nyt hakemistorakenteen pit&auml;isi olla jokseenkin seuraavanlainen (dir #? all):</p>
						<pre>   LinuxAPUS (dir)
        Icons (dir)
          APUS_Drawer.info                 
        Docs (dir)
          kernel-options.txt               
        Storage (dir)
             vmapus-2.2.10-000814 (dir)
               config                           modules.tar.gz
               README                           System.map
               vmapus-000814                    
             bh000629 (dir)
               apus-amiboot.readme              bootmesg
               bootstrap                        kernel-options.txt
               ppcboot_pup                      ppcboot_wup
          file_id.diz                      vmapus.displayme
        RAMDisks (dir)
          ramdisk.image.gz
        Kernels (dir)
          vmapus-000814                    
     bootmesg                         bootstrap
     Docs.info                        Install_Linux_APUS
     Install_Linux_APUS.info          Kernels.info
     Linux.aux                        Linux.rexx
     Linux_Launcher                   Linux_Launcher.info
     ppcboot_pup                      ppcboot_wup
     RAMDisks.info                    
LinuxAPUS.info                   README
README.info</pre>
						<p>T&auml;t&auml; esimerkkin&auml; k&auml;ytt&auml;m&auml;ll&auml; voitkin nyt testata, josko Linux toimii koneellasi. Huomaa, ett&auml; t&auml;m&auml;n j&auml;lkeen joudut resetoimaan koneen p&auml;&auml;st&auml;ksesi takaisin AmigaOS:iin. Jos p&auml;&auml;t&auml;t olla k&auml;ytt&auml;m&auml;tt&auml; LinuxLauncheria, komentoriviohjeet l&ouml;yd&auml;t APUS FAQ:sta.</p>
						<p>LinuxLauncheria k&auml;yt&auml;t n&auml;in:</p>
						<p><b>Kernel-sivu:</b><br>
						Kernel image on k&auml;ytt&auml;m&auml;si kernelin nimi, esim. &quot;Kernels/vmapus-000814&quot; Valitse my&ouml;s APUS, kun k&auml;yt&auml;t PPC:t&auml;. 60ns RAM voit k&auml;ytt&auml;&auml; mahdollisesti, vaikka sinulla olisi vain 70ns RAMia, mutta testin ajaksi j&auml;t&auml; valitsematta sit&auml;. NoBATs ei tarvitse, ellei sinulla ole BlizzardPPC-SCSI- tai A4000T/A4019-SCSI-ohjainta.</p>
						<p><b>Display-sivu:</b><br>
						Laita kaikki muut paitsi sinun n&auml;yt&ouml;nohjaimen asetuket tilaan &quot;Not specified&quot;. Jos sinulla on B/CVision, valitse Permedia2 800x600-56, johon kaikki SVGA-monitorit pystyv&auml;t, mutta voit korottaa sit&auml; tarpeen mukaan my&ouml;hemmin. Nativea k&auml;yt&auml;t, jos sinulla on vain AGA. Silloin valitse esim. PAL-lace jos sinulla on pelkk&auml; TV, tai VGA, jos sinulla on multisync- tai VGA-monitori k&auml;yt&ouml;ss&auml;. Virge on CV64(/3D)-kortteja varten.</p>
						<p><b>Disks-sivu:</b><br>
						Root partition on se laite/osio, josta Linux boottaa. Testiss&auml; sek&auml; my&ouml;hemmin Installer RAMdiskien kanssa k&auml;yt&auml; /dev/ram sek&auml; valitse RAM disk image, esim. &quot;RAMDisks/ramdisk.image.gz&quot;.</p>
						<p><b>Misc-sivu:</b><br>
						Jos k&auml;yt&auml;t nelj&auml;&auml; IDE-laitetta esim. IDEfixin avulla, kirjoita Extra kernel option -kohtaan &quot;ide=doubler&quot;.</p>
						<p>Koneesi miettii hetken aikaa (noin 30-45 sekuntia), mink&auml; j&auml;lkeen pit&auml;isi ilmesty&auml; valkoista teksti&auml; mustalla pohjalla (&agrave; la MSDOS), sek&auml; kulmassa Linux-pingviinin (Tux) kuva. Yrit&auml; katsoa, lukeeko n&auml;yt&ouml;ss&auml; jossain kohtaa seuraavantapaista teksti&auml;:</p>
						<p>Partition check:<br>
						hda: hda1<br>
						hdb: hdb1 hdb2 hdb3 hdb4</p>
						<p>Jos lukee, se tarkoittaa ett&auml; kernelin levyajurit toimivat ja ett&auml; asennus on mahdollista. Siin&auml; tapauksessa ettei testi toiminut, tarkista ett&auml; olet valinnut etenkin n&auml;yt&ouml;nohjaimen asetukset sek&auml; muut asetukset. Tarkista, ettei boothack valita puuttuvista tiedostoista jne. Tarkista, ett&auml; kuva tulee TV/RGB-portista. Katso my&ouml;s APUS FAQ, jos siit&auml; l&ouml;ytyisi apua.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Amigalla teht&auml;v&auml;t asennukset</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kun olet testannut, ett&auml; Linux toimii sek&auml; hankkinut tavalla tai toisella LinuxPPC:n itsellesi, voitkin aloittaa asennuksen nyt. Asennukseen tarvitset joitain tiedostoja, joita ei LinuxPPC:ss&auml; ole:
						<p><a href="http://sourceforge.net/projects/linux-apus/" target="_blank">http://sourceforge.net/projects/linux-apus/</a></p>
						<p><b>apus-lp-ramdisk.image20000622.gz</b> eli Installer RAMDisk. Hoitaa Linuxin asentamisen kiintolevyllesi oikealla tavalla. LinuxPPC 2000:n RAMDiskin nimi lyhentynee automaattisesti muutamalla merkill&auml;, jos k&auml;yt&auml;t Amigan FFS:&auml;, joten joudut ehk&auml; lis&auml;&auml;m&auml;&auml;n p&auml;&auml;tteen &quot;.gz&quot; takaisin nimeen.</p>
						<p><a href="ftp://linux-apus.sourceforge.net/pub/linux-apus/contrib/">ftp://linux-apus.sourceforge.net/pub/linux-apus/contrib/</a></p>
						<p><b>XF86_FBDev-pm2-glibc-2.1.gz</b> eli Permedia 2 -tuen sis&auml;lt&auml;v&auml; X-ajuri. Tarvitset t&auml;m&auml;n, jos haluat k&auml;ytt&auml;&auml; X:&auml;&auml; B/CVisionillasi.</p>
						<p>Kopioi Installer RAMDisk oikeaan paikkaan, &auml;l&auml; pura t&auml;t&auml;k&auml;&auml;n RAMDiskia.</p>
						<p>Seuraavaksi tarvitset kaksi vapaata osiota kiintolevyll&auml;si, yksi Linuxia varten sek&auml; yksi Linuxin swapia (virtuaalimuisti) varten. T&auml;m&auml; on kohta, jossa pit&auml;&auml; olla erityisen varovainen, ettet menet&auml; dataa! Lue Amigasi manuaalista, miten ohjelma toimii, jos et ole t&auml;ysin varma. Huomaa, ettei APUS tue CyberstormPPC:n SCSI-ohjainta viel&auml;, joten k&auml;yt&auml; IDE-kiintolevy&auml;, mm. BlizzardPPC:n SCSI toimii.</p>
						<p>Nyt tee kiintolevyllesi tarpeelliset osiot, joita Linux k&auml;ytt&auml;&auml;. K&auml;ynnist&auml; HDToolBox ja valitse kiintolevy, johon haluat Linuxin. Tee ensin swap-osio, se kannattaa olla noin 100 Mt (25-127 Mt). (Valitse ensin Advanced Options, ellet k&auml;yt&auml; OS3.5:t&auml;.) Klikkaa &quot;Change...&quot; ja valitse &quot;Custom File System&quot;. Kirjoita Identifier-kohtaan &quot;0x53575000&quot;. Klikkaa OK, ja jos FastFileSystemin tilalla lukee &quot;SWP/0&quot;, kirjoitit oikein.</p>
						<p>Linux-osioon kannattaa varata melkein niin paljon kuin mahdollista, eli jos voit k&auml;ytt&auml;&auml; 1-2 Gt, tee se. Minimi on noin 400 Mt, mutta siihen ei paljoa ohjelmia tai k&auml;ytt&ouml;tilaa mahdu. My&ouml;s t&auml;m&auml;n kohdalla muuta asetukset Custom File Systemiksi ja t&auml;m&auml;n Identifieriksi &quot;0x4c4e5800&quot;, tarkista ett&auml; se on &quot;LNX/0&quot;.</p>
						<p>Kun olet tehnyt molemmat osiot, kirjoita yl&ouml;s niiden Linux-tyyliset nimet. Nimitykset toimivat niin ett&auml; on &quot;/dev/&quot; + &quot;hd&quot; (jos IDE, &quot;sd&quot; jos SCSI) + &quot;a&quot;, &quot;b&quot;, &quot;c&quot; jne. levyjen j&auml;rjestyksen mukaan + monesko osio. Esim. /dev/hda3 eli kolmas osio ensimm&auml;isell&auml; IDE-kiintolevyll&auml;, /dev/sdb7 eli seitsem&auml;s osio toisella SCSI-kiintolevyll&auml;. Jos et hankkinut CD:t&auml;, niin kirjoita yl&ouml;s my&ouml;s se osio ja hakemisto, jossa tiedostot ovat. Muista, ett&auml; Linux erittelee isot ja pienet kirjaimet, eli HakEMisTo ei ole sama kuin hakemisto jne. Linuxissa hakemistoista alin eli root on &quot;/&quot;, jos hakemistosi on Work:LinuxAPUS/Temp/, muuttuu se Linuxissa muotoon /LinuxAPUS/Temp/.</p>
						<p>Nyt voitkin k&auml;ynnist&auml;&auml; Linuxin Installer RAMDiskilt&auml;. Eli vaihda LinuxLauncherissa &quot;ramdisk.image.gz&quot; -&gt; &quot;apus-lp-ramdisk.image20000622.gz&quot; ja k&auml;ynnist&auml; Linux.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Linuxilla teht&auml;v&auml;t asennukset</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kun Linux on k&auml;ynnistynyt Installeriin (&auml;l&auml; v&auml;lit&auml; command-line-varoituksista), se kysyy n&auml;pp&auml;imist&ouml;tyyppi&auml;si. Valitse &quot;amiga-us&quot; tai &quot;amiga-se&quot;, jos haluat skandit. Seuraavaksi Installer pyyt&auml;&auml; asennustiedostojen paikkaa, laita CD sis&auml;&auml;n ja valitse CD-ROM. Jos tiedostosi on kiintolevyll&auml;, valitse Local Harddisk, niin ohjelma kysyy paikkaa. Valitse oikea osio ja kirjoita hakemiston paikka.
						<p>Seuraavaksi valitse kiintolevy, johon haluat asentaa Linuxin. Installer k&auml;ynnist&auml;&auml; fdisk-osiointiohjelman, mutta koska teit oikeat osiot jo Amigalla, paina &quot;q&quot; ja enter. Sitten sinun pit&auml;&auml; valita kiintolevysi osiot, jonne haluat asentaa Linuxin. Valitse listasta se osio, jossa lukee &quot;Linux native&quot;, paina enter sen kohdalla ja laita mount pointiksi &quot;/&quot;. Installerin kysyess&auml; swapia valitse oikea osio.</p>
						<p>Installer skannaa saatavilla olevat paketit ja varoittaa joistakin puuttuvista, joita ei tarvitse huomioida. Seuraavaksi Installer esitt&auml;&auml; listan ohjelmaryhmist&auml;, joista voit valita ne jotka haluat asentaa. Valmiiksi valitut hjelmat ovat hyv&auml; perusasennus, ne viev&auml;t noin 400 Mt.</p>
						<p>Sitten Installer kysyy, mitk&auml; osiot haluat formatoida. Voit my&ouml;s antaa Installerin tarkistaa, onko levyll&auml; ns. bad blockeja, t&auml;m&auml; tosin vie paljon enemm&auml;n aikaa eik&auml; yleens&auml; ole tarpeen. Jos Installer ilmoittaa joidenkin pakettien tarvitsevan toisia (dependacies), anna sen asentaa puuttuvat paketit automaattisesti. Nyt Installer aloittaa formatoinnin ja pakettien asennuksen, joka kest&auml;&auml; noin 10-20 min.</p>
						<p>Jos kaikki sujui hyvin, Installer kysyy nyt teht&auml;vist&auml; muutoksista (Amiga changes). Valitse OK kaikkeen paitsi LAN, ellei sinulla ole verkkokorttia koneessasi. Laita kello &quot;Etc/GMT&quot; ja valitse &quot;Hardware clock&quot;, muuten Linux n&auml;ytt&auml;&auml; ajan v&auml;&auml;rin. Services, joita k&auml;ynnist&auml;&auml;, anna asetusten olla perusmuodossa. Jos haluat, voit konfiguroida my&ouml;s tulostimen: valitse OK kaikkeen, mutta laita A4 ja valitse onko sinulla mustavalko- vai v&auml;ritulostin.</p>
						<p>Seuraavaksi Installer pyyt&auml;&auml; root passwordia. Root on se k&auml;ytt&auml;j&auml;, jolla on oikeudet asentaa ohjelmia, muuttaa kaikkia asetuksia sek&auml; p&auml;&auml;sy kaikkiin hakemistoihin. Muista kirjoittaa se yl&ouml;s johonkin! Nyt pit&auml;isi asennuksen olla valmis ja voitkin k&auml;ynnist&auml;&auml; koneen uudelleen!</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Asennuksen j&auml;lkeen</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jotta voisit k&auml;ynnist&auml;&auml; LinuxLauncherilla uuden Linuxisi, tyhjenn&auml; &quot;RAMDisk&quot;-kohta ja kirjoita &quot;Root partition&quot; kohtaan sen osion nimi Linux-muodossa. K&auml;ynnist&auml; Linux ja kirjoittaudu sis&auml;&auml;n &quot;root&quot;-k&auml;ytt&auml;j&auml;n&auml;. Seuraavassa viel&auml; muutamia alkuvinkkej&auml;.
						<p>Kopiointi ja editointi sujuu helposti Midnight Commanderilla, &quot;mc&quot;. Pakettien asennus hoituu komennolla &quot;rpm -ivh tiedosto.rpm&quot;. Tar-paketit purat komennolla &quot;tar -xfv&quot; ja tar.gz- ja tgz-paketit komennolla &quot;tar -xzfv&quot;. Komentojen ohjeet voit lukea helposti &quot;man&quot;- ja &quot;more&quot;-komentojen yhteisk&auml;yt&ouml;ll&auml;: &quot;man mount | more&quot;. Tab-n&auml;pp&auml;in toimii kuten Amigan KingCon-shelliss&auml;, eli se t&auml;ydent&auml;&auml; tiedosto- ja hakemistonimien loput, kun olet kirjoittanut alun komennosta. Paina nopeasti tabulaattoria kaksi kertaa, niin saat listan vaihtoehdoista.</p>
						<p>Lis&auml;&auml; k&auml;ytt&auml;ji&auml; teet komennolla &quot;adduser&quot;. Tee ainakin yksi, jolla ei ole kaikkia oikeuksia, ja k&auml;yt&auml; konetta t&auml;ll&auml;, niin v&auml;ltyt ylim&auml;&auml;r&auml;isilt&auml; vahingoilta. &quot;exit&quot;-komennolla kirjoittaudut ulos, takaisin login-kohtaan. P&auml;&auml;set my&ouml;s hetkeksi &quot;root&quot;-k&auml;ytt&auml;j&auml;ksi komennolla &quot;su&quot;.</p>
						<p>Yleens&auml; eri osiot laitetaan /mnt/-hakemistoon. Tee ensin hakemisto: cd toimii kuin AmigaDOSin cd: &quot;cd /mnt/&quot;. mkdir on AmigaDOSin makedir: &quot;mkdir amiga3&quot;. &quot;mount&quot;-komennolla tehd&auml;&auml;n osio Linuxille n&auml;kyv&auml;ksi: &quot;mount -t affs /dev/hda3 /mnt/amiga3&quot;. CD-ROM-asemaasi p&auml;&auml;set k&auml;ytt&auml;m&auml;&auml;n komennolla &quot;mount -t iso9660 /dev/cdrom /mnt/cdrom&quot;. Nyt kopioi &quot;System.map&quot;-tiedosto Kernel/Storage/vmapus&quot;-hakemistosta &quot;/boot&quot;-hakemistoon: &quot;cp System.map /boot&quot;.</p>
						<p>Kopioi sitten &quot;XF86_FBDev-pm2-glibc-2.1.gz&quot; johonkin v&auml;liaikaisesti ja pura se. Sen j&auml;lkeen kopioi tiedosto hakemistoon &quot;/usr/X11/bin&quot; ja siin&auml; hakemistossa tee linkki siihen: &quot;ln -s XF86_FBDev X&quot;. K&auml;ynnist&auml; Xconfigurator-ohjelma, jolla s&auml;&auml;d&auml;t X:n melko helposti. T&auml;m&auml;n j&auml;lkeen muokkaa &quot;etc/X11/XF68Config&quot;-tiedostoa esim. &quot;mc&quot;-ohjelman avulla, niin ett&auml; mousetype on &quot;BusMouse&quot; ja ota kommentti &quot;#&quot; pois XKBDisable-kohdalta. Katso esimerkki&auml; Ohjelmat-hakemistossa olevasta tiedostosta. Nyt voitkin k&auml;ynnist&auml;&auml; X:n komennolla &quot;startx&quot;. X:ss&auml; voit vaihtaa resoluutiota painamalla &quot;ctrl leftalt +&quot; ja lopettaa sen mill&auml; hetkell&auml; tahansa painamalla &quot;ctrl leftalt backspace&quot;.</p>
						<p>Kun haluat palata takaisin Amigaan, pit&auml;&auml; Linux sammuttaa turvallisesti erityisell&auml; &quot;shutdown&quot;-komennolla: &quot;shutdown -r now&quot; resetoi koneen automaattisesti, &quot;shutdown -h now&quot; pys&auml;ytt&auml;&auml; koneen toiminnot.</p>
						<p>Jos kaikki sujui hyvin, on Linuxin perusasennus valmis. Tietenk&auml;&auml;n kaikki ei v&auml;ltt&auml;m&auml;tt&auml; toimi heti, enk&auml; kaikkeen voinut neuvoa t&auml;ss&auml; artikkelissa, mutta seuraavassa Saku-lehdess&auml; on toivottavasti jatkoa t&auml;lle artikkelille. Ainakin tulevaisuudessa kotisivuillani tulee olemaan vinkkipalsta, johon muutkin voivat lis&auml;t&auml; omia LinuxAPUS-vinkkej&auml;&auml;n.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Linkkej&auml;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">APUS-ryhm&auml;n sivut:<br>
						<a href="http://linux-apus.sourceforge.net/" target="_blank">http://linux-apus.sourceforge.net/</a>
						<p>APUS-ryhm&auml;n tiedostot:<br>
						<a href="http://sourceforge.net/projects/linux-apus/" target="_blank">http://sourceforge.net/projects/linux-apus/</a></p>
						<p>APUS FTP:<br>
						<a href="ftp://linux-apus.sourceforge.net/pub/linux-apus/" target="_blank">ftp://linux-apus.sourceforge.net/pub/linux-apus/</a></p>
						<p>APUS FAQ:<br>
						<a href="ftp://linux-apus.sourceforge.net/pub/linux-apus/docs/faq-all.tgz" target="_blank">ftp://linux-apus.sourceforge.net/pub/linux-apus/docs/faq-all.tgz</a></p>
						<p>LinuxPPC:<br>
						<a href="http://www.linuxppc.com/" target="_blank">http://www.linuxppc.com/</a> ja <a href="http://www.linuxppc.org/" target="_blank">.org/</a></p>
						<p>Linuxhelp:<br>
						<a href="http://www.linuxhelp.net/" target="_blank">http://www.linuxhelp.net/</a></p>
						<p>RedHat:<br>
						<a href="http://www.redhat.com/" target="_blank">http://www.redhat.com/</a></p>
						<p>RedHatSupport:<br>
						<a href="http://www.redhat.com/support/" target="_blank">http://www.redhat.com/support/</a></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Lopuksi</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Toivottavasti n&auml;itten ohjeitten avulla p&auml;&auml;set ainakin alkuun Linuxin asentamisessa. Todenn&auml;k&ouml;isesti seuraavassa Saku-lehdess&auml; on jatkoa t&auml;lle artikkelille, mutta ainakin kotisivuillani tulee olemaan tulevaisuudessa p&auml;ivitetty versio. Onnea asennukseen, ja toivon paljon hauskoja hetki&auml; Linuxin kanssa.
						<p>S&auml;hk&ouml;postiosoitteeni on <a href="mailto:tec@luukku.com">tec@luukku.com</a> ja kotisivut l&ouml;ytyv&auml;t osoitteesta <a href="http://teccrom.tripod.com/" target="_blank">http://teccrom.tripod.com/</a>. Lis&auml;ksi olen IRCnetin #amigafin- ja #linux-apus-kanavilla nimell&auml; Teccrom.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
