<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Testit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Visa Electron</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">&quot;Tohtori AivoTurmio&quot; &lt;<a href="mailto:drbraindamage@nic.fi">drbraindamage@nic.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Olet melko todenn&auml;k&ouml;isesti kuullut juttua uudesta kortista, Visa Electronista. Olet kuullut juttuja, ett&auml; sill&auml; saattaisi pysty&auml; tilamaan AmigActiven netin kautta, onhan se Visa. Olet kuullut, ett&auml; se kelpaisi bensan tankkauksessa itsepalveluasemilla. Mutta pit&auml;v&auml;tk&ouml; v&auml;itteet paikkansa?
						<p>Valitettava vastaus on, ett&auml; p&auml;&auml;asiassa eiv&auml;t. Todellisuudessa Visa Electron ei ole sama asia kuin Visa. Visa on luottokortti, Visa Electron ei. T&auml;m&auml;n vuoksi Visa Electronista my&ouml;s puuttuvat luottokortin tuomat edut, joista Amigisteja kiinnostavimpana nettikelpoisuus.</p>
						<p>Kysyin paikkakuntani pankeilta ja parista l&auml;hipaikkakunnan pankistakin Visa Electronista. L&auml;hes kaikki pankit pyrkiv&auml;t ensin tyrkytt&auml;m&auml;&auml;n Visa Electronin minulle ja vasta sen j&auml;lkeen selvitt&auml;m&auml;&auml;n, miten tuon nettihomman kanssa on. Kun ensiksi kyselin pankeilta, sanoivat yhdet, ett&auml; heill&auml; on nettitunnukset, toiset, ett&auml; heill&auml; ei ole ja kolmannet ettei sellaisia olekaan. Koska Osuuspankki tarjosi tuon Visa Electronin ilmaiseksi alle 25-vuotiaille, p&auml;&auml;tin kokeilla.</p>
						<p>Kun k&auml;vin hakemassa korttia, sopimuksessa oli kaksi eri rastituskohtaa:<br>
						Olen vastaanottanut:<br>
						(1) Automaattien k&auml;ytt&ouml;&ouml;n mahdollistavan tunnusluvun,<br>
						(2) s&auml;hk&ouml;iseen tunnistamiseen mahdollistavan tunnusluvun.</p>
						<p>Rasti oli totta kai vain (1) kohdan kohdalla. Kysyin saman tien, mik&auml; on t&auml;m&auml; kohta (2) ja miten sen saa. Nyt pankkineiti soitti p&auml;&auml;konttoriin ja kysyi asiasta ja selvisi, ett&auml; tuo s&auml;hk&ouml;tunnus oli vasta suunnitelmissa, eik&auml; sen tulosta ollut viel&auml; tietoa. Olisi s&auml;&auml;st&auml;nyt paljon vaivaa, jos pankkineiti olisi vaivautunut selvitt&auml;m&auml;&auml;n asian jo silloin, kun k&auml;vin tuosta nettik&auml;yt&ouml;st&auml; kysym&auml;ss&auml;. Sama tyyli yritti jatkua muissakin pankeissa. Nyt vain tiesin, mit&auml; kysy&auml; ja tiesin, ett&auml; voin pyyt&auml;&auml; heit&auml; soittamaan p&auml;&auml;konttoreihinsa.</p>
						<p>T&auml;m&auml;n j&auml;lkeen selvisi, ettei Meritassa, Osuuspankissa eik&auml; kapina-Osuuspankeissakaan ole Visa Electronissa s&auml;hk&ouml;tunnuksia. Sek&auml; Meritassa ett&auml; Osuuspankissa on kyll&auml; suunnitteilla tuo s&auml;hk&ouml;tunnus, mutta p&auml;&auml;tellen siit&auml;, ettei kumpikaan antanut mink&auml;&auml;nlaista tietoa sen mahdollisesta tuloajasta, ominaisuus kuulostaisi l&auml;hinn&auml; kaukaiselta tulevaisuudelta, jota ei kannata j&auml;&auml;d&auml; odottamaan.</p>
						<p>Katsoin sitten ST1-asemalla, ett&auml; tankkaukseen kelpaa my&ouml;s Visa-kortti, joten k&auml;vin sitten kysym&auml;ss&auml; ST1-aseman hoitajalta, k&auml;yk&ouml; tuo Visa Electron niiden automaatteihin, jolloin hoitaja vastasi: &quot;Joo, kaikki luottokortit k&auml;y kyll&auml;.&quot; Iloissani sitten ensi kerralla menin kortin kanssa tankkaamaan, ja vastaukseksi sain vain kovan PIIP-&auml;&auml;nen. Visa Electron ei siis kelpaa siihenk&auml;&auml;n.</p>
						<p>Visa Electronissa on siru, johon voi ladata sopivista automaateista rahaa. Ainoa toivo tankkaamiseen Electronilla on, ett&auml; t&auml;h&auml;n siruun rahaa siirt&auml;m&auml;ll&auml; voisi noita itsepalvelutankkauksia k&auml;ytt&auml;&auml;, mutta suunnattomasti ep&auml;ilen senkin toimivuutta.</p>
						<p>Mik&auml; Visa Electron loppujen lopuksi on? Visa Electron ei ole Visaa vastaava, vaikka omaakin samaa nimess&auml;&auml;n. Visa Electronia ei voi k&auml;ytt&auml;&auml; netiss&auml;, vaikkakin suunnitelmissa on tuo mahdollisuus, mutta sen toteutumisajankohdasta ei ole tietoa. Visa Electronia ei voi k&auml;ytt&auml;&auml; itsepalvelutankkauksissa, jotka pyyt&auml;v&auml;t seteleit&auml; tai korttia maksuv&auml;lineeksi.</p>
						<p>Sen sijaan Visa Electron kelpaa tavalliseksi maksuautomaattikortiksi, jolla voi siis samoin kuin esimerkiksi pankkien automaattikortilla nostaa rahaa automaateista, maksaa laskuja automaateilla jne. Visa Electron tarkistaa aina, samoin kuin tavallinen automaattikorttikin, ett&auml; tilill&auml; on tarpeeksi katetta, jotta kyseinen tapahtuma kyet&auml;&auml;n tekem&auml;&auml;n.</p>
						<p>Se mik&auml; Visa Electronin erottaa tavallisesta automaattikortista, on mahdollisuus nostaa rahaa automaateista my&ouml;s ulkomailla. Kaikista ulkomailla olevista automaateista ei maksu kuitenkaan onnistu, vaan ainoastaan Visa-automaateista, joita on 117 maassa. Lis&auml;ksi Visa Electron antaa aina kyseisen maan valuuttaa ja hoitaa my&ouml;s muunnoksen automaattisesti. Eli jos suunnittelet ulkomaanmatkaa, niin Visa Electron on ihan k&auml;yt&auml;nn&ouml;llinen, muuten se ei mik&auml;&auml;n ihmeellinen ole.</p>
						<p>Osuuspankit tarjoavat Visa Electronia alle 25-vuotiaille ilmaiseksi, muuten hinta menee jossain alle 100 markan paikkeilla. Merita ei anna Visa Electronia ilmaiseksi edes alle 25-vuotiaille. Tavalliselle asiakkaalle Meritan hinta on 60 mk/vuosi, kanta-asiakkaille (v&auml;hint&auml;&auml;n 20 000 mk tilill&auml; irtorahaa, osakkeet eiv&auml;t k&auml;y) 40 mk vuodessa ja avainasiakkaille (v&auml;hint&auml;&auml;n 80 000 mk irtorahaa tilill&auml;, osakkeet eiv&auml;t k&auml;y) se on ilmainen. Lis&auml;ksi ik&auml;&auml; pit&auml;&auml; olla v&auml;hint&auml;&auml;n 16 vuotta, jotta tuon kortin voi saada.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
