<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
2. AMIGA und Edivision LLC vereinbaren Kooperation 
 
AMIGA, Inc. (http://www.amiga.com) informiert: 
 
»Edivision arbeitet mit Amiga zusammen, um aufregende, neue Inhalte zu  
entwickeln 
 
Snoqualmie, WA - 16. Juli 2001 
 
Heute gab Edivision LLC bekannt, dass sie Spiele f&uuml;r das Amiga Digital 
Environment (AmigaDE) erzeugen werden. Die Firma plant drei Titel f&uuml;r die 
AmigaDE-Umgebung im kommenden Jahr. Die Spiele werden f&uuml;r Japan &uuml;ber die 
Sharp Space Town Webseite vertrieben werden, und weltweit &uuml;ber andere 
Amiga-Vertriebskan&auml;le. Amiga und Edivison geben ebenfalls eine gemeinsame 
Partnerschaft bekannt, in der Edivision technologische Schl&uuml;sselteile f&uuml;r 
das AmigaDE liefern wird. 
 
Das Kern-Team von Edivision verf&uuml;gt &uuml;ber mehr als 30 Jahre an Erfahrung im 
Bereich Computer-Grafik. Patrick Roberts erschuf 2D- und 3D-Effekte f&uuml;r 
Walt Disneys Animations-Klassiker "Dinosaur" und Software und Animationen 
f&uuml;r Dreamworks Animation, Disney Classics und dem Disney-TV-Kanal. Jeremy 
Engelman ist einer der besten 3D-K&uuml;nstler auf der Welt. Sein bekanntestes 
Werk sind die Grafiken f&uuml;r Cyans Riven, der Fortsetzung von Myst. Steven 
Haun wurde als Hersteller von Computer-Grafiken ausgezeichnet und verf&uuml;gt 
&uuml;ber eine mehr als 10-j&auml;hrige Erfahrung mit Computer-Grafiken und der 
Unterhaltungsindustrie. Seine Referenzen umfassen die Produktion von 
Effekten f&uuml;r Warner Brothers, Universal Pictures, ABC, CBS und Fox 
Televison. 
 
"Diese Partnerschaft mit Edivision wird den Komsumenten eine Reihe von 
aufregenden Inhalten und erfreuliche Erfahrungen bieten, die sie mit 
anderen werden teilen wollen", sagte Bill McEwen, Pr&auml;sdent und CEO von 
Amiga Inc.. "Patrick, Jeremy und Steven sind langj&auml;hrige Unterst&uuml;tzer von 
Amiga und wir sch&auml;tzen ihre Beitr&auml;ge als Antrieb f&uuml;r die Einf&uuml;hrung 
unserer Software. Ihre Fachkenntnisse im Bereich Spiele und 
Unterhaltungsindustrie wecken die Vorfreude auf einige revolution&auml;re 
Spiele f&uuml;r den PDA-Markt." 
 
"Wir freuen uns sehr, mit Amiga an der Erzeugung faszinierender Inhalte f&uuml;r 
das AmigaDE zu arbeiten", sagte Patrick Roberts, einer der Gr&uuml;nder von 
Edivision. "Als Amiga seine Partnerschaft mit Sharp bekannt gab, sahen wir 
dies als eine Gelegenheit, fr&uuml;hzeitig in eine neue, aufregende 
Spiele-Plattform einzusteigen. Ger&auml;te wie das Sharp Zaurus und andere PDAs 
haben das Potential, eine neue und andere Generation von Spielern zu 
erreichen." 
 
Edivision wird sich f&uuml;r die erste Reihe von Ver&ouml;ffentlichungen auf 
Original-Titel konzentrieren. Die Firma verhandelt auch mit anderen 
Anbietern, um deren Titel auf die AmigaDE-Plattform zu bringen. 
 
Der Markt f&uuml;r Video-Spiele in den Vereinigten Staaten, der Arcade-, PC-, 
Konsolen- und Online-Spiele umfasst, wird derzeit auf einen Wert von 11 
Milliarden US-Dollar gesch&auml;tzt. Die AmigaDE-Plattform erlaubt es 
Entwicklern, Spiele zu erzeugen, die auf diesen Markt zielen. Die 
bin&auml;r-portierbare Natur der Inhalte des AmigaDE versetzt Applikationen in 
die Lage, nahtlos von Handys und Handheld-Ger&auml;ten auf Settop-Boxen und bis 
hin zu Desktop-Computern und Servern zu wandern.« 
 
 
Edivision (http://www.e-d-i-v-i-s-i-o-n.com) informiert: 
 
»Los Angeles, CA - Juli 2001 
 
Heute gab Edivision LLC die Unterzeichnung einer Vertriebsvereinbarung mit 
Amiga Inc. bekannt. Amiga Inc. wird weltweit die Vertriebsrechte f&uuml;r von 
Edivision unter Verwendung der AmigaDE Betriebsumgebung produzierte 
Software-Titel haben. Ebenfalls Bestandteil der Vereinbarung ist, dass 
Edivision Technologien, die sie f&uuml;r ihre AmigaDE-Titel entwickeln wird, 
Amiga Inc. zur Verf&uuml;gung stellen wird. 
 
Edivision LLC wird w&auml;hrend des kommenden Jahres drei Produkte erzeugen, die 
auf der AmigaDE-Plattform laufen werden. Zwei dieser Produkte werden 
exklusiv dem Bereich Unterhaltung gewidmet sein und das dritte wird 
Utilities, Treiber und erweiterte Funktionalit&auml;t bieten. Edivision wird 
sich f&uuml;r ihre erste Reihe von Ver&ouml;ffentlichungen auf Original-Titel 
konzentrieren, die Firma verhandelt jedoch mit anderen Entwicklern, um 
deren Titel zur AmigaDE-Plattform zu bringen. 
 
"Diese Partnerschaft mit Edivision wird den Konsumenten eine Reihe von 
aufregenden Inhalten und erfreuliche Erfahrungen bieten, die sie mit 
anderen werden teilen wollen", sagte Bill McEwen, Pr&auml;sident und CEO von 
Amiga Inc.. Ihre Fachkenntnisse im Bereich Spiele und 
Unterhaltungsinsdustrie wecken die Vorfreude auf einige revolution&auml;re 
Spiele f&uuml;r den PDA-Markt." 
 
"Titel, die f&uuml;r das AmigaDE erzeugt wurden, sind in der Lage, ohne 
&Auml;nderungen auf einer Reihe von Plattformen zu laufen, einschlie&szlig;lich 
PocketPCs, Zaurus, Windows und Linux. Dies gibt uns einen gewaltigen 
Vorteil bei der Markteinf&uuml;hrung dieser Titel", merkte Steven Haun an, CFO 
von Edivision. "Das erlaubt es uns, uns bei der Entwicklung auf den Titel 
an sich zu konzentrieren, und nicht auf die Einschr&auml;nkungen durch einen 
Cross-Plattform-spezifischen, kleinsten gemeinsamen Nenner." 
 
&Uuml;ber Amiga Inc. 
 
Amiga Inc. bietet eine Entwickler-Technologie zum Schreiben und Portieren 
von Applikationen auf ein neues, die Hardware erkennendes 
Multimedia-Betriebssystem. AmigaDE ist eine gemeinsame Entwicklung von der 
Tao-Group aus Reading, England, und Amiga Incorporated. Auf dem AmigaDE 
basierende Applikationen laufen ohne &Auml;nderungen auf x86, PowerPC, M Core, 
ARM, StrongARM, MIPS R3000, R4000, R5000, SH3, SH4, und NEC V850 
Prozessoren. Das AmigaDE kann gehosted auf Linux, Embedded Linux, Windows 
95, 98, 2000, NT, CE und QNX4 laufen. Amiga hat seinen Hauptsitz in 
Snoqualmie, WA, 28 Meilen &ouml;stlich von Seattle und unterh&auml;lt 
Niederlassungen auf der ganzen Welt. Amiga kann unter 0001 (425) 396-5660 
telefonisch erreicht werden oder besuchen Sie Amiga im Web auf 
www.amiga.com. 
 
&Uuml;ber Edivision 
 
Edivision LLC wurde im Mai 2001 in Los Angeles, CA, gegr&uuml;ndet. Die Gr&uuml;nder 
Patrick Roberts, Jeremy Engelman und Steven Haun sind Veteranen der 
Computer-Spiele-Industrie. Sie bekamen zahlreiche Auszeichnungen und 
Belobigungen f&uuml;r ihre hervorragende Arbeit im Bereich Computer-Grafik und 
Animation. F&uuml;r weitere Einzelheiten &uuml;ber Edivision besuchen Sie bitte 
www.e-d-i-v-i-s-i-o-n.com, schreiben Sie Steven Haun oder rufen Sie ihn 
an: 0001 (323) 578-1998. 
 
Alle Warenzeichen sind im Besitz der jeweiligen Eigent&uuml;mer. Alle Rechte  
vorbehalten.« 
 
 
Die &Uuml;bersetzungen aus dem Englischen stammen von Martina Jacobs 
(mj@amiga-news.de) und wurden f&uuml;r unseren Partner amiga-news.de  
durchgef&uuml;hrt. 
 
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
