<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
Neues zum AmigaNG 
----------------- 
 
1. Zusammenfassung der j&uuml;ngsten Ank&uuml;ndigungen AMIGAs (von Oliver Tacke) 
 
Anl&auml;sslich der Amiga Messe AmiWest in Sacramento, Kalifornien verk&uuml;ndete  
Amiga CEO Bill McEwen diverse Neuigkeiten.  
 
Der AmigaOne, gebaut von Escena (und vertrieben von Eyetech), soll im 4.  
Quartal 2001 ausgeliefert werden. Angepeilt ist der 01. November,  
allerdings sind feste Termine bekannterma&szlig;en mit Vorsicht zu genie&szlig;en. Zur  
Zeit werde an den CPU- Karten gearbeitet. 
 
Die Version 4.0 des Amiga Betriebssystems, die nur auf dem AmigaOne laufen  
wird, soll ebenfalls am 01. November in den Handel kommen. Einige Dinge  
seien bereits fertig, so z.B. das neue Filesystem, der neue TCP/IP-Stack  
und die 3D-Treiber f&uuml;r die Voodoo 3. An anderen Dingen werde noch  
gearbeitet, darunter das RTG System und die Treiber f&uuml;r die Matrox G450 und  
G550. 
Entwickelt wird das AmigaOS 4.0 zur Zeit auf diversen Amiga 3000 und 4000  
in Verbindung mit CyberstormPPC Karten, dem PCI-Bus-Board Prometheus von  
Matay und StormC V4. 
 
&Uuml;berraschend sogar f&uuml;r Amiga (man hatte kurz vor der Messe davon erfahren)  
war die Verf&uuml;gbarkeit eines neuen Amiga Emulators f&uuml;r x86 Systeme mit dem  
Codenamen "Amithlon". Entwickelt wurde das Programm von Harald Frank (VMC)  
und Bernd Meyer (Autor des UAE JIT Compilers) basierend auf UAE JIT. Ein  
minimales Linuxsystem, das die Treiber f&uuml;r die Hardware liefert,  wird  
benutzt, um die Emulation des 68k AmigaOS zu starten. Von Linux selbst  
bekommt man nichts mit, so dass man das Gef&uuml;hl hat, das AmigaOS laufe  
direkt auf der x86 Architektur, weshalb es auch unter dem Namen "Amiga x86"  
ab dem 4. Quartal 2001 vertrieben werden wird. 
Laut Aussagen der Programmierer werde es mit Amithlon aber m&ouml;glich sein,  
auch x86 native Routinen oder Programme f&uuml;r das AmigaOS zu schreiben. 
Die Geschwindigkeit &uuml;bertreffe einen 68060 Prozessor auf aktuellen x86  
Prozessoren (auch ohne native Programme) um L&auml;ngen. Erkauft wird diese  
Geschwindigkeit allerdings durch den Verzicht der Emulation einiger Custom  
Chips wie z.B. des AGA Chipsatzes, d.h. es laufen nur Programme, die auf  
diese Chips nicht angewiesen sind. Bisher g&auml;be es auch noch keine Emulation  
des Sounds. Eine weitere Einschr&auml;nkung wird sein, dass maximal AmigaOS 3.9  
unterst&uuml;tzt wird, nicht aber AmigaOS 4.x, da dieses auf dem PowerPC l&auml;uft,  
nicht auf 68k-Prozessoren. Zur Zeit g&auml;be es keine Pl&auml;ne, das AmigaOS auf  
x86 zu portieren. 
 
Ebenfalls im 4. Quartal 2001 werde das AmigaDE 1.0 ver&ouml;ffentlicht, an dem  
mehr als 30 Programmierer weltweit arbeiten w&uuml;rden und f&uuml;r das mehr als  
3000 Entwickler Inhalt produzierten. Sharp w&uuml;rde f&uuml;r den Zaurus eine Lizenz  
&uuml;ber ein Paket mit f&uuml;nf Spielen (Spitzname "Series Zero") erhalten. 
 
 
Zugeh&ouml;rige Pressemeldung: 
[http://www.amiga.com/corporate/080101-amiwest.shtml] 
Inoffizielle FAQ zu Amithlon:  
[http://byron.csse.monash.edu.au/amithlon.html] 
 
Oliver Tacke &lt;oliver@aakt.de&gt; 
 
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
