<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
3. PerSuaSiVe SoftWorX (Andreas Kleinert) zur Amithlon-Entwicklung 
 
PerSuaSiVe SoftWorX (http://www.ar-kleinert.de) informiert: 
 
»Obwohl mir nur relativ wenig freie Zeit hierf&uuml;r zur Verf&uuml;gung steht,  
untersuche ich die M&ouml;glichkeit, x86-native Plugins f&uuml;r meine Software unter  
der Amithlon-Umgebung bereitzustellen. 
 
Da Diversifikation sich &uuml;ber l&auml;ngere Sicht nicht auszahlt - insbesondere  
wenn die Zeit so knapp bemessen ist und wenn man sich die veraltete  
aktuelle Amiga PPC-Plattform anschaut (200 MHz ohne l2-cache) dann k&ouml;nnte  
diese x86-Entwicklung den aktuellen PPC-Support in meiner Software komplett  
ersetzen. Support und Testen f&uuml;r PPC, PPC/MorphOS und x86 w&auml;re zuviel. 
 
Grunds&auml;tzlich wird momentan weniger Software bestellt und registriert als  
jemals zuvor - was zu zwei &Uuml;berlegungen f&uuml;hrt: erstens lohnt es sich nicht,  
in eine PPC-Maschine zu investieren, wenn diese sich niemals mehr  
amortisieren wird. Zweitens, falls "niemand" anderes an diesen x86-Sachen  
interessiert ist, so handelt es sich um meinen privaten Spa&szlig; f&uuml;r meine  
eigenen Bed&uuml;rfnisse, f&uuml;r den Fall, dass mein 68k/PPC-Amiga irgendwann  
schlicht auseinanderf&auml;llt. Amiga 68k/PPC Software wird langsam zum reinen  
Hobby. 
 
Das waren meine 2 Cents - ich w&auml;re jederzeit f&uuml;r eine architektonisch  
elegante PPC-Architektur gewesen, aber in den letzten 6 Jahren ist dies  
nicht passiert, und nun ist es meiner Meinung nach zu sp&auml;t. 
 
Nichtsdestotrotz stehe ich der MorphOS-Entwicklung und den anderen PPC- 
Ans&auml;tzen voller Sympathy gegen&uuml;ber. Man mag sich jedoch bitte daran  
erinnern, dass ich zu den allerersten geh&ouml;rte, die PPC auf dem Amiga  
unterst&uuml;tzt haben - aber denselben Fehler noch mal machen? Nein, diesmal  
nicht...« 
 
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
