<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
Diverse Amiga-News 
------------------ 
 
1. Ank&uuml;ndigung: »AMIGA-Meeting 2001 - das Party-Wochenende« 
 
Thorsten Mampel (Thorsten.Mampel@gmx.de) informiert: 
 
»Ein ganzes Wochenende Party und Spass rund um den Amiga. 
 
Zu dem Programm geh&ouml;ren: 
 
- Demo- und Filmvorf&uuml;hrungen &uuml;ber Beamer 
- Kostenlose Hard- und Softwareb&ouml;rse f&uuml;r Amigas und Zubeh&ouml;r 
- Workshops 
- Erstellung einer Party-CD durch die Teilnehmer 
- Netzwerk ins InterNet 
- Webcam  
- G&auml;stebuch 
- u.v.m. 
 
Bis zu 50 Rechner k&ouml;nnen aufgebaut und vernetzt werden.  
 
Seid dabei und sichert Euch rechtzeitig einen Platz !  
 
Vom 12.10. bis zum 14.10.2001! 
 
Durchgehend von Freitag (12.10) bis Sonntag (14.10) kann Mann / Frau am 
eigenen AMIGA alles machen, zeigen, spielen, programmieren u.s.w.  Die 
Hauptsache ist:  es macht Spa&szlig;! 
 
F&uuml;r diejenigen die 'ne M&uuml;tze Schlaf ben&ouml;tigen bietet das Hotel Tanneneck 
gem&uuml;tliche Zimmer.  - Ganz wichtig anmelden!  - (Dies gilt auch f&uuml;r Tages- 
g&auml;ste die ihren Rechner mitbringen wollen - da es "nur" ca.  50 
Rechnerpl&auml;tze gibt) 
 
Dieses Treffen wird vom Amiga Club Schleswig-Holstein und dem ACH (Amiga 
Club Hamburg e.V) organisiert und ist aus Kontakten der DAUG entstanden. 
 
Wer darf mitmachen? 
 
Jeder!  - der den AMIGA mag, mit ihm arbeitet oder spielt, oder ihn einfach 
mal kennenlernen m&ouml;chte. 
 
Sch&ouml;n w&auml;re es nat&uuml;rlich wenn Du Deinen AMIGA mitbringen w&uuml;rdest und zeigst 
was Du mit ihm machst!  - Sei es Grafik, Animation, Raytraycing, Sound, 
Textverarbeitung, DTP, Video, Spiele oder eine andere Anwendung die man mit 
dem AMIGA machen kann. 
 
Auch als "Zaungast" bist Du herzlich willkommen!  Schau zu was andere mit 
dem AMIGA machen.  - vielleicht findest Du neue Anregungen - oder Du kannst 
jemanden weiterhelfen. 
 
Genie&szlig; die Vorf&uuml;hrungen, mach mit bei den Workshops, oder bei einer der 
anderen Aktionen! 
 
Wie kann ich mich anmelden? 
 
Am einfachsten geht es &uuml;ber das Anmeldeformular im InterNet.  Hier haben 
wir schon alles vorbreitet und Du brauchst nur deine Adresse ausf&uuml;llen, 
ausw&auml;hlen wie die Teilnahme aussehen soll - und dann die eMail abschicken. 
Falls Du lieber den Postweg benutzen m&ouml;chtest : 
 
Norbert Kapahnke Hotel Tanneneck Birkenweg 28 24576 Bad Bramstedt 
 
Bei Fragen wende Dich an Norbert Kapahnke, Tel: 04192/500071 oder  
Norbert@amigameeting.de ! 
 
- Teilnahme Fr-So incl.2 &Uuml;bernachtungen 2x Abendessen (warm) und Fr&uuml;hst&uuml;ck:  
150,--DM 
 
- Teilnahme Fr-Sa oder Sa-So incl. Abendessen (warm) und Fr&uuml;hst&uuml;ck: 75,--DM 
 
- f&uuml;r den Tagesgast: 10,-- DM 
 
Wo findet das AMIGA Meeting statt? 
 
Im Hotel Tanneneck, Bad Bramstedt, n&ouml;rdlich von Hamburg ! 
 
...und so findest Du hin: 
 
Autobahn A4, Von der Autobahnabfahrt Nr.17 (Richtung Bad Bramstedt) f&auml;hrst 
Du hinterm Bahn&uuml;bergang links ins Kurgebiet.  &Uuml;berquerst die Br&uuml;cke und 
f&auml;hrst dann rechts in den Birkenweg.  Ganz am Ende - auf der rechten Seite 
- befindet sich das Hotel Tanneneck. 
 
Der Weg wird ausgeschildert sein ! 
 
Bad Bramstedt kannst Du auch mit der Bahn oder per Bus erreichen« 
 
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
