<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
AMIGA-aktuell-Forum 
------------------- 
 
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt  
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke"  
zusammengefasst.  
 
Wenn Ihr einen Beitrag habt, schreibt bitte an: 
 
        Carsten Schr&ouml;der 
        Helmoltstra&szlig;e 10 
        37081 G&ouml;ttingen 
 
E-Mail: aakt@aakt.de 
 
 
1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren 
 
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage  
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere  
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst  
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der  
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an aakt@aakt.de 
 
 
Standpunkt des letzten Monats: »Die Amiga-Browser-Hersteller sollten sich  
zusammenschlie&szlig;en, um auf diese Weise ein wirklich konkurrenzf&auml;higes  
Produkt dieser Art auf den Markt bringen zu k&ouml;nnen.« 
 
 
G&uuml;nter Lang (LASOWA@t-online.de) meint dazu: 
 
»Diesen Vorschlag kann ich nur begr&uuml;&szlig;en, doch mir fehlt der Glaube daran.« 
 
 
Gernod Schomberg (g.schomberg@t-online.de) schreibt: 
 
»Konkurrenzf&auml;hig? Zu wem? Ein Browser f&uuml;r den Amiga kann doch wohl nur  
einem Browser auf dem Amiga Konkurrenz machen. Ein PC-Benutzer wird kaum  
auf den Amiga umsteigen, selbst wenn der "VoyWebBrowse" besser ist als der  
IE! Da m&uuml;ssten doch erst mal ganz andere Sachen auf dem Amiga m&ouml;glich sein!  
Wenn man erst durch kreuz und quer gesteckte Karten eine h&ouml;here  
Geschwindigkeit mit Unterst&uuml;tzung f&uuml;r die eine oder andere Zusatzkarte  
bekommt, kann man das h&ouml;chsten einem alten Amiga-Fan zumuten, aber nicht  
einem normalen PC-Benutzer. 
 
F&uuml;r uns w&auml;re es sch&ouml;n, einen Browser zu bekommen, der das kann, was andere  
als Standard setzen. Aber wichtiger w&auml;re eine vern&uuml;nftige Hardware, die  
moderne Dinge auf einfache Weise unterst&uuml;tzt. Und deren Firmware (AmigaDE?)  
vielleicht sogar wieder die geniale Idee der Amiga-V&auml;ter verwirklicht,  
Zusatzger&auml;te ohne Klimmz&uuml;ge erkennen und einbinden zu k&ouml;nnen! Da wir uns in  
modernen Zeiten befinden, vielleicht sogar solche, die f&uuml;r ein ganz anderes  
Betriebssystem vorgesehen sind :-)« 
 
 
Nun zur aktuellen Frage des Monats: 
 
»Was h&auml;ltst du von der Ank&uuml;ndigung AMIGAs, einen offiziellen Amiga-Emulator  
f&uuml;r x86-Rechner auf den Markt zu bringen?« 
 
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
