<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
 
2. Update: So senkt ihr eure Telekom-Rechnung! 
 
Zwar weist die Tariftabelle auch diesmal wieder viele &Auml;nderungen auf, der  
Preisauftrieb der letzten Monate hat sich jedoch abgeschw&auml;cht: 
 
G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.): 
 
Wann:    |      Wohin:  Festnetz -&gt; Festnetz      Festnetz -&gt; Mobilfunknetz 
=========================================================================== 
werktags 7-8 Uhr   ElisaNet (010050), 4,3 Pfg.  Teledump (0190031), 37 Pfg.  
werktags 8-18 Uhr  Teledump (0190031), 5,5 Pfg. Teledump (0190031), 37 Pfg. 
werktags 18-21 Uhr o.tel.o (01011), 4,3 Pfg.    Teledump (0190031), 37 Pfg. 
 
sa/so/feiert. 7-21 Uhr o.tel.o (01011), 4,3 Pfg.  Teled. (0190031), 37 Pfg.  
 
t&auml;glich 21-22 Uhr  GTS (01040), 3,8 Pfg.        Teledump (0190031), 37 Pfg.  
t&auml;glich 22-7 Uhr   Talkline (01050), 3,7 Pfg.   Teledump (0190031), 37 Pfg.  
 
(Alle Angaben ohne Gew&auml;hr) 
 
 
Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige  
Anmerkungen: 
 
* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag. 
 
* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen. 
 
* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein   
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften       
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                   
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen. 
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr         
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte   
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen      
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom     
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte. 
 
* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,       
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass     
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im      
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen      
  l&auml;sst. Mein Favorit: http://www.teltarif.de 
 
* Alle in der Tabelle oben aufgef&uuml;hrten Anbieter rechnen im Minutentakt ab. 
 
 
F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98. 
 
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
