<html>
<head>

<title>Reisebericht Teil 2</title>

<META NAME = "Author" CONTENT = "Arne Steputat (Highnoon of Xymox Project)">
</head>
<body>

<font color="#0000FF" size="3">

<b><u>Und es geht weiter mit meinem Bericht unserer Karibiktour
vom 29.01.2001 bis zum 25.04.2001.</u></b><br><p>

Wir liefen also in <b>San Juan</b> ein, der Hauptstadt Puerto Ricos. Hier lagen wir f&uuml;r
ca.3Ω Tage, meiner Ansicht viel zu kurz. Ich spreche, glaube ich, nicht f&uuml;r mich alleine,
wenn ich sage, daﬂ San Juan der beste Auslandshafen war, den wir hatten.
Wir lagen direkt an der Passagier Pier mitten im Zentrum der Stadt. Von dort aus konnte man
zu Fuss das Hafenufer mit seinen Kneipen (sowie McDoof und das Hard Rock CafÈ) bequem erreichen.
Ein Pflichtbesuch war nat&uuml;rlich auch das Schnellrestaurant Hooters, wo das Essen von
leicht bekleideten Kellnerinnen an den Tisch gebracht wird. Leider hatten sie immer noch
ziemlich viel an und das Essen war doch recht teuer.<br><p>
Naja, trotzdem gibt es sehr viele Sehensw&uuml;rdigkeiten in San Juan die auch fast alle von
uns besucht wurden. Neben Burgen und Festungen (wie z.B. die alte Stadtmauer aus dem Krieg)
gibt es auch viele kleine Sachen, wie unter anderem kleine typische L&auml;den oder StraﬂencafËs.
Auﬂer in der Stadt rumzubummeln haben wir uns bei bestem Wetter nat&uuml;rlich auch an den
Strand begeben um zu baden und nat&uuml;rlich um den Strandsch&ouml;nheiten nachzuschauen und
zu flirten. Tja, so ist das, fast wie Urlaub. Trotz allem sind wir nach fast 4 Tagen wieder
aus diesem sch&ouml;nen fleckchen Erde verschwunden. Schade. Aber es stand noch das Man&ouml;ver
JTFEX, das eigentliche Anliegen unserer Reise.<br><p>

Das JTFEX-Man&ouml;ver lag also vor uns. Dieses Man&ouml;ver haben wir zusammen mit den Amerikanern
und Canadiern durchgef&uuml;hrt. Hier trafen wir auch zum ersten Mal auf den amerikanischen
Flugzeugtr&auml;ger U.S.S. Enterprise. (Nein, fliegen konnte das Schiff nicht :)) Bei diesem Man&ouml;ver
ging es also darum unsere Langstrecken Raketen zu testen. Ob die Zielanweisung klappt, die Zielauffassung,
nat&uuml;rlich der Abschuﬂ der Rakete usw. Verschossen haben wir 3 NATO Seasparrow, 4 MM38 Exocet und
einige kleinere RAM-Flugkˆrper. Von unseren anderen Einheiten (FGS K&ouml;ln, FGS Niedersachsen und dem 
Zerst&ouml;rer M&ouml;lders) wurden nat&uuml;rlich auch entsprechend deren Bewaffnung gefeuert was das
Zeug h&auml;lt. Die Amis und Canadier haben dann auch Ihre Waffen an uns ausprobiert.<br><p>
Das lief in etwa so ab:
Zwischen uns und unserem "Feind" lag ein Gebiet von etwas mehr als 40 Seemeilen (1 SM = 1,84 KM). Die Reichweite
der Raketen die wir abfeuerten betr&auml;gt aber nur ca. 38 SM. Bevor uns also der Flugk&ouml;rper erreicht,
geht ihm der Sprit aus und f&auml;llt ins Meer. Mittels Computer kann aber die Flugbahn weiterberechnet werden
und somit wird bestimmt ob der Schuss ein Treffer war oder nicht.<br><p>

Nach diesem Tag sind wir noch kurz wieder in Roosevelt Roads eingelaufen um wieder aufmunitioniert zu werden.
Das hat aber nur insgesamt 2 Tage in Anspruch genommen. Nun waren wir also auf dem Weg in Richtung Charleston.
Auf dem Weg dorthin war eigentlich nichts besonderes vorgefallen, auﬂer, daﬂ wir schon wieder in n&ouml;rdliche
Gefilde eingedrungen sind. Das machte sich auch entsprechend am Wetter bemerkbar, denn es wurde zunehmend
k&auml;lter und ungem&uuml;tlicher.<br><p>

Am 12.03.2001 liefen wir zum letzten Mal aus Rosevelt Roads aus. Wir wollten nach Charleston, wo wir dann auch
am 27.03. eintreffen sollten. Vorher hatten wir auf dem doch recht langen Transit (eigentlich h&auml;tten wir
nicht so lange gebraucht) noch einige interne Kampszenarien eingespielt bekommen, damit wir nicht einrosten.
Also mal hier ein Feuer l&ouml;schen oder mal da einen Wassereinbruch stoppen oder mal Gefechtsdienst. Also das
&uuml;bliche. Nichts besonderes. Da die Temperaturen auch schon wieder zur&uuml;ckgingen war das alles kein
Problem.<br>
Dann endlich: <b>Charleston/USA</b> Unser Ziel war da. Wir waren endlich in den USA, dem Land der unbegrenzten 
M&ouml;glichkeiten. Und gleich fallen einem die Autos ins Auge, boah was f&uuml;r Autos. Danach die Benzinpreise:
1 Gallone (rund 3 Liter) f&uuml;r 1,25 US-Dollar - heiﬂt also 3 Liter (Normal)Benzin f&uuml;r 2,50 DM !
Das ist doch schon mal was. Aber die Autos verbrauchen wahrscheinlich auch dementsprechend mehr von dem Brennstoff :)<br>
Nach dem Anlegen kurz M&uuml;ll von Bord, dann IO-Musterung danach Dienstausscheiden und dann auf in die Stadt.
Hmm, toll ohne Auto ist man hier ziemlich aufgeschmissen. Alles sehr weitl&auml;ufig. Also ab in den n&auml;chsten Bus
und los. Bei dem Verstehen der Amis haperte es allerdings ein wenig. Erstens sprechen sie alle sehr schnell und zweitens
nuscheln sie zudem auch noch. Da hilft nur eins, sie auf deutsch zutexten. - Nein, Spass beiseite, die nuscheln
wirklich sehr. Dabei interessiert es sie auch nicht ob sie verstanden werden oder nicht. Wie dem auch sei wir haben es
&uuml;berstanden. Doch auch beim erkunden der Stadt und der n&auml;heren Umgebung wird man hungrig. Und wo geht man
hin wenn am mal richtig amerikanisch essen will? Richtig - zu McDonalds. &Uuml;brigens alle McDoofs die wir gesehen haben
waren immer ausnahmslos sehr gut besucht. Die Burger sind wirklich so wie auf dem Bild und auch gr&ouml;ﬂer als bei
uns. Da wird man schon satt von einem Burger + Pommes. Und zu trinken gibt's auch reichlich. Und wenn es leer ist
holt man sich einfach kostenlos was neues zu trinken. Das war auch bei Burgerking so. Scheint in den USA irgendwie
normal zu sein. Naja, da ist man ja nicht abgeneigt. Gut gest&auml;rkt ging es also weiter zum einkaufen und zum gucken.
Nach fast einer Woche sollte unsere Tour dann weitergehen. Diesmal wieder &uuml;ber den grossen Teich (in Fachkreisen
auch ATLANTIK genannt) der Heimat entgegen.<br><p>

Unser n&auml;chster Zwischenstopp war &uuml;ber Ostern auf Teneriffa. Genauer gesagt Santa Cruz.
Hier war nichts geplant und so konnte man sich &uuml;ber Ostern mal richtig entspannen. Ich habe mich an den
Strand gelegt, die Sonne genossen und mit 3 Kameraden von mir die Insel erkundet. Wir hatten ein Auto zur
Verf&uuml;gung und sind dann einen Tag lang &uuml;ber die ganze Insel gereist und haben uns alles angeschaut.
Sehr sch&ouml;n und sehr warm war es. Aber so kann man Ostern auch geniessen. Aber dann wollten wir doch mal
wieder nach Hause zu Freunden und zur Familie. Dann, nach 3 wundersch&ouml;nen Tagen liefen wir nochmal f&uuml;r
8 Tage aus um dann in Wilhelmshaven/Deutschland festzumachen.<br><p>

Auf der Pier war eine Menge los, als unser Verband einlief. Es waren 5 Schiffe die in kurzen Abst&auml;nden
nacheinander einliefen. Wir als F&uuml;hrungsschiff nat&uuml;rlich als erstes. Eine Horde von Eltern, Bekannten, Freunde,
Freundinnen, Br&uuml;der und Schwestern waren da um uns in Empfang zu nehmen. Auﬂerdem war unser Geschwarderkommandeur
da und eine Musikkapelle, die Musik spielte. Ja, es ist doch sch&ouml;n wieder zu Hause zu sein.<br><p>


Tja, das war es also. Ein kleiner Bericht als Stellungnahme zu meiner langen Abwesenheit und als Entschuldigung daﬂ
ich so lange nichts geschrieben habe. Ich hoffe es war nicht allzu langweilig.<br><p><br><p>

<a href="mailto:XP-Highnoon@gmx.de"><font size="5">HIGHNOON</font></a>
</font>
<br><p>
<font color="#000000" size="2">
PS: Am 04.September dieses Jahres laufen wir wieder aus. Diesmal in Richtung Mittelmeer mit allem drum und dran<br>
    (inkl.: Ballermann). Wir kommen dann am 17.Dezember wieder.
</font> 


</body>
</html>
