<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - GeoWorld</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Geoworld v1.08-Update</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></A></DIV>

<P>In <A HREF="../amz0398/main.htm">Ausgabe #4</A> testeten wir das ehrgeizige Projekt <B>GeoWorld</B> und mu&szlig;ten
leider einige herbe Kritikpunkte anbringen, weswegen wir uns entschieden,
der Software nur die Testnote 3 zu geben. <A HREF="9803geow.htm">Damals</A> verwiesen wir allerdings
auf das vorbildliche Update-Konzept, das die Autoren f&uuml;r ihr Programm
vorsahen und da diese sofort auf unseren Test und unsere Kritik
reagierten, m&ouml;chten wir nun unsererseits auf die aktuelle Version
1.08 reagieren, in der das Programm bereits etliche <B>Verbesserungen
und Bugfixes</B> erfahren durfte.
</P><P>
Da mir zum Test nur noch die Update-Pakete zur Verf&uuml;gung stehen, kann
ich die Installation des Gesamtpaketes nicht mehr beurteilen, jedoch
d&uuml;rfte diese nun schneller vonstatten gehen, da die Datenstruktur seit
V1.04 &uuml;berarbeitet wurde und nun weniger gr&ouml;&szlig;ere Dateien statt vieler
kleiner installiert werden.
</P><P>
Die <B>Installation</B> der Updates jedenfalls geht z&uuml;gig und komfortabel
vonstatten.
</P><P>
Nach dem <B>Start</B> f&auml;llt auf, da&szlig; das Bildschirm-Font-Problem behoben wurde,
in den Einstellungen findet man nun auch die M&ouml;glichkeit, diesen zu
&auml;ndern. Beim Einstellungsfenster gibt es aber immer noch einige Macken
zu beheben. Wird der Bildschirmauswahlrequester mittels &quot;Abbruch&quot;
verlassen, so interpretiert GeoWorld dies offenbar als ein Umschalten
in einen LowRes-Modus, was der Benutzer zu sp&uuml;ren bekommt, wenn er
danach die Font-Einstellung &auml;ndert. Desweiteren werden bei positivem
Best&auml;tigen der Font- und Bildschirmrequester die Einstellungen sofort
&uuml;bernommen und das Einstellungsfenster mit der Funktion &quot;Benutzen&quot;
verlassen, was erst geschehen sollte, wenn der User diesen Button
wirklich bet&auml;tigt.
</P><P>
Die Probleme bez&uuml;glich der Zusammenarbeit mit MCP wurden weitestgehend
behoben, so treten keine Probleme mit den Cycle-Gadgets mehr auf, wenn
der Cycle-to-Menu-Modus aktiviert wurde. Ebenso ist das Scrollen via
Gedr&uuml;ckthalten der Pfeilbuttons unter den Slidern m&ouml;glich. Optische
Probleme machen immer noch die Slider selbst: ist MCP aktiv, so sind
diese durchg&auml;ngig schwarz, die aktuelle Position des Sliders ist nicht
zu erkennen.
</P><P>
Umfangreich wurde die <B>Quizfunktion</B> &uuml;berarbeitet, die Ausgabe der
richtigen Antworten erscheint jetzt ausreichend lange auf dem Bildschirm
und es wurde ein Highscore eingef&uuml;gt. Dar&uuml;berhinaus wurde der Vorrat an
Fragen erweitert und es wurden weitere kleine Optimierungen vorgenommen.
</P><P>
Die <B>Druckfunktion</B> ist ebenfalls &uuml;berarbeitet worden, jedoch funktioniert
sie immer noch nicht. Bei Ausgabe auf den Drucker erscheint ein Requester,
der zum Startklarmachen desselben auffordert, jedoch nach Best&auml;tigung
immer wieder erscheint, bis man sich f&uuml;r &quot;Abbruch&quot; entscheidet. Die
Druckausgabe mu&szlig; also weiterhin den Umweg &uuml;ber eine ASCII-Datei nehmen.
</P><P>
Dar&uuml;ber hinaus wurde das Handling der Landkarten verbessert, neu ist,
da&szlig; diese als Bilder exportiert werden k&ouml;nnen. Desweiteren wurden noch
einige Fehler behoben und weitere Funktionen verbessert oder erweitert.
</P><P>
Eine von ihnen ist die <B>Maxi-Suche</B>, die im urspr&uuml;nglichen Testbericht
aufgrund einer Unachtsamkeit meinerseits unerw&auml;hnt blieb. Diese z&auml;hlt
zweifelsohne zu den Besonderheiten von GeoWorld, da hier nach L&auml;ndern
und St&auml;dten u.a. anhand sehr besonderer Merkmale wie Postleitzahlen,
H&ouml;henlage &uuml;ber dem Meeresspiegel, Gr&uuml;ndungsjahr, KFZ-Kennzeichen,
Religion, Sprache oder Bruttosozialprodukt gesucht werden kann. Die
passenden Eintr&auml;ge werden dann wieder in der bekannten Auswahlliste
pr&auml;sentiert und k&ouml;nnen genauer unter die Lupe genommen werden.
</P><P>
Beeindruckend ist, wieviel <B>Service</B> Andr&eacute; und Ronny Beer um ihr Produkt
bieten. Die Support-Homepage ist eine der &uuml;bersichtlichsten und
umfangreichsten ihrer Art, die Ver&ouml;ffentlichungen von Updates erfolgt
weitestgehend regelm&auml;&szlig;ig dort und im Aminet, freilich v&ouml;llig kostenlos,
und der Datenbestand w&auml;chst unaufh&ouml;rlich. Somit wird die Meldung
&quot;Hierzu sind leider keine Informationen verf&uuml;gbar.&quot; langsam zur
Seltenheit.
</P><P>
Wie sehr die Autoren um ihr Projekt bem&uuml;ht sind, sieht man an dem der
V1.08 beiliegenden Aufruf, eingescannte Landschaftsbilder einzusenden,
die dann in GeoWorld eingebunden werden sollen, und an einem ebenfalls
beigef&uuml;gten Fragebogen, in dem der User seine Meinung zu GeoWorld
mitteilen, sowie Anregungen geben soll.
</P><P>
Bei soviel <B>Engagement</B> und angesichts der behobenen Fehler - auch wenn
einige wesentliche immer noch drin stecken - kann unsere Wertung
nat&uuml;rlich nur besser ausfallen als beim letzten Mal.
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Geoworld</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>BEER Productions</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>geogr. Datenbank</TD>
    <TD><B>Version:</B></TD>
    <TD>1.08</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>29,- DM zzgl. Versandk.</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.freiepresse.de/home/jubee/">Homepage</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4>Andre & Ronny Beer, Siedlung 6, 09548 Deutscheinsiedel</TD></TR>
</TABLE><BR>

</P><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809fe.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809fdf.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

