<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Amiga Forever 2.0</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Amiga Forever 2.0</U></H1><P ALIGN="CENTER">von<BR><A HREF="G.Franz@gmx.de">Gregor Franz</A></P>
<B>Was ist Amiga Forever?</B>

<P>Amiga Forever ist das offizielle von Amiga lizensierte Software-Paket
von Cloanto, das auf einem PC, PowerMAC und diversen anderen Systemen
die Emulation eines Amiga erlauben soll.
</P><P>
<B>Wie ist die Ausstattung?</B>
</P><P>
Die nun ausgelieferte Version 2.0 (nach der 1.0, die praktisch eine
Beta-Version darstellte) kommt in einer gro&szlig;en Doppel-CD-H&uuml;lle, auf
derem Cover aus einem kargen, ausgetrockneten Boden heraus, eine
kleine, gelbe Bl&uuml;te sprie&szlig;t.
</P><P>
In der vorderen H&uuml;llenh&auml;lfte befindet sich die eigentliche Daten-CD und
in der hinteren eine DD-Diskette im Amigaformat mit den erforderlichen
Dateien f&uuml;r den Amiga. Hier ist auch ein kleiner Aufkleber angebracht,
auf dem sich die Seriennummer befindet und ein einzelner loser Boing-Ball-
Sticker zum Anbringen auf dem PC (nettes Gimmick).
</P><P>
<B>Woraus besteht der Inhalt?</B>
</P><P>
Was den Inhalt der CD ausmacht, sei grob angerissen: Herzst&uuml;ck sind
die Emulatoren <B>Fellow</B> (f&uuml;r DOS) und insbesondere der wesentlich
leistungsf&auml;higere <B>UAE</B>, der auch mit zahlreichen Versionen f&uuml;r
unterschiedliche Systeme vertreten ist.
</P><P>
Zu Fellow m&ouml;chte ich noch bemerken, da&szlig; er im Moment lediglich
leistungsschw&auml;chere Amigas emulieren kann und in vielen Bereichen noch
weit hinter UAE hinterhinkt (selbst in den Docs wird vielfach auf die
UAE-Dokumentation verwiesen), weshalb ich im folgenden lediglich auf
UAE eingehen werde.
</P><P>
Notwendig f&uuml;r die Emulationen ist aber auch das Amiga-Betriebssystem in
Form eines ROM-Images. Diejenigen, die einen Amiga besitzen, k&ouml;nnten
sich mit einem kleinen Amiga-Hilfsprogramm ein Image ihres eigenen ROMs
erstellen, w&auml;ren aber auf diese Version beschr&auml;nkt. F&uuml;r alle anderen
bleibt lediglich Amiga Forever, da die Weitergabe von ROM-Files verboten
ist. Auf der CD befinden sich die lizensierten Kickstart-Versionen 1.1,
1.2, 1.3, 2.04 und 3.0 sowie die zugeh&ouml;rigen Workbench-Versionen.
</P><P>
Sehr wichtig ist weiterhin die M&ouml;glichkeit des Datenaustauschs mit einem
echten Amiga. Daf&uuml;r gibt es den Amiga Explorer, mit dessen Hilfe man per
serieller Verbindung oder per TCP (Netzwerk) Daten &uuml;bertragen kann.
</P><P>
Zwei vorinstallierte &quot;Pseudo&quot;-Partitionen f&uuml;r den emulierten Amiga
(System und Work) incl. z.B. Personal Paint 7.1, sowie ein Interview
mit einem der Amiga-V&auml;ter Jay Miner (verstorben) im Text- und Audio-
Format sowie eine HTML-Dokumentation runden das Ganze ab.
</P><P>
<B>Was ist UAE?</B>
</P><P>
UAE ist der Unix Amiga Emulator, der in der (u.a.) PC-Welt doch ziemlich
f&uuml;r Furore gesorgt hat. Er wird st&auml;ndig weiterentwickelt und ist Freeware,
das hei&szlig;t, er ist kostenlos erh&auml;ltlich. Eine eingehende Einf&uuml;hrung in die
Thematik, sowie einen <A HREF="9712uae.htm">Test</A> von UAE habe ich bereits in <A HREF="../amz1297/main.htm">Ausgabe #3</A>
vorgenommen, auf die ich in diesem Zusammenhang verweise.
</P><P>
<B>Was teste ich?</B>
</P><P>
Der Test der Emulation bezieht sich daher nur auf die komfortablere,
neben der DOS-UAE-Version enthaltenen UAE-Version f&uuml;r Windows. Ich gehe
auf Weiterentwicklungen, Unterschiede und Eigenarten ein.
</P><P>
<B>Was sind die Voraussetzungen?</B>
</P><P>
F&uuml;r die Emulation wird ein m&ouml;glichst schneller PC (Pentium) mit mindestens
16 MByte RAM, eine Grafikkarte, Win 95/98 oder NT ben&ouml;tigt. Eine Apple-
Betaversion von UAE ist, genauso wie eine PPC-Amiga-Version, enthalten.
Die ROMs, Docs und Partitionen k&ouml;nnten auch mit anderen Rechnerversionen
z.B. f&uuml;r Unix, Be oder RiscPC genutzt werden.
</P><P>
<B>Wie l&auml;uft die Installation?</B>
</P><P>
Wie auf dem PC oft &uuml;blich, mit Hilfe des Setup-Programms, in dem man
zuerst einmal nach der Seriennummer gefragt wird. Dann geht es recht
selbsterkl&auml;rend weiter, ob man z.B. neben dem Amiga Explorer auch
die Emulationen (+ 36 MByte) installieren will, usw..
</P><P>
Da bei mir schon eine UAE-Version installiert war, meldete mir Setup,
da&szlig; schon eine Amiga Forever-Umgebung existieren w&uuml;rde und ob sie
gel&ouml;scht werden solle (nat&uuml;rlich erst einmal nicht).
</P><P>
Nachdem dann die eigentliche Installation fast problemlos ablief, gab
es dann doch einen Abbruch mit der Fehlermeldung 113 bei der Datei
AExplore.DLL (also praktisch dem Gegenst&uuml;ck zu einer Library). Au&szlig;er
dieser Komponente und den Verweisen im Start-Men&uuml; war aber ansonsten
alles ordnungsgem&auml;&szlig; installiert worden.
</P><P>
Um den Vorgang zu komplettieren, war es lediglich n&ouml;tig mit der rechten
Maustaste auf das bei der DLL-Datei gefundene AExplore.inf-File zu
dr&uuml;cken und den Men&uuml;punkt &quot;Installieren&quot; auszuw&auml;hlen.
</P><P>
Von einem anderen User h&ouml;rte ich &uuml;brigens, da&szlig; dort die Installation
problemlos abgelaufen war.
</P><P>
<B>Zuerst aber zum Datenaustausch</B>
</P><P>
Diesen habe ich, in Ermangelung einer Netzwerkkarte auf der Amiga-Seite,
mit einem sogenannten Nullmodem-Kabel getestet, mit dem ich beide Rechner
(A4000 und Pentium) verband.
</P><P>
Auf der Amiga-Seite mu&szlig; noch der Ger&auml;tetreiber installiert werden, am
besten im WBStartup-Verzeichnis und insbesondere mu&szlig; auf beiden Rechnern
dieselbe Daten&uuml;bertragungsrate eingestellt werden. Das macht man beim
Amiga mit den Tooltypes des Icons und beim PC mit dem RechteMaustaste-
Men&uuml; unter Eigenschaften.
</P><P>
Eigentlich soll es einem ab Amiga 3000 (also 030er-CPU) m&ouml;glich sein,
problemlos eine 115.2 KBit/sek-Verbindung aufzubauen. Bei mir gab es
trotz Herunterschaltens des Amiga-Screenmodes allerdings zahlreiche
H&auml;nger, so da&szlig; ich auf 57.6 KBit/sek herunterschalten mu&szlig;te. Dann lief
die Daten&uuml;bertragung fehlerfrei, wenn auch relativ langsam.
</P><P>
Sollte man planen, gr&ouml;&szlig;ere Dinge zu installieren, um den UAE-Amiga erst
einmal auf Vordermann zu bringen, w&auml;re es angebracht ins Auge zu fassen,
die wichtigsten gr&ouml;&szlig;eren Dinge mit dem ADF-Hilfsprogramm als ADF-Dateien
zu archivieren und diese per guter alter Disk zum PC zu transportieren.
Das nat&uuml;rliuch nur f&uuml;r den Fall, da&szlig; man nicht zu den Besitzern von
Netzwerkkarten auf beiden Seiten z&auml;hlt. Dieser Vorgang ist ja im
wesentlichen einmalig und f&uuml;r die sp&auml;tere &Uuml;bertragung von Daten im
eigentlichen Sinne, n&auml;mlich f&uuml;r Texte, Sounds, Grafiken etc. gen&uuml;gt
dann die serielle Verbindung vollauf.
</P><P>
Auf der PC-Seite &ouml;ffnet sich ein entsprechendes Explorerfenster, in dem
die Amiga-Ger&auml;te angegeben werden. Hier ist es nicht nur m&ouml;glich in den
Verzeichnissen herumzust&ouml;bern, sondern auch die &quot;Bits&quot; zu &auml;ndern (Lesen,
Schreiben etc.), sowie Dateien umzubenennen oder zu l&ouml;schen. Ein Ausf&uuml;hren
ist nicht m&ouml;glich, da die Dateien erst auf den PC &uuml;bertragen werden m&uuml;ssen,
um dort etwas mit ihnen anzufangen. Allerdings h&auml;tte man dies (unsichtbar
f&uuml;r den User) nachstellen k&ouml;nnen, in dem die Dateien automatisch in eines
der &uuml;blichen Temp-Verzeichnisse des PCs &uuml;bertragen und dann ausgef&uuml;hrt
w&uuml;rden.
</P><P>
Trotzdem handelt es sich um eine sinnvolle und recht komfortable
Angelegenheit, da man sich nicht mit den existierenden DOS-lastigen
L&ouml;sungen oder gar Terminal-Programmen auf beiden Seiten herumschlagen
mu&szlig;. Nat&uuml;rlich ist es nicht nur eine Einbahnstra&szlig;e, sondern man kann
auch in das Amiga-Explorerfenster Dateien hineinkopieren und somit
an die angegebene Position direkt auf dem Amiga.
</P><P>
<B>Nun zu WinUAE - zuerst die Einstellungen</B>
</P><P>
Im Gegensatz zu UAE f&uuml;r DOS bietet diese Version mehr Komfort. Bevor
sie startet &ouml;ffnet sich ein Fenster mit mehreren Karteikarten f&uuml;r
Einstellungen. Ich habe mich mit der auf der CD befindlichen Version
0.7.0b2 befa&szlig;t, die nicht ganz taufrisch ist.
</P><P>
Bei &quot;<B>Configurations</B>&quot; ist es m&ouml;glich mehrere unterschiedliche
Einstellungen zu verwalten.
</P><P>
Bei &quot;<B>Startup/Memory</B>&quot; kann man Chip/Fast/Z3-Fast (simuliert Zorro-III-
Karte) und Grafikkartenspeicher ausw&auml;hlen. Chipmemory kann maximal 8 MByte
betragen (bei &uuml;ber 4 MB ist allerdings kein Stadard-FastRAM m&ouml;glich), beim
Z3-FastRAM sind unabh&auml;ngig davon bis max. 64 MByte und f&uuml;r die Grafikkarte
auch max. 8 MByte m&ouml;glich. Au&szlig;erdem kann man hier das verwendete KickROM
einstellen.
</P><P>
Bei &quot;<B>Sound</B>&quot; sind einige Einstellungen f&uuml;r die Qualit&auml;t m&ouml;glich oder man
kann ihn deaktivieren. Die AHI-Einstellung ist mit dieser Version noch
nicht ausw&auml;hlbar.
</P><P>
Bei &quot;<B>Floppies</B>&quot; kann man vier ADF-Files einstellen, die vom UAE dann als
Amiga-Floppies angesprochen werden. Man kann sie aber auch w&auml;hrend des
UAE-Betriebes wechseln. (Dazu sp&auml;ter mehr).
</P><P>
Bei &quot;<B>Display/Gfx</B>&quot; kann man die PC-Aufl&ouml;sung w&auml;hlen, die f&uuml;r ECS-Modi
verwendet werden soll, au&szlig;erdem die Refresh-Rate (wie oft das Bild
aufgefrischt werden soll - hier l&auml;&szlig;t sich an der Geschwindigkeitsschraube
drehen!) und ein paar weitere Features, die bei einem Standardbetrieb erst
einmal nicht weiter interessieren.
</P><P>
Weiter geht es mit &quot;<B>Hard-Drives</B>&quot;. Hier kann man entweder eigene Drivefiles
erstellen (&auml;hnlich ihren Pendants bei z.B. PC-Task) oder bestimmte PC-
Verzeichnisse/Ger&auml;te einstellen (auch z.B. CD-ROM, was problemlos
funktioniert), die dann als Amiga-Partitionen angesprochen werden.
Die maximale Anzahl ist vier.
</P><P>
So ist es m&ouml;glich einfach auf PC-Daten zuzugreifen bzw. auch auf PC-Seite
(einmal ALT-TAB gen&uuml;gt ja zum Wechsel) schnell eine Datei in der Amiga-
Partition zu manipulieren, obwohl UAE gerade l&auml;uft.
</P><P>
Bei &quot;<B>I/O-Ports</B>&quot; kann man die serielle und parallele Schnittstelle den
jeweiligen PC-Anschl&uuml;ssen zuordnen und die Eingabeger&auml;te f&uuml;r die beiden
Amigamaus- bzw. Joystickports festlegen.
</P><P>
Bleibt au&szlig;er &quot;<B>About</B>&quot; nur noch &quot;<B>Advanced</B>&quot;. Hier sind noch ein paar
speziellere Einstellungen m&ouml;glich, wie z.B. die Festlegung der CPU-
Emulations-Priorit&auml;t (gegen&uuml;ber den Customchips) oder die
Loggingfunktionen (falls es Probleme geben sollte).
</P><P>
Danach kann es losgehen mit einem Klick auf '<B>Okay</B>'.
</P><P>
<B>Die Emulation selbst</B>
</P><P>
Neben einer in Anwendungsdingen ziemlich guten und weiter verbesserten
Emulation, ist die mit Abstand wichtigste Neuerung generell (zu dem in
Ausgabe 3 befindlichen erw&auml;hnten UAE-Test) die Picasso 96-Emulation, wie
ja schon der oben gefallene Begriff Grafikkartenspeicher implizierte.
</P><P>
Und tats&auml;chlich bieten die aktuellen Versionen des Amiga-
Grafikkartentreibersystems <B>Picasso 96</B> spezielle Treiber f&uuml;r UAE an, die
dann unter UAE direkt die PC-Grafikkarte ansprechen und somit neben hohen
Aufl&ouml;sungen und Wiederholfrequenzen auch f&uuml;r eine wesentlich verbesserte
Geschwindigkeit sorgen. Selbst auf (m)einem P 166 ist nun ein relativ
normales Workbench-Handling m&ouml;glich und das bei 1024x768x32K. Nach
Herunterschalten auf einen OCS/ECS-Screen erscheint einem alles wieder
unwahrscheinlich tr&auml;ge.
</P><P>
Sicherlich ist jetzt auf aktuellen LowEnd- bzw. MidRange-PCs immer noch
nicht alles eitel Sonnenschein, was die <B>Geschwindigkeit</B> betrifft, aber
ein grunds&auml;tzliches Arbeiten auf einer ergonomischen WB ist m&ouml;glich.
Programme, die selbst auf mittleren Amigas (mit 030) nicht flott arbeiten,
sind auf diesen Maschinen nat&uuml;rlich immer noch langsam. Bei systemkonformen
Programmen erstaunt die Kompatibilit&auml;t trotzdem immer wieder und einige
kleinere Hacks zur WB-Verbesserung hatten auch kein negativen Auswirkungen.
Insbesondere &uuml;ber die (verringerte) Framerate lassen sich noch einige
Geschwindigkeitszuw&auml;chse herausholen.
</P><P>
Der einzige gro&szlig;e Absturz (resultierend in einem Guru, so da&szlig; man UAE
wieder booten konnte), der mir auffiel und der sich auch immer wieder
reproduzieren l&auml;&szlig;t, tritt bei DirectoryOpus 4 auf. Wenn man auf einem
ge&ouml;ffneten Picasso96-Screen den DOpus-Konfigscreen 'betreten' m&ouml;chte,
st&uuml;rzt er ab. Daf&uuml;r mu&szlig; man also vorher auf einen OCS/ECS-Screen wechseln.
</P><P>
In Sachen <B>Sound</B> bietet sich nat&uuml;rlich das selbe Bild, wie zuvor. Die
mit der restlichen Emulation voll ausgelastete PC-CPU hat nicht mehr
gen&uuml;gend Performance &uuml;brig, um da auch nur einigerma&szlig;en etwas
vern&uuml;nftiges aus den Lautsprechern pressen zu k&ouml;nnen. Bei sehr schnellen
aktuellen PC-CPUs mag das schon wieder etwas anders aussehen. F&uuml;r die
anderen liegt m&ouml;glicherweise Hoffnung in der geplanten AHI-Unterst&uuml;tzung,
also dem Gegenst&uuml;ck im Soundbereich zu dem, was Picasso 96 (oder CyberGfx)
f&uuml;r die Grafikkarten darstellt. Sollte es sich dabei dann tats&auml;chlich um
eine CPU-entlastende Direktausgabe auf der PC-Soundkarte handeln (wobei
bei dem PC die CPU ja trotzdem generell in gewissem Ma&szlig;e involviert ist),
w&auml;re zumindest f&uuml;r WB-Programme, die dies unterst&uuml;tzen eine Verbesserung
denkbar.
</P><P>
Auch im laufenden WinUAE kann man ein paar Einstellungen &auml;ndern. Dazu
mu&szlig; man die F12-Taste dr&uuml;cken. Dann &ouml;ffnet sich auf dem UAE-Screen ein
Windows-Fenster (seltsame Kombination!), in der man die Floppies
'bedienen' und die Framerate, sowie die Eingabeger&auml;te Maus und Joystick
&auml;ndern kann.
</P><P>
<B>Zur Dokumentation </B>
</P><P>
Auf Englisch verfa&szlig;t, ist sie in ansprechendem Design als HTML-Datei zu
betrachten und bietet so ziemlich alle Informationen und auch Tips zur
Fehlervermeidung, die man ben&ouml;tigt. Einige Screenshots helfen Sachverhalte
zu verdeutlichen.
</P><P>
Bei den jeweiligen Emulationen sind zus&auml;tzlich die Originaldokumentationen
enthalten.
</P><P>
<B>Sonstiges</B>
</P><P>
Das Interview mit Jay Minor ist sicherlich eine nette Beigabe, auch wenn
man es sicher nur selten h&ouml;ren wird. N&uuml;tzlich auch die beigef&uuml;gte Software,
wie das bekannte PPaint 7.1 oder AmiToRTF, das Amiga-Texte in das
weitverbreitete RTF-Format konvertiert. Es gibt auch ein einfaches
Startpanel, von dem aus sich einige Standard-Konstellationen von UAE
oder Fellow direkt ohne gro&szlig;e Einstellereien starten lassen.
</P><P>
<B>Das Fazit</B>
</P><P>
Zuallererst mu&szlig; man sich sicherlich immer vor Augen halten, da&szlig; der Kern
der Amiga Forever-CD aus dem ausgereiften und im Normalfall kostenlosen
UAE besteht.
</P><P>
<B>Lohnt</B> es sich trotzdem und f&uuml;r wen?
</P><P>
Allerdings ist die Weitergabe von KickROMs an andere verboten und User,
die neben ihren anderen Rechnern keine Amigas besitzen, haben keine legale
M&ouml;glichkeit UAE zu betreiben, so wie auch Amiga-User nur das Kick-File
ihres eigenen Amigas verwenden d&uuml;rfen.
</P><P>
<B>Grunds&auml;tzlich zu UAE</B>: Ob passionierte PC-Spieler zu UAE greifen erscheint
mir zweifelhaft. Sie ben&ouml;tigen eine State-Of-The-Art-Ausstattung und haben
eigentlich auch so ein ziemlich gutes Spieleangebot auf ihrer Seite.
</P><P>
F&uuml;r am OS und am Amiga Interessierte, die seine Programme und
M&ouml;glichkeiten an sich kennenlernen und nutzen wollen, also f&uuml;r die
sogenannten 'ernsthaften' User, wird UAE dank Picasso 96-Emulation
zu einer wirklich guten M&ouml;glichkeit mit dem Amiga zu arbeiten.
</P><P>
<B>Amiga Forever</B> gibt daf&uuml;r nicht nur die legalen Voraussetzungen, sondern
bietet ein ausgewogenes und sorgf&auml;ltig zusammengestelltes Gesamtpaket,
das gerade dieser Zielgruppe einen guten Start erm&ouml;glicht.
</P><P>
F&uuml;r den Amiga-(und zeitgleich PC-)User, der sich nicht alles m&uuml;hsam
zusammensuchen m&ouml;chte, ist dieses Argument eventuell auch von G&uuml;ltigkeit.
Hinzu kommen die Komplettheit der Kick- und WB-Files, sowie die einfache
Daten&uuml;bertragung per Amiga Explorer. Er sollte also diese Punkte abw&auml;gen.
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Amiga Forever</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.cloanto.com">Cloanto</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Emulator-Paket</TD>
    <TD><B>Version:</B></TD>
    <TD>2.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>119 DM / Update 50 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809aw.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809geo.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
