<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Sixth Sense Investigations</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>STFax 3.2 Professional</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>

<BR><TABLE BGCOLOR="#DADADA" ALIGN="CENTER" BORDER="1">
<TR><TD>
Das nachfolgend getestete Produkt wurde uns freundlicherweise von
der Firma &quot;Ferst Computer&quot;, K&ouml;penicker Stra&szlig;e 11, 15537 Gosen,
(<A HREF="http://www.ferst.de">http://www.ferst.de</A>/<A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A>) leihweise zur Verf&uuml;gung gestellt.
</TD></TR></TABLE>

<P><B>Sixth Sense Investigations</B> von CineTECH ist ein neues Grafikadventure.
Man bewegt sich als Detektiv der &quot;6th Sense Investigations&quot;-Detektei
durch diverse Welten, und das ist durchaus w&ouml;rtlich gemeint. Die beiden
Detektive, die gleich am Anfang getrennt werden, so da&szlig; man immer nur
eine Figur steuern mu&szlig; (kann), sind ziemlich durchgedrehte - eben
englische - Charaktere. Die F&auml;lle, die die Beiden bearbeiten, sind auch
ziemlich seltsam - eine verschwundene Katze, ein unter einem Riesenk&auml;se
eingeklemmter K&auml;seh&auml;ndler und dergleichen.
</P><P>
<B>Die &quot;Hardware&quot;</B>
</P><P>
In der ziemlich schlichten Verpackung (bedrucktes Papier um einen wei&szlig;en
Karton) findet sich neben den 10 Disketten noch ein kleines Detektiv-
Notizbuch, das die Anleitung und Platz f&uuml;r eigene Notizen enth&auml;lt. Auf
den ersten Blick ein recht netter Gag, im t&auml;glichen Gebrauch aber
nervt&ouml;tend, da erstens die Schrift sehr klein geraten ist; zweitens das
B&uuml;chlein am oberen Rand geklebt ist (wie ein Daumenkino) und so den Text
oben auf der Seite sehr schwer lesbar macht; und drittens einige Seiten
falsch geheftet sind. Und viertens ist das Buch zweisprachig: Von der
einen Seite gelesen, findet man alles in Englisch, dreht man es herum,
steht alles in Deutsch da. Eigentlich eine nette Idee, aber man bl&auml;ttert
garantiert immer die englische Version auf, wenn man das Ding in die Hand
nimmt. F&uuml;nftens neigt das Ganze bei intensivem Gebrauch zum Fleddern, was
ich bei meinem Testmuster aber vermieden habe, schlie&szlig;lich mu&szlig; ich es
zur&uuml;ckgeben.
</P><P>
<B>Die Anforderungen</B>
</P><P>
Die Diskettenversion braucht eine Festplatte mit ca. 20 MB freiem Platz
(die Anleitung sagt 30 MB), alternativ darf es auch ein ZIP-Medium sein,
oder sonst etwas, auf dem genug Platz ist. Laut Hersteller soll das Spiel
auch auf einem nackten A1200 laufen (ich habe auf meinem A4000 probeweise
das Fastmem ausgeschaltet: Es geht, aber langsam), und mit Fastmem
schneller laden, was ich aber nicht nachvollziehen konnte. Man kann aus
einem Raum heraus- und gleich wieder hineingehen, das Spiel mu&szlig; immer von
Festplatte nachladen. Da hilft auch Fastmem nichts. Erfreulicherweise gab
es aber mit einem MC68060 Prozessor (unvertr&auml;glich mit vielen Spielen)
keine Probleme.
</P><P>
Unbedingt abschalten sollte man alle Patches und Commodities, allen voran
MCP. Tut man dies nicht, h&auml;ngt das Spiel sp&auml;testens nach zwei Minuten.
Ein AGA-Amiga (1200, 4000) mu&szlig; es &uuml;brigens sein, da die Grafiken in 256
Farben daherkommen. Leider ist die Aufl&ouml;sung nur durchschnittlich: 320
mal 200 Pixel - man k&ouml;nnte auch sagen, das mit jedem Amiga auf einem
Fernseher darstellbare.
</P><P>
Nat&uuml;rlich braucht man zur Installation auch ein Diskettenlaufwerk, wobei
ich beim n&auml;chsten Thema bin, der Installation.
</P><P>
<B>Die Installation</B>
</P><P>
Tja, es scheint, das Spiel ist noch eine Betasoftware. Zuerst habe ich
alles mit zwei Diskettenlaufwerken installiert, die erste Disk im einen,
die anderen Disks im zweiten Floppy. Kein Problem. In der Readme-Datei
(&uuml;brigens sehr gut versteckt, ohne Icon, auf der ersten
Installationsdiskette) steht w&ouml;rtlich:
</P><P>
&quot;Wenn Sie &uuml;ber mehr als ein Diskettenlaufwerk verf&uuml;gen, lassen Sie Disk 1
immer in einem der Laufwerke, da diese immer wieder ben&ouml;tigt wird.&quot;
</P><P>
Nun, als Tester ist man gr&uuml;ndlich, schaltet das zweite Floppy per
Bootmen&uuml; ab, und installiert zum Spa&szlig; einfach nochmal. Erste Disk - ok.
Zweite Disk geht auch noch. Aber pl&ouml;tzlich meldet sich LHex (das Programm,
das die Installationsarchive auspackt) siebenmal mit Usage-Fehler und die
Installation ist fertig ohne Fehlermeldung vom Installationsprogramm.
Tats&auml;chlich installiert waren aber nur die ersten zwei Disketten.
</P><P>
Wer nur ein Diskettenlaufwerk hat, mu&szlig; also das Spiel &quot;zu Fu&szlig;&quot;
installieren. Dazu kopiert man von jeder Diskette die .lha-Datei auf
Festplatte, erzeugt ein Verzeichnis f&uuml;r das Spiel und entpackt die
Archive in dieses Verzeichnis. F&uuml;r reine Spielernaturen und Anf&auml;nger
nat&uuml;rlich ein un&uuml;berwindliches Hindernis, ich wei&szlig;. Au&szlig;erdem verbraucht
man nochmal 8 MB Speicher auf der Platte.
</P><P>
Wenn man gerade dabei ist, kann man auch noch die Patches von der
CineTECH Homepage mit installieren, falls man denn einen Internetzugang
hat...
</P><P>
Hat man endlich alles installiert, findet man auch eine Readme-Datei,
die man vorher so dringend ben&ouml;tigt h&auml;tte. Allerdings nicht dieselbe,
wie die auf der Diskette. Hier steht dann:
</P><P>
&quot;1. Move the install icon in the directory you want to install the game on.
 2. Double click on the install icon to install the game.&quot;
</P><P>
Gesagt, getan, schlie&szlig;lich soll ich das Teil testen, aber nichts geht.
&quot;Programm EasyInstaller nicht gefunden&quot;, meldet die Workbench. Wundert
mich nicht, denn es wird ja nur das Installationsskript kopiert, nicht
das dazu notwendige Programm. Also auch keine funktionable Art der
Installation.
</P><P>
Ach ja, Englisch braucht man auch ab und zu, obwohl das Spiel
eingedeutscht ist.
</P><P>
Die CD-Version (die ich aber nicht testen konnte), h&auml;tte zus&auml;tzlich auch
noch gerne 1 bis 4 MB Fastram - die Anleitung ist sich hier nicht einig -
um die Sprachausgabe zu aktivieren.
</P><P>
<B>Endlich - das Spiel</B>
</P><P>
&Ouml;ffnet man die Schublade, in die man das Spiel installiert hat, kann
man 6th Sense auf zwei Arten starten: &quot;Quickstart&quot; ohne Intro und
&quot;SixthSense&quot; mit Intro.
</P><P>
Zumindest einmal sollte man sich das Intro ansehen, denn hier werden
schon einige Charaktere vorgestellt, die man im Spiel kennen sollte.
Man bekommt auch schon einen Eindruck von der Gestaltung und der
Geschwindigkeit des Spiels.
</P><P>
Sp&auml;ter kann man das Intro auslassen und direkt ins Spiel starten.
Besonders zu loben ist hier die M&ouml;glichkeit, zu jeder Zeit ein Spiel
sichern und laden zu k&ouml;nnen. Die Steuerung erfolgt ausschlie&szlig;lich &uuml;ber
die Maus, einige Icons und Befehle am unteren Bildrand, ein Klick mit
der rechten Maustaste f&uuml;hrt einen vordefinierten Befehl f&uuml;r ein Objekt
aus, so da&szlig; man z.B. K&auml;sekr&uuml;mel nur mit rechts anklicken mu&szlig;, und Frank
(einer der zwei Detektive) steckt sie ein.
</P><P>
Einstecken kann man eine Menge, n&auml;mlich unbegrenzt viel. Bei so viel
Bequemlichkeit geht der Realismus nat&uuml;rlich fl&ouml;ten, aber die Story ist
sowieso ziemlich abgehoben. Au&szlig;er den beiden Detektiven Frank und Ben
gibt es noch den Geist &quot;Arthur David Fieldstone&quot;, der frappante
&Auml;hnlichkeit mit Commander Data aus Star Trek besitzt.
</P><P>
Das Ziel des Spiels ist, die Erde von einem ausgeflippten Wissenschaftler
zu befreien, was angesichts des unberechenbaren Geistes und der ziemlich
skurrilen R&auml;tsel nicht einfach ist. Schon im ersten Level findet man in
der Spielzeugfabrik Hinweise auf das Wirken des B&ouml;sewichts, wie z.B.
einen demolierten Roboter oder ein Giftm&uuml;llfa&szlig;.
</P><P>
Die Figuren sind ausnahmslos Cartoon-Charaktere, mit denen man sich
nat&uuml;rlich prima um so aufwendige Dinge, wie 3D-Animationen, Videosequenzen
und Echtzeitberechnungen dr&uuml;cken kann. Der Vorteil ist eben, da&szlig; 6th Sense
so auch auf kleinen Amigas l&auml;uft.
</P><P>
Bis auf den seltsamen (englischen) Humor spielt sich 6th Sense wie jedes
Adventure: Hinweise sammeln, Sachen anwenden, die richtigen Schl&uuml;sse
ziehen. Zum Beispiel kann man mit K&auml;sekr&uuml;meln, Bierdeckel und einem Glas
eine Maus fangen, mit der man wiederum eine Katze ablenken kann, die dann
ihrerseits die Hausherrin ablenkt...
</P><P>
Spieletechnisch gesehen geh&ouml;rt 6th Sense zum guten Mittelfeld, wenn man
den durchschnittlichen A1200-Besitzer betrachtet. Die Animationen sind
fl&uuml;ssig genug, die Aufl&ouml;sung f&uuml;r einen Grafikkarten-Gew&ouml;hnten wie mich
viel zu grob; CyberGraphX-Grafikkarten werden durch einen Patch im Aminet
unterst&uuml;tzt, leider sagt die CineTECH-Homepage nicht, von welchem; und das
Multitasking wird nat&uuml;rlich abgeschaltet. Aber leider nicht so komplett,
da&szlig; ein Tool wie MCP nicht noch dazwischenpfuschen k&ouml;nnte. Da&szlig; das
trotzdem m&ouml;glich w&auml;re, zeigen Spiele wie DeluxeGalaga, das auch wieder
sauber zur Workbench zur&uuml;ckkehrt (wie 6th Sense &uuml;brigens auch).
</P><P>
Soundeffekte sind vorhanden, genauso eine unaufdringliche Hintergrundmusik,
die einen nicht vom Hocker rei&szlig;t, aber andererseits auch nicht nervt. Die
Grafiken sind originell, aber nicht sehr aufwendig, also keine
Speicherfresser. Ich frage mich allerdings, ob es bei soviel R&uuml;cksicht
auf langsamere Rechner nicht besser gewesen w&auml;re, das Spiel komplett im
Multitasking zu betreiben. Prozessorbelastende Balleraction ist bei einem
Adventure dieser Klasse bestimmt nicht zu erwarten.
</P><P>
St&ouml;rend wirken teilweise holprig &uuml;bersetzte Dialoge und vergessene
englische Satzfetzen, das Spiel beeintr&auml;chtigen tun sie allerdings nicht.
Manche eingesammelten Gegenst&auml;nde sind sp&auml;ter pl&ouml;tzlich wieder da, ohne
da&szlig; man sie erneut einsammeln kann, praktisch als Geisterbilder. Einmal
ist es mir auch passiert, da&szlig; sich eine T&uuml;re nicht mehr &ouml;ffnen lie&szlig;, die
kurz vorher noch funktionierte, und Frank in einem Zimmer eingesperrt war.
Mit dem Patch von der CineTECH Homepage sollten diese Probleme aber
behoben sein.
</P><P>
Die zu l&ouml;senden R&auml;tsel sind recht originell, wenngleich auch nicht immer
logisch, so da&szlig; man meistens einfach probieren mu&szlig;. Wer den besonderen
englischen Humor liebt, kommt auf jeden Fall auf seine Kosten. Vielleicht
mu&szlig; man die Installation auch unter diesem Gesichtspunkt betrachten...
</P><P>
<B>Die Wertung</B></P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>6th Sense Investigat.</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>CineTECH</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Comic-Grafikadventure</TD>
    <TD><B>Version:</B></TD>
    <TD>1.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ca. 49.- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>2</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>3</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=4>Kontakt/Support: <A HREF="http://users.skynet.be/Graffito/sixth_sense/">http://users.skynet.be/Graffito/sixth_sense</A></TD></TR>
</TABLE></P><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809fdf.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9809hw.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


