<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - APC&amp;TCP-CDs 6</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>APC&amp;TCP-CD`s 6</U></H1><P ALIGN="CENTER">von<BR><A HREF="G.Franz@gmx.de">Gregor Franz</A></P>

<P><B>Grunds&auml;tzlich</B> l&auml;&szlig;t sich die APC&TCP-CD Volume 6, wenn man sich die
bisherigen Ausgaben anschaut, am ehesten mit den Misch-CD`s 1 und
5 vergleichen. Bei letzterer (siehe <A HREF="../amz1297/main.htm">AmZeiger #3</A>) wurde bem&auml;ngelt, da&szlig;
sie einen unverh&auml;ltnism&auml;&szlig;ig hohen Anteil ihres Inhalts mit der Volume
1 gemein hatte. Zwar trifft dies in einiger Beziehung auch wieder
auf die nun getestete Volume 6 zu, allerdings nicht f&uuml;r die Bilder,
Musiken und Texte, da sich keine auf ihr befinden!</P><P>
Die Volume 6 widmet sich haupts&auml;chlich den Tools. Neben den gewohnten
anklickbaren Icons &quot;<B>Palette</B>&quot;, &quot;<B>Screenmode</B>&quot; und &quot;<B>KlickMe</B>&quot; (f&uuml;r einige
Assigns), die einige Standardeinstellungen bereitstellen, befinden
sich im Hauptdirectory die Unterverzeichnisse &quot;<B>Infodisk</B>&quot; mit einigen
Clubinformationen und Preislisten; &quot;<B>SuchTool</B>&quot; mit dem Mui-Programm
CDCat incl. Indexen der Ausgaben 1-6; und schlie&szlig;lich noch &quot;<B>Tools</B>&quot;.
</P><P>&quot;<B>Tools</B>&quot; selbst ist unterteilt in &quot;<B>Demo</B>&quot;, &quot;<B>Icons-Background</B>&quot; und &quot;<B>PD</B>&quot;.
</P><P>In &quot;<B>Demo</B>&quot; sind keine der bekannten Pr&auml;sentationen von diversen Demo-
Gruppen zu finden, sondern eingeschr&auml;nkte Versionen kommerzieller
Programme bzw. von Shareware. Dabei handelt es sich um Adventure-Shop,
BurnIt (Version 1.10 der CD-Brenner-Software), Datachrome (mit dem man
Programmen das Datatype-lesen beibringen kann, die dazu von Hause aus
eigentlich nicht f&auml;hig sind), DigiBoosterPRO (Tracker), EZPager (mit
dem man eMails an Funktelephone senden kann), Geb&uuml;hrenmanager, MSE
(Midi-Tool), PC-Task 4 (der PC-Emulator), StormC und StormWizard (die
bekannt sein d&uuml;rften).</P><P>
&quot;<B>Icons-Backgrounds</B>&quot; ist gef&uuml;llt mit zahlreichen Sammlungen der
bezeichneten Art. Die Anzahl der Verzeichnisse (teilweise auch mit
wenigen Dateien) betr&auml;gt hier 151, von denen sich aber schon eine Menge
auch auf den oben genannten APC-CD`s befinden, wie z.B. die ROM-Icons.</P><P>
Nun zu &quot;<B>PD</B>&quot;:</P><P>
Den Anfang macht das Unterverzeichnis &quot;<B>Backup-Copy-Disk-CD</B>&quot;, das schon
vom Titel her einen ziemlich zusammengew&uuml;rfelten Eindruck macht, was aber
zu verschmerzen ist. Hier lassen sich einige n&uuml;tzliche Programme finden,
wie z.B. das bekannte ABackup oder IDEfix (allerdings ist das auch eine
Demo-Version).</P><P>
&quot;<B>Blanker</B>&quot; - da gibt es nicht viel zu sagen, au&szlig;er, da&szlig; einige gro&szlig;e
Pakete fehlen, unter den 16 ist aber z.B. <A HREF="http://www.amigaworld.com/support/madhouse/">Madhouse</A> enthalten.</P>
<P>&quot;<B>Datatypes</B>&quot; - 49 St&uuml;ck, die meisten nat&uuml;rlich altbekannt.</P>
<P>&quot;<B>DFUe-WWW</B>&quot; - Einige Tools zu diesem Bereich, ziemlich ausgesucht. So f&auml;llt
z.B. auf, da&szlig; zwar NComm enthalten ist, da&szlig; bekannteste DF&Uuml;-Programm Term
aber fehlt. Mit RunC64 ist hier auch ein kleines Tool zum Datenaustausch
mit dem guten alten C64 enthalten.</P><P>
&quot;<B>Grafik-Grafikkarte</B>&quot; - bunt gemischt, aber eines der interessanteren
Verzeichnisse der CD. Viewer, Bildmanipulationsprogramme und Tools
sind in ihm u.a. zu finden.
</P><P>&quot;<B>Library</B>&quot; - einige ausgesuchte Libraries, von denen nur wenige f&uuml;r den
jeweiligen User von Interesse sein d&uuml;rften.</P><P>
&quot;<B>Misc</B>&quot; - Zusammengew&uuml;rfelter geht es denn doch nimmer mehr, als hier.
BlueEyes (WB-Augen), WordConverter (um PC-Worddokumente zu konvertieren),
Editoren oder Tools - hier mu&szlig; man sich durchw&uuml;hlen.
</P><P>Mit &quot;<B>Packer</B>&quot; (einige Packprogramme), &quot;<B>Sound</B>&quot; (Musikprogramme), &quot;<B>Time</B>&quot;
(ein paar Uhren und Kalender) und &quot;<B>Datenbanken</B>&quot; geht es im Grunde im
selben Stil weiter.
</P><P>
Was f&uuml;r ein <B>Fazit</B> mu&szlig; ich ziehen: Das Mischkonzept der Volume 5 wurde
wegrationalisiert, so da&szlig; in diesem Bereich die Dopplungen nicht mehr
auftreten k&ouml;nnen, allerdings auch das &quot;Hier ist f&uuml;r jeden was&quot; nicht mehr
gilt. Im verbliebenen Tool-Sektor fallen aber, trotz der Wiederholungen, in
vielen Bereichen wichtige L&uuml;cken auf, so da&szlig; noch nicht einmal das Argument
des gro&szlig;en, halbwegs vollst&auml;ndigen Backup-Archivs zieht. Die Ordnung (siehe
&quot;Backup-Copy-Disk-CD&quot; und insbesondere &quot;Misc&quot;) ist sehr eingeschr&auml;nkt
ebenso wie der Nutzwert f&uuml;r den einzelnen User. Die Tools, die von
Interesse sind, kann man in den meisten F&auml;llen gezielter und oft auch
aktueller aus anderen Quellen beziehen.</P><P>
Die gesamte <B>Zusammenstellung</B> macht auf mich, trotz der schon fr&uuml;her
gelegentlich bem&auml;ngelten Qualit&auml;t, einen ausgesprochen uninspirierten
Eindruck. Vielleicht sollte man jetzt mal ein Weilchen mit den Tool-CD`s
aussetzen, bis wirklich Neues aufgelaufen ist, und nach neuen Konzepten
suchen, um das vielbeschworene Speicherwunder CD auszunutzen.</P><P>
In Anbetracht des Preis-/Leistungsverh&auml;ltnisses und der Wertung zu Volume 5
kann ich nur zu folgendem Ergebnis kommen:</P>

<BR>
<TABLE ALIGN="CENTER" BORDER="1">
<TR>
    <TH>Produkt:</TH><TD>APC&amp;TCP-CD Volume 6</TD><TH>Hersteller:</TH><TD><A HREF="http://www.chiemgau.com/apc&tcp/">APC&amp;TCP</A></TD>
</TR>
<TR>
    <TH>Art:</HT><TD>Daten-CD</TD><TH>Version:</TH><TD>-</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>24.95 DM</TD><TH>Bez.Quelle:</TH><TD>APC&amp;TCP</TD>
</TR>
<TR>
    <TH>Gesamt:</TH><TH ALIGN="CENTER">6</TH><TD ALIGN="CENTER" COLSPAN="2"><IMG SRC="../images/note6.gif" WIDTH="56" HEIGHT="82"></TD>
</TR>
<TR>
    <TD ALIGN="CENTER" COLSPAN="4">APC&amp;TCP, Postfach 59, 83236 &Uuml;bersee</TD>
</TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809fax.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809art.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
