<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - STFax 3.2 Professional</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>STFax 3.2 Professional</H1>von<BR><A HREF="mailto:C.Jahn@gmx.de">Carsten Jahn</A></DIV>

<BR><TABLE BGCOLOR="#DADADA" ALIGN="CENTER" BORDER="1">
<TR><TD>
Das nachfolgend getestete Produkt wurde uns freundlicherweise von
der Firma &quot;Ferst Computer&quot;, K&ouml;penicker Stra&szlig;e 11, 15537 Gosen,
(<A HREF="http://www.ferst.de">http://www.ferst.de</A>/<A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A>) leihweise zur Verf&uuml;gung gestellt.
</TD></TR></TABLE>

<P>
<B>Faxe verschicken:</B> viele Menschen machen das sehr selten. Warum also ein
relativ teures Faxger&auml;t kaufen, wenn man da schon ein Modem rumstehen hat,
das mit entsprechenden Befehlss&auml;tzen f&uuml;r die Faxfunktion aufwarten kann?
Softwareseitig sind die Hersteller der Modems nicht zimperlich, ich kann
mich nicht erinnern, schon mal ein Modem gesehen zu haben, das nicht mit
entsprechenden Windows-Programmen ausgestattet ist. Weil das den Amiga-
Anwender bekannterma&szlig;en nicht weiterbringt, gibt es schon lange Anbieter
von Fax-Software f&uuml;r den Amiga.
</P><P>
Von Active Technologies wird uns STFax professional, fr&uuml;her als Shareware
zu haben, beschert. STFax kommt in buntem <B>MUI</B>-Design daher, damit ist MUI
unverzichtbare Voraussetzung. Davon abgesehen, nennt die Anleitung keine
weiteren Beschr&auml;nkungen. Da es die Hauptaufgabe von STFax ist, Faxe mit
dem Computer zu verschicken und zu empfangen, sollte man nat&uuml;rlich ein
Faxmodem oder eine entsprechende Erweiterungskarte haben.
</P><P>
Da STFax viele Sonderfunktionen f&uuml;r Voice-Modems bietet, ist ein Modem mit
solchen Features n&ouml;tig, wenn man diese Funktionen nutzen m&ouml;chte.
</P><P>
STFax steckt in einer CD-H&uuml;lle, wird aber auf zwei Disketten ausgeliefert.
Das Faltblatt beschreibt die Installation und macht unmi&szlig;verst&auml;ndlich (auf
Englisch) klar, da&szlig; man zuerst MUI installieren soll, dem Diskette 2
gewidmet ist. Anschlie&szlig;end wird Schritt f&uuml;r Schritt beschrieben, welche
Fragen das eigentliche STFax-Installerscript an den Anwender stellt und
was bei der Installation passiert. Zwischendurch mu&szlig; man den 20-stelligen
Code abtippen, der im Faltblatt aufgeklebt ist. Alles kein Problem.
</P><P>
Nach dem <B>Start</B> &ouml;ffnet STFax sein Fenster und meckert &uuml;ber das nicht
verf&uuml;gbare Modem. Okay, man sollte also immer das Modem einschalten,
bevor man STFax startet, sonst kommt ein nervender Requester...  das
Modem erst sp&auml;ter einzuschalten, wird von STFax leider nicht akzeptiert.
Der Requester &quot;Serial not ready&quot; taucht immer wieder auf.
</P><P>
Am oberen Rand sind diverse Icons angeordnet, mit denen sich Faxe
versenden und ggfs. empfangen lassen k&ouml;nnen, auch das Ausdrucken von
Faxen und das Ansehen am Bildschirm ist m&ouml;glich. Daf&uuml;r wird sogar ein
Datatype mitgeliefert. Zu jedem Icon sind Bubble-Helps definiert, die
Help-Taste ruft die AmigaGuide-Anleitung auf.
</P><P>
Darunter findet man zwei Listen, links die Gruppen&uuml;bersicht, die die
Faxpostf&auml;cher (empfangene, versandte, f&uuml;r den sp&auml;teren Versand
vorbereitete und sonstige gespeicherte Faxe) und die Voice-&quot;Postf&auml;cher&quot;
ansteuert. In der rechten Liste werden die Nachrichten angezeigt, die
im gew&auml;hlten Postfach liegen.
</P><P>
Im <B>Preferences-Men&uuml;</B> lassen sich, wie schon vermutet, viele Details
einstellen. Briefk&ouml;pfe lassen sich auf jeder Seite einblenden, soll
das Modem automatisch die Anrufe beantworten? Offenbar lassen sich auch
ARexx-Programme (Hooks) starten, wenn ein Ereignis (Anruf) eintritt.
</P><P>
Ein <B>Fax</B> zu <B>erzeugen</B> ist nicht weiter schwer. Zu STFax geh&ouml;rt ein
Druckertreiber, der sich per Men&uuml; aktivieren l&auml;&szlig;t. Man kann aus jeder
Textverarbeitung heraus drucken, STFax f&auml;ngt die Ausgabe ab und macht
ein Fax daraus. Alternativ dazu erzeugt STFax eine verschickbare
Seitengrafik auch selbst, aus einem ASCII-Text und einer w&auml;hlbaren
Schriftart.
</P><P>
Benutzer von TurboPrint (sprich: ich) haben es leider schwer. TurboPrint
selbst hat gar keinen Amiga-Druckertreiber im System, sondern scheint
sich irgendwie hereinzupatchen. Das mag schneller sein, aber es l&auml;&szlig;t
sich nicht abschalten. Den STFax-Druckertreiber im Printer-
Preferencestool einzustellen, gen&uuml;gt nicht. Die einzige L&ouml;sung,
die ich gefunden habe, erfordert da&szlig; TurboPrint/TurboSpool aus der
WBStartup-Schublade verbannt werden und der Rechner neu gestartet wird.
STFax kann den Text nun problemlos aus der Textverarbeitung empfangen,
wenn man was ausdrucken m&ouml;chte, mu&szlig; man TurboPrint per Hand starten.
Das ist nervig, aber soweit ich das einsch&auml;tzen kann, eher ein Problem
auf der Seite von TurboPrint. Unterschreiben kann man seine Faxe
nat&uuml;rlich nicht, au&szlig;er man hat seine Unterschrift per Scanner
digitalisiert und in der Textverarbeitung eingef&uuml;gt.
</P><P>
Nun gen&uuml;gt es, die Telefonnummer des anzusteuernden Faxger&auml;ts einzugeben,
ein Telefonbuch ist vorhanden. Auch Titelseiten lassen sich gestalten. Ich
habe die Faxfunktion unter Mithilfe von Andreas Schlick ausprobiert, von
STFax an STFax und von STFax an ein &quot;echtes&quot; Faxger&auml;t (Philips Magic Vox),
beides hat problemlos funktioniert.
</P><P>
<B>Aber Vorsicht</B>: eine gestartete Aktion sollte man nicht wieder abbrechen
wollen. Andreas [Schlick] ist STFax dabei abgest&uuml;rzt, und weil der Rechner
gerade beim Schreiben auf die Festplatte war, mu&szlig;te er erst auf die
Validierung der Festplatte warten.
</P><P>
Wer kein Voice-Modem hat, sollte auch nicht aus Versehen das &quot;Answer&quot;-
Icon zum zwischenmenschlichen Gespr&auml;ch anklicken. Das erscheinende
Fenster bietet zwar sowohl &quot;Hang up&quot; als auch ein Schlie&szlig;gadget, aber
dessen Benutzung hat bei mir zweimal einen Absturz der h&auml;rteren Art
produziert.
</P><P>
<B>Zum Empfang</B>: STFax kann Faxe sowohl automatisch empfangen, zu empfehlen,
wenn das Modem an einer Leitung h&auml;ngt, die nur f&uuml;r Faxe bestimmt ist.
Oder wenn man so eine mystische Faxweiche sein eigen nennt. Aktiv?
Passiv? Der Telekommunikationsfachverk&auml;ufer hilft gern weiter. Der
Rechner mu&szlig; dazu permanent eingeschaltet sein. Ansonsten kann man das
Modem parallel zum Telefon in die TAE-Dose, die die Post -&auml;hm- Telekom
freundlicherweise installiert hat, einh&auml;ngen und schnell zum Computer
laufen, wenn beim Abheben mittels konventionellem H&ouml;rer das Faxpiepen
im Ohr schmerzt. Wenn der Rechner nicht gerade ultraschnell bootet, ist
es zum Einschalten wohl schon zu sp&auml;t: die Gegenstelle erh&auml;lt keine
Antwort und legt wieder auf. Abhilfe schafft &quot;Fax per Absprache&quot;, man
l&auml;&szlig;t sich einfach vor dem Faxempfang Bescheid sagen.
</P><P>
Ob man nun selber das passende Icon in STFax anklickt oder das Modem
sich automatisch auf den Anruf st&uuml;rzt; STFax leitet souver&auml;n den Empfang
ein und holt das Fax auf den Rechner. Auf Wunsch wird es automatisch
ausgedruckt. Im Postfach kann man das Fax ansehen, dabei verg&ouml;&szlig;ern,
verkleinern, drehen, spiegeln und (daf&uuml;r gibt's leider kein Icon) auf
die n&auml;chste Seite bl&auml;ttern.
</P><P>
Auch der Abruf-Empfang (Polling) wird von STFax unterst&uuml;tzt.
</P><P>
Zu den <B>Voice-Funktionen</B>: &Uuml;ber das Voice-BBS-System, das STFax bietet,
l&auml;&szlig;t sich eine richtige Men&uuml;struktur aufbauen. Jeder Anrufer wird per
Sample willkommengehei&szlig;en und kann, wie beim antiquierten Anrufbeantworter,
eine Nachricht hinterlassen. Oder er kann per Tonwahl w&auml;hlen, ob er eine
Nachricht hinterlassen, ein Fax abrufen, ein Fax senden oder jemanden
pers&ouml;nlich sprechen m&ouml;chte.
</P><P>
W&auml;hlt er &quot;Fax abrufen&quot;, kann er wom&ouml;glich noch aus einer Reihe von
vordefinierten Faxen w&auml;hlen. Geht bei &quot;pers&ouml;nlich sprechen&quot; niemand
ans Telefon, kann STFax auch das verarbeiten. Es lassen sich mehrere
Postf&auml;cher, &auml;hnlich der T-Net-Box, realisieren. Es gibt pa&szlig;wortgesch&uuml;tzte
Bereiche. Da Modems auch eine R-Taste (Hook flash) simulieren k&ouml;nnen,
lassen sich Gespr&auml;che evtl. auch innerhalb einer Nebenstellenanlage
vermitteln. Das h&auml;ngt von der Funktionalit&auml;t des Modems ab, bei
unserem Telefon ist die Konfiguration des Telefons auf die
Telefonanlage auf sieben Seiten beschrieben...
</P><P>
Die <B>Anleitung</B> ist, wie das Programm, durchgehend in Englisch gehalten.
Man kann zwischen der AmigaGuide-Form und HTML w&auml;hlen, f&uuml;r letzteres
ben&ouml;tigt man nat&uuml;rlich einen Browser. Die HTML-Variante ist gut gestaltet
und enth&auml;lt viele Screenshots von den STFax-Fenstern. Ein Index fehlt bei
beiden Varianten.
</P><P>
Leider geht die Anleitung auf das weitgehend mit den Icons identische
Men&uuml; nicht mehr ein, deshalb wird die Polling-Funktion nicht erw&auml;hnt.
Au&szlig;erdem ist nichts zur Hooks-Seite des Einstellungsfensters zu finden.
Und was macht &quot;Silent compression&quot;?
</P><P>
Es liegt eine alternative Registraturkarte bei, die man an Haage & Partner
abschicken kann. Denn: &quot;nur wenn wir Sie kennen, k&ouml;nnen wir Ihnen helfen!&quot;
Blo&szlig; schade, da&szlig; man diese Hilfe mangels Angabe einer Telefonnummer nur
schriftlich bekommen kann. Wer seine Fremdsprachenkenntnisse unter Beweis
stellen m&ouml;chte, darf nat&uuml;rlich Active Technologies in England anrufen.
Die haben noch nicht mal ihre Auslandsvorwahl vergessen.</P>
<P><B>Fazit:</B> STFax bietet alle Fax-Funktionen und den Komfort, den man sich
w&uuml;nscht. Die Voice-Features nehmen einen gro&szlig;en Teil des Programms ein
und sind wirklich umfangreich. Wer soetwas nutzen m&ouml;chte, ist mit STFax
sehr gut beraten. Leider hat das Programm kleine Macken, die die Benutzung
aber nicht stark st&ouml;ren. Die Anleitung ist englisch, aber ausf&uuml;hrlich und
gut geschrieben, sie bietet sogar ein Tutorium f&uuml;r Voice-Scripte. Zu
Nebenstellenanlagen findet man keine Informationen, au&szlig;erdem ist die
Anleitung nicht 100%ig auf dem Stand des Programms, was man bei einer
ausschlie&szlig;lich elektronischen Anleitung erwarten d&uuml;rfte.</P>
<P>[Dieser Test bezieht sich explizit auf die Version 3.2. Inzwischen
sind Updates kostenfrei auf der Haage & Partner-Homepage downloadbar
(<A HREF="http://www.haage-partner.com">http://www.haage-partner.com</A>), d. Chefred.]</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>STFax professional</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.active-net.co.uk">Active Tech.</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Fax-Software</TD>
    <TD><B>Version:</B></TD>
    <TD>3.2 Pro</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>98,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2 &#185;</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2 &#178;</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>
<BR>
Erl&auml;uterungen:<BR>
&#185;) Abwertung wegen Abst&uuml;rzen<BR>
&#178;) keine Abwertung wegen Englisch<BR>
<BR>
Hersteller:<BR>
Active Technologies, Oval House, 113 Victoria Road, Darlington, DL1 5JH<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz0998/iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809cd.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

