<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - AmigaWriter</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>AmigaWriter 1.0</U></H1><P ALIGN="CENTER">von<BR><A HREF="A.Schlick@gmx.de">Andreas Schlick</A></P>
<P><B>Lieferumfang</B>
</P><P>
Vor ungef&auml;hr einem Jahr als <B>EasyWriter</B> angek&uuml;ndigt, erfuhr das Programm
noch eine Namens&auml;nderung kurz vor der Auslieferung, da der Name EasyWriter
bereits von einem PC-Programm benutzt wurde.
</P><P>
Als ich endlich das Paket in den H&auml;nden hielt, packte ich freudig die CD-
Packung aus, in der Hoffnung, da&szlig; der Amiga vielleicht endliche eine
vern&uuml;nftige Textverarbeitung h&auml;tte.
</P><P>
Auf der CD-H&uuml;lle wird <B>AmigaWriter</B> als &quot;Textverarbeitung der Superlative
f&uuml;r PowerPC(TM) und 68k-Amiga&#174;&quot; angek&uuml;ndigt. Bei &Ouml;ffnung fand ich jedoch
nicht mal eine CD vor, sondern nur zwei Disketten. Neben den Disketten
wird noch eine Karte mit der Registrierungsnummer, eine Registrierungskarte,
verschiedene Aufkleber (!) und ein Booklet ausgeliefert.
</P><P>
Im &quot;Booklet&quot; steht dann, da&szlig; die PPC Version noch nicht fertig geworden
ist und &quot;in K&uuml;rze&quot; nachgeliefert wird (was jedoch auf der Reg.Karte
vermerkt werden sollte). Ein gedrucktes Handbuch soll auch erst mit der
Version 2 ausgeliefert werden (das Update ist allerdings kostenlos),
desweiteren wird an einer Unterst&uuml;tzung von anderen Zeichens&auml;tzen als
Bitmap- und Compugrafic-Vektorschriften gearbeitet. Das bedeutet leider,
da&szlig; AmigaWriter keine TT-oder Postscript-Fonts benutzen kann. :(
</P><P>
So weit die ersten Ent&auml;uschungen. Interessant sind nat&uuml;rlich auch die
tollen Aufkleber von StormC und WarpUp. Nach meinem ersten Gr&uuml;beln, was
ich denn damit &uuml;berhaupt anfangen soll (vielleicht sollen die Programme
mal Kultstatus haben, aber das kann ich irgendwo nicht glauben), findet
sich die Erkl&auml;rung auch auf einem der Zettel: StormC-Symbol &quot;Achtung:
Dieses Zeichen ist ein Garant f&uuml;r die hohe Qualit&auml;t des jeweiligen
Produktes. Achten Sie auch bei Software, die nicht von H&P kommt auf
dieses Symbol. Sie k&ouml;nnen beruhigt Updates der Software kaufen und
sicher sein, auch in Zukunft mit Software h&ouml;chster Qualit&auml;t und
Leistung versorgt zu werden.&quot;
</P><P>
ROTFL - na ja, vielleicht haben die Aufkleber ja Zauberwirkungen.
</P><P>
<B>Installation</B>
</P><P>
Die Installation von AmigaWriter lief per Commodore-Installer eigentlich
problemlos ab, wenn man davon absieht, da&szlig; man selbst im Expert-Modus
keinerlei Entscheidungen f&auml;llen darf.
</P><P>
Die Lieferumfang von AmigaWriter ist recht arm. Es werden keine
zus&auml;tzlichen Fonts oder Grafiken mitgeliefert (stattdessen befindet
sich auf der zweiten Diskette ein 439KB gro&szlig;es Archiv mit CGTimes,
CGTriumvirate und LetterGothic-Font - komisch, die gleichen habe ich
bereits auf meiner WB-Fonts Diskette).
</P><P>
Installiert wird nur das Hauptprogramm, ein paar Lib's, zwei Beispiel-
Dokumente, das AmigaGuide-Handbuch (dt./120KB) und zwei PlugIns. Dann
fand ich noch eine &quot;StormScreenManager.guide&quot;-Datei im AmigaWriter-
Verzeichnis. Etwas erschreckt guckte ich schnell in der WBStartup nach
und tats&auml;chlich: Dort fand sich dann der StormScreenManager (SSM).
</P><P>
<B>StormScreenManager</B>
</P><P>
Dieses Programm dient zur &quot;Verwaltung&quot; von PublicScreens und nimmt dem
Programm dann die &quot;Arbeit&quot; ab, einen Screen selbst &ouml;ffnen zu m&uuml;ssen. D.h.
dann, da&szlig; AmigaWriter keinen eigenen Screen &ouml;ffnen kann und sich auf den
SSM verlassen mu&szlig;. Netterweise ist der SSM auch lokalisiert..., das
Catalog-Verzeichnis landete allerdings auch in der WBStartup.
</P><P>
Ich finde diese Entwicklung ziemlich schade. W&auml;hrend die Amiga-Programme
eigentlich immer sehr kompakt waren und meist nur zus&auml;tzlich Lib's
brauchten, werden jetzt schon Programme ben&ouml;tigt, blo&szlig; um einen Screen
zu &ouml;ffnen. ;-(
</P><P>
Wenn ich also AW auf einen eigenen Screen laufen lassen m&ouml;chte, mu&szlig; ich
dazu erst den SSM &ouml;ffnen (der dazu nat&uuml;rlich die ganze Zeit im Hintergrund
laufen mu&szlig;) und kann dann dort einen neuen Screen einstellen. Allerdings
ist darauf zu achten, ob &quot;Like Workbench&quot; angew&auml;hlt ist oder nicht, wenn
man einen anderen Screenmode als den der Workbench einstellen will. Der
Button f&uuml;r die Modusauswahl wird n&auml;mlich nicht geghosted. Wenn AW dabei
jedoch schon l&auml;uft, mu&szlig; der Screen auch vom SSM ge&ouml;ffnet werden, da AW
den Screen sonst nicht erkennt (und das Prefsfenster mu&szlig; nachtr&auml;glich
ge&ouml;ffnet werden, da AW sonst auch nichts macht).
</P><P>
Also, SSM &ouml;ffnen, Screen konfigurieren, Screen &ouml;ffnen, AW Prefs &ouml;ffnen,
Screen ausw&auml;hlen, Prefs schlie&szlig;en, AW beenden und AW neu starten. Argh.
Wo sind die Zeiten geblieben, wo man einfach einen ASL-Screenrequester
&ouml;ffnete und fertig?! Wenigstens l&auml;uft AW auf der Workbench auch ohne SSM,
so da&szlig; ich ihn mal wieder (das erste mal nach der StormC Installation)
l&ouml;schen konnte.
</P><P>
Wer sich von der Anleitung von SSM noch viel verspricht, wird auch etwas
entt&auml;uscht, da der entscheidene Punkt &quot;GUI&quot; gar nicht existiert. &lt;seufz&gt;
</P><P>
<B>Benutzung/Features</B>
</P><P>
Nach dem Starten von AmigaWriter sieht man erst nur ein Fenster mit Icons.
</P><P>
Mit den Icons (bzw. entsprechenden Men&uuml;punkten) lassen sich dann: ein
neues Dokument erstellen, ein altes Dokument &ouml;ffnen, die Arbeitsmodi
&auml;ndern (Text editieren, Box editieren, Textbox erstellen, Grafikbox
erstellen, Verbindungseditor) und die vier Formatkatalogfenster &ouml;ffnen
(siehe unten).
</P><P>
<B>Anleitung/Hilfe</B>
</P><P>
Die Icons haben netterweise eine Art Bubblehelp, die ihre Funktion kurz
erkl&auml;rt. Leider sind die anderen Buttons damit nicht ausgestattet, auch
ein Druck auf die Help-Taste bringt die AmigaGuide-Anleitung nicht zum
Erscheinen. Die Anleitung enth&auml;lt auch teilweise wenig informative
Passagen, z.B. f&uuml;hrt der Link &quot;Fenster/Seitenformat-Katalog&quot; zu dem
Text &quot;&Ouml;ffnet das Dialogfenster zur Verwaltung der Seitenformate&quot;. Als
ob ich da nicht selber drauf kommen w&uuml;rde. :)
</P><P>
<B>Fu&szlig;noten</B>
</P><P>
Kommen wir mal zu etwas Positivem. AmigaWriter bietet Fu&szlig;noten!
</P><P>
W&auml;hrend der ersten Testversuche funktionierten die Fu&szlig;noten auch korrekt,
d.h. wenn der Fu&szlig;notenverweis auf eine andere Seite wanderte, wird die
Fu&szlig;note auch mitbewegt. AW beherrscht auch Kapitelendnoten und
Textendnoten. Aber da das zu sch&ouml;n w&auml;re, darf man sich bei jedem Dokument
nur f&uuml;r eine Art entscheiden, also entweder Fu&szlig;noten oder Kapitelendnoten
oder Textendnoten. Wobei die Kapitelendnoten bei mir nicht korrekt
funktionierten und wie die Textendnoten am Ende des Textes erschienen.
Das liegt vielleicht an der, meiner Meinung nach noch nicht vollst&auml;ndigen
Implementierung der Kapitel. Z.B. l&auml;&szlig;t sich ein Kapitel nur (!) dadurch
erstellen, indem bei einer Kapitelvorlage der undokumentiere Checkmark
&quot;Neues Kapitel&quot; angew&auml;hlt wird.
</P><P>
<B>Boxenprinzip - Textboxen</B>
</P><P>
Das Grundkonzept von AW basiert auf Boxen. Wie die Textboxen von
FinalWriter97 lassen sich auch bei AW die Textboxen beliebig auf der Seite
positionieren. Jedoch merkt man, da&szlig; das Konzept von Anfang an geplant war,
da auch die Standard-Seite als gro&szlig;e Textbox implementiert ist. Praktisch
ist die M&ouml;glichkeit die verschiedenen Textboxen miteinander zu verbinden,
d.h. wenn der Text einmal in die Box nicht mehr hineinpa&szlig;t, wandert er
autmatisch in die n&auml;chste Box. Dadurch sind auch mehrspaltige Seiten sehr
einfach zu realisieren (mehrspaltige Seiten m&uuml;ssen jedoch nicht von Hand
erstellt werden - AW kann das automatisch erledigen). Das Konzept der
Textboxen erm&ouml;glicht eine sehr freie und trotzdem einfach zu bedienende
Gestaltung der Seiten.
</P><P>
<B>Grafikboxen</B>
</P><P>
Die zweite Art von Boxen sind die Grafikboxen. Mit Hilfe der Grafikboxen
und den Datatypes werden Grafiken in die Seiten eingebunden. Das h&ouml;rt sich
erstmal sehr sch&ouml;n und flexibel an, jedoch werden die Bilder meist 3-4 mal
eingeladen (warum auch immer; Geduld ist eine Tugend) und gelegentlich
macht AW das Einladen so viel Spa&szlig;, da&szlig; er gar nicht mehr damit aufh&ouml;rt
(zumindest habe ich nach 3 Minuten einen Reset gemacht).
</P><P>
<B>PlugIn`s</B>
</P><P>
Eine weitere M&ouml;glichkeit Bilder zu integrieren, ist, sie als Textbaustein
zu laden, d.h. sie tauchen dann als Zeichen in dem Textflu&szlig; auf. Leider
ist diese M&ouml;glichkeit (als PlugIn gel&ouml;st) noch instabiler als die
Grafikboxen, so da&szlig; ich sie gar nicht zum Arbeiten bewegen konnte. :-(
Nach der Auswahl des Bildes bleibt AmigaWriter im Busy-Nodus einfach
stehen. Ob die Probleme nun an AW oder meinen DataTypes liegen, wei&szlig; ich
nicht. Jedoch w&uuml;rde ich mir schon alleine aus Geschwindigkeitsgr&uuml;nden
w&uuml;nschen, da&szlig; AW zumindest IFF, GIF und Jpeg Bilder direkt (einmal!)
laden w&uuml;rde.
</P><P>
Das zweite PlugIn ist ein Smiley-PlugIn. Wer also :-) und :-( nicht mehr
tippeln will, kann jetzt zur Maus greifen und per Men&uuml; und Fenster die
Smilies erstellen. :-\
</P><P>
<B>Formatvorlagen</B>
</P><P>
Ein weiterer Grundbaustein von AW sind Formatvorlagen. Es gibt vier
Formatvorlagen: Zeichen-, Absatz-, Seiten- und Kapitelformate. Sie dienen
dazu, dem gesamten Dokument ein einheitliches Aussehen zu geben.
</P><P>
Z.B. kann man eine Vorlage &quot;Hervorhebung&quot; erstellen mit dem Fontattribut
&quot;Fett&quot;. Will man dann sp&auml;ter lieber die Hervorhebungen durch Unterstreichen
markieren, so mu&szlig; man nur einmal zentral die Vorlage ver&auml;ndern und nicht
das gesamte Dokument durchsuchen. Soweit die Theorie..., die Praxis sieht
etwas anders aus.
</P><P>
Leider hat AW noch einige Fehler, so l&auml;&szlig;t sich z.B. eine
Seitenformatvorlage nicht mehr l&ouml;schen, wenn sie einmal erstellt wurde
oder man konfiguriert die Seitenformatvorlage indem man einen Doppelklick
auf den entsprechenden Eintrag im Seitenformatkatalog macht. Dadurch wird
jedoch nicht nur das Konfigurationsfenster ge&ouml;ffnet, sondern auch das
Seitenformat der aktuellen Seite ge&auml;ndert, was nicht unbedingt erw&uuml;nscht
ist (vor allem, da dadurch vorhandene Textboxen ins Nirwana entschwinden).
Desweiteren hatte ich vor allem Probleme die Kapitel-Formatvorlagen
anzuwenden, was vielleicht an der fehlenden Unterst&uuml;tzung von Kapiteln
im generellen liegt.
</P><P>
<B>Und nun noch zu ein paar anderen (fehlenden) Features:</B>
</P><P>
<B>*Silbentrennung*</B>
</P><P>
AmigaWriter hat eine eingebaute Silbentrennung, die jedoch scheinbar f&uuml;r
so gut gehalten wird, da&szlig; man sie gar nicht abschalten kann. :( Im ersten
Text wurde auch gleich ein Wort falsch getrennt, jedoch gibt es keinen
Men&uuml;punkt bzw. Icon, mit dem die Trennung r&uuml;ckg&auml;ngig gemacht werden kann.
Ein Blick in die Anleitung zum Thema Silbentrennung verr&auml;t, da&szlig; man die
Trennung mit dem Shortcut CTRL-# beseitigen kann.
</P><P>
Allerdings mu&szlig; man sich sehr genau daran halten, denn es steht nicht dort,
da&szlig; das Wort markiert werden soll. Wird es markiert, gibt es meistens
einen Absturz. Der weitere Nachteil ist, da&szlig; die Silbentrennung rein
algorithmisch ist, d.h. es gibt kein zu&auml;tzliches &quot;W&ouml;rterbuch&quot; f&uuml;r die
W&ouml;rter, die falsch getrennt wurden. Selbst im gleichen Test wird ein
einmal korrigiertes Wort wieder falsch getrennt.
</P><P>
<B>*Rechtschreibkontrolle/Thesaurus*</B>
</P><P>
Selbst mein Texteditor (GoldED) hat eine Rechtschreibkontrolle und
einen Thesaurus und wer sich noch an BeckerText erinnert, wei&szlig;, da&szlig;
dieses schon damals eine Rechtschreibkontrolle hatte. Bei AmigaWriter
fehlt eine Rechtschreibkontrolle vollst&auml;ndig, ebenso wie ein Thesaurus.
</P><P>
<B>*Inhaltsverzeichnis*</B>
</P><P>
AmigaWriter kann selbst&auml;ndig ein eigenes Inhaltsverzeichnis erzeugen.
Dazu schaltet man bei einer (oder mehreren) Absatzformate(n) die Option
&quot;Inhalt&quot; ein. Damit wird jeder Text, der dieses Absatzformat hat, in das
Inhaltsverzeichnis aufgenommen. Das Inhaltsverzeichnis ist jedoch sehr
spartanisch. In jeder Zeile steht der Inhalt des Absatzes und die
Seitennummer, gegebenenfalls wird mit Tabulatoren einger&uuml;ckt, jedoch
wird nicht darauf geachtet, da&szlig; die Seitennummern alle untereinander
stehen. Vorhandene Kapitel werden ignoriert.
</P><P>
<B>*Formeln*</B>
</P><P>
AmigaWriter besitzt (wie erwartet :) keinen Formeleditor, also holte
ich MathScript heraus und bemerkte recht schnell, da&szlig; AmigaWriter keinen
Import f&uuml;r EPS-Grafiken hat. Also bleibt lediglich die Verwendung von IFF
und wer mal IFF Grafiken skaliert hat (im Vergleich zu EPS) wei&szlig;, warum
ein EPS Support daf&uuml;r sehr w&uuml;nschenswert ist.
</P><P>
<B>*RTF - Rich Text Format*</B>
</P><P>
AmigaWriter kann Texte im RTF-Format im- und exportieren. Allerdings auch
nur das RTF-ASCII-Format, d.h. es fehlen alle Informationen &uuml;ber
Zeichens&auml;tze und Formatvorlagen.
</P><P>
<UL>
<LI>erzeugen eines Seitenumbruchs</LI>
<LI>dokumentierter ARexx Port</LI>
<LI>Tabellen</LI>
<LI>EPS Import</LI>
</UL>
</P><P>
AmigaWriter bietet leider keine der oben genannten Features. :-(
</P><P>
<B>Fazit</B>
</P><P>
Insgesamt mu&szlig; leider gesagt werden, da&szlig; in AmigaWriter noch eine ganze
Menge Arbeit gesteckt werden mu&szlig;, bis es sich mit FinalWriter97 bzw.
WordWorth messen kann. Es bietet zwar sehr nette Ans&auml;tze, aber da nicht
feststeht, was die V2.0 beinhalten wird und wann sie erscheint, kann ich
momentan den Kauf von AmigaWriter nicht empfehlen.
</P><P>
Jedoch soll demn&auml;chst ein Update erscheinen, vielleicht bessert das ja
die Situation. Allerdings mu&szlig; leider angemerkt werden, da&szlig; die Demo
aktueller ist als die Vollversion! :(
</P><P>
Die Konfiguration ist auch sehr mager und die vorhandenen Men&uuml;s/Shortcuts
sind nicht ideal gew&auml;hlt. Vor allem, da&szlig; man Boxen nicht mit DEL bzw.
Backspace (oder einem anderen Shortcut) l&ouml;schen kann, st&ouml;rte mich sehr.
Das GUI ist auch nicht immer konsequent, so kann z.B. alleinig beim
Kapitelformat-Katalog-Fenster die Konfiguration durch einen Doppelklick
<I>nicht</I> ge&ouml;ffnet werden.
</P><P>
Ich greife also erstmal wieder in mein Regal und hole mein LaTeX-Handbuch
raus und warte auf AmigaWriter V2.0...
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>AmigaWriter</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.haage-partner.com">Haage&amp;Partner</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Textverarbeitung</TD>
    <TD><B>Version:</B></TD>
    <TD>1.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>198DM inkl. 2.0-Update</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>4</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note4.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>4</TD></TR>
</TABLE></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809art.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809fe.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
