<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - ArtStudio Professional</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>ArtStudio Professional</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<BR><TABLE BGCOLOR="#DADADA" ALIGN="CENTER" BORDER="1">
<TR><TD>
Das nachfolgend getestete Produkt wurde uns freundlicherweise von
der Firma &quot;Ferst Computer&quot;, K&ouml;penicker Stra&szlig;e 11, 15537 Gosen,
(<A HREF="http://www.ferst.de">http://www.ferst.de</A>/<A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A>) leihweise zur Verf&uuml;gung gestellt.
</TD></TR></TABLE>

<P>Eines der spannendsten Dinge, die man mit einem Computer auf sehr
einfache Art und Weise tun kann, ist das Malen. Wer hat nicht schon
mal den virtuellen Pinsel geschwungen und sei es nur, um Strichm&auml;nnchen
zu kritzeln? Bleibt es aber nicht nur bei solchen gelegentlichen
Versuchen, sondern packt den User die Visualisierungswut, so kann es
schnell passieren, da&szlig; er die &Uuml;bersicht &uuml;ber die Sammlung seiner
unbezahlbaren Kunstwerke verliert.
</P><P>
Ebenso ergeht es nat&uuml;rlich jenen, die der Sammlerleidenschaft fr&ouml;hnen
oder die ihre Photos gern digital betrachten, um hin und wieder ein
paar kleine Sch&ouml;nheitsfehler auszugleichen. All jenen hilft ein
Bildkatalogisierer, der es auf einfache Art und Weise erm&ouml;glicht,
die Kreationen in Ordnung zu halten.
</P><P>
Als solcher pr&auml;sentiert sich <B>ArtStudio Professional</B> aus dem Hause Titan
Computer. Aber, wie sich das f&uuml;r eine professionelle Software geh&ouml;rt, die
einem traditionsreichen Giganten wie dem Picture Manager Paroli bieten
will, beschr&auml;nkt sich der Funktionsumfang nicht nur auf das geordnete
Verwalten von Bildern via Thumbnails. Dar&uuml;ber hinaus steht eine riesige
Palette an Bildbearbeitungsfunktionen zur Verf&uuml;gung und nat&uuml;rlich k&ouml;nnen
die Pixeleien auch in eines der 55 Grafik- und Animationsformate, unter
welchen sich auch solche f&uuml;r Vektorgrafiken befinden, konvertieren.
</P><P>
Aber werden wir doch <B>konkret</B>. Geliefert wird ArtStudio Professional in
der Version 3.0 auf einer CD-Rom. Eine Diskettenversion ist aber
ebenfalls erh&auml;ltlich. Die <B>Installation</B> erfolgt &uuml;ber ein Installer-Script
weitestgehend problemlos, auch wenn es etwas komfortabler sein k&ouml;nnte.
Die Registrierung wird &uuml;ber eine Seriennummer gel&ouml;st.
</P><P>
Nach dem <B>Start</B> pr&auml;sentiert sich das Programm auf einem eigenen Bildschirm,
dessen Aufl&ouml;sung und Farbtiefe sich frei einstellen lassen. Etwas negativ
f&auml;llt zun&auml;chst auf, da&szlig; man sich die Programmierung eines Font-sensitiven
GUIs dadurch gespart hat, da&szlig; &uuml;berall der Topaz.font verwendet wird und
sich das Programm nicht auf einen Public-Screen legen l&auml;&szlig;t. Letzteres ist
zwar gerade bei dieser Art von Programm nicht tragisch, allerdings ist
eine komplett Topaz-beschriftete Oberfl&auml;che weder zeitgem&auml;&szlig;, noch h&uuml;bsch,
was auch die Hinterlegung mit einem Schatteneffekt nicht verschleiern kann.
</P><P>
Was die <B>Funktionalit&auml;t</B> angeht, zeigt sich ArtStudioPro allerdings recht
flexibel. Vom zu verwendenden Lade-, Speicher-, und Anzeige-Modul, &uuml;ber
die Darstellung der Thumbnails, bis hin zum Verhalten des ausreichend
umfangreichen ARexx-Ports, l&auml;&szlig;t sich die Software den eigenen Bed&uuml;rfnissen
anpassen. Der Status der Fenster wird dabei mit festgehalten und somit
l&auml;&szlig;t sich auch die Oberfl&auml;che dauerhaft gestalten. Diese besteht in einem
oder mehreren Katalog-Fenstern und diversen zuschaltbaren Werkzeugleisten
und Informationsfenstern, sowie ggf. einem Bildbearbeitungsfenster, auf
das ich sp&auml;ter noch zu sprechen komme.
</P><P>
Das <B>Handling</B> ist recht intuitiv, wenn man davon absieht, da&szlig; die
&Uuml;bersetzungen der Menu-Punkte nicht mit denen in der sonst umfangreich
und &uuml;bersichtlich geschriebenen Anleitung &uuml;bereinstimmen. Das Hinzuf&uuml;gen
von Bildern in einen Katalog ist einzeln oder durch das Einlesen von
Verzeichnissen mit und ohne Unterverzeichnisse m&ouml;glich. Hierbei bietet
das Programm das besondere Feature, Kategorien entsprechend der
Unterverzeichnisse automatisch einzurichten. Die einzelnen Kategorien
lassen sich dann in ArtStudio verwalten und der Katalog kann
kategorienweise betrachtet werden.
</P><P>
Die <B>Handhabung</B> der einzelnen Bilder erfolgt &auml;hnlich komfortabel. Hierzu
stehen drei M&ouml;glichkeiten zur Verf&uuml;gung:
</P>

<OL>
<LI>Man w&auml;hlt zuerst eine Funktion (Info, Zoom, Betrachten oder Markiern) aus
und w&auml;hlt dann das Thumbnail an, auf das diese angewendet werden soll,</LI>
<LI>man zieht die Bilder per Drag&Drop auf die entsprechende Funktion und</LI>
<LI>man klickt zuerst ein Thumbnail an und sucht dann aus einem sich
daraufhin &ouml;ffnenden Popup die entsprechende Funktion aus.</LI>
</OL>
<P>
Die Zoom-Funktion ist &uuml;brigens insbesondere f&uuml;r Grafikkartenbesitzer
interessant, da hier einfach eine 4fache Vergr&ouml;&szlig;erung des Thumbnails
dargestellt wird, die ein Laden und Betrachten des Originalbildes
ersparen kann. Letzteres kann &uuml;ber interne View-Module oder externe
Anzeiger geschehen. Der Drag&Drop-Modus funktionierte bei mir
allerdings nur in Verbindung mit dem Bildbearbeitungsfenster, weder
die Werkzeugleisten, noch die Buttonleiste im Katalogfenster reagierten
auf das &quot;Fallenlassen&quot; der Thumbnails.
</P><P>
Das wohl umfangreichste Feature ist die <B>Bildbearbeitungsfunktion</B>. Leider
brachte gerade diese meinen Rechner regelm&auml;&szlig;ig zum Absturz, so da&szlig; ich
zu ihrer Funktionsweise nicht viel sagen kann. Die Auswahl an Effekten
ist sehr umfangreich, die Qualit&auml;t der 3DLook-Funktion (die einzige, die
ich noch testen konnte), war allerdings nicht unbedingt &uuml;berw&auml;ltigend.
</P><P>
Wer seine Kataloge gern im <B>Internet</B> ver&ouml;ffentlichen oder einfach nur
weiter gestalten will, kann sie als HMTL-Seite exportieren lassen.
Hierf&uuml;r liegen auf der CD-Rom einige Hintergr&uuml;nde und Grafiken bereit.
</P><P>
Das wohl umfangreichste Feature ist die <B>Bildbearbeitungsfunktion</B>.
Leider brachte gerade diese meinen Rechner regelm&auml;&szlig;ig zum Absturz.
Da ArtStudioPro den 68060 und &uuml;brigens auch PPC direkt unterst&uuml;tzt,
ist dieser als Ursache f&uuml;r die Instabilit&auml;t wohl auszuschlie&szlig;en.
</P><P>
Startet man das neben verschiedenen Grafikanzeigern und einer separaten
Konvertieroberfl&auml;che beigelegte Bildbearbeitungstool, das dieselben
Module benutzt, funktioniert die Konvertierung. Die Auswahl an Effekten
ist sehr umfangreich, die Qualit&auml;t war allerdings nicht unbedingt
&uuml;berw&auml;ltigend, zumal viele der Funktionen nur sehr geringf&uuml;gig die
Eingabe von Parametern zulassen. F&uuml;r geringf&uuml;gige Modifikationen der
Bilder reicht das aus, aber gro&szlig;artige Effekte wird man wohl nicht
erziehlen k&ouml;nnen.
</P><P>
Da ArtStudioPro den 68060 und &uuml;brigens auch PPC direkt unterst&uuml;tzt, ist
dieser als Ursache f&uuml;r die Instabilit&auml;t wohl auszuschlie&szlig;en, allerdings
mu&szlig; ich einr&auml;umen, da&szlig; die Abst&uuml;rze nicht unbedingt auf ArtStudio
zur&uuml;ckzuf&uuml;hren sein m&uuml;ssen, da ich in j&uuml;ngster Zeit geh&auml;uft Probleme mit
meiner Hardware habe.
</P><P>
Um den Testbericht abzuschlie&szlig;en, sei erw&auml;hnt, da&szlig; das Programm ansonsten
sehr stabil l&auml;uft und einen sehr soliden und funktionalen, wenn auch nicht
h&uuml;bschen Eindruck hinterl&auml;&szlig;t. Positiv ist auch das modulare Konzept,
mittels dessen sich Lade-, Speicher-, Anzeige- und Bildbearbeitungs-
Module einfach erweitern lassen.
</P><P>
Wer vom PictureManager umsteigen m&ouml;chte, kann seine Kataloge mittels
einer Importfunktion &uuml;bernehmen und Besitzer eines Scanners werden sich
&uuml;ber den direkten ScanQuix3-Support freuen.
</P><P>
Wer mehr Wert auf Funktionalit&auml;t als auf eine ansprechende
Arbeitsatmosph&auml;re legt, ist mit ArtStudioProfessional 3.0
sicherlich nicht schlecht beraten.
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>ArtStudio Professional</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>Titan Computer</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Bildbearbeitung</TD>
    <TD><B>Version:</B></TD>
    <TD>3.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>129,- DM &#185;</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Titan Computer</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=4>Fa. Titan Computer, Mahndorfer Heerstra&szlig;e 80 A, 28211 Bremen <BR>Hotline: Motion Studios, <A HREF="MotionStudios@mail.netwave.de">MotionStudios@mail.netwave.de</A>
</TD></TR>
</TABLE></P>

<P>&#185;)<BR>
Upd. v. V1.0: 79,- DM<BR>
Upd. v. V2.0: 69,- DM<BR>
Upd. v. V2.5: 59,- DM<BR>
CrossUpdate : 69,- DM</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809cd.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809aw.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

