<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1"><!-- Author = Reiner Hoster -->

    <TITLE>Dunkelrestaurant</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Dunkelrestaurant</B></FONT></P>

          <H3>Hallo liebe Blindzler,</H3>

          <P>Bitte nehmt Euch doch einen Moment Zeit, den folgenden
          Artikel zu lesen.</P>

          <P>Mein Name ist Reiner Hoster und ich arbeite im Verein
          Aus-Sicht, den die B&uuml;rgerstiftung Esslingen
          gegr&uuml;ndet hat, f&uuml;r ein Projekt welches sich mit
          der Gr&uuml;ndung eines Dunkelrestaurantes
          besch&auml;ftigt.</P>

          <P>Vorerst wird dieses Restaurant in Esslingen am Neckar
          aufgebaut. Die Idee dahinter besteht darin, eine Ebene
          entstehen zu lassen, die Blinde und Sehende
          zusammenf&uuml;hrt, um die Kluft zwischen Behinderten und
          Nichtbehinderten zu schm&auml;hlern.</P>

          <P>Die R&auml;umlichkeiten werden uns vorerst f&uuml;r 4
          Wochen vom Ehepaar Hag zur Verf&uuml;gung gestellt, die
          in Esslingen ein Tagungshotel unterhalten.</P>

          <P>Die R&auml;umlichkeiten werden maximal verdunkelt,
          sodass der sehende Gast auf die blinde Bedienung
          angewiesen sein wird. Die Rollen vertauschen sich also.
          Vertrautes verkehrt sich. Wir bieten den G&auml;sten eine
          kulinarische Reise f&uuml;r Gaumen und Nase. Weiterhin
          besteht die M&ouml;glichkeit, dass der Gast / die
          G&auml;stin, die Fragen stellen kann, die ihm in seiner
          unmittelbaren Umgebung zwar auffallen, aber nicht
          beantwortet werden.</P>

          <P>Wir finden, dass es wichtig ist, dass aus Sicht der
          Betroffenen die Aufkl&auml;rungspflicht unsrer Situation,
          unbedingt initialisiert werden muss.</P>

          <P>Das Projekt soll vorerst 4 Wochen als Probeprojekt
          instaliert werden um herauszufinden, ob dies
          m&ouml;glicherweise einen neuen Arbeitsmarkt f&uuml;r
          Blinde in unserer Gesellschaft darstellen
          k&ouml;nnte.</P>

          <P>Ich war pers&ouml;nlich f&uuml;r eine Woche in
          Z&uuml;rich in der Blinden-Kuh, um mich zu informieren,
          wie die Idee sich f&uuml;r 5 Jahre so manifestieren
          konnte. Wie die infrastrukturellen Gegebenheiten
          entwickelt wurden und nicht zuletzt, wie sie sich
          au&szlig;er &uuml;ber die Einnahmen finanzieren
          konnten.</P>

          <P>Die sehbehinderten Menschen im Raum Stuttgart sind mit
          in das Projekt invollviert und zeigen starke
          Mitarbeit.</P>

          <P>Auch wurde eine Reservierungshotline eingerichtet,
          &uuml;ber die Pl&auml;tze im Restaurant reserviert werden
          k&ouml;nnen. Weiterhin haben wir eine f&uuml;r blinde
          &uuml;bersichtliche Webseite erstellen lassen, &uuml;ber
          die ebenfalls das Projekt eingesehen werden kann. Auch
          dort besteht die M&ouml;glichkeit eine
          Reservierungsanfrage zu mailen.</P>

          <P>Die Er&ouml;ffnung des Restaurantes ist am 12.
          April.<BR>
           Die Telefonnummer f&uuml;r die Platzreservierung: 0711 /
          350 92 87<BR>
           Die Internetadresse: www.aus-sicht.de</P>

          <P>Wir w&uuml;rden uns sehr freuen, wenn Ihr Euch
          f&uuml;r unser Projekt interessiert und uns auch als
          G&auml;ste besuchen w&uuml;rdet. Denn welche
          M&ouml;glichkeit ist besser, unseren Sehenden zu
          erkl&auml;ren, wie es ist, wenn man im Dunklen essen -
          trinken muss.</P>

          <P>Die finanzielle Unterst&uuml;tzung durch Sponsoring
          war bisher leider sehr d&uuml;rftig ausgefallen. Daher
          m&ouml;chte ich noch hinzuf&uuml;gen zu &uuml;berlegen,
          m&ouml;chtet Ihr uns in unserem Vorhaben nicht
          unterst&uuml;tzen? K&ouml;nntet Ihr Euch vorstellen das
          Projekt mit Eurer Mitarbeit zu erg&auml;nzen? Habt Ihr
          Lust Mitglied im Verein Aus-Sicht zu werden? M&ouml;chtet
          Ihr vielleicht etwas spenden, mit Spendenquittung?</P>

          <P>Diese Fragen sind von fundamentaler Wichtigkeit, um
          unsere Idee nicht einfach so sterben zu lassen. In
          Berlin, K&ouml;ln und auch in Z&uuml;rich haben diese
          Fragen und die daraus resultierenden Reaktionen eine
          Existenz hervorgerufen, die es Blinden m&ouml;glich
          gemacht hat eine neue Arbeit zu finden.</P>

          <P>Also, wir reden hier von Integration, die uns
          Betroffene alle angeht. Unterst&uuml;tzt uns auch mit
          Euren Ideen und m&ouml;glicherweise habt Ihr ja auch noch
          die eine oder andere Idee.</P>

          <P>Ich danke Euch jetzt f&uuml;r Euer Interesse und hoffe
          auf Euere Unterst&uuml;tzung.<BR>
           Mit hoffenden Gr&uuml;&szlig;en</P>

          <P>Reiner Hoster<BR>
          Verein Aus-Sicht.<BR>
          Esslingen am Neckar<BR>
          Tel: 0711 90 79 81 9<BR>
          E-Mail: reiner.hoster@freenet.de</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

