<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>TigerTale</TITLE>
  </HEAD>

  <BODY background="images/bg2.jpg" text="#000000" link="#000000"
  vlink="#0000ff" alink="#000055">
    <BR>
    <BR>

    <CENTER>
      <TABLE width="95%">
        <TR>
          <TD>
            <CENTER>
              <H1>Tiger Tale Adventure Report</H1>
            </CENTER>

            <P><BR>
            </P>

            <P>Hallo und herzlich Willkommen zum Tiger Tale
            Adventure Report. Ich denke es wird mal wieder Zeit
            sich zu melden, damit man nicht glaubt dass es schon
            vorbei ist mit dem ehrgeizigem Projekt. In den
            vergangenen Wochen hat sich einiges getan. Wir erinnern
            uns: Das letzte Mal habe ich Randas Haus teilweise
            erstellt und nun auch teilweise eingebaut. Nun kann man
            sich auch mit Verina unterhalten, die auf ihrem Bett
            liegt und ein Buch liest. Der Plan sie komplett
            animiert einzubauen wurde noch nicht verworfen, jedoch
            ergab es zun&auml;chst eigendlich noch keinen Sinn, da
            sie in dem ersten Kapitel eine sehr kleine Rolle spielt
            und man erst einmal das feritg machen sollte, was auch
            direkt ben&ouml;tigt wird. Es geht nun darum das
            Schwimmbad nach und nach zu erweiten. Momentan sind
            folgende Screens des Bereiches Schwimmbad fertig: Die
            Stra&szlig;e, Die Eingangshalle, Das Restaurant, Das
            Schwimmbad Innen, Der Garten, Ein kleiner Zwischenraum.
            Es sind auch schon einige Gegenst&auml;nde eingebaut
            und das erste kleinere &gt;R&auml;tsel&lt; ist
            vorhanden. Wenn alle relewanten R&auml;ume feritig
            sind, gild es sich Gedangen &uuml;ber die ersten echten
            R&auml;tsel zu machen, was nichts anderes hei&szlig;t
            wie: Wie kommt man am schwersten in das Schwimmbad
            hinein? Erste Ideen gibt es schon, aber es ist nicht
            einfach die Sachen schwierig und zugleich logisch zu
            machen.</P>

            <P>Gibt es Fragen? Ja, der Herr mit dem gr&uuml;nen
            Klamotten und dem Kleeblatt im Hut, bitte...?</P>

            <P>Frage: Ich bin sehr skeptisch was die Fertigstellung
            des Projekts angeht. Ich glaube ehrlich gesagt nicht
            wirklich daran und ich w&uuml;rde gerne wissen wo sie
            die Zuversicht hernehmen das wirklich zu Ende zu
            bringen.</P>

            <P>Antwort: Nun, ich verstehe schon was sie meinen. Es
            ist ja wirklich so, dass derartige Projekte nicht sehr
            viel Aussicht auf Erfolg haben und irgendwann heimlich
            still und leise eingestellt werden. Irgendwann
            h&ouml;rt man dann nichts mehr davon. Der Grund ist
            ganz einfach: Viele sind sich zu Beginn nicht
            dar&uuml;ber im Klaren wie viel Arbeit es wirklich ist
            und ein Adventure ist wirklich wahnsinnig viel Arbeit!
            Es gibt viele Animationen und Hintergrundbilder zu
            erstellen und dann kommt ja noch die Programmierung
            hinzu, was mit Inga ja zum Gl&uuml;ck recht einfach
            ist. Alleine ist es eigendlich fast unm&ouml;glich. Ich
            kann nat&uuml;rlich nichts versprechen, da es ja ein
            Just for Fun Projekt ist was so lange weiter gemacht
            wird wie der &gt;Fun&lt; eben h&auml;lt, aber ich will
            es mal so sagen: In dieser NoCover befindet sich der
            54.Randa Teil. Wer h&auml;tte damals beim 1.Teil
            geglaubt, dass es sich einmal so weit weiter
            entwickelt?</P>

            <P>Weitere Fragen? Ja, der Mann mit der Augenklappe,
            dem Holzbein und dem S&auml;bel in der Hand
            bitte...?</P>

            <P>Frage: Ich w&uuml;rde gerne wissen was wir f&uuml;r
            R&auml;tsel erwarten d&uuml;rfen und wie lange die
            Spieldauer wird?</P>

            <P>Antwort: Insgesammt? Dazu kann ich nichts sagen, da
            ja erst einmal nur das erste Kapitel erstellt wird und
            momentan noch keine ernsthaft schweren R&auml;tsel
            vorhanden sind. Au&szlig;erdem wei&szlig; ich ja als
            Ersteller immer die L&ouml;sungen der R&auml;tsel
            sofort und kann nicht sagen wie lange es dauert bis
            andere darauf kommen. Ich habe &auml;hnlich wie in der
            Randa Saga eine feste Vorstellung von dem ersten
            Kapitel im Kopf und alles weitere wird sp&auml;ter
            entschieden. Eines vielleicht noch zu den R&auml;tseln:
            Ich habe letztens ein Adventure auf dem PC gespielt mit
            dem Namen Runaway. Einige hier werden es vielleicht
            kennen. Dabei ist mir aufgefallen, dass einige
            R&auml;tseln nur mit Komplettl&ouml;sung zu
            bew&auml;ltigen waren. Manche Dinge konnte man nur zum
            richtigem Zeitpunkt machen (Vorher nicht), waren
            reichlich unlogisch (Benutze Lippenstift mit
            Schie&szlig;pulver um Munition zu erhalten) und haben
            mich pers&ouml;nlich schwer entt&auml;uscht. Solche
            Dinge wird es in Tiger Tale nicht geben. Kleine Dinge,
            die man nicht zuerst sieht sollten schon vorhanden
            sein, aber gegen R&auml;tsel, die absolut unlogisch
            sind wehre ich mich. R&auml;tsel sollten durch
            &uuml;berlegen gel&ouml;st werden und nicht durch
            ausprobieren. Dabei darf man jedoch nicht vergessen,
            dass die Inga-M&ouml;glichkeiten begrenzt sind. Es gibt
            nur zwei Maustasten und somit nur zwei Befehle: Ansehen
            und Benutzen. Mehr geht nicht und ich muss sehen wie
            man damit das Beste herausholen kann.</P>

            <P>Weiter? Die Frau mit dem Spitzhut und dem Besen
            bitte...?</P>

            <P>Frage: Wird es &uuml;berhaupt weitere Kapitel geben?
            Richten sie sich nach der Resonanz und wann k&ouml;nnen
            wir mit dem ersten Kapitel rechnen?</P>

            <P>Antwort: Ich nenne jetzt hier kein Datum. Es
            w&auml;hre schon einerseits sch&ouml;n das 1.Kapitel so
            fr&uuml;h wie m&ouml;glich zu ver&ouml;ffendlichen,
            damit die Leute es auch mal LIVE sehen k&ouml;nnen.
            Andererseits stehe ich nicht so auf halbfertige Sachen.
            Es kommt auch immer darauf an was dazwischen kommt,
            auch im wirklichen Leben abseits vom Amiga. Ich
            m&ouml;chte erst einmal das erste Kapitel fertig
            bekommen, bevor wir &uuml;ber ein zweites Kapitel reden
            und zur Resonanz: Ich rechne mit mindestens genauso
            viel wie bei der Randa-Saga: N&auml;mlich nichts. Also
            wenn ich danach gehen w&uuml;rde, w&auml;hre das der
            sichere Tod des Projekts. Keine Angst, ich gehe nicht
            danach.</P>

            <P>Der Mann mit dem langem wei&szlig;em Bart und dem
            Stab in der Hand bitte...</P>

            <P>Frage: Wenn dem so ist, wie sieht es dann mit einer
            PC-Umsetzung aus? Dort w&uuml;rde man bestimmt mehr
            Resonanz bekommen. Ist das denkbar?</P>

            <P>Antwort: Denkbar schon, aber sehr unwahrscheilich,
            weil ich es erst einmal nicht machen werde. Erst muss
            das Spiel ja mal auf dem Amiga laufen und ich mache es
            ja haupts&auml;chlich weil es mir Spa&szlig; macht dort
            mit Inga zu erstellen. Nat&uuml;rlich gibt es auf dem
            PC &auml;hnliche Programme. Ich habe allerdings noch
            keines gesehen, was ohne Probleme funktioniert. Dann
            muss man sich wieder in ein komplett anderes Programm
            hineindenken und damit herum&auml;rgern bis man es
            versteht. Die Zeit kann man denke ich erst einmal
            sinnvoller nutzen. Wenn es jemand anderes machen
            m&ouml;chte, dann lege ich niemandem Steine in den Weg,
            ich glaube aber nicht dass das jemand machen
            m&ouml;chte...</P>

            <P>Die Dame mit den zwei Fl&uuml;geln auf dem
            R&uuml;cken, bitte ihre Frage...</P>

            <P>Frage: Ich stelle mir die Frage, warum ausgerechnet
            diese abgewandelte Amigana-Story, wo es gerade einmal
            nur einen Teil in der NoCover versteckt als
            Sonderausgabe gab? Ich denke viele h&auml;tten lieber
            die Randa Saga als Adventure gesehen, oder man
            h&auml;tte die Spacys auf diese Weise weiterleben
            lassen k&ouml;nnen, aber warum dieses Neuzeit
            Adventure?</P>

            <P>Antwort: Das mit der Randa Saga hatte ich zu Beginn
            tats&auml;chlich vor. Es gab schon die komplette
            Animation von Randa und die ersten zwei Screens. Es gab
            allerdings zwei Probleme. Zum einen basierte Randa dort
            noch auf der zweiten Grafikversion. Dort war sie ja
            noch etwas kleiner und die Screens waren einfach zu
            gigantisch. Man h&auml;tte den Bildschirm selten
            ausnutzen k&ouml;nnen. Das eigendliche zweite Problem
            aber war, dass ich die Story ja schon mit der Randa
            Saga erz&auml;hle. Ich wollte einfach etwas anderes
            machen. Die Spacys standen gar nicht zur Diskussion.
            Ich habe sie eigendlich nur fertig gemacht, weil ich
            keinen halben Comic auf der Webseite haben wollte.
            Au&szlig;erdem habe ich das Gef&uuml;hl, dass die
            Spacys eigendlich keiner so richtig gemocht hat.</P>

            <P>Weitere Fragen? Ja, die Kreatur mit den zwei
            gro&szlig;en Fl&uuml;geln und den langem Hals...?</P>

            <P>Frage: Ich habe eine Frage zur Randa Saga. Die Figur
            Randa hat sich ja mehrmals ver&auml;ndert. Bleibt sie
            nun so? Au&szlig;erdem bezeichnen sie Die Randa Saga ja
            immer als Fantasy Comic, aber so viel Fantasy ist
            meiner Meinung nach bis jetzt nicht drin gewesen. Wo
            sind die Drachen Einh&ouml;rner und Feen?</P>

            <P>Antwort: Es ist schwer ihre Frage zu beantworten
            ohne etwas zur Story zu verraten. Erst einmal zu Randa
            selbst: Sie hat sich ja ver&auml;ndert, weil die
            Aufl&ouml;sungen immer h&ouml;her wurden und immer mehr
            Details zugelassen haben, das hatte ja auch immer einen
            eher positiven Nutzen. Randa wird sich sich nun
            bestimmt nicht mehr ver&auml;ndern, da die
            Aufl&ouml;sung nicht mehr h&ouml;her geschraubt wird
            und die Bilder nicht mehr ver&auml;ndert werden von der
            Gr&ouml;&szlig;e her. Ich erkl&auml;re das mal: Ich
            lege die Bilder alle gesondert in einem Ordner ab und
            &auml;ndere nichts mehr an den Farben in der Palette,
            damit ich Personen und Bilder jederzeit, auch in Teil
            77 z.B. unver&auml;ndert verwenden kann. &Auml;ndere
            ich die Bilder wieder, so geht der Plan nicht auf. Zur
            Fantasy: Ich hoffe mehr zeigen zu k&ouml;nnen. Ich
            h&auml;tte schon gerne Iratima, das gefl&uuml;gelte
            Einhorn, diesmal dabei. Allerdings sehe ich nicht wann
            ich sie einbauen k&ouml;nnte, genau wie den Drachen
            Rixtiran, denn es gibt nun mal nur einen Drachen auf
            Eriadon. Ich habe das Bild, dass solche Fantasyfiguren
            sehr m&auml;chtig sind und die trifft man nun mal nicht
            an jeder Stra&szlig;enecke, sondern sind selten.
            Diesmal werden sie aber, haupts&auml;chslich gegen Ende
            der "zweiten Staffel" auf ihre Kosten kommen, da bin
            ich mir ganz sicher.</P>

            <P>Ja? Ah, die Dame mit den spitzen Ohren und dem Bogen
            in der Hand bitte...?</P>

            <P>Frage: K&ouml;nnen sie etwas zu Story verraten? Von
            der Randa Saga jetzt, nicht Tiger Tale. Die soll man ja
            selbst erleben...</P>

            <P>Antwort: Ohne zuviel zu veraten, nenne ich mal nur
            ein paar Stichw&ouml;rter: Rekotan, Selaros, Selissa
            Taleria von Winterkalt, Verinas Magie und
            Crusifenjon</P>

            <P>Frage Das ist ja nicht gerade viel...</P>

            <P>Antwort: Sie d&uuml;rfen nicht vergessen, dass hier
            auch Leute sind, die die Geschichte erleben wollen,
            ohne sie vorher zu wissen und ich denke, dass dies so
            auch besser ist. Ich kann und will nicht mehr verraten,
            aber ein gro&szlig;er Teil wird auf der schwarzen Burg
            spielen.</P>

            <P>...und das Skelett bitte direkt neben dem D&auml;mon
            dort...</P>

            <P>Frage: Da die Randa Saga ja im Mittelalter spielt
            und &uuml;berwiegend dort mit Schwertern hantiert wird,
            wie stehen sie da zur Gewalt? Ich meine, es wird sich
            ja wohl kaum vermeiden lassen, oder?</P>

            <P>Antwort: Ja, ein schweres Thema und sie haben schon
            recht. Es wird sich nicht vollst&auml;ndig vermeiden
            lassen, alleine von der Story her ist es schon
            unm&ouml;glich. Es werden allerdings keine K&ouml;pfe
            rollen, da ich von so etwas auch nicht so recht
            begeistert bin. Ich sage es mal so: Es wird auf keinen
            Fall so brutal wie manche Zeichentrickserien im
            Kinderprogramm von Fernsehen. Die Randa Saga braucht
            ganz einfach auch keine unn&uuml;tze Gewalt um
            &uuml;ber eine schlechte Story hinwegzut&auml;uschen.
            Das habe ich bis jetzt geschafft und m&ouml;chte ich
            auch so beibehalten.</P>

            <P>Die gro&szlig;e Kreatur mit den vielen K&ouml;pfen
            bitte ihre Frage...</P>

            <P>Frage: Ich habe einmal eine Frage zu dem Verlauf der
            Story. In den ersten Teilen, da gab es ja recht
            langwierige Teile, wie der viel kritisierte
            Kerker-Abschnitt, wo sich Randa &uuml;ber mehrere Teile
            mit Xantinia unterhalten hat. D&uuml;rfen wir uns auch
            wieder &uuml;ber solche Bereiche "freuen" und wie sieht
            es mit den Gro&szlig;aufnahmen aus? Wie genau werden
            die eingesetzt?</P>

            <P>Antwort: Ja , der Kerkerabschnitt mein ewiges
            Kreuz... Das lie&szlig; sich damals nicht vermeiden,
            reden wir nicht dar&uuml;ber. Reden wir lieber
            dar&uuml;ber, wie ich versuche solche Fehler zu
            vermeiden, denn nat&uuml;rlich sind solche Passagen
            langweilig, das ist keine Frage, weil sie ja auch pro
            Monat nur einen Teil bekommen, darf sich so etwas nicht
            mehr &uuml;ber ein halbes Jahr strecken. Nehmen wir
            z.B. einmal die momentanen Teile 53-55. Dort
            unterh&auml;lt sich Randa auch mit Xantinia &uuml;ber
            drei Teile, aber Randa zieht sich w&auml;renddessen um
            und ab und zu gibt es auch eine Gro&szlig;aufnahme um
            das aufzulockern. Da kommen wir auch zum zweiten Teil
            ihrer Frage. Ich m&ouml;chte ab und zu schon solche
            Gro&szlig;aufnahmen haben, es ist diesmal auch
            stellenweise unerl&auml;&szlig;lich, denn ich
            w&uuml;rde gerne einmal Xantinias Hand etwas
            gr&ouml;&szlig;er zeigen, damit man die
            Ver&auml;nderungen sieht. Es ist allerdings einfach zu
            viel Aufwand solche Gro&szlig;aufnahmen am laufenden
            Band zu machen, denn es ist bei einem Comic eben etwas
            anderes, wenn man es mit einem Malprogramm statt einem
            Bleistift zeichnet. Bei einfachen Unterhaltungen mache
            ich das in der Regel nicht. Es muss passen.</P>

            <P>Weitere Fragen? Das ist nicht der Fall sehe ich...
            Dann weiterhin viel Spa&szlig; mit der NoCover!</P>

            <P>Euer Thomas Weber</P>
          </TD>
        </TR>
      </TABLE>
      <BR>
       
    </CENTER>
  </BODY>
</HTML>

