<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>heise online - Amiga Inc ohne AmigaOS</TITLE>
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <META name="description" content=
    "Mit beinahe einem Jahr Versp&auml;tung verk&uuml;ndet Amiga Inc, dass es die Rechte an dem Betriebssystem AmigaOS bereits im April 2003 verkauft hat.">
    <META name="copyright" content="Heise Zeitschriften Verlag">
  </HEAD>

  <BODY bgcolor="#FFFFF4" text="#000000" link="#003399" vlink=
  "#666666" alink="#3366cc" leftmargin="0" topmargin="0"
  marginwidth="0" marginheight="0">
    <TABLE border="0" cellspacing="0" cellpadding="6" width="100%">
      <TR>
        <TD>
          <H2>Amiga Inc ohne AmigaOS</H2>

          <P>Die Geschichte des einst legend&auml;ren Heimcomputers
          Amiga ist um gleich zwei Besitzerwechsel reicher. Mit
          beinahe einem Jahr Versp&auml;tung verk&uuml;ndet die
          Firma Amiga Inc nun, dass sie die Rechte an dem
          Betriebssystem AmigaOS bereits im April 2003 verkauft
          habe. Der K&auml;ufer Itec LLC sei sp&auml;ter von der
          bis dato v&ouml;llig unbekannten Firma KMOS aus Delaware
          &uuml;bernommen worden.</P>

          <P>Mit der Meldung findet die katastrophale
          Informationspolitik von Amiga Inc ihren H&ouml;hepunkt
          und vielleicht auch ihr Ende. Noch im Januar hatte Amiga
          Inc offiziell die Weiterentwicklung des Programms
          Personal Paint f&uuml;r AmigaOS&nbsp;4 verk&uuml;ndet,
          obwohl die Firma zu diesem Zeitpunkt nach der neusten
          Darstellung die Rechte an dem Betriebssystem l&auml;ngst
          verkauft hatte. Die Ver&ouml;ffentlichung des Verkaufs
          zum jetzigen Zeitpunkt steht offenbar in Zusammenhang mit
          einem Gerichtsverfahren, in dem Gary Hare,
          Gesch&auml;ftsf&uuml;hrer von KMOS, als Zeuge
          aufgef&uuml;hrt wird. Bereits vor einem Jahr hatte es
          Ger&uuml;chte gegeben, dass Hare auf Dr&auml;ngen von
          Investoren die Leitung von Amiga Inc &uuml;bernommen
          habe.</P>

          <P>Die Entwicklung der neuen Version des Betriebssystems
          soll durch den Verkauf der Rechte nicht gef&auml;hrdet
          sein: KMOS habe die Vertr&auml;ge zur Entwicklung neuer
          Amigas &uuml;bernommen, hei&szlig;t es in der offiziellen
          Mitteilung. Diese Arbeiten waren von externen Firmen
          &uuml;bernommen worden. Bereits seit zwei Jahren
          entwickelt die belgische Firma Hyperion das neue
          Betriebssystem AmigaOS&nbsp;4, das auf
          PowerPC-Prozessoren laufen und auch Programme
          ausf&uuml;hren soll, die f&uuml;r den "Classic Amiga"
          geschrieben wurden. Die Firma Eyetech steuerte die
          Hardwareplattform namens AmigaOne bei, die derzeit
          allerdings nur mit Linux angeboten wird. Hyperion hat
          f&uuml;r die n&auml;chsten Tage eine Prerelease des neuen
          AmigaOS&nbsp;4 angek&uuml;ndigt.</P>

          <P>Der Amiga-Markt bietet inzwischen nur noch ein
          trauriges Bild. Die fast traditionellen Grabenk&auml;mpfe
          zwischen verschiedenen Firmen haben immer mehr Entwickler
          und User abgeschreckt, der jahrelange Stillstand nach der
          Pleite der Firma Commodore tat sein &Uuml;briges. Derzeit
          ist die Community gespalten zwischen Anh&auml;ngern des
          weiterentwickelten AmigaOS-Clones MorphOS auf dem Rechner
          Pegasos und den Amiga-Fans, die mehr auf die offizielle
          Produktlinie vertrauen.</P>

          <P>Amiga hat seit der &Uuml;bernahme der Rechte von
          Gateway wenig getan, um dieses Vertrauen zu
          rechtfertigen. Die anf&auml;nglich versprochenen
          regelm&auml;&szlig;igen "Executive Updates" waren meist
          nebul&ouml;s und wurden bald wieder eingestellt. Den
          Amiga-Fans sollte die Wartezeit auf ein neues Produkt
          beispielsweise mit einem Gutschein verk&uuml;rzt werden,
          f&uuml;r den die K&auml;ufer unter anderem ein T-Shirt
          erhalten sollten. Die Auslieferung der Textilien
          verz&ouml;gert sich nun schon &uuml;ber 2 Jahre. Im
          vergangenen Jahr hatte die Firma eine angek&uuml;ndigte
          CeBIT-Teilnahme sehr kurzfristig abgesagt.</P>

          <P>Amiga Inc will sich nun um den "wachsenden
          Mobil-Markt" k&uuml;mmern und setzt dabei auf das Amiga
          Digital Enviroment (DE), das auf unterschiedlichsten
          Hardwareplattformen laufen soll. K&auml;uflich sind
          bisher jedoch nur einige Spiele f&uuml;r Pocket PCs.<BR>
          (<I>Torsten Kleinz</I>)</P>

          <P>Copyright&nbsp;&copy;&nbsp;2004&nbsp; &lt;a
          href="http://www.heise-medien.de/zeitschriften/"&gt;
          Heise&nbsp;Zeitschriften&nbsp;Verlag<BR>
          gezogen: &lt;a
          href="http://www.heise.de/newsticker/meldung45592"&gt;</P>

          <P>eingeschickt: Dieter Beck</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

