<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- Author =  Mathias Klingner -->

<TITLE>Verkaufsfahrt mit dem FFO-Reiseclub</TITLE>
</HEAD>

<BODY background="images/bg4.jpg" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" summary="">
<TR>
<TD>
<CENTER>
<TABLE border="1" summary="Formatierung" width="740" cellpadding="6">
<TR>
<TD>
<A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A> 

<P align="center"><FONT color="#000080" size="6"><B>Verkaufsfahrt mit dem
FFO-Reiseclub am 09.03.2004 nach 16767 Germendorf</B></FONT><BR> </P>

<P>Mein Bekannter lud mich zur Verkaufsfahrt des FFO-Reiseclubs nach
Joachimsthal bei Berlin ein. Die Fahrt war als Tagesfahrt mit dem Besuch
eines Bauernhofes ausgeschrieben. Sie nannte sich "M&auml;rzen-Vesper &amp;
Einkaufen auf dem Bauernhof".</P>

<P>An diesem Tag war es mit +5&deg;C recht k&uuml;hl und am Morgen noch
sehr bedeckt. Ich traf mich mit meinem Bekannten, mit Vornamen Manfred, am
Dienstag, den 09.03.2004 gegen 7.30 Uhr am Berliner S-und U-Bhf.
Frankfurter Allee. Gegen 8 Uhr kam dort ein moderner, gut beheizter
Reisebus des Busunternehmens "Erdmanns' Reisedienst" an.</P>

<P>Wir waren mit noch einigen Reiselustigen die einzigen, die an dieser
ersten Zusteigem&ouml;glichkeit in den Bus einstiegen. Er fuhr kurz darauf
los. Zun&auml;chst fuhren wir die gesamte Karl-Marx-Allee entlang in
Richtung Fernsehturm.</P>

<P>Auf dieser Strecke hielt der Bus noch etwa drei Mal an, um weitere
Reisende einsteigen zu lassen. Auf dem Weg in den Norden Berlins hielt der
Bus noch weitere zwei Mal an, um nun auch die restlichen Ausflugsg&auml;ste
aufzunehmen zu k&ouml;nnen. Der Bus war nun mit etwa 50 Reiseteilnehmern
fast g&auml;nzlich ausgelastet.</P>

<P>Die Fahrt ging dann nach Berlin-Reinickendorf, durch den Flughafentunnel
auf die A11 in Richtung Prenzlau. Auf der Autobahn wurde dann vom Busfahrer
angesagt, dass wir nicht nach Joachimsthal fahren, sondern nach Germendorf,
welches direkt westlich, ca. 3 km vor den Toren von Oranienburg liegt. Er
hat uns noch darauf hingewiesen, sich genau das Aussehen oder das
Nummernschild des Reisebusses einzupr&auml;gen. Da am Zielort noch mehrere
Busse erwartet werden, w&auml;re es dann leichter seinen Bus
wiederzufinden. Der Busfahrer sammelte auch von jedem Fahrgast 2,99 EUR
Buchungsgeb&uuml;hr f&uuml;r diese Reise ein.</P>

<P>Unser Ziel Germendorf lag direkt westlich, ca. 3 km vor den Toren von
Oranienburg. Zur Zeit leben hier etwas mehr als 1.600 Menschen. Germendorf
ist, wie die meisten D&ouml;rfer in dieser Region, ein typisch
m&auml;rkisches Stra&szlig;endorf. Von den beiden Hauptstra&szlig;en, der B
273 und der L 172, hat sich der Ort in den letzten Jahren seit der Wende
weiter vergr&ouml;&szlig;ert. Neben dem gewachsenen Dorfkern und den
traditionellen Wohnstrukturen wurden zwei Neubaugebiete im Anger und am
Waldsee gebaut.</P>

<TABLE border="0" summary="Bild1" align="left" cellpadding="8">
<TR>
<TD align="center">
<IMG src="images/ffo193.jpg" width="360" height="240" alt="Bild01"><BR>
01: Veranstaltungsraum im Gasthaus:<BR>
"Zum fr&ouml;hlichen Landmann"
<HR>
</TD>
</TR>
</TABLE>

<P>Gegen 09.45 Uhr fuhren wir mit dem Bus vor dem Gasthaus "Zum
fr&ouml;hlichen Landmann" in Germendorf vor. Wir gingen dann auch gleich
hinein, in den gro&szlig;en Saal des Gasthauses. Dort waren schon die
Tische f&uuml;r das Fr&uuml;hst&uuml;ck mit Geschirr und den Getr&auml;nken
gedeckt. Doch zuvor wurden wir von Marco begr&uuml;&szlig;t. Er teilte uns
auch mit, dass die Veranstaltung heute in Germendorf stattfindet. Als Grund
nannte er, dass es in Joachimsthal im Saal zu kalt sei und die
sanit&auml;ren Einrichtungen auch nicht den Vorstellungen des Veranstalters
entsprachen. Deshalb habe man sich entschlossen die Veranstaltung heute
hier durchzuf&uuml;hren. </P>

<P>Zum Fr&uuml;hst&uuml;ck gab es belegte Br&ouml;tchen, Kaffee und auf
Wunsch auch alkoholfreie Getr&auml;nke oder Bier. Marco erkl&auml;rte
danach, dass es drei verschiedene Mittagsgerichte gibt. Als kostenloses
Mittagessen gab es Kartoffelsuppe mit Bockwurst. Daf&uuml;r musste man aber
seinen ausgef&uuml;llten Teilnahmeschein gleich abgeben und bekam dann am
Ende der Veranstaltung keine Geschenke. Auf diesem Teilnahmeschein wurden
Angaben wie z.B. Name, Vorname, Wohnanschrift, Geburtsdatum und
Telefonnummer gefordert. Aber er wurde auch in meinem Fall anerkannt. Ich
hatte die Telefonnummer und das Geburtsdatum nicht angegeben. Als zweites
Mittagsangebot gab es f&uuml;r 5,50 EUR Brartoffeln, Remouladenso&szlig;e
und S&uuml;lze. Das Dritte und letzte Angebot bestand aus Kartoffeln,
Erbsen und Schnitzel zu 8,50 EUR.</P>

<P>Nach dem Fr&uuml;hst&uuml;ck kam dann der Rico und w&uuml;nschte allen
Damen und Herren einen sch&ouml;nen Guten Morgen. Er sagte dann weiter:
"Mein Name ist der Rico. Ich habe heute die ehrenvolle Aufgabe Sie durch
das Reise- und Clubshoppingprogramm zu f&uuml;hren und meine erste Frage
ist sehr interessant und spannend. Und zwar, wer ist denn heute von Ihnen
zum aller, aller, aller erstenmal auf einer Tagesfahrt des FFO mit dabei?"
Es meldeten sich au&szlig;er mir noch zwei weitere Reiseteilnehmer. Er
sagte dann weiter: "Passen Sie auf. Ich habe da mal eine Frage an Sie, wo
Sie die letzten 10 Jahre geblieben sind? Wir h&auml;tten uns so gefreut,
wenn Sie schon eher mitgefahren w&auml;ren. Herzlich willkommen. Wir freuen
uns immer ganz besonders, wenn wir mal einige neue Gesichter sehen".</P>

<P>Als zweite Frage kam dann: "Wer ist denn in diesem Jahr zum aller,
aller, ersten Mal auf einer Tagesfahrt mit dabei?" Daraufhin meldeten sich
auch einige Teilnehmer. "Ach, das sind auch schon ein paar", sagte Rico.
Die letzte Frage lautete dann: "Wie lange dauert denn so eine Veranstaltung
in der Regel?" Es meldeten sich einige zu Wort und sagten Zeiten von einer
halben Stunde bis die ganze Nacht durch. Rico schlug dann vor: "Wir machen
bis sechs, halb sieben." Er beruhigte dann und meinte:" Nee, nee, nee. Ihr
habt mich nicht richtig verstanden. Ich meine sechs, halb sieben zu
Hause."</P>

<TABLE border="0" summary="Bild2" align="left" cellpadding="8">
<TR>
<TD align="center">
<IMG src="images/ffo194.jpg" width="360" height="240" alt="Bild02"><BR>
02: Urlaubsziel "Costa Azahar" in Spanien <HR>
</TD>
</TR>
</TABLE>

<P>Dann kam er auf den neuen Veranstaltungsort zu sprechen. Er
sagte, dass selbst derjenige, der in Geografie nicht so beschlagen ist
gemerkt haben wird, das wir hier nicht in Joachimsthal sind. Das hat
folgenden Grund, f&uuml;hrte er weiter aus. Der Saal war zu kalt, die
Toiletten waren sichtbar nicht sehr erquickend und der Rest hat uns auch
nicht gefallen. Au&szlig;erdem hatten wir ein gro&szlig;es Problem mit dem
Nachmittagsprogramm. Was wir den Leuten h&auml;tten dort anbieten
k&ouml;nnen, w&auml;re eine Fischerei gewesen. Auf dem Programm stand aber
Besuch eines Bauernmarktes. </P>
                   

<P>Dann machte er Ausf&uuml;hrungen zum weiteren Verlauf des Tages. Er
sagte: "Wir werden jetzt gleich mit der Vorstellung der Reisen beginnen.
Hinten im Saal, sitzt eine nette, junge Dame. Das ist meine Gattin. Meine
liebe nette Frau, die Diana. Bei ihr k&ouml;nnen Fragen gestellt und die
Reisen gebucht werden." Rico nannte dann beispielhaft verschiedene
Reiseziele wie: Teneriffa, Gran Canaria, &Auml;gypten, den mittleren Westen
der USA, Indien, Fahrten &uuml;ber Ostern an den W&ouml;rther See,
Ostfriesland, Usedom, R&uuml;gen und weitere sensationelle Reisen,
insgesamt 26 verschiedene. Zum weiteren Programm sagte er, dass wir nach
den Reisen eine kleine, nette Pause machen werden um den Interessierten die
M&ouml;glichkeit zu geben, sich Prospektmaterial oder Ausk&uuml;nfte zu den
Reisen holen zu k&ouml;nnen. Danach wird es eine Neuvorstellung eines
Produktes geben, die mit einem Fernsehfilm angereichert ist. "Es wird also
heute keine normale Werbung durchgef&uuml;hrt", sagte Rico. "Sondern ich
werde eine Stunde lang dieses neue Produkt vorstellen". Das ganze wird dann
bis zum Mittagessen gehen, f&uuml;hrte er weiter aus. Er sagte dann weiter:
"Nach dem Essen wird es dann noch ein paar nette, kleine
&Uuml;berraschungen f&uuml;r Sie geben".</P>

<P>Zum Nachmittagsprogramm sagte er, dass wir f&uuml;r Sie ein neues
Programm &uuml;berlegt haben. Der Veranstalter ist der Meinung, dass allen
auch etwas an Sehenswertem auf solch einer Reise geboten werden sollte. Und
so haben sie sich den sch&ouml;nsten Bauernmarkt in Brandenburg gegriffen.
Er fragte uns alle, welcher das wohl sei. Er wurde auch von einem
Teilnehmer errraten. Es ist der Bauernmarkt in Schmachtenhagen. Alle waren
begeistert und freuten sich nun auf den Nachmittag. Rico sagte weiter, dass
wir auf dem Bauernmarkt schon erwartet werden. Eintritt brauchen wir nicht
zu bezahlen, das hat alles die Firma organisiert, bzw. die Veranstalter.
Und er denkt, das wir danach jeder mit Spa&szlig; und Freude den Heimweg
antreten werden. Soweit seine Ausf&uuml;hrungen zum Tagesablauf.</P>

<P>Doch zun&auml;chst ging es im Programm mit einem Reiseangebot weiter. Es
handelte sich dabei um eine 7-t&auml;gige Flugreise nach Spanien an die
Costa Azahar mit Unterbringung im Vier-Sterne-Hotel. Diese Reise wurde
f&uuml;r 450 EUR angeboten. Man konnte den Anreisetag nach seinen
W&uuml;nschen buchen. Die auf der Werbefl&auml;che angebotene Reise zu 450
EUR war eine Busreise zum gleichen Reiseziel von FFO. Es wurde von Rico
vorher noch erl&auml;utert, das es diese Flugreise, in vergleichbaren sehr
guten Hotels, ungef&auml;hr von 900 bis 1.200 EUR bei anderen Anbietern
gibt.</P>

<P>Zum Finanzierungskonzept sagte er, dass die spanischen Hersteller von
Teppichen, Kunstgewerbe, Lederwaren oder Wein daran interessiert sind, dass
deutsche Urlauber nach Spanien kommen. Vom Reiseclub werden dann auf
Veranstaltungsfahrten diese besucht und es werden Produkte von diesen
angeboten. Deshalb sponsern sie derartige Reisen und diese niedrigen Preise
kommen dabei zustande. Das hei&szlig;t also, das man in Spanien auf
&auml;hnlichen Veranstaltungen wie heute Gegenst&auml;nde kaufen soll. Das
ist das Finanzierungskonzept. Wer sich nicht daran st&ouml;rt, der kann
getrost bei diesen Preisen zugreifen und verreisen.</P>

<P>Nach einer kurzen Pause ging es dann im Tagesprogramm mit der
Neuvorstellung eines Produktes weiter. Es wurde zuerst ein
Fernsehmitschnitt gezeigt, in dem die Vorteile von Aloe Vera sowie die
Wirkungs- und Anwendungsweise erl&auml;utert wurde. Danach erl&auml;uterte
Rico recht anschaulich auch mit Hilfe von Skizzen an einer Maltafel die
Vorteile bei der Anwendung von Aloe Vera bei verschiedenen Erkrankungen.
Zum Verkauf wurden dann von diesem Produkt drei Flaschen zu je 1 Liter
"DC-Aloe Vera Drink" angeboten. Diese sollten zu insgesamt 768 EUR verkauft
werden. Da aber das Produkt neu eingef&uuml;hrt wurde, konnte man es heute
mit einem Rabatt von 400 EUR f&uuml;r 384 EUR kaufen. Da dies aber immer
noch vielen Teilnehmer relativ teuer erschien und sich die Begeisterung bei
diesem Preis in Grenzen hielt, wurde wegen der Neueinf&uuml;hrung des
Produktes die gleiche Menge noch einmal oben drauf gelegt. So bekam man nun
f&uuml;r 384 EUR sechs Liter-Flaschen "DC-Aloe Vera Drink". Er hatte
daraufhin dann regeren Zuspruch und es wurde gekauft. Die K&auml;ufer
bekamen eine Ehrenurkunde und es wurde von ihnen erwartet, dass sie bei
einer n&auml;chsten Veranstaltung &uuml;ber ihre Erfolge mit Aloe Vera
berichten. Da ja die wenigsten das Geld dabei hatten, konnte man auch
Ratenzahlung vereinbaren. Wer etwas kaufte, bekam noch ein besonderes
Geschenk dazu. Man konnte aus folgenden vier Geschenken w&auml;hlen: einen
DVD-Player von elta, ein 70-teiliges Besteck im Aktenkoffer aus rostfreiem
Edelstahl, einem 3-teiligen Werkzeugkoffer mit Akku-Bohr-Schrauber,
Schleifer und Stichs&auml;ge sowie als letztes einen verchromten
Br&auml;ter.</P>

<TABLE border="1" summary="Bild3+4" width="100%">
<TR>
<TD align="center"><IMG src="images/ffo195.jpg" width="360" height="240" alt="Bild03"><BR>
03: Erkl&auml;rungen zur Wirkungsweise<BR>
von "DC-Aloe Vera Drink"</TD>

<TD align="center"><IMG src="images/ffo196.jpg" width="360" height="240" alt="Bild04"><BR>
04: Ehrenurkunde f&uuml;r den K&auml;ufer<BR>
des "DC-Aloe Vera Drink"</TD>
</TR>
</TABLE>

<P>Was aber ist nun Aloe Vera? Es handelt sich um eine Pflanze aus der
Familie der Liliengew&auml;chse. Die Pflanze ist stammlos oder mit einem
bis zu 25 cm langen Stamm und ca. 20 Bl&auml;ttern in aufrechter, dichter
Rosette. Ihre Bl&auml;tter sind zwischen 40 und 50 cm lang und 6 bis 7 cm
breit, recht dick, fleischig und wasserspeichernd. Die Bl&auml;tter sind
oberseits konkav, grau-gr&uuml;n mit h&auml;ufig roter F&auml;rbung und bei
jungen Pflanzen manchmal gefleckt. Unterseits sind die Bl&auml;tter konvex
geformt und haben am Blattrand eine leicht rosa Kante mit 2 mm langen,
blassen, derben, dornigen Z&auml;hnen im Abstand von 10 bis 20 mm. Der
Bl&uuml;tenstand ist einfach oder ein- bis zweimal verzweigt und 60 bis 90
cm hoch. Die Bl&uuml;tentrauben sind dicht, zylindrisch, nach oben schmal
werdend. Die Aloe bildet zahlreiche Adventivsprosse, mit denen sich die
Pflanze auch vegetativ vermehrt. Die urspr&uuml;ngliche Heimat der Aloe ist
unbekannt. M&ouml;glich erscheinen der Sudan oder die arabische Halbinsel.
Heute findet sich diese Art kultiviert und verwildert in Nord-Afrika von
Marokko bis &Auml;gypten, im Nahen Osten, in Asien und hier besonders in
Indien, im gesamten s&uuml;dlichen Mittelmeerraum, auf Madeira, den
Kapverden und den Kanarischen Inseln. Sie wurde in Mittel- und
S&uuml;damerika, insbesondere auf den niederl&auml;ndischen Antillen,
Puerto Rico, Jamaika, Mexiko und im Andenvorland eingef&uuml;hrt und ist
heute auch verwildert zu finden. Ihre Anbaugebiete sind auf den
niederl&auml;ndischen Antillen, in K&uuml;stengebieten von Venezuela sowie
in subtropischen Regionen der USA und Mexikos. Die Aloe Vera wird in
gro&szlig;en Plantagen angebaut.</P>

<TABLE border="0" summary="Bild5+6" align="left" cellpadding="8">
<TR>
<TD align="center">
<IMG src="images/ffo197.jpg" width="240" height="360" alt="Bild05"><BR>
05: 1-Liter Flasche (Vorderseite)<BR>
"DC-Aloe Vera Drink"
<HR>
<BR>
 <IMG src="images/ffo198.jpg" width="240" height="360" alt="Bild06"><BR>
06: 1-Liter Flasche (R&uuml;ckseite)<BR>
"DC-Aloe Vera Drink"
<HR>
</TD>
</TR>
</TABLE>

<P>Au&szlig;ergew&ouml;hnlich sind bei dieser Pflanze die Schutzeigenschaften
gegen das Verdunsten von Feuchtigkeit. Wird eines der Bl&auml;tter der
Pflanze verletzt, so heilt die Wunde fast augenblicklich. Die alten
&Auml;gypter schlossen deshalb bereits vor &uuml;ber 3.500 Jahren daraus,
dass diese F&auml;higkeiten auch der Behandlung des menschlichen Organismus
und der Haut zugute kommt. Zur Familie der Aloe Vera Pflanzen z&auml;hlen
&uuml;ber 300 verschiedene Arten, aber nur eine, die Aloe Barbadensis
Miller - auch die "wahre Aloe" genannt - ist die Pflanze, die f&uuml;r den
Menschen am bek&ouml;mmlichsten ist. Der Fl&uuml;ssigkeitsgehalt im Blatt
liegt bei ca. 95 % und wird durch eine wachsartige und
feuchtigkeitsspendende Hautschicht bedeckt. Der Gesamtwirkstoffgehalt
entwickelt sich erst nach dem 3. bis 5. Lebensjahr der Pflanze. In den
prallgef&uuml;llten Bl&auml;ttern der W&uuml;stenpflanze befindet sich ein
Wasserspeicher der rund 160 kostbare Lebensbausteine enth&auml;lt die tief
in die Haut eindringen und dort ihre heilende, pflegende und
sch&uuml;tzende Wirkung entfalten. Das aus den Bl&auml;ttern gewonnene Mark
ist reich an lebensspendenden Stoffen wie Vitaminen Mineralsalzen,
Aminos&auml;uren, Enzymen und verdauungsf&ouml;rdernden Fermenten. Mit
Hilfe neuester technischer Analysemethoden wurden etwa 400 Wirkstoffe, die
heilend auf den menschlichen Organismus wirken, im Saft der Pflanze
nachgewiesen. Die Wirkstoffe des reinen Gels im Inneren des Aloe
Vera-Pflanzenblattes werden nicht nur zur Entschlackung und Regeneration
des menschlichen Organismus eingesetzt, sie sind auch ein wohltuendes
Erlebnis f&uuml;r die Haut. In der heutigen Zeit wird Aloe Vera aus als
Trinkkur empfohlen und soll so unter anderem bei regelm&auml;&szlig;igem
Genuss so schwere Krankheiten wie Bluthochdruck, Migr&auml;ne,
Immunschw&auml;che oder Rheuma heilen k&ouml;nnen. Wegen der als nicht
gesichert geltenden Erkenntnisse d&uuml;rfen Aloe Vera Produkte in
Deutschland auch nur als Nahrungserg&auml;nzungsmittel beworben werden.
Wissenschaftlich belegt ist lediglich eine leicht abf&uuml;hrende Wirkung.
Bei &Uuml;berdosierung kann es zu empfindlichen St&ouml;rungen des
Verdauungsapparates kommen. Auf den angebotenen 1-Liter Flaschen "DC-Aloe
Vera Drink" war auf der R&uuml;ckseite folgendes zu lesen: "Vor Gebrauch
gut Sch&uuml;tteln. Trinken Sie t&auml;glich 30 ml bis 120 ml des
regenerierenden und nahrhaften Gel Getr&auml;nks je nach Bedarf.
K&ouml;stlich auch auf Eis oder gemischt mit einem Saft Ihrer Wahl. Trinken
Sie auf n&uuml;chternen Magen, vor den Mahlzeiten. DC-Aloe Vera Drink
eignet sich vorzugsweise zur &auml;u&szlig;erlichen Anwendung bei kleinen
Schnittwunden, Insektenstichen, Hautreizungen, nach Laser Therapie,
Sonnenbrand u.s.w. Nach dem &Ouml;ffnen im K&uuml;hlschrank lagern. DC-Aloe
Vera Drink enth&auml;lt folgende N&auml;hrstoffe in nat&uuml;rlicher
Zusammensetzung: Aminos&auml;uren, Enzyme, Mineralstoffe, Vitamine (B1, B2,
C, B6, Choline, B12). Ern&auml;hrungswerte pro 120 ml: ca. 5 Kalorien, 0g
Fett, 1,0g Kohlenhydrate, 0,0g Zucker, 0,2 mg Protein, 0,02 mg Calcium,
0,02 mg Zink, 4,5 mg Magnesium. Zutaten: Zertifizierter organischer Aloe
Vera "Barbadensis Miller" (99,7%) unter 0,3% an nat&uuml;rlichen
Zus&auml;tzen: 01,% Zitronens&auml;ure (Antioxidarit aus
Zitrusfr&uuml;chten) 0,1% Potasium und 0,1% Sodium. Wer noch mehr &uuml;ber
die Pflanze wissen m&ouml;chte, der kann sich hier informieren:
http://aloeveraspecial.gmxhome.de/ .  </P>


<P>Nach der Mittagspause, die auch von einigen genutzt wurde, um sich
weiter zu informieren oder um bei den Veranstaltern etwas zu kaufen, ging
es im Programm mit den angek&uuml;ndigten kleinen &Uuml;berraschungen
weiter. Es wurde ein Staubsauger angeboten. Bei diesem handelte es sich um
einen schnurlosen Handstaubsauger, bei dem man den Sauger auch abnehmen
konnte und so einen praktischen, kleinen Minihandstabsauger hatte, wie es
ihn auch extra zu kaufen gibt. Der Staubsauger saugte nicht nur, er
arbeitete auch mit rotierenden B&uuml;rste und hatte daher, trotz seiner
geringeren Wattzahl mindestens eine ebensolche gute Saugleistung wie
wesentlich gr&ouml;&szlig;ere und schwerere Ger&auml;te. Das Ger&auml;t
wurde auf fr&uuml;heren Veranstaltungen zu 298 EUR verkauft. Zu diesem
Preis hatten es auf fr&uuml;heren Veranstaltungenauch auch viele von den
heutigen Teilnehmern gekauft. Der Handstaubsauger wurde aber nun f&uuml;r
198 EUR angeboten. Das &auml;rgerte nat&uuml;rlich viele der Anwesenden,
die ihn damals f&uuml;r wesentlich mehr Geld kauften. Wer ihn nun immer
noch nicht zu Hause hatte, oder mit dem Gedanken spielte ihn etwa als
Geschenk zu kaufen, tat dies dann und bekam noch eins von den oben
aufgef&uuml;hrten Geschenken (DVD-Player, Besteck, 3-teiligen
Werkzeugkoffer oder Br&auml;ter) gratis dazu. Als n&auml;chstes, etwas
kleineres Mitbringsel, wurde eine Quarzuhr mit Schweizer Taschenmesser in
einer silberfarbenen Blechdose zu 68 EUR angeboten. Drei solcher Packungen
wurden auch ge&ouml;ffnet f&uuml;r die Anwesenden durchgereicht und es
hatte jeder somit die Gelegenheit, sich von der Uhr und dem Taschenmesser
selbst ein Bild zu machen. Bei der Uhr handelte es sich um eine ganz
normale Quarzuhr mit Lederarmband und Leuchtzifferblatt ohne
r&uuml;ckseitigen Herstellernachweis oder Angaben bis zu wie viel Meter sie
wohl wasserdicht ist. Das Messer war ein Schweizer Messer-Imitat. Eine
&auml;hnliche Uhr in einer gleichen Blechdose, jedoch ohne das Schweizer
Messer, daf&uuml;r jedoch mit Metallarmband kaufte ich vor ca. zwei Jahren
bei Karstadt f&uuml;r 10 EUR. Allerdings bekam man auch bei dem Kauf dieser
Uhrenpackung ein oben genanntes Geschenk gratis dazu. Man konnte also die
Uhr f&uuml;r 68 EUR kaufen und bekam einen DVD-Player von elta dazu. Das
sagt eigentlich schon einiges zum Wert dieser Uhr. Andersherum w&auml;re
der Verkauf schon eher einleuchtend gewesen. Man kauft einen DVD Player
f&uuml;r 68 EUR und bekommt die Uhrenpackung gratis dazu. Aber so war es
nicht. Da viele schon im Besitz einer Uhr waren kauften dann nur diese die
Uhr, die scharf auf die Gratisgeschenke waren. So wurden also auch einige
der Uhren verkauft. Wer sich nun immer noch nicht im Kaufrausch befand, der
wurde nun mit wirklich f&uuml;r alle erschwinglichen Gegenst&auml;nden des
t&auml;glichen Bedarfs gelockt. So gab es nun eine Flasche mit 1000 ml
Wollbalsam von Olympia mit Lanolin zu 10 EUR sowie eine Gesundheitspackung
von Pulmoll mit 2x 40 g Eukalyptusbalsam S, 1x Meerwasser-Nasenspray und 1x
Blasentee f&uuml;r 10 EUR und als letztes eine 125 ml Dose Aloe Vera Creme
auch zum Preis von 10 EUR. Da fanden sich dann doch noch einige
K&auml;ufer, die bis jetzt noch nicht das Richtige gefunden hatten. So
kaufte auch ich nun einmal Wollbalsam und eine Dose Aloe Vera-Creme. An die
Reiseteilnehmer gerichtet, die bis jetzt immer noch nichts gekauft hatten,
sagte Rico dann sinngem&auml;&szlig;: Er findet es &uuml;berhaupt nicht in
Ordnung, das es unter den Reiseteilnehmern welche gibt, die auch jetzt noch
nichts gekauft haben. Es kann doch nicht sein, das man nur nimmt und nicht
bereit ist auf der Veranstaltung etwas zu geben, indem man etwas kauft. Die
anderen, die etwas kauften, finanzieren den Nichtk&auml;ufern letztendlich
die Reise mit. Es ist doch einleuchtend, dass man von dem eingesammelten
Buchungsbeitrag in H&ouml;he von 2,99 EUR, der von jedem Teilnehmer zu
leisten war, nicht die Reise mit allen Reiseleistungen finanzieren kann.
Die Reise wird eben auch &uuml;ber den h&ouml;heren Verkaufspreis, der eher
kleiner Dingen finanziert. Wenn nichts gekauft wird und sich die
Tagesreisen nicht mehr finanziell lohnen, dann kann es passieren, das es
diese Form der Kurzreisen in Zukunft nicht mehr geben wird. Wenn dies
eintritt, trifft es dann alle. Er bedankte sich dann im Abschluss bei
allen, die etwas gekauft haben und w&uuml;nschte noch viel Spa&szlig; beim
Besuch des Bauernmarktes und eine gute Heimfahrt.</P>

<P>Danach konnte man dann drau&szlig;en in einer Garage die f&uuml;r jeden
vorbereiteten Geschenke, sowie die gekauften gr&ouml;&szlig;eren Waren
abholen. Diejenigen Mitreisenden, die gr&ouml;&szlig;ere Gegenst&auml;nde
gekauft hatten bekamen einen Gep&auml;ckroller mit, auf dem schon alle
Waren fertig verschn&uuml;rt waren.</P>

<P>Dann ging es ab zum Bus. Diesen zu finden war recht einfach, denn es war
kein weiterer Bus zur Veranstaltung angekommen. Wir fuhren ca. 10 Minuten
nach Schmachtenhagen zum Oberhavel Bauernmarkt. Dort war es an diesem
Dienstag sehr ruhig. Die meisten Gesch&auml;fte und St&auml;nde hatten
geschlossen. Sie machen wohl nur am Wochenende auf, wenn die Berliner
diesen Markt besuchen. Von einem gro&szlig;en Erlebnis konnte also nicht
die Rede sein.</P>

<TABLE border="1" summary="Bild7-10" width="100%">
<TR>
<TD align="center">
<IMG src="images/ffo199.jpg" width="360" height="240" alt="Bild07"><BR>
07: Ankunft mit modernem Reisebus am "Oberhavel Bauernmarkt"
<HR>
</TD>

<TD align="center">
<IMG src="images/ffo200.jpg" width="360" height="240" alt="Bild08"><BR>
08: Eingang zum "Oberhavel Bauernmarkt" in 16515 Schmachtenhagen
<HR>
</TD>
</TR>

<TR>
<TD align="center">
<IMG src="images/ffo201.jpg" width="360" height="240" alt="Bild09"><BR>
09: Am Wurst-und Fleischstand im Bauernmarkt <HR>
</TD>

<TD align="center">
<IMG src="images/ffo202.jpg" width="360" height="240" alt="Bild10"><BR>
10: Leider geschlossener Bio-Markt <HR>
</TD>
</TR>
</TABLE>

<P>Nach einer viertel Stunde fanden wir uns dann auch alle wieder beim Bus
ein und fuhren in Richtung Berlin nach Hause. Im Bus passierte einer
Reisenden noch eine kleine Kuriosit&auml;t, die ich hier noch kurz
berichten m&ouml;chte. Einer Frau im mittleren Alter fiel beim Essen eine
Tomate aus der Hand, bevor sie zubei&szlig;en konnte. Diese Tomate kullerte
durch den Bus, der in diesem Moment etwas bergab fuhr. So landete sie von
allen unbemerkt vorn, in der N&auml;he des Fahrers. Die Frau suchte dann im
Bus nach ihrer Tomate. Da sie diese aber nicht finden konnte, bat sie die
Mitfahrenden dann um Mithilfe. Dies bekam auch der Busfahrer mit. Er rief
alle &uuml;ber das Mikrofon zur Suche nach der Tomate auf. Obwohl alle
suchten, blieb die Tomate aber spurlos verschwunden. Der Busfahrer, der
wohl bef&uuml;rchtet hat, es k&ouml;nnte ein Fahrgast aus dieser Tomate mit
seinem Fu&szlig; Ketschup machen, rief wiederholt alle auf, die Tomate zu
suchen. Sie wurde dann auch endlich von einem &auml;lteren Fahrgast
gefunden und der Frau &uuml;berreicht. Alle freuten sich und ermunterten
die Frau, dem &auml;lteren Mann wenigstens mit einem K&uuml;sschen zu
danken. Sie gab ihm darauf auch unter dem Beifall Aller zwei K&uuml;sschen
auf die Wange.</P>

<TABLE border="0" summary="Bild11+12" align="left" cellpadding="8">
<TR>
<TD align="center">
<IMG src="images/ffo203.jpg" width="240" height="360" alt="Bild11"><BR>
11: Die Geschenke f&uuml;r jeden<BR>
m&auml;nnlichen Reiseteilnehmer... <HR>
</TD>

<TD align="center" valign="top">
<IMG src="images/ffo204.jpg" width="240" height="360" alt="Bild12"><BR>
12: und das habe ich gekauft<BR>
&nbsp; <HR>
</TD>
</TR>
</TABLE>

<P>Bei der R&uuml;ckfahrt hielt der Bus auch in umgekehrter Reihenfolge an
allen Haltestellen wieder an und nach und nach leerte er sich. Der
Busfahrer musste &ouml;fter mit aussteigen, um den Vielk&auml;ufern ihre
Gep&auml;ckroller mit den gekauften Sachen aus der Gep&auml;ckbox
au&szlig;erhalb des Fahrgastraumes zu geben. Da mein Bekannter Manfred und
ich zuerst eingestiegen waren, waren wir nun die letzten, die aussteigen
konnten. Wir waren gegen 17.30 Uhr am Berliner S-und U-Bhf. Frankfurter
Allee angekommen und unsere Reise war damit zu Ende. </P>
                   

<P>Abschlie&szlig;end kann ich zu meinen neuen Erfahrungen, die ich mit
dieser Verkaufsfahrt machte sagen, dass ich solch eine Fahrt nicht
unbedingt wiederholen w&uuml;rde. Man kann auch anders reisen. Die Fahrt
ist dann wahrscheinlich teuerer als 2,99 EUR Buchungsgeb&uuml;hr, jedoch
werden einem mehr Sehensw&uuml;rdigkeiten geboten. Auch steht man nicht in
der Schuld der Veranstalter und versucht dann diesen zu liebe irgend etwas
zu kaufen, um nicht wie ein Bettler dazustehen. Wer allerdings recht hart
gesotten ist und wirklich nur das kauft, was er oder seine Verwandten
gebrauchen k&ouml;nnen, der kann, wenn ihm oben aufgef&uuml;hrtes nicht
st&ouml;rt, durchaus mitfahren. Er sollte sich dann aber auch nicht
&uuml;ber die zum Teil sehr &uuml;berh&ouml;hten Preise aufregen. Dies
geh&ouml;rt einfach zum Finanzierungskonzept dieser Art Reisen. Rico
verstand es, seine Produkte anschaulisch und verst&auml;ndlich
vorzustellen. Dadurch hatte die Veranstaltung auch einen hohen
Informationsgehalt. Ich m&ouml;chte noch auff&uuml;hren, das die Art und
Weise wie diese Veranstaltung durchgef&uuml;hrt wurde vom Umgang mit den
Reiseteilnehmern &auml;u&szlig;erst fair war und diplomatisch und
feinf&uuml;hlig mit den &auml;lteren Menschen umgegangen wurde. Der Bus war
in Ordnung, man brauchte also keine Angst zu haben, nicht wieder heil zu
Hause anzukommen, was auch f&uuml;r den Busfahrer spricht. Man konnte
Vertrauen zu seinem Fahrstil haben.</P>

<P>Soweit mein Bericht zu der durchgef&uuml;hrten Verkaufsfahrt. Ich bin
mir aber durchaus im klaren dar&uuml;ber, dass einige Leser von derartigen
Veranstaltungen weit schlechteres berichten k&ouml;nnten oder von anderen
Reisenden dies h&ouml;rten. Nur bei dieser Reise war es eben nicht so.</P>
<BR clear="all">
                   

<P>Mathias Klingner<BR>
E-Mail: Tschandru.Shing@Berlin.de</P>
<BR>
<A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A> 
</TD>
</TR>
</TABLE>
</CENTER>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

