<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1"><!-- Author =  -->

    <TITLE></TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Ebay &nbsp; &nbsp; 
          ;-)</B></FONT></P>

          <P><B>Tag 1, 22:00 Uhr:</B><BR>
           Email erhalten. Ein Freund schreibt etwas davon, dass
          man bei ebay tolle alte B&uuml;cher bek&auml;me, ab und
          zu w&uuml;rden sogar .........-b&uuml;cher angeboten. Das
          hat mich sehr &uuml;berrascht, bis dahin war ebay
          f&uuml;r mich etwas, wo man seine gebrauchte
          Kinderkleidung und alte M&ouml;bel ver- bzw. ersteigern
          konnte. Aber nun werde ich wach. Alte B&uuml;cher ???
          Daf&uuml;r hatte ich schon immer eine Schw&auml;che. Und
          dann wom&ouml;glich noch .......... ???</P>

          <P><B>Tag 1, 22:10 Uhr:</B><BR>
           Mit gro&szlig;en staunenden Kinderaugen lese ich, dass
          alleine unter der Rubrik "Antiquarische B&uuml;cher"
          &uuml;ber 36.000 Angebote sind, aufgeteilt in 16
          Unterrubriken. Ich fange an zu lesen und zu
          bl&auml;ttern.</P>

          <P><B>Tag 1, 22:18 Uhr:</B><BR>
           Das erste interessante Objekt ist gefunden, mein Herz
          schl&auml;gt schneller. Jetzt muss ich mich wohl mal
          anmelden.</P>

          <P><B>Tag 1, 22:25 Uhr:</B><BR>
           Die erste H&uuml;rde: ich brauche einen "Namen", eine
          Identit&auml;t. Da nimmt man ja nicht etwa seinen
          wirklichen Namen, sondern irgendeinen Fantasienamen.
          Pech, wenn einem gerade nichts Gescheites
          einf&auml;llt.<BR>
           Ein Spitzname muss her. Wie hat man mich fr&uuml;her mal
          genannt ? Pech, ist schon vergeben. N&auml;chster
          Versuch. Ist auch vergeben. Na gut, eine Zahl dahinter.
          Ist auch vergeben. Ja, spinnen die denn ???<BR>
           Da hilft mir ein nettes Programm und fragt mich nach
          meinen Hobbies. Daraus haben wir dann quasi "gemeinsam"
          einen Namen gebastelt. Er klingt zwar recht affig, aber
          das ist mir schnurzwurschtegal, Hauptsache ist, ich kann
          endlich mitbieten !<BR>
           Ein Passwort brauche ich auch noch. Am besten ein so
          schweres, dass ich es mir selbst nicht merken kann.
          Vorsichtshalber schreibe ich mir alles auf. Jetzt wird
          mein Name auch noch gepr&uuml;ft. Das klappt nicht auf
          Anhieb und ich muss warten. Nun muss ich noch eine Mail
          best&auml;tigen. *fingertipptipptipp...*</P>

          <P><B>Tag 1, 22:45 Uhr:</B><BR>
           Die Formalit&auml;ten sind erledigt, ich habe nun eine
          "mein ebay" Seite, habe etwas zu trinken, etwas zum
          knabbern... und nun kann es losgehen. Jeder
          ebay-Anf&auml;nger wird wohl das Gef&uuml;hl kennen, wenn
          man sich zum erstenmal dieser &uuml;berw&auml;ltigenden
          F&uuml;lle von Angeboten gegen&uuml;bersieht... und ein
          paar davon laufen gleich ab, dann ist die Zeit um, in der
          geboten werden kann !!! Man bl&auml;ttert und bietet wie
          in Trance. Da sind drei ganz &auml;hnliche Angebote, noch
          dazu &auml;u&szlig;erst billig !!! Welches soll ich
          nehmen ? Oder besser auf alle drei bieten, falls mir
          jemand zwei wegschnappt, bekomme ich wenigstens das
          dritte ? In einem Auktionssaal ist es ja anders, da wird
          ein St&uuml;ck nach dem anderen verkauft. Aber hier
          manches fast gleichzeitig. Also - entscheiden,
          entscheiden und weiterbl&auml;ttern und staunen und
          entscheiden. Nein, das nicht. Ja, das k&ouml;nnte, aber
          lieber erstmal beobachten. Ja, hier vielleicht bieten.
          Nein, dies eher nicht. Tausende von Angeboten...</P>

          <P><B>Tag 2, 02:51 Uhr nachts:</B><BR>
           Ich habe 11 Gebote abgegeben, einiges unter Beobachtung
          und so langsam die &Uuml;bersicht verloren. Wenigstens
          hat die "mein ebay" Seite noch die &Uuml;bersicht. Meine
          Frau meint, ich solle lieber schlafen gehen. Na, die hat
          gut reden. Ich kann jetzt noch nicht schlafen, ich bin
          v&ouml;llig
          aufgeeee&auml;&auml;&auml;&auml;hhhnnnn...</P>

          <P><B>Tag 2, 09:40 Uhr: Habe schon vor dem
          Fr&uuml;hst&uuml;ck meine Mails abgerufen, nun nach dem
          Fr&uuml;hst&uuml;ck kann ich endlich weitermachen. Tag 2,
          12:24 Uhr:</B><BR>
           Habe 4 weitere Gebote abgegeben, bin auch schon
          &uuml;berboten worden (cool bleiben !!!) aber nun endlich
          hab ich mein erstes Buch ersteigert. Klein, billig, aber
          interessant. Sofort Mail an Verk&auml;ufer geschickt, wie
          es sich geh&ouml;rt.</P>

          <P><B>Tag 2, 17:34 Uhr:</B><BR>
           Bin auf den letzten Sekunden &uuml;berboten worden, habe
          ganz verbl&uuml;fft zugeguckt. F&uuml;r eine Reaktion war
          alles viel zu schnell. Heeee, die k&auml;mpfen hier mit
          harten Bandagen !!! Stelle fest, dass bei abgelaufenen
          Auktionen oftmals die Sieger vorher gar nicht mitgeboten
          haben. Lerne, wie entscheidend die letzten Minuten sind.
          Lerne au&szlig;erdem, dass es intelligenter ist, krumme
          Betr&auml;ge zu bieten. Glatte Betr&auml;ge, wie etwa 15
          Euro, werden sonst mit 15,05 Euro &uuml;berboten.
          Typische Anf&auml;ngerfehler...</P>

          <P><B>Tag 2, 19:18 Uhr:</B><BR>
           Zwei Fragen sind aufgetaucht, die ich in den
          umfangreichen Erl&auml;uterungen nicht erl&auml;utert
          fand. Also email an den Kundenservice. Die Mails werden
          sofort automatisch best&auml;tigt. Die eigentliche
          Antwort bleibt aber aus.</P>

          <P><B>Tag 3, 01:41 Uhr nachts:</B><BR>
           Email von ebay. Man fragt mich, ob ich mit dem Service
          zufrieden w&auml;re. Mit welchem Service ???</P>

          <P><B>Tag 3, 15:50 Uhr:</B><BR>
           ebay begr&uuml;&szlig;t mich mit den Worten "Schoen,
          dass Sie dabei sind". Wie nett. Inzwischen sind aber auch
          die Antworten auf meine Fragen eingetroffen.</P>

          <P><B>Tag 5:</B><BR>
           Jetzt bin ich richtig drin. Habe geboten, gewonnen,
          verloren, gezittert, gemailt, Geld &uuml;berwiesen,
          gebl&auml;ttert, gezweifelt, Forum durchgelesen, neue
          ungeahnte Rubriken entdeckt und mein Geld gez&auml;hlt
          :-))) ebay ist ein gro&szlig;es schwarzes Loch, ein
          Treibsand, ein H&ouml;llenschlund. Ich bin dabei, darin
          zu versinken...</P>

          <P><B>Tag 8:</B><BR>
           Das erste Buch ist eingetroffen. Ich schreibe eine
          Bewertung und ... ich bekomme eine. Endlich steht keine
          "0" mehr hinter meinem Namen. Bin jetzt ein "echter"
          ebayer. Die Anzahl Bewertungen wird sehr beachtet und
          nat&uuml;rlich die Qualit&auml;t : Lob, Neutral oder
          Beschwerde.</P>

          <P><B>Tag 11:</B><BR>
           Ich entdecke immer noch neue interessante Rubriken.
          Besonders hei&szlig; : Sammeln &amp; Seltenes =&gt; Total
          Verr&uuml;cktes. In &uuml;ber 4.800 Auktionen werden die
          verr&uuml;cktesten Sachen angeboten, auch
          Dienstleistungen und Bl&ouml;dsinn. Find ich &uuml;beraus
          witzig. Ahne nicht, dass das bei ebay l&auml;ngst ein
          alter Hut ist.</P>

          <P><B>Tag 13:</B><BR>
           Jetzt wei&szlig; ich es. Wei&szlig; auch was ein Sixpack
          ist und Partygranaten. Habe zwei Homepages entdeckt, die
          solche witzigen Auktionen "sammeln", n&auml;mlich
          www.wortfilter.de (sehr informativ !) und "ebay-Galerie
          des Grauens". Wei&szlig; jetzt auch, dass Verk&auml;ufer
          einen K&auml;ufer streichen und ablehnen k&ouml;nnen,
          wenn die schlechte Bewertungen haben. Wei&szlig; auch,
          was "pushen" bedeutet. Habe mittlerweile 8 wunderbare
          Beurteilungen. Die Verk&auml;ufer sind ja sooo lieb mit
          ihren Bewertungen !</P>

          <P><B>Tag 14:</B><BR>
           Meine neunte Bewertung stimmt mich mi&szlig;trauisch.
          Klingt zwar auch positiv und nett, aber irgendwie
          abgedroschen. Komme jetzt dahinter, dass "meine"
          Verk&auml;ufer diese Texte stereotyp benutzen, sie
          schreiben jedem (fast) das gleiche. F&uuml;hle mich wie
          unter einer kalten Dusche...</P>

          <P><B>Tag 15:</B><BR>
           Wieder eine neue interessante Rubrik entdeckt :
          Liebesromane. Nein, denkt nichts falsches, die sind
          f&uuml;r meine Mutter ! Die liest einen in 2-3 Tagen und
          braucht ganze Stapel davon. Hier bei ebay werden sie
          gebraucht angeboten, in kleinen Stapeln zu 4 St&uuml;ck
          und in gro&szlig;en zu 50 St&uuml;ck. Das w&auml;re dann
          schon ein m&ouml;gliches Weihnachtsgeschenk, denn wir
          schenken uns eigentlich nichts, aber "Mitbringsel" sind
          erlaubt :-) Meine Frau meint, wenn ich f&uuml;r mich
          einen "Kn&uuml;ller" ersteigern kann, spendiert sie mir
          den zu Weihnachten. Die Sache bleibt spannend...</P>

          <P><B>Tag 16:</B><BR>
           Jetzt habe ich 9 kleine und gro&szlig;e B&uuml;cher
          ersteigert, sie liegen auf dem Tisch und gucken mich an.
          Wann soll ich die eigentlich lesen ? Ich bin ja sooo
          besch&auml;ftigt, ich hab doch sonst auch nie Zeit
          ???<BR>
           Heute morgen hab ich tats&auml;chlich einen
          "Kn&uuml;ller" entdeckt. Insgesamt hab ich 7 Gebote
          abgegeben. Auf 7 verschiedene B&uuml;cher, versteht sich.
          Aber es wird mir zuviel, morgen h&ouml;re ich damit auf.
          &Uuml;bermorgen bestimmt...</P>

          <P><B>Tag 17:</B><BR>
           Hab heute ein altes Schulbuch entdeckt und sofort
          ersteigert. TOLL !!! So richtig aus meiner Kinderzeit. So
          etwas wollte ich immer schon mal haben, hab's aber auf
          Flohm&auml;rkten nie finden k&ouml;nnen. Wo steht der
          Sekt ??? Nach diesem Erfolgserlebnis st&ouml;bere ich
          noch ein bi&szlig;chen in ebay und finde eine ganze Reihe
          weiterer Schulb&uuml;cher, auch sehr sch&ouml;n, nur
          offensichtlich g&uuml;nstiger ! *seufz* Hab ich mir schon
          wieder einen typischen Anf&auml;ngerfehler geleistet
          ?</P>

          <P><B>Tag 18:</B><BR>
           Mein "Kn&uuml;ller" ist kurz vor dem Ende, die Zeit
          l&auml;uft ab, in der man bieten kann. Wie gebannt schaue
          ich auf den Monitor. Die Minuten verrinnen. Nichts
          passiert. Nein, ich werde mir das diesmal nicht
          wegschnappen lassen !!!<BR>
           Noch 7 Minuten. Nichts passiert. Aber ich bin gewarnt,
          der Ansturm kommt in den letzten 2 Minuten. Oder letzten
          30 Sekunden. Oder vielleicht gar nicht ? Der Abstand zu
          dem Gebot meines Vorbieters ist mir eigentlich zu gering.
          Da kann doch leicht einer mit ein paar Euro mehr...<BR>
           Ich hole tief Luft und erh&ouml;he mein eigenes Gebot um
          das dreifache! So, jetzt k&ouml;nnen sie mich alle mal an
          den F&uuml;&szlig;en fassen...<BR>
           Noch 2 Minuten. Noch 54 Sekunden. Nichts passiert. Bin
          gaaaar nicht nerv&ouml;s, nein, &uuml;berhaupt nicht !
          *n&auml;gel kau*<BR>
           Noch 7 Sekunden. War's das? Noch ein allerletztes Mal
          den Bildschirm aktualisieren... und da steht es: ich habe
          gewonnen !!!!</P>

          <P><B>Tag 19:</B><BR>
           Nein, diesmal hab ich nichts gekauft. Ich bin brav. Man
          kann sich ja auch mal zur&uuml;ckhalten. Oder ?<BR>
           Allerdings hab ich einem Freund einen Link geschickt,
          das Buch wird ihn bestimmt interessieren !<BR>
           Erstaunlich, was man alles bei ebay findet! In der
          K&uuml;che stapelt sich der Abwasch.... mal sehen, ob bei
          ebay auch Einweggeschirr zu haben ist.....</P>

          <P>[WASCHWEIB]-Homepage:
          http://waschweib.blindzeln.de</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

