<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1"><!-- Author = Cord Hagen -->

    <TITLE>Samstags bei Ikea</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Samstags bei Ikea</B></FONT></P>

          <P>IKEA - schon der Name ist Schei&szlig;e. Meine
          Freundin meint: Lass uns mal wieder zusammen zu IKEA
          fahren. Ist doch sch&ouml;n, da mal wieder
          durchzubummeln.</P>

          <P>Bummeln... von wegen. Als ob Frauen durch den Schuppen
          BUMMELN w&uuml;rden. Sie KAUFEN sich durch. Jede von den
          Weibern rei&szlig;t riesige L&ouml;cher in die
          Regale.</P>

          <P>Nat&uuml;rlich am Samstag. Warum eigentlich
          ausgerechnet immer Samstags? Kann mir jemand sagen, warum
          Frauen immer Samstags zu IKEA fahren wollen?</P>

          <P>Oder Sonntags? Oder Freitags? Ich will nicht zu IKEA.
          An keinem Tag. Aber widersprich da mal einer. Also was
          tun? Klar - was sie alle tun: l&auml;cheln, innerlich
          sterben und mitgehen.</P>

          <P>Anfahrt: der Stau reicht zur&uuml;ck bis auf die
          Autobahn. Von der Ausfahrt bis auf den IKEA-Parkplatz
          brauchen wir 35 Min. Ich bin innerlich schon am kochen,
          lasse mir aber nichts anmerken. Auch nicht, als sich ein
          Fahrer r&uuml;cksichtslos vorne in die Parkl&uuml;cke
          dr&auml;ngt. ("Komm her du Arsch.</P>

          <P>Los steig aus. Dir hau ich ein paar aufs Maul. Depp,
          bl&ouml;der. Los trau dich. Wichser"). Nun, er hat sich
          getraut, meine Freundin nagt an der Unterlippe und mir
          geht es kurzzeitig etwas besser. Obwohl ich ihm schon
          gern... Gott sei dank hat sie sich diesmal nicht gleich
          im ersten Stock ausgetobt. Da hatte sie letztes Mal schon
          mit einer neuen Couch gedroht:</P>

          <P>"Die hier ist sch&ouml;n. Und sooo praktisch. Den
          Bezug kann man abzie hen und waschen." Ich schau aufs
          Preisschild. ("!!!! Wir werden das Ding h&ouml;chstens
          dreimal waschen, also kostet jedes Mal Waschen 1.500.-?
          Wieso nehmen wir nicht ne billige, schmei&szlig;en sie
          weg, sobald sie nen Fleck hat, und kaufen ne Neue?") -
          "Prima. Du hast recht. Sehr sch&ouml;n. Sitzt sich auch
          bequem. Und gar nicht teuer. Ein echtes Schn&auml;ppchen.
          Willst Du sie gleich haben?" Zum Gl&uuml;ck wollte sie
          das Ding dann doch nicht kaufen.</P>

          <P>H&auml;rtetest kommt im Untergeschoss: Millionen
          Dinge, die Frau unbedingt braucht. Jeder Artikel 3978-mal
          vorhanden. Nat&uuml;rlich will sie nur ein paar
          Kleinigkeiten, die sie unbedingt schon immer gebraucht
          hat und nirgendwo sonst und schon gar nicht zu deeem
          Preis. Ein Nudelklammereisen... oder so. Jedenfalls total
          praktisch und gar nicht teuer. Und die tollen Gl&auml;ser
          mit Stiel. Gibt's nur im 10er Pack. Aber was soll's - die
          alten hatte sie ja schon seit dem letzen IKEA-Besuch
          vor...was? acht Wochen?? Und die sind ja auch schon nicht
          mehr sch&ouml;n. Und die praktischen Fressbretter
          (Brotzeitteller aus Holz - scheiss-schwer!) und diese
          Kerzenhalter und "sieh doch mal die kleine Leuchte da"
          und die praktischen zusammenfaltbaren
          "kannmanimmerbrauchen"-Teile und ... Sie stopft mir das
          Zeug in diese tolle gelbe Umh&auml;ngetasche, mit der ich
          aussehe wie ein geistig zur&uuml;ckgebliebener
          Pfadfinder. Oder Stadtreinigung. Offenbar muss jeder Mann
          so ne Tasche umhaben, obwohl sie fast alle auch noch
          einen Wagen schieben m&uuml;ssen. Aber Frauen scheinen
          die Dinger schick zu finden. Sie scheint jetzt alles zu
          haben ... dann die Schlange an der Kasse. Sie haben jetzt
          Schilder aufgestellt: "Ab hier 25 Minuten Wartezeit zur
          Kasse" - eins kann ich von hier aus schon fast lesen. Sie
          kann nur m&uuml;hsam verhindern, dass ich die Tasche ins
          n&auml;chste Regal schmei&szlig;e.. Ich fasse es nicht:
          die Frauen schwatzen miteinander oder wuseln noch mal
          davon, um schnell noch ein paar
          "haettenwirdochfastvergessen" zu holen, w&auml;hrend die
          M&auml;nner wie die Deppen mit ihren Wagen in der
          Schlange stehen. Das n&auml;chste Schild: "Noch 15 Min...
          bis zur Kasse" veranlasst mich, mit der Tasche Schwung zu
          holen, aber sie meint, sie k&ouml;nne die Kasse schon
          sehen... Na gut.</P>

          <P>Wuselwuselwusel und schon habe ich noch einen tollen
          &Uuml;bertopf f&uuml;r den Dingsbums-Busch im Esszimmer
          (Das Drecksding werde ich mit Domestos gie&szlig;en!) in
          der Tasche. Das n&auml;chste Schild kann man schon nicht
          mehr lesen: das muss wohl jemand umgekickt haben - lauter
          Fu&szlig;abdr&uuml;cke drauf. Aber jetzt kann ich die
          Kasse auch sehen.</P>

          <P>ENDLICH sind wir dran. Nach f&uuml;nf Minuten
          Vorzeigen von Driver's license, Organspenderau sweis,
          ATM-, Visiten-, Kredit- und Krankenversicherungskarte
          glaubt mir die bl&ouml;de Kuh an der Kasse ("Mein Freund
          hat das nicht so gemeint.") endlich, dass ich mit dem
          Nachnamen und nicht dem Vornamen 
          unterschrieben habe. ("Ich habs noch ganz anders
          gemeint...") Der Tritt gegen den Tresen hat aber auch
          keinen Schaden hinterlassen. Abfahrt: auf dem Parkplatz
          beginnt das Drama von vorn: wie komme ich von IKEA
          wieder weg?? Die Ausfahrt ist verstopft. Der Parkplatz
          ist verstopft, der Weg bis zur Ampel ist verstopft, die
          Autobahnauffahrt ist verstopft.</P>

          <P>35 Min f&uuml;r 1,4 km. Aber den bl&ouml;den Deppen
          von der Herfahrt habe ich diesmal in eine Parkl&uuml;cke
          abgedr&auml;ngt, wo er vermutlich ne Stunde gebraucht
          hat, um da r&uuml;ckw&auml;rts wieder rauszukommen.</P>

          <P>[WASCHWEIB]-Homepage:
          http://waschweib.blindzeln.de</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

