<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1"><!-- Author = Cord Hagen -->

    <TITLE>Mole, der Maulwurf</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Mole,
          der Maulwurf</B></FONT></P>

          <P>Liebe BLINDzeln-Gemeinde!</P>

          <P>Anl&auml;sslich unseres einj&auml;hrigen Geburtstages
          haben wir unseren kleinen, pelzigen Schirmherrn Mole
          &uuml;berreden k&ouml;nnen, uns endlich mal seine
          Geschichte zu erz&auml;hlen. Denn diese ist ja auch
          unsere Geschichte!</P>

          <P>Leider hat es noch etwas gedauert, bis sie druckreif
          war, da Mole ein wenig zu Ausschweifungen neigt und wir
          die Geschichte vorher noch auf das Wesentliche
          k&uuml;rzen mussten.</P>

          <P>Jetzt aber liegt sie vor uns und Euch, und wir hoffen,
          dass es nicht die letzte Geschichte aus Moles Leben sein
          wird...</P>

          <P>Viel Vergn&uuml;gen beim Lesen dieses versp&auml;teten
          Geburtstagsgeschenks w&uuml;nschen Euch Mole und das
          gesamte BLINDzeln-Team!</P>
          <HR>

          <P>Es war einmal ein kleiner Maulwurf namens Mole. Er
          lebte gl&uuml;cklich und zufrieden im D&auml;mmerlicht an
          der Erdoberfl&auml;che, bis er eines Tages ganz
          unerwartet durch ein Loch in einem Maulwurfsh&uuml;gel in
          die Tiefe fiel. Zum Gl&uuml;ck hatte er sich bei seinem
          Sturz nichts gebrochen.</P>

          <P>Er rappelte sich auf und blickte sich hier unten um.
          Hier war er noch nie gewesen. Und nachdem er ein paar
          Minuten lang nur den Kopf bewegt und versucht hatte,
          Schemen in dem Halbdunkel vor ihm auszumachen, begriff er
          auch, warum: Die Luft war feucht und k&uuml;hl, und seine
          Augen gew&ouml;hnten sich nur schwer an das Zwielicht
          hier unten. Nein, hier wollte er nicht bleiben! So
          beschloss er, einen R&uuml;ckweg in seine Welt zu
          suchen.</P>

          <P>Anfangs lief er ziellos in dem Gang auf und ab, in den
          er gefallen war. Er versuchte sich mit seinen
          Schaufelh&auml;nden an den W&auml;nden emporzuziehen, um
          wieder an die Erdoberfl&auml;che zu gelangen. Dabei war
          das Einzige, was er erreichte, dass ihm die H&auml;nde
          von der Anstrengung weh taten und er Kratzspuren an den
          W&auml;nden hinterlie&szlig;, aus denen Erde
          herabfiel.</P>

          <P>Der erlittene R&uuml;ckschlag, keinen Weg zu finden,
          tat weh. Sehns&uuml;chtig sah er nach oben, von wo ein
          Streifen Tageslicht zu ihm hereindrang. Dieser schien so
          freundlich und ihm so nahe zu sein, und war in
          Wirklichkeit doch so unerreichbar weit entfernt. Aber war
          er das wirklich? Er sah sich um und pr&uuml;fte das
          Erdreich um ihn herum mit den Augen. So schnell gab er
          nicht auf. Immerhin schien die Erde nicht &uuml;berall so
          hart zu sein, dass er keine G&auml;nge graben konnte.
          Warum sollte er sich nicht bis oben durchbuddeln?</P>

          <P>Sofort begann er mit neuer Hoffnung mit der Arbeit und
          kam so gut voran, dass er bald nur noch ein kleines
          St&uuml;ck bis zur Erdoberfl&auml;che brauchte.
          Pl&ouml;tzlich jedoch fing die Decke an zu br&ouml;ckeln
          und st&uuml;rzte herab, wobei sie ihn wie in einer
          Luftblase versch&uuml;ttete. Als sich der Staub gelegt
          hatte, blickte er sich um. Sein soeben gegrabener Gang
          war komplett eingest&uuml;rzt. Er brauchte nicht lange zu
          &uuml;berlegen, in welche Richtung er weitergraben
          sollte, und machte sich wieder ans Werk. Er war sich ganz
          sicher: Bald w&uuml;rde er wieder zu Hause sein! Immer
          wieder brach hinter ihm ein Gro&szlig;teil des Ganges
          zusammen. Aber das war ihm egal. Als er die
          herabgest&uuml;rzte Erde beiseite ger&auml;umt hatte,
          erwartete ihn eine b&ouml;se &Uuml;berraschung: Er war
          nicht, wie gehofft, dem Tageslicht zum Greifen nahe
          gekommen, sondern war wieder dort gelandet, von wo er
          gekommen war: in dem feuchten, halbdunklen Gang unter der
          Erde.</P>

          <P>Ein zweites Mal machte er sich, diesmal an einer
          anderen Stelle des Ganges, ans Graben. Diesmal allerdings
          kam er nur sehr schwer voran, da hier die Erde schier
          hart wie Stein war. Er gab sein Bestes, konnte irgendwann
          aber nicht die Augen vor der Wahrheit verschlie&szlig;en:
          Die Bedingungen hier unten waren nicht die besten zum
          Graben, und ihm blieb kaum eine andere Wahl, als hier
          unten zu bleiben und das Beste aus der Situation zu
          machen. Verzweiflung w&uuml;rde ihn ja auch nicht
          weiterbringen.</P>

          <P>Er sa&szlig; da und &uuml;berlegte, was jetzt am
          besten zu tun w&auml;re. Er blickte sich in dem
          mittlerweile mit Erde &uuml;bers&auml;ten Gang um und
          stellte pl&ouml;tzlich &uuml;berrascht fest, dass er sehr
          viel besser sah als vorhin, als er hier heruntergefallen
          war. Und die Luft schien l&auml;ngst nicht mehr so klamm
          zu sein. Ihm wurde klar, dass er sich hier in einer
          f&uuml;r ihn neuen, anderen Welt befand, in der man auch
          leben konnte. Und er &uuml;berlegte, dass dies
          haupts&auml;chlich die Welt von Maulw&uuml;rfen war. Und
          diese wollte er jetzt kennen lernen. Er wollte nicht mehr
          allein sein und mit seinem Schicksal hadern!</P>

          <P>Er war in einen Seitengang gefallen, der wohl nur
          selten von anderen Maulw&uuml;rfen gekreuzt wurde. Er
          lief ein St&uuml;ck den Gang entlang und rief:
          "Hallooooo, ist da wer?" Niemand antwortete ihm. Dies
          wiederholte er einige Male, immer mit demselben Ergebnis.
          Gut, dachte er, wenn sie nicht zu ihm kamen, musste er zu
          ihnen gehen!</P>

          <P>So tastete sich unser kleiner Mole an den W&auml;nden
          entlang, bis er irgendwann auf einen breiten Gang traf.
          Hoffnungsvoll lief er weiter und begegnete bald einem
          anderen Maulwurf, der auch einen Stra&szlig;en-, oder
          besser Gangplan von dem unterirdischen System hatte. So
          wurde er auch endlich dar&uuml;ber aufgekl&auml;rt, wo
          sich denn die vielen anderen Maulw&uuml;rfe trafen, di
          hier unten lebten. Mole lief bis zur n&auml;chsten
          Bushaltestelle und setzte sich dort, um auf den Bus zu
          warten. Bald schon brachte ihn ein vorbeifahrender Bus
          viele Kilometer weit zu einem Gang, wo sich eine Menge
          Maulw&uuml;rfe trafen, die sich zu einer gro&szlig;en,
          eingeschworenen Gemeinschaft zusammengeschlossen hatten.
          Dort war auch sehr viel los, aber es musste doch noch
          mehr Maulw&uuml;rfe geben. Denn hier f&uuml;hlte sich
          Mole noch nicht so richtig wohl.</P>

          <P>Er machte sich wieder auf den Weg und traf erneut auf
          einen Maulwurf mit einer Gangkarte. Wieder fragte er den,
          wo er denn seinesgleichen finden k&ouml;nne. Der andere
          nannte ihm einen weiteren Zusammenschluss von
          Maulw&uuml;rfen, die sich schon etwas zielgerichteter auf
          ganz bestimmte Maulwurf-Belange spezialisiert hatten.
          Mole dankte ihm, nahm den n&auml;chsten Bus und fuhr
          wiederum viele Kilometer weit durch das unterirdische
          Tunnelsystem. Und tats&auml;chlich: Als er sein Ziel
          erreichte, sa&szlig;en auch dort einige Maulw&uuml;rfe,
          die allerdings recht wortkarg waren.</P>

          <P>Entt&auml;uscht fuhr Mole nun einige Tage immer hin
          und her. Denn auch wenn er sich bei beiden Gruppen nicht
          wirklich wohl f&uuml;hlte, war ihre Gesellschaft trotzdem
          besser als das Alleinsein, und bei beiden gab es ja auch
          nette Leute. Au&szlig;erdem brauchte er Maulw&uuml;rfe,
          um zumindest die n&ouml;tigsten Informationen
          dar&uuml;ber zu bekommen, wo man hier unten was fand und
          wie man sich schnell und einfach orientieren konnte. Im
          Gang der gro&szlig;en Maulwurf-Gemeinschaft von anfangs
          sprachen einige Maulw&uuml;rfe von Dingen, f&uuml;r die
          sich l&auml;ngst nicht alle hier interessierten. Vielen
          war es ein wenig unbehaglich zumute, und da Mole
          gro&szlig;e H&auml;nde zum Buddeln hatte, schlug er vor,
          einen eigenen Gang zu graben. Sofort krempelten auch
          einige andere ihre &Auml;rmel hoch, obwohl kaum einer
          Mole n&auml;her als fl&uuml;chtig kannte. Aber seine Idee
          konnte trotz alledem durchaus vern&uuml;nftig sein. Wenn
          der Gang einst&uuml;rzte, konnten sie immer noch zu ihren
          Kameraden zur&uuml;ckkehren. Jetzt aber halfen sie eifrig
          mit zu graben, bis der Gang schlie&szlig;lich fertig war.
          Er war noch nicht sehr gro&szlig;, was sie allerdings
          nicht sonderlich st&ouml;rte. Wenn er hielt, k&ouml;nnten
          sie ihn mit der Zeit ja vielleicht St&uuml;ck f&uuml;r
          St&uuml;ck erweitern.</P>

          <P>Sie brachten am Eingang ein Schild an, auf dem
          "BLINDzeln" stand. Da viele von ihnen schlecht sahen,
          fanden sie diesen Namen irgendwie originell. Einige
          machten sich auf k&uuml;rzere Reisen und stellten in
          anderen G&auml;ngen Hinweisschilder auf, damit es keinem
          mehr so gehen musste wie unserem armen Mole anfangs.
          Schnell fanden sich weitere Maulw&uuml;rfe ein, die sich
          auch in dem neuen Gang wohl f&uuml;hlten. Viele von ihnen
          hatten weitere Ideen und wollten noch mehr G&auml;nge
          buddeln. Hier aber hatten sie sich eine schlechte Stelle
          daf&uuml;r ausgesucht, denn die Erde war zu locker und
          die Decke br&ouml;ckelte immer wieder an manchen Stellen,
          weswegen sie st&auml;ndig nachgebessert werden musste.
          Zus&auml;tzlich fiel immer deutlicher auf, dass die
          einzelnen G&auml;nge der BLINDzeln-Maulw&uuml;rfe viel zu
          weit auseinander lagen. So setzten sich eines Abends alle
          um ein w&auml;rmendes Lagerfeuer zusammen und berieten,
          was sie tun k&ouml;nnten. St&auml;ndig mit dem Bus zu
          fahren, um von Gang zu Gang zu kommen, war recht
          m&uuml;hselig. Zus&auml;tzlich kamen st&auml;ndig
          Marktschreier durch ihre G&auml;nge, um ihre eigenen,
          teilweise sehr br&uuml;chigen und dazu noch engen
          G&auml;nge feil zu bieten. Und die ungewisse
          Beschaffenheit der Erde hier war f&uuml;r sie erst recht
          keine Dauerl&ouml;sung. So beschlossen die
          Maulw&uuml;rfe, sich alle zusammenzutun und woanders
          einen festeren Rasen zu suchen, um darunter sch&ouml;n
          ordentlich alle ihre G&auml;nge nebeneinander graben zu
          k&ouml;nnen. Ein paar von ihnen meldeten sich freiwillig,
          um solch einen Rasen zu suchen, und machten sich schon
          sehr bald auf den Weg. Sie schw&auml;rmten in
          verschiedene Richtungen aus und wurden dadurch sehr
          schnell f&uuml;ndig: Eine sch&ouml;ne, saftiggr&uuml;ne
          Wiese oben und ein Erdreich darunter, in das man breite
          G&auml;nge graben konnte, ohne dass sie gleich wieder
          einst&uuml;rzten. Sie gruben probeweise mehrere
          nebeneinander, um auch ganz sicher zu gehen, und konnten
          feststellen, dass nur selten ein kleines St&uuml;ck eines
          Tunnels einst&uuml;rzte. Daraufhin packten sie in ihren
          bisherigen G&auml;ngen Sack und Pack zusammen und zogen
          gemeinsam in einer kleinen Karawane unter die sch&ouml;ne
          Wiese. Hier gruben sie nahe beieinander, um den Weg zum
          Nachbarn nicht st&auml;ndig mit dem Bus bew&auml;ltigen
          zu m&uuml;ssen. Sie f&uuml;hrten ein sehr friedliches
          Zusammenleben, in dem es zwar auch mal
          Missverst&auml;ndnisse und Unstimmigkeiten, ja sogar
          Streit gab, aber im Gro&szlig;en und Ganzen war jeder
          froh, nicht mehr in den einsamen und br&ouml;ckeligen
          G&auml;ngen zu sein. Selbst wenn der Nachbar mal unter
          dem Fu&szlig;ballfeld in der Stadt oder unter dem
          Rollfeld des Flughafens im Urlaub war, fand sich immer
          jemand, der auf den heimischen Gang aufpasste.</P>

          <P>Wie sch&ouml;n es hier war, sprach sich sehr schnell
          auch bis zu anderen Maulw&uuml;rfen herum, die zum Teil
          gerade erst anfingen, sich einen eigenen Gang zu graben,
          oder einfach ihre Sachen nahmen und ihren Gang bei den
          anderen BLINDzeln-Maulw&uuml;rfen neu buddelten.</P>

          <P>Immer wieder trafen sich alle abends am Lagerfeuer und
          lie&szlig;en sich etwas Neues einfallen, um noch mehr
          Spa&szlig; miteinander zu haben.</P>

          <P>Einige der alteingesessenen Maulw&uuml;rfe in den
          alten G&auml;ngen beobachteten die Entwicklungen um
          BLINDzeln &auml;u&szlig;erst skeptisch. Sie fanden diese
          neue Gemeinschaft der Maulw&uuml;rfe nicht sch&ouml;n,
          denn in einigen der alten G&auml;nge schien es ruhiger zu
          werden und immer weniger Maulw&uuml;rfe schienen sich
          f&uuml;r die alten G&auml;nge und ihre Bewohner zu
          interessieren. Sicher lag das nur an dieser Gemeinschaft,
          die man einfach nicht verstehen wollte. Daf&uuml;r war
          sie viel zu weit weg und wuchs in einem schier
          unvorstellbaren Tempo immer weiter an.</P>

          <P>Die Maulw&uuml;rfe der neuen Gemeinschaft nannten sich
          jetzt kurz BLINDzler und verfolgten nur ein gro&szlig;es
          Ziel: Sie wollten m&ouml;glichst viele Maulw&uuml;rfe zu
          den gemeinsamen Treffen abends am Lagerfeuer einladen, um
          ihnen zu zeigen, dass sie gemeinsam viel mehr erreichen
          k&ouml;nnten als allein auf sich gestellt. Dabei war es
          den BLINDzlern egal, wer sich zu ihnen gesellte. Ob der
          Maulwurf nun viel von sich und seiner Geschichte
          preisgeben wollte oder ob er Neuem gegen&uuml;ber sehr
          aufgeschlossen war, ob er von vielen f&uuml;r
          unfreundlich, ja sogar unausstehlich gehalten wurde und
          nur ein Minimum an Gemeinschaft aufkommen lie&szlig; oder
          ob er sch&uuml;chtern und zur&uuml;ckhaltend war, tat
          f&uuml;r sie nichts zur Sache. Wichtig war ihnen der gute
          Wille allein und dass man sich an die Grundregeln eines
          friedlichen Zusammenlebens und der H&ouml;flichkeit
          hielt.</P>

          <P>Unser kleiner Mole war jetzt gl&uuml;cklich, weil er
          nicht mehr allein in den dunklen G&auml;ngen herumirren
          musste. Aber seine Idee f&uuml;r BLINDzeln, die ihn auch
          nach R&uuml;ckschl&auml;gen weiter vorantrieb, war bisher
          nur zu einem kleinen Teil verwirklicht worden. Seine Idee
          n&auml;mlich, die von vielen so bereitwillig aufgenommen
          wurde, war folgende: Er wollte mit den anderen
          Maulw&uuml;rfen m&ouml;glichst viel erreichen, und nicht
          nur f&uuml;r die BLINDzler. Seine &Uuml;berzeugung war
          es, dass sie gemeinsam an Zielen arbeiten sollten, die
          jedem Maulwurf etwas brachten, egal unter welchem Rasen
          er lebte. Denn gemeinsam kann man viel schneller
          gro&szlig;e und sch&ouml;ne G&auml;nge bauen und auch
          noch ganz andere Dinge erreichen, als wenn man dies ganz
          allein versuchen muss. Dazu war aber nicht nur die
          Zusammenarbeit der BLINDzler unter sich n&ouml;tig,
          sondern nach M&ouml;glichkeit auch die Mithilfe und die
          Erfahrungen der alteingesessenen Maulw&uuml;rfe der
          bereits erfahreneren und &auml;lteren Maulwurf-Gruppen.
          Aber Mole verstand auch sehr gut, dass die alten
          Lagerfeuer abends in den alten G&auml;ngen die
          &auml;lteren Geschichten hatten und es dort oft
          gem&uuml;tlicher war, weil man sich viel l&auml;nger
          kannte und schon G&auml;nge zusammen gegraben hatte,
          lange bevor Mole durch das Loch im Maulwurfsh&uuml;gel
          gefallen war. Und er verstand auch die damit verbundene
          Skepsis der &uuml;brigen Maulw&uuml;rfe. Deshalb kehrte
          Mole von Zeit zu Zeit zu den alten G&auml;ngen
          zur&uuml;ck und setzte sich einfach zwischen die anderen
          Maulw&uuml;rfe ans warme Feuer, lauschte den alten
          Geschichten, genoss die Gem&uuml;tlichkeit und
          erz&auml;hlte auch seine eigene Geschichte in der
          Hoffnung, dass die alten Maulw&uuml;rfe zuh&ouml;rten und
          ihn vielleicht ein wenig verstehen konnten. Er hoffte so
          sehr, dass sie ihre Misstrauen gegen BLINDzeln mit der
          Zeit verlieren w&uuml;rden, da er doch nichts B&ouml;ses
          gegen sie und die &uuml;brigen Maulw&uuml;rfe im Schilde
          f&uuml;hrte. Er hoffte, dass irgendwann alle gemeinsam
          vielleicht erkennen w&uuml;rden, dass beides sehr wichtig
          war: Sowohl wenn die alten Maulw&uuml;rfe ihre
          gem&uuml;tlichen Geschichten aus alten Zeiten
          erz&auml;hlten wie auch, wenn Mole wieder mit dem Bus zu
          den neuen G&auml;ngen fuhr, um mit den anderen
          Maulw&uuml;rfen weiterhin neue G&auml;nge zu bauen. Und
          vielleicht konnten sie gemeinsam ja irgendwann auch
          andere Tiere dazu &uuml;berreden, ihre G&auml;nge und
          Behausungen so zu bauen, dass auch die Maulw&uuml;rfe
          darin gehen konnten.</P>

          <P>Ob alle bis an ihr Lebensende gl&uuml;cklich
          miteinander leben werden, wei&szlig; heute niemand. Aber
          vielleicht wird irgendwann einmal ein Anderer dann diese
          Geschichte erz&auml;hlen...</P>

          <P>Liebe Gr&uuml;&szlig;e<BR>
           Mole</P>
          <HR>

          <P>www.BLINDzeln.de - Die Welt mit anderen Augen
          sehen<BR>
           Specken 3 D-27308 Kirchlinteln Germany<BR>
           Phone and Fax +49 (0) 42 36 - 16 57<BR>
           Fax +49 (0) 72 1 - 15 15 76 12 0 SMS +49 (0) 17 2 - 58
          05 61 9<BR>
           www.blindzeln.de info@blindzeln.de</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

