<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Buchbesprechungen</TITLE>
  </HEAD>

  <BODY background="images/bgd.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Buchbesprechungen</B></FONT></P>
          <A name="top"></A> 

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">Sakrileg von Dan Brown</A></LI>

            <LI><A href="#a02">Nostradamus von N. Alexander Centurio</A></LI>

            <LI><A href="#a03">Illuminati von Dan Brown</A></LI>

            <LI><A href="#a04">Sternenflut von David Brin</A></LI>

            <LI><A href="#a05">Der Pferdefl&uuml;sterer von Nicholas Evans</A></LI>
            
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>Buchtitel: Sakrileg<BR>
           Autor: Brown, Dan<BR>
           Vorgestellt von: Bitschreck<BR>
          Verlag: L&uuml;bbe<BR>
           Erscheinungsjahr: 2004<BR>
           ISBN: 3785721528<BR>
           Format: Schwarzdruck</H3>

          <P><B>Inhalt:</B><BR>
          Robert Langdon, Symbologe aus Harvard, befindet sich aus
          beruflichen Gr&uuml;nden in Paris, als er einen Anruf
          erh&auml;lt: Der Chefkurator des Louvre wurde mitten in
          der Nacht vor dem Gem&auml;lde der Mona Lisa ermordet
          aufgefunden. Langdon begibt sich zum Tatort und erkennt
          schon bald, dass der Tote durch eine Reihe von
          versteckten Hinweisen auf die Werke Leonardo da Vincis
          aufmerksam machen wollte, Hinweise, die seinen
          gewaltsamen Tod erkl&auml;ren und auf eine finstere
          Verschw&ouml;rung hindeuten. Der Verdacht f&auml;llt
          anfangs auf Robert Langdon selber. Er solle den Mord
          begangen haben, meint die Polizei.</P>

          <P>Bei seiner Suche nach den Hintergr&uuml;nden der Tat
          wird Robert Langdon von Sophie Neveu unterst&uuml;tzt,
          einer Kryptologin der Pariser Polizei und Tochter des
          ermordeten Kurators. Sie hilft ihm, den F&auml;ngen der
          Ermittler zu entgehen. Von Sophie Neveu erf&auml;hrt er
          auch, dass der Kurator der geheimnisumwitterten
          Sions-Bruderschaft angeh&ouml;rte &shy; ebenso wie
          Leonardo da Vinci, Victor Hugo und Isaac Newton. Bei
          ihren Recherchen sto&szlig;en Robert und Sophie immer
          wieder auf verborgene Zeichen und Symbole in den Werken
          Leonardo da Vincis, die zum einen auf den Heiligen Gral
          hindeuten, zum anderen die These st&uuml;tzen, dass Jesus
          Christus und Maria Magdalena einen gemeinsamen Sohn
          hatten. Beides w&uuml;rde die Grundfesten der Kirche
          ersch&uuml;ttern, wird Maria Magdalena von der Kirche
          doch als Hure gef&uuml;hrt.</P>

          <P>Erschwert wird die Suche der Wissenschaftler durch das
          Eingreifen der mysteri&ouml;sen Organisation Opus Dei,
          die Roberts und Sophies Erkenntnisse unter allen
          Umst&auml;nden unter Verschluss halten m&ouml;chte
          &shy;und dabei auch nicht vor Mord
          zur&uuml;ckschreckt.</P>

          <P><B>Anmerkungen:</B><BR>
          Wieviel Wahrheit liegt in diesem roman? Bei dieser Frage
          kommen einem schon erschreckende Gedanken.</P>

          <P>Das Buch ist eine Mischung aus spannendem Krimi und
          kirchlicher Traditionsaufarbeitung.</P>

          <P>Das H&ouml;rbuch erschien im Februar 2004 auf vier
          Audio-CDs.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>Buchtitel: Nostradamus<BR>
          Autor: Centurio N. Alexander<BR>
          Vorgestellt von: Gimli<BR>
          Verlag: Turm-Verlag<BR>
          Erscheinungsjahr: 1977<BR>
          ISBN: 3-7999-0179-5<BR>
          Format: Schwarzdruck</H3>

          <P><B>Inhalt:</B><BR>
          Nostradamus wurde im Jahre 1503 in der Provence geboren,
          als Sohn wahrscheinlich sephardischer Juden, die im Jahr
          1492 aus Spanien vertrieben wurden und in die Provence
          flohen. Er studierte u.a. in Avignon und Montpellier und
          wurde schlie&szlig;lich Arzt. Er erwarb sich aber auch
          gro&szlig;e Kenntnisse auf dem Gebiet der Religion und
          Astrologie. Nachdem er bei einer Pestepidemie seine
          gesamte Familie verloren hatte, begann er Visionen
          niederzuschreiben, in denen er Ereignisse sah, die in der
          Zukunft lagen.</P>

          <P>Nachdem er das Gesehene mit astrologischen
          Erkenntnissen und alten religi&ouml;sen Schriften in
          Einklang gebracht hatte, schrieb er alles in &uuml;ber
          900 Vierzeilern verschl&uuml;sselt nieder. Bald
          ber&uuml;hmt geworden, wurde er an den franz&ouml;sischen
          Hof berufen, wo er gro&szlig;en Einfluss erlangte. Er
          starb schlie&szlig;lich im Jahre 1566, wie er es selbst
          vorausgesagt hatte.</P>

          <P>Die hier gedeuteten Prophezeiungen decken einen
          Zeitraum von &uuml;ber 500 Jahren ab. Der Schwerpunkt
          liegt auf den Ereignissen des 20. und der ersten
          H&auml;lfte des 21. Jahrhunderts. Es werden die beiden
          Weltkriege beschrieben und schlie&szlig;lich noch ein
          dritter gro&szlig;er Krieg, in dem es zur Konfrontation
          zwischen den Westm&auml;chten USA und Westeuropa und
          Arabien unterst&uuml;tzt von China kommt. In einer
          entscheidenden Schlacht siegt der Westen unter der
          F&uuml;hrung eines neuen K&ouml;nigs, der aus Frankreich
          kommt und schlie&szlig;lich auch die Weltregierung
          &uuml;bernimmt. Es beginnt ein Zeitalter des
          Friedens.</P>

          <P><B>Anmerkungen:</B><BR>
          Mit gro&szlig;em Interesse, aber auch Skepsis habe ich
          dieses Buch gelesen. Soweit es um zur&uuml;ckliegende
          Ereignisse geht, gelang es dem Autor eine
          &Uuml;bereinstimmung mit den Prophezeiungen herzustellen.
          Bei Ereignissen, die aus seiner Sicht in der Zukunft
          lagen, gelang dies allerdings nicht. Hier wird aus meiner
          Sicht die Schw&auml;che aller Prophezeiungen deutlich,
          die unter der Pr&auml;misse gemacht werden, dass alles
          bereits vorbestimmt ist und unver&auml;nderbar
          feststeht.</P>

          <P>Diese Ausgabe des Buches ist bereits vergriffen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>Buchtitel: Illuminati<BR>
          Autor: Brown, Dan<BR>
           Vorgestellt von: Eowyn<BR>
           Verlag: Verlagsgruppe Weltbild GmbH, L&uuml;bbe<BR>
          Erscheinungsjahr: 2003<BR>
           ISBN: 3-8289-7150-4<BR>
           Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Am fr&uuml;hen Morgen erh&auml;lt der Professor f&uuml;r
          Symbologie und Kunstgeschichte Robert Langdom ein Fax.
          Ein Fax mit dem Foto der Leiche, eines Wissenschaftlers,
          welche neben grausamen Verst&uuml;mmelungen auch noch ein
          merkw&uuml;rdiges doch dem forscher recht bekanntes
          Brandzeichen auf der Brust zeigt, welches den Mann mehr
          als alles andere &uuml;berzeugt, die Reise aus den USA in
          die Schweiz ins CERN, ein wissenschaftliches Institut,
          welches sich unter anderem auch mit Kernforschung
          besch&auml;ftigt, auf sich zu nehmen.</P>

          <P>Das Zeichen der Illuminati, einer eigentlich
          totgesagten Bruderschaft, die ihr offizielles Ende
          bereits in den 80ern des 18. Jahrhunderts fand, von der
          Kirche ihrer wissenschaftlichen Tendenzen und ihrer
          Haltung gegen den Klerus wegen verboten.</P>

          <P>Im CERN angekommen erf&auml;hrt er, dass besagter
          Wissenschaftler es nicht nur geschafft hat,
          gr&ouml;&szlig;ere mengen von Antimaterie herzustellen,
          sondern auch das Problem der Lagerung mittels
          Magnetfeldern zu l&ouml;sen. Wo es Wissenschaftlern
          bisher nur gelungen war, jeweils ein paar Molek&uuml;le
          der Substanz zu erzeugen, lagert in einem unterirdischen
          Teil seines Labors ein viertel Gramm davon, eine menge,
          die ausreicht, nicht nur Verw&uuml;stungen in einem
          Umkreis von zwei Kilometern anzurichten, sondern alles,
          was sich innerhalb dieses Radius befindet einfach
          verschwinden zu lassen.</P>

          <P>Ber&uuml;hren sich Normale Materie und Antimaterie,
          zehren sich beide sofort gegenseitig auf und erzeugen
          dabei eine menge Energie. Selbst mit Luft darf diese
          Substanz nicht in Ber&uuml;hrung kommen.</P>

          <P><B>Antimaterie als zuk&uuml;nftige
          Energiequelle?</B></P>

          <P>Antimaterie Quasi als Gegenst&uuml;ck zur Materie und
          die Erschaffung dieser, sollte dem Wissenschaftler, der
          gleichzeitig auch tief religi&ouml;s war dazu dienen,
          sowohl der Kirche als auch den Forschern der Welt zu
          beweisen, dass sich Kirche und Wissenschaft nicht
          gegenseitig ausschlie&szlig;en, sondern er in seinen
          Erkenntnissen trotz aller logischen Erkl&auml;rung oder
          grad wegen ihnen, die Hand Gottes sieht und der Meinung
          ist, dass auch die Wissenschaft etwas von Gott Gegebenes
          ist.</P>

          <P>Der Direktor von CERN hat diesen Mord bisher f&uuml;r
          sich behalten, da er wei&szlig;, dass der Ermordete
          Wissenschaftler zusammen mit seiner Tochter Vittoria an
          einem geheimen Projekt gearbeitet hatte und nun
          m&uuml;ssen er, Robert Langdom und Vittoria feststellen,
          dass die gr&ouml;&szlig;ere Probe der Antimaterie
          verschwunden ist.</P>

          <P>Genau zu dieser Zeit taucht auf einer der drahtlosen
          &Uuml;berwachungskameras im Vatikan dieser besagte
          Beh&auml;lter auf.</P>

          <P>Problem: Die Kamera wurde von ihrem angestammten Platz
          entfernt und keiner wei&szlig;, wo sie und damit auch der
          Beh&auml;lter zu finden ist. Selbst die Evakuierung des
          Vatikans ist zu dieser zeit undenkbar, da sich 165
          Kardinale zum Konklave dort versammelt haben.</P>

          <P>Der Papst war vor gut zwei Wochen an einem
          &uuml;berraschenden Hirnschlag im Schlaf gestorben und
          ein neuer muss gew&auml;hlt werden. Doch die vier
          preferiti, die Favoriten der Wahl sind spurlos
          verschwunden.</P>

          <P>Langdom und die Tochter des ermordeten
          Wissenschaftlers, Vittoria werden in den Vatikan bestellt
          um den Beh&auml;lter mit der Antimaterie zu
          identifizieren. Nicht lange danach meldet sich ein Mann,
          der behauptet, f&uuml;r die Illuminati zu sprechen. Er
          bekennt sich zu der Entf&uuml;hrung der vier Kardinale
          und f&uuml;r Robert und Vittoria beginnt ein Wettlauf
          gegen die Zeit.</P>

          <P>Denn gleichzeitig will der Sprecher der Illuminati
          diesen Abend mit seinem spektakul&auml;ren Ausgang zu
          einem Medienereignis machen, an das sich die Welt noch
          lang erinnern soll und so plant der den Tod der vier
          Entf&uuml;hrten, jeweils zur vollen Stunde.</P>

          <P>Der Beh&auml;lter mit der Antimaterie befindet sich
          irgendwo versteckt im Vatikan und ist mit Batterien
          ausgestattet, die genau 24 Stunden halten. An diesem Tag
          um Mitternacht laufen diese 24 Stunden ab und auch
          f&uuml;r die preferiti, wird die Zeit knapp.</P>

          <P>Doch es gibt einen Weg. Und so machen sich die beiden
          Anhand alter Aufzeichnungen, Ger&uuml;chte und
          versteckter Hinweise, die umso schwerer zu finden sind,
          da die Illuminati im Geheimen operiert haben, auf den
          Weg, die vier Entf&uuml;hrten zu finden, w&auml;hrend die
          Schweizer Garde ausstr&ouml;mt, dem Beh&auml;lter noch
          vor der zeit zu bergen. . Der Vatikan w&uuml;rde
          zerst&ouml;rt, wenn dies nicht gel&auml;nge, das ist
          klar.</P>

          <P><B>Anmerkungen:</B><BR>
          Dieses Buch ist nicht nur aufgrund der Spannung, die es
          tats&auml;chlich bis zur letzten Zeile auszeichnet
          lesenswert, und auch nicht allein aufgrund der Fakten,
          die man sowohl &uuml;ber die Geschichte der Kirche, die
          Iluminati selbst und auch Fakten &uuml;ber neueste
          Errungenschaften und Erkenntnisse auf dem Gebiet der
          Forschung erf&auml;hrt, es regt auch an, sich wirklich
          &uuml;ber Kirche, Wissenschaft und den darin enthaltenen
          Gegensatz Gedanken zu machen. Welches von beiden man auch
          immer Favorisieren mag, Brown findet f&uuml;r beide
          Seiten gute Argumente und es gibt mehrere Stimmen in
          diesem Buch, denen der Verbund von beidem am Herzen
          liegt, die sich und ihre Mitmenschen fragen, warum sich
          beides ausschlie&szlig;en muss, ob es nicht sein
          k&ouml;nnte, dass das eine das andere bedingt.</P>

          <P>Und man erf&auml;hrt auch bis zuletzt nicht
          tats&auml;chlich, welche Meinung Brown selbst vertritt,
          und ist meist dazu angehalten, sich sein eigenes Bild zu
          machen und seine eigene Meinung zu finden.</P>

          <P>Und Brown h&auml;lt wohl f&uuml;r jeden Leser bis zum
          Ende noch eine &Uuml;berraschung bereit, wie oft man auch
          der Meinung ist, man w&uuml;rde sich denken k&ouml;nnen,
          wie dieses Drama ausgeht.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>Buchtitel: Sternenflut<BR>
          Autor: David Brin<BR>
          Vorgestellt von: bianka<BR>
          Verlag: Heyne<BR>
          Erscheinungsjahr: 2000<BR>
          Gesamtseitenzahl: 634<BR>
          ISBN: 3453164164<BR>
          Format: Schwarzschrift</H3>

          <P><B>Inhalt:</B><BR>
          Die Streaker, ein Raumschiff, auf dem alle intelligenten
          rassen der Erde - Menschen, Delphine und Schimpansen -
          arbeiten, hat eine Entdeckung gemacht, die die Bewohner
          der Galaxien in Aufruhr versetzt. Jetzt ist die Streaker
          auf einem verlassenen Planeten gestrandet und veruscht
          der Verfolgung durch die galaktischen Kriegsheere zu
          entkommen.</P>

          <P>Doch die Bedrohung komt nicht nur von aussen. Denn die
          gemischte Zusammensetzung der Besatzung aus Menschen -
          der Patronatsrasse - und ihren Klienten (Delphinen und
          schimpansen, die durch Genmanipulation (Lifting) Sprechen
          und logisches Denken gelernt haben, birgt auch einigen
          Zuendstof in sich.</P>

          <P><B>Anmerkungen:</B><BR>
          Ich bin kein SF-Fan, aber dieses Buch hat mich
          beeindruckt. Nicht nur durch die schillernden
          ausserirdischen Wesen und die Beschreibung der seltsamen
          Planetenwelt. Besonders beeindruckt hat mich die
          Phantasie des Autors, mit der er ein Bild dessen malt,
          was passieren koennte, wenn die Menschen es schaffen,
          Tieren menschliche Intelligenz einzuhauchen. Die Sprache
          der Delphine, die sich vorzugsweise der Haiku-Form
          bedienen, ist einfach nur herrlich skurril...</P>

          <P><B>Empfehlung:</B><BR>
          Ich kann dieses Buch jedem empfehlen, der gerne
          Science-Fictions liest, in denen es um mehr als coole
          Technik und galaktische Kriege geht. Auch fuer
          Nicht-Science-fictionfans ist es ein Einstieg, da man
          sich nicht wirklich mit Technik und Raumfahrt auskennen
          muss, um an diesem Buch gefallen zu finden.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <H3>Buchtitel: Der Pferdefl&uuml;sterer<BR>
          Autor: Evans, Nicholas<BR>
          Vorgestellt von: Bitschreck<BR>
          Verlag: Goldmann<BR>
          Erscheinungsjahr: 1997<BR>
          ISBN: 3442431875<BR>
          Format: Schwarzdruck</H3>

          <P><B>Inhalt:</B><BR>
          Das Leben der Familie Graves ger&auml;t aus den Fugen,
          als die Tochter und deren Freundin bei einem
          morgendlichen Ausritt verungl&uuml;cken. Grace, schwer
          verletzt, versinkt in tiefe Melancholie, der Hengst
          Pilgrim wird durch das erlittene Traumer immer
          b&ouml;sartiger. H&auml;tte man ihn von seinen Leiden
          erl&ouml;sen sollen? Zwischen den Familienmitgliedern
          bauen sich Mauern auf. Da h&ouml;rt die Mutter, Annie
          Graves, durch eine befreundete Tier&auml;rztin von einem
          Mann, der verst&ouml;rten Pferden helfen kann. Mit ihrer
          Tochter und dem ungeb&auml;rdigen Tier tritt sie die
          Reise quer durch den amerikanischen Kontinent an.</P>

          <P>Der Pferdefl&uuml;sterer versucht Pilgrim und dadurch
          auch dem M&auml;dchen zu helfen. Sein Umgang mit den
          Tieren beeindruckt nicht nur Annie. Zwischen den Beiden
          beginnt eine Liebesgeschichte.</P>

          <P><B>Anmerkungen:</B><BR>
          Nicht nur bei der Schilderung des Reitunfalls verlangt
          der Autor vom Leser eine hohe Schmerzgrenze. Zeitweise
          sind die gezeichneten Bilder nur schwer zu
          verkraften.</P>

          <P>Nicholas Evans versteht es brilliant Mensch und Tier,
          sammt ihrer Beziehungen untereinander zu beschreiben. Es
          gelingt ihm meisterlich, eine spannende und dramatische
          Erz&auml;hlung &uuml;ber Pferde, deren Haltung und
          allt&auml;gliche Dinge in eine Liebestrag&ouml;die
          m&uuml;nden zu lassen.</P>

          <P>Das Buch wurde von Hollywood erfolgreich verfilmt und
          erschien 1996 im 'Der H&ouml;rverlag', als von Christian
          Br&uuml;ckner gelesenes H&ouml;rbuch. Wie bei allen
          Verfilmungen, ist auch hier das Buch wesendlich
          deteilierter und einpr&auml;gsamer. Im Film wird
          zwangsl&auml;ufig viel ausgelassen. Das Ende in diesem
          Film h&auml;lt sich jedoch nicht an die Vorlage aus dem
          Roman. Man kann also gespannt sein.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

