<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1"><!-- Author = Anja Winkler -->

    <TITLE>Die Angst vor der Dunkelheit</TITLE>
  </HEAD>

  <BODY background="images/bgd.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Die
          Angst vor der Dunkelheit</B></FONT></P>

          <P>Mein Immunsystem l&auml;uft Amok und greift die
          Netzhaut an. Keine der bekannten Therapien hilft. Um die
          drohende Erblindung abzuwenden, schlagen die &Auml;rzte
          ein riskantes Experiment vor: Antik&ouml;rper sollen den
          Angriff stoppen.</P>

          <P>Ein unfreiwilliger Report von Ulrich Bahnsen</P>

          <P>Die Maus muss weg. Ihre Silhouette flimmerte am
          Morgenhimmel auf der Fahrt von Hamburg in Richtung
          S&uuml;dwesten. Sie verdeckte die Buchseite. Nun funkelt
          sie vor der Fassade des Bettenhauses der K&ouml;lner
          Uniklinik. Bei jedem Blick ist sie zu sehen, sie hat ein
          gro&szlig;es Ohr, sie ist b&ouml;sartig. Als dunkler
          Schatten hat sich der Nager auf die Netzhaut gebrannt.
          Wieder entz&uuml;ndet. Ein weiterer blinder Fleck,
          diesmal ganz nah an der Makula, der Sehgrube. Das ist die
          Stelle auf der Netzhaut, die liest, die fernsieht,
          Gesichter erkennt, die Nagelschere f&uuml;hrt. Die blinde
          Maus soll verschwinden.</P>

          <P>Zumindest darf sie nicht wachsen. "Wir k&ouml;nnen
          Ihnen vielleicht die Infliximab-Infusion anbieten", hatte
          der Oberarzt Andreas Perniok am Telefon versprochen.
          "Wenn Sie am laufenden Meter R&uuml;ckf&auml;lle haben,
          machen wir das als individuellen Heilversuch. Seien Sie
          Montag hier, richten Sie sich auf drei Tage ein,
          sicherheitshalber."</P>

          <P>Okay. Jetzt bekomme ich meinen Willen. Gegen die Maus
          im Auge werde ich Infliximab bekommen, einen
          k&uuml;nstlichen Antik&ouml;rper. Ein Pr&auml;parat, das
          f&uuml;r meine Krankheit weder entwickelt wurde noch
          f&uuml;r ihre Behandlung zugelassen ist. Ich wollte dies
          eine Medikament schon vor einem Jahr. Aber kein Arzt
          wollte f&uuml;r einen solchen Schuss ins Blaue den Kopf
          hinhalten. "Zu wenige Erfahrungswerte", "experimentell,
          ja spekulativ", hatten die Augen&auml;rzte gewarnt,
          besser gesagt, den Versuch schlicht verweigert. In
          Wahrheit ging es mir damals einfach noch zu gut.</P>

          <P>Individueller Heilversuch bedeutet: eine h&auml;ufig
          mutige, oftmals letzte, meist aber verzweifelte
          Intervention. Ohne Vorhersage, erst recht ohne
          Gewissheit, etwas zum Lernen f&uuml;r die &Auml;rzte, wie
          auch immer es ausgeht. "Wir geben Ihnen zun&auml;chst
          vier Infusionen", hatte Perniok, der K&ouml;lner
          Rheumatologe, gesagt, "je eine in Woche null, Woche zwei
          und sechs, dann eine in Woche 14, danach sehen wir
          weiter." Erst aber m&uuml;ssen die Kollegen in der
          benachbarten Uni-Augenklinik feststellen, ob die
          Behandlung wirklich angezeigt ist. Oberarzt Brunner
          wartet schon.</P>

          <P>Nachdem der erste blinde Fleck auf dem rechten Auge
          aufgetaucht war, nach unz&auml;hligen Untersuchungen in
          Unikliniken, in Hamburg, Z&uuml;rich, Heidelberg, Boston,
          mochte erst Manfred Zierhut, der Netzhautexperte von der
          T&uuml;binger Augenklinik, eine einigerma&szlig;en klare
          Diagnose stellen: Pic-Syndrom (punctate inner
          choroidopathy), eine Form der Uveitis, eine chronische
          Netzhautentz&uuml;ndung. Bekannte Pic-F&auml;lle
          weltweit: etwa f&uuml;nfzig. "Die Ursache", fragte ich
          (der Augenprofessor guckt sparsam), "ich meine: Wie
          kriegt man so was ?" - "&Auml;hm, prim&auml;r
          idiopathisch." Bedeutet: Wir haben andauernd keine
          Ahnung. Erfahrungen bei Verlauf und Therapie
          dementsprechend: mager bis nicht vorhanden.</P>

          <P>Antik&ouml;rper-Molek&uuml;le sind wie der Buchstabe Y
          geformt. 100 Milliarden unterschiedliche Typen bewachen
          den Organismus. Sie vernichten alles, was fremd erscheint
          Foto: Dr. Tim Evans/SPL/Agentur Focus Uveitis ist eine
          Regenschirmdiagnose, darunter verbergen sich mindestens
          ein Dutzend unterschiedliche Krankheiten. Von manchen,
          wie Pic, kennt die Medizin eigentlich nur den Namen. Alle
          Varianten k&ouml;nnen zur Erblindung f&uuml;hren, und sie
          entstehen, wenn das Auge unter eine Art friendly fire der
          Immunabwehr ger&auml;t. Jede Entz&uuml;ndung der Netzhaut
          durch so eine fehlgeleitete Attacke hinterl&auml;sst
          einen Schaden - einmal abgestorbene Sehzellen kann das
          menschliche Auge nicht ersetzen. Es bleibt eine Narbe aus
          Bindegewebe, und die ist blind, f&uuml;r immer.</P>

          <P>Etwa 27000 Uveitis-Kranke gibt es in Deutschland, und
          manchmal findet sich eine Infektion, die das Leiden
          ausl&ouml;st. Doch bei 75 Prozent von ihnen ist die
          eigentliche Ursache komplett r&auml;tselhaft - sie
          gelten, wie ich auch, als Autoimmun-Kranke, mangels
          besserer Erkl&auml;rung, und weil man mit Pillen zur
          D&auml;mpfung des Immunsystems die akuten
          Entz&uuml;ndungssch&uuml;be im Auge meistens brechen
          kann.</P>

          <P>"Autoimmun" sind viele schlimme Leiden, wie Multiple
          Sklerose, oder chronische Gelenk-entz&uuml;ndung. Stets
          ist die wahre Ursache ein Mysterium. Hinter dem Begriff
          des Autoimmunleidens steht im Wesentlichen eine
          bestechende, aber weithin unbewiesene Theorie. Die beste
          Bezeichnung f&uuml;r Autoimmunkrankheit ist Terra
          incognita - nur durchkreuzt von ein paar medizinischen
          Trampelpfaden. Die einzigen Medikamente gegen
          Netzhautentz&uuml;ndungen stammen aus der
          Transplantationsmedizin und der Rheumatherapie.
          Hochwirksame und hochdosierte Immunblocker wie Prednison
          (ein Kortisonpr&auml;parat), CyclosporinA, CellCept oder
          das Zellgift Methotrexat. Heilen k&ouml;nnen die
          Pr&auml;parate nicht, aber oft l&auml;sst sich der
          Krankheitsverlauf mit ihnen einigerma&szlig;en unter
          Kontrolle halten.</P>

          <P>Zuerst klappte das auch bei mir. Sp&auml;ter ging gar
          nichts mehr. Vor der ersten Reise nach K&ouml;ln standen
          auf meiner Pillenliste: 150 Milligramm Kortison plus 3000
          Milligramm CellCept t&auml;glich, dazu 25 Milligramm
          Methotrexat pro Woche - damit k&ouml;nnte man das
          Immunsystem zweier Elefantenbullen in die Knie zwingen.
          Gegen mein marodierendes Immunsystem reichte es
          nicht.</P>

          <P>Und selbst wenn: F&uuml;r kurze Zeit sind
          Kortisonpr&auml;parate wunderbare Medikamente, sie wirken
          schnell und effektiv. Bei Daueranwendung in hoher Dosis
          sind sie des Teufels. Man sieht aus wie eine schwangere
          Kaulquappe, das Gesicht, der ganze Oberk&ouml;rper
          schwillt an. Fett sammelt sich kiloweise um die
          H&uuml;ften. Knochen und Muskeln werden schwach. Der
          Kreislauf spielt verr&uuml;ckt. Ab 100 Milligramm
          t&auml;glich bricht das Kurzzeitged&auml;chtnis ein.</P>

          <P>In der Augenklinik spricht der Oberarzt Richard
          Brunner, nach der Untersuchung meiner Sehleistung
          (Sehsch&auml;rfe links 10, rechts 60 Prozent
          -b&ouml;se!), nach dem Studium der Akte und einem
          besorgten Blickwechsel mit seiner Kollegin Helen Ayertey,
          das Urteil: "Therapie-refrakt&auml;r." Das ist die
          schlechte Nachricht, aber die kannte ich eigentlich
          schon. Die gute steht auf seinem Konsiliarbericht:
          "Infliximab-Infusion ist indiziert."</P>

          <P>Was am n&auml;chsten Tag, nach der Augenuntersuchung,
          nach einer Batterie von Blut- und Gentests, in meine Vene
          sickern wird, kostet fast dreitausend Euro, ist, rein
          technologisch betrachtet, ziemlich veraltet und trotzdem
          im Moment eines der hei&szlig;esten Medikamente gegen
          verschiedene chronische Entz&uuml;ndungskrankheiten. Der
          Stoff kann vielleicht auch die Schattenmaus t&ouml;ten
          und meine Netzh&auml;ute retten. Vielleicht. Bei
          Nichtstun werden sie verschmoren unter immer neuen
          Attacken meiner eigenen Immunzellen.</P>

          <P>Infliximab (Remicade) ist ein biotechnisch
          produzierter Antik&ouml;rper, ein k&uuml;nstlich
          geschneidertes Mischmolek&uuml;l aus Maus und Mensch. Das
          k&uuml;nstliche Immuneiwei&szlig; soll nun einen
          Botenstoff in meinem Blut aus dem Verkehr ziehen:
          Tnf-alfa (Tumor-Nekrose-Faktor). Der Stoff wird vom
          K&ouml;rper selbst produziert - und er gilt als top dog
          in einer komplizierten Kaskade von biochemischen
          Faktoren, die Entz&uuml;ndungen im K&ouml;rper starten.
          Wenn man Patienten mit chronischer Gelenk- (rheumatoider
          Arthritis) oder Darmentz&uuml;ndung (Morbus Crohn)
          Infliximab infundiert, klammert sich das k&uuml;nstliche
          Immuneiwei&szlig; an das Tnf, fischt es aus dem Blut, und
          die Symptome verschwinden oder bessern sich selbst bei
          Schwerstkranken.</P>

          <P>Immerhin, bekundet Oberarzt Perniok, gebe es nun "gute
          Hinweise, dass Tnf-alfa auch bei
          Netzhautentz&uuml;ndungen eine entscheidende Rolle
          spielt". Na dann.</P>

          <P>Es ist vier Uhr nachmittags, da schiebt die
          Stations&auml;rztin Christina Schumann den Galgen mit der
          Infusionsl&ouml;sung ins Zimmer, sticht den Zugang in die
          linke Armvene. Drau&szlig;en, hinter dem riesigen Fenster
          im 10. Stock, geht die Sonne unter, und mir ist mulmig.
          Immerhin wei&szlig; ich, Biologe, wenigstens theoretisch,
          was jetzt passieren wird in meinem Blut, im Auge, mit
          meinen Immunzellen. Andererseits sind h&ouml;chstens
          hundert Uveitis-Kranke auf der ganzen Welt versuchsweise
          so behandelt worden. Auch ich bin jetzt ein Experiment.
          Zwei Stunden lang rinnt mir die Kochsalzl&ouml;sung mit
          dem biotechnischen Immunmolek&uuml;l ins Blut.</P>

          <P>Solche therapeutischen Antik&ouml;rper sind inzwischen
          gro&szlig;e Hoffnungstr&auml;ger in der Pharmabranche und
          in der Medizin. Aber das war nicht immer so. Noch vor
          f&uuml;nfzehn Jahren wurden sie &uuml;berall als
          Komplettversager eingestuft. Dabei hatte es zuvor
          wirklich so ausgesehen, als st&uuml;nde eine echte
          Revolution in der Medizin unmittelbar bevor: Der deutsche
          Immunologe Georges K&ouml;hler hatte 1975 ein Verfahren
          zur Massenherstellung von Maus-Antik&ouml;rpern entdeckt.
          Ebenso wie die menschliche Immunverteidigung bilden auch
          die Nager Antik&ouml;rper als Angriffswaffen gegen Viren,
          Bakterien, Krebszellen oder Pilze.</P>

          <P>Mit K&ouml;hlers Entdeckung hatten die Therapeuten
          gleichsam &uuml;ber Nacht ein Mittel in die Hand
          bekommen, mit dem sie identische Maus-Antik&ouml;rper
          gegen einen bestimmten Krankheits-erreger in gro&szlig;en
          Mengen produzieren konnten. Sogar zur industriellen
          Herstellung von solchen Immungeschossen gegen alle Arten
          von Krebszellen schien das Verfahren geeignet - die
          &Auml;rzte formierten sich schon zum Parademarsch.</P>

          <P>Aber in der Medizin gibt es keine Kantersiege.
          K&ouml;hler und seine Kollegen C&eacute;sar Milstein und
          Niels Jerne wurden 1984 mit dem Medizinnobelpreis belohnt
          - doch all die Hoffnungen auf einen schnellen Triumph in
          den Brandherden der Medizin zerschellten da gerade. Simon
          Moroney, Boss der M&uuml;nchner Bio-Tech-Firma MorphoSys,
          hat H&ouml;henflug und Crash der Antik&ouml;rper als
          junger Forscher selbst erlebt. "Es gab damals zwei
          gro&szlig;e klinische Versuche, beide spektakul&auml;re
          Fehlschl&auml;ge. Dann war das Feld tot", sagt er.
          "Niemand in der Pharmaindustrie hat sich mehr f&uuml;r
          Antik&ouml;rper interessiert."</P>

          <P>Fast niemand. Einige Wissenschaftler, manche Firmen
          lie&szlig;en nicht locker. Und nach zehn, f&uuml;nfzehn
          Jahren geduldiger, hartn&auml;ckiger Forschung begann die
          Renaissance der Immuneiwei&szlig;e. Sp&auml;testens als
          Genentech, Pionierfirma der Bio-Tech-Industrie, ein
          wirksames Antik&ouml;rper-Medikament gegen
          fortgeschrittenen Brustkrebs vorstellte, wurde auch den
          letzten Kritikern klar, dass der Wind sich gedreht hatte.
          "Herceptin war der Wendepunkt", sagt Simon Moroney. Das
          Pr&auml;parat enth&auml;lt einen k&uuml;nstlichen
          Antik&ouml;rper, der an ein Oberfl&auml;chenmolek&uuml;l
          ankoppelt, das bei vielen Frauen in gro&szlig;er Zahl auf
          den Krebszellen vorkommt. Heilen kann auch Herceptin
          nicht, aber es kann das Leben verl&auml;ngern.</P>

          <P>Viele Schwerkranke setzen nun ihre ganze Hoffnung in
          die einst gestrandeten Wirkstoffe. M&auml;use und ihre
          Immunmolek&uuml;le lassen die Pharmazeuten jetzt indessen
          m&ouml;glichst beiseite - mit neuen gentechnischen
          Verfahren wird das Elixir aus den Arsenalen der
          menschlichen Immunverteidigung destilliert. Und es zeigt
          sich, dass Antik&ouml;rper zwar beileibe keine
          Wunderwaffen sind, aber die Sache funktioniert.
          Inzwischen sind in Europa und den Vereinigten Staaten
          schon 17 solcher Pr&auml;parate im Einsatz. Und mehr als
          200 neue Antik&ouml;rper-Medikamente befinden sich in den
          Pipelines der Pharmaunternehmen.</P>

          <P>Der Reanimierung der Antik&ouml;rper verdankt Markus
          Enzelberger seinen Job. Und er hat offenbar gro&szlig;e
          Freude an seiner Aufgabe. Zwei, drei Schritte nur in sein
          Labor, und man l&auml;uft gegen die Wand. Daran ist ein
          mannshohes Flie&szlig;diagramm gepinnt. Dar&uuml;ber, als
          &Uuml;berschrift, eine bedenkenswerte Frage: "What are we
          doing here, anyway?" (Was machen wir hier eigentlich?)
          Immerhin hat der Biochemiker Enzelberger die Antwort
          parat. "Cherry-picking" (Kirschenpfl&uuml;cken), ruft er
          mir durch das Surren der Labormaschinen entgegen. Er
          grinst zufrieden und fingert weiter auf seiner Tastatur,
          um die Programme der Roboter auf Kurs zu halten.</P>

          <P>Der 34-j&auml;hrige Forscher ist allein zwischen
          lauter Automaten. Gemeinsam suchen Mensch und Maschinen
          in einer Unzahl von gentechnisch konstruierten
          Immuneiwei&szlig;en nach den m&auml;chtigsten Varianten.
          Enzelberger wei&szlig; nicht, dass ein &auml;hnliches
          Eiwei&szlig;, millionenfach vermehrt, seit ein paar Tagen
          durch meinen K&ouml;rper wandert - hoffentlich auf der
          Jagd nach den kleinen &Uuml;belt&auml;tern, die sich
          darangemacht haben, mir das Augenlicht zu nehmen.</P>

          <P>Bis zu Enzelbergers "Kirschernte" hat es lange
          gedauert: bis Wissenschaftler herausgefunden hatten,
          wieso die ersten Versuche der Heilbehandlung mit
          Antik&ouml;rpern so kl&auml;glich scheitern mussten, und
          erkundet hatten, wie dem abzuhelfen w&auml;re. Und bis
          der biotechnische Fortschritt es &uuml;berhaupt
          m&ouml;glich machte, einen Stoff wie Infliximab
          herzustellen.</P>

          <P>Auch in Enzelbergers Roboterlabor bei MorphoSys gilt
          ein Projekt der Bek&auml;mpfung chronischer
          Entz&uuml;ndungen: MorphoSys will neue
          Antik&ouml;rper-Medikamente gegen Schuppenflechte und
          rheumatoide Arthritis entwickeln. Doch selbst mit den
          modernsten Verfahren ist die Suche nach wirkungsvollen -
          und nebenwirkungsarmen -Antik&ouml;rper-Molek&uuml;len
          aus der Retorte ein m&uuml;hsames Gesch&auml;ft. "Low
          hanging fruits", sagt Simon Moroney, gebe es nun mal
          nicht im Antik&ouml;rper-Gesch&auml;ft.</P>

          <P>Auch danach braucht ein neues Medikament noch viel
          Zeit - von der Entwicklung im Labor bis zur Anwendung bei
          Patienten k&ouml;nnen zehn Jahre vergehen. Deshalb ist
          meines alter K&auml;se. Infliximab ist ein
          Mischlingsmolek&uuml;l aus Maus und Mensch. Der
          Menschenteil erf&uuml;llt vor allem einen Zweck: Er soll
          den Antik&ouml;rper maskieren gegen&uuml;ber dem
          Immunsystem. Die fehlende Tarnung war n&auml;mlich der
          Grund f&uuml;r das Desaster bei den ersten
          Behandlungsversuchen mit reinen Maus-Antik&ouml;rpern.
          Diese waren zwar durchaus wirksam, wurden aber vom
          Immunsystem der Patienten sofort als das erkannt, was sie
          eben auch waren: Maus-Eiwei&szlig;e. Die
          Immunverteidigung der Testpersonen machte Front gegen die
          Eindringlinge und zog sie aus dem Verkehr.</P>

          <P>Meine Abwehr gibt nach drei Wochen - und der zweiten
          Infliximab-Infusion -endlich Ruhe. Zum ersten Mal seit
          einem Jahr sp&uuml;re ich meine Augen nicht. Die Maus auf
          der Netzhaut schrumpft etwas zusammen. Und sie hat ihr
          riesiges Ohr verloren. Den Immunblocker CellCept hatte
          ich schon vor der ersten Infusion absetzen m&uuml;ssen.
          "Die Kombination mit Infliximab ist nicht erprobt", hatte
          Perniok mir erkl&auml;rt, "das w&auml;re mir zu
          gef&auml;hrlich." Au&szlig;erdem ist meine Kortisondosis
          halbiert worden.</P>

          <P>Noch mal zwanzig Tage. Dann der einundzwanzigste, der
          Tag der Wahrheitsfindung. Wieder fahre ich nach
          K&ouml;ln. Erst Infusion Nummer drei beim Rheumatologen
          Perniok: "Na, Herr Bahnsen, alles gut gegangen? Sie sind
          infektfrei? Ihre Akte - Schwester Olga! Die Akte von Dr.
          Bahnsen." -".liegt auf dem Schreibtisch!" Der leicht
          untersetzte Doc rotiert durch sein Arztzimmer, die Akte
          ist weg. "Machen Sie mal den Oberk&ouml;rper frei,
          abh&ouml;ren muss ich Sie schon noch."</P>

          <P>W&auml;hrend die Schwester die 400 Milligramm
          Infliximab-Pulver in steriler Kochsalzl&ouml;sung
          aufl&ouml;st, gibt der Chef sein Okay (die Akte kam unter
          einem Stapel Lancet- und Rheumatology-Heften zum
          Vorschein). Zwei Stunden sp&auml;ter kann ich gehen, ein
          Haus weiter in die Augenklinik zur Sehpr&uuml;fung.</P>

          <P>Will ich es eigentlich wirklich wissen? Die Augen
          sagen: Du siehst besser. Der Verstand sagt: Du bist noch
          immer entt&auml;uscht worden. Mein Bauch: rumort. Der
          Arsch: auf Grundeis.</P>

          <P>Visus-Check, Gesichtsfeldpr&uuml;fung, Netzhautbefund.
          Die Doktorin Helen Ayertey scharrt innerlich mit den
          F&uuml;&szlig;en, als ihr Chef Brunner ins
          Untersuchungszimmer tritt, springt auf, h&auml;lt ihm die
          Werte unter die Nase: "Das ist der Hammer."</P>

          <P>Das kann man so oder so verstehen. Aber dann ist es
          so: Keine Anzeichen f&uuml;r Entz&uuml;ndung.
          Gesichtsfeld besser, Visus links von 10 auf 25, rechts
          von 60 auf 100 Prozent Sehsch&auml;rfe. Oh Mann! Alle
          &Auml;rzte sind Engel, die Pharmaindustrie im Allgemeinen
          und die Firma Centocor (die macht Infliximab) im
          Besonderen sind von guten Menschen bev&ouml;lkert.</P>

          <P>In Wahrheit hat der Elan der Pharmazeuten
          nat&uuml;rlich andere Gr&uuml;nde als meine seltene
          Augenkrankheit: Es sind vor allem verbreitete chronische
          Leiden -und die stellen einen riesigen Markt dar -, die
          k&uuml;nftig mit Hilfe des gewaltigen Repertoires
          menschlicher Immuneiwei&szlig;e therapiert werden sollen.
          Etwa hundert Milliarden unterschiedliche Antik&ouml;rper
          erzeugt jeder Mensch im Lauf seines Lebens und schickt
          sie auf Patrouille durch die Blutbahn. Jedes der
          Immuneiwei&szlig;e erkennt eine andere
          Molek&uuml;lstruktur - f&uuml;r die Pharmaforscher eine
          unersch&ouml;pfliche Quelle f&uuml;r Wirkstoffe, die
          dringend gebraucht werden: Medikamente gegen Krebs,
          Infektionen, chronische Entz&uuml;ndungskrankheiten, auch
          Asthma oder Lungenemphysem. Neuerdings gibt es sogar
          Hoffnung, mit solchen Medikamenten Alzheimer und
          Altersblindheit bek&auml;mpfen zu k&ouml;nnen.</P>

          <P>Diese neueste Generation therapeutischer
          Antik&ouml;rper, so genannte humanisierte oder vollhumane
          Antik&ouml;rper, ist vollkommen artifiziell, stammt aus
          keinem K&ouml;rper, ist nie mit einem Tropfen Blut in
          Ber&uuml;hrung gekommen. Ihre Form wird am
          Gro&szlig;computern errechnet, gentechnisch
          zurechtgeschneidert, und sie werden in Massen in
          Zellkulturen produziert. Ihre Struktur aber ist praktisch
          vollkommen identisch mit nat&uuml;rlichen humanen
          Antik&ouml;rpern - das Immunsystem der Patienten erkennt
          sie daher nicht als Fremdlinge.</P>

          <P>K&ouml;ln Hauptbahnhof, erst mal Wasser kaufen. "Sie
          m&uuml;ssen viel trinken", hatte Oberarzt Brunner
          gemahnt, "mit Fl&uuml;ssigkeit k&ouml;nnen Sie die
          Blutzirkulation im Auge verbessern, das kann in den
          R&auml;ndern der vernarbten Stellen noch viel
          bringen."</P>

          <P>Im IC nach Hamburg-Dammtor; bei M&uuml;nster wird es
          dunkel drau&szlig;en, ich sehe ganz wenig. Das liegt an
          den Tropfen zum &Ouml;ffnen der Pupillen, trotzdem
          kriecht wieder Angst hoch: ob dies nun endlich helfen
          wird, wie das alles weitergeht. Die richtigen
          Abst&auml;nde zwischen den Infusionen m&uuml;ssen
          f&uuml;r jeden Patienten individuell herausgefunden
          werden. Bei mir und allen anderen Uveitis-Patienten, die
          Perniok mit Infliximab behandelt, geht das so: nach der
          ersten Infusion werden die folgenden in ansteigenden
          Abst&auml;nden gegeben. So kann man feststellen, wie
          lange die Wirkung des Medikaments anh&auml;lt. Jetzt
          hatte ich Ladung drei, die n&auml;chste kriege ich erst
          in acht Wochen. Irgendetwas sagt mir, es werden zwei
          lange Monate.</P>

          <P>Inzwischen hat wieder Genentech den neuesten Erfolg
          mit Antik&ouml;rpern gelandet. Avastin soll Leuten
          helfen, denen es noch schlechter geht als mir. Es kann
          schwerstkranken Darmkrebs-Patienten etwas mehr Leben
          schenken, weil es den Krebsherden die Blutversorgung
          kappt. Und auch f&uuml;r mein Medikament, lese ich, gibt
          es nun einen vielleicht besseren Ersatz. Humira ist auch
          ein Antik&ouml;rper gegen das fatale Tnf in meinem Blut,
          aber es ist ein vollhumanes Molek&uuml;l. Das ist gut.
          Noch immer besteht die Gefahr, dass mein Immunsystem sich
          irgendwann doch gegen das Mensch-Maus-Medikament zur Wehr
          setzt.</P>

          <P>Nach sechseinhalb Wochen stellt sich heraus, dass acht
          Wochen Abstand zwischen den Infusionen keine so gute Idee
          waren. Ich sehe nur Sandsturm, die Welt vor meinen Augen
          flimmert, jedes Licht ist viel zu hell. Morgens knipse
          ich nicht die Nachttischlampe an, sondern taste nach
          Streichh&ouml;lzern und einer Kerze. "Okay. Ziehen wir
          die Infusion vor", schreibt Perniok auf meine Alarm-Mail
          zur&uuml;ck. "Wann k&ouml;nnen Sie da sein?" In
          K&ouml;ln, am n&auml;chsten Morgen um zehn, ist es dann
          nicht ganz so schlimm, aber "einen Teil der Verbesserung
          aus den letzten Wochen haben wir wieder verloren", sagt
          Helen Ayertey. "Das ist doch wirklich &auml;rgerlich."
          -"Immerhin", tr&ouml;stet Oberarzt Brunner, nachdem er
          meine Augen minutenlang ausgeleuchtet hat - wenig
          angenehm, wenn man sich schon von einer Leuchtdiode
          geblendet f&uuml;hlt, "immerhin sehen Sie immer noch
          deutlich besser als vor Beginn der Behandlung." Abmarsch
          in die Poliklinik, Tropf, und dann nur nach Hause.</P>

          <P>Es wird nicht besser. Schlie&szlig;lich stimmt Perniok
          zu, die Keule rauszuholen, noch eine Ladung Infliximab
          einzuleiten. Geheuer ist ihm die Sache nicht. Das merkt
          man sogar am Telefon. Infliximab kann Nebenwirkungen
          haben, auch gef&auml;hrliche. "Ein blinder ist besser als
          ein toter Patient", sagt er. Davon kann meinerseits keine
          Rede sein, ich sehe das vorl&auml;ufig exakt anders
          herum. Um halb sechs sitze ich in der S-Bahn zum
          Hamburger Hauptbahnhof, dann im ersten Zug nach
          K&ouml;ln. Untersuchung, Urinprobe, Blutabnahme,
          Schwester Olga h&auml;ngt den Tropf auf: "Welchen Arm
          sollen wir heute nehmen?"</P>

          <P>Eine Stunde ungef&auml;hr wird die Infusion in meine
          Adern laufen. Tropfen f&uuml;r Tropfen. Es wird
          langweilig, ich sp&uuml;re nichts. Alle f&uuml;nfzehn
          Minuten kommt Schwester Olga ("Sind Sie okay?"), misst
          Blutdruck und Puls. "Haben Sie was gegessen? - Das geht
          aber nicht." Nach zehn Minuten bringt sie Kaffee und
          Schokolade. Oberarzt Perniok schie&szlig;t pl&ouml;tzlich
          herein, wedelt mit einem Rezept. "Wir sehen uns in vier
          Wochen", sagt er, "holen Sie vorher das Medikament aus
          der Apotheke." Er dreht schon ab, aber dann setzt er sich
          doch. "F&uuml;hlen Sie sich gut? Okay, denken Sie an
          alles, was ich Ihnen gesagt habe. Ihre Infektabwehr ist
          jetzt stark herabgesetzt. Achten Sie vor allem auf
          Bronchialinfekte. Sofort zum Arzt, klar?" Das waren
          ahnungsvolle Worte.</P>

          <P>Schon am n&auml;chsten Tag sehe ich wieder besser.
          Noch besser am &uuml;bern&auml;chsten, einem Mittwoch. Am
          Donnerstag bekomme ich Schnupfen, nichts Schlimmes,
          Abgeschlagenheit, Kopfweh, was man da so hat. Was man da
          normalerweise nicht hat, beginnt am folgenden Montag:
          Fieber, 39,6. Ein paar Tage sp&auml;ter Diarrh&ouml;e,
          schwere Kopfschmerzen, das Fieber ist auf 40,4 Grad
          gestiegen, und ich bin im Krankenhaus. "Nehmen Sie
          au&szlig;er Antibiotika Medikamente? -Infliximab? Oh!"
          Die junge &Auml;rztin in der Notaufnahme kriegt
          Sehschlitze. "Okay, wir bringen sie jetzt nach oben."</P>

          <P>Zwei Tage sp&auml;ter, als der Oberarzt der
          Intensivstation zur Visite kommt, bin ich vollverkabelt,
          in jeder verf&uuml;gbaren Vene steckt ein Schlauch. Aber
          ich wei&szlig; immerhin wieder, wie ich hei&szlig;e. "Ihr
          Thorax-Computertomogramm hat uns &uuml;berhaupt nicht
          gefallen. Sie haben eine atypische Lungenentz&uuml;ndung,
          aber ich glaube, wir haben Gl&uuml;ck." Nach f&uuml;nf
          Tagen Intensivstation und insgesamt 15 Gramm Antibiotika
          kann ich das erste Mal die vier Schritte zum Waschbecken
          ohne Sauerstoffschlauch vor der Nase zur&uuml;cklegen.
          Mich schwindelt von der Anstrengung und weil der Oberarzt
          den Satz sagt, den ich gef&uuml;rchtet habe: "Ich frage
          mich, ob man Ihnen Infliximab weiter geben darf."</P>

          <P>Leider stellt sich auch Perniok diese Frage. "Ich muss
          mir das &uuml;berlegen", sagt er, als ich mich aus der
          Klinik zur&uuml;ckmelde. "Vielleicht ist das Risiko
          einfach zu gro&szlig;." Was ich nicht wei&szlig;, ist,
          dass zu dieser Zeit ein anderer Infliximab-Patient in
          seiner K&ouml;lner Klinik seit fast drei Wochen mit einer
          Lungenentz&uuml;ndung zwischen Leben und Tod schwebt.
          Eine Woche sp&auml;ter hat sich Perniok entschieden. Ich
          darf weiter kommen. "Aber Sie werden erst richtig gesund,
          wir warten noch ein paar Wochen ab bis zur n&auml;chsten
          Infusion."</P>

          <P>Vier Wochen und 400 Milligramm Infliximab sp&auml;ter
          ist meine Augendoktorin "sehr zufrieden" mit mir. Und
          auch ihr Chef Brunner hat Hoffnung: "Den Krieg haben wir
          noch nicht gewonnen, aber das ist ein Etappensieg." Die
          Frontlinie in meiner Krankenakte verl&auml;uft jetzt bei
          Fernsicht: stabil, Nahsicht: verbessert, Gesichtsfeld:
          weiter verbessert. Kortison: nur noch 40 Milligramm
          t&auml;glich.</P>

          <P>Es ist Morgen, 6.12 Uhr, Hamburg Hauptbahnhof. Auf
          Gleis 13 geht wieder der Metropolitan nach K&ouml;ln. Ein
          prima Zug, Fr&uuml;hst&uuml;ck und Tageszeitungen sind
          inbegriffen. Immerhin kann ich sie wieder lesen.</P>

          <P>(c) DIE ZEIT 19.05.2004 Nr.22</P>

          <P>eingesandt: Anja Winkler</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

