<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>[RADIOAKTIV] Kurzmeldungen</TITLE>
  </HEAD>

  <BODY background="images/bgd.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>[RADIOAKTIV] Kurzmeldungen</B></FONT></P>

          <H3><B>Slowakei: Parlamentssausschuss gegen Abschaltung
          der Kurzwelle</B></H3>

          <P>Der Medienausschuss des Nationalrats der Slowakei hat
          sich gegen die drohende Einstellung der
          Kurzwellensendungen des Slowakischen Rundfunks
          ausgesprochen und das Finanz- sowie das Kultusministerium
          aufgefordert, die Finanzierung der Sendungen zu
          gew&auml;hrleisten. Der Slowakische Rundfunk geht von
          weltweit 150.000 H&ouml;rern aus, von denen bei einer
          Abschaltung der Kurzwellensender nur 20.000 verbleiben
          w&uuml;rden. Die Nutzung eines Senders in Rimavsk&aacute;
          Sobota kostet den Slowakischen Rundfunk pro Jahr 13
          Millionen Slowakische Kronen (etwa 320.000 Euro). Dieser
          Betrag wird vom Senderbetreiber pauschal berechnet,
          weshalb eine Reduzierung der kritisch diskutierten Anzahl
          der Wiederholungen (so wird das t&auml;gliche deutsche
          Programm viermal ausgestrahlt) keine nennenswerten
          Einsparungen mit sich bringen w&uuml;rde. Bereits seit
          dem 01.12.2003 werden f&uuml;r Radio Slowakei
          International nur noch zwei statt wie zuvor drei Sender
          eingesetzt, womit die Ausstrahlungskosten etwa 60 % des
          urspr&uuml;nglich f&uuml;r das Jahr 2004 vorgesehenen
          Budgets von 54 Millionen Slowakischer Kronen (1,3
          Millionen Euro) ausmachen.</P>

          <H3><B>Rundfunksendungen von Schiffen der US
          Navy</B></H3>

          <P>Seit dem 15.04.2004 strahlt die US Navy im Golf von
          Oman und im Norden des Arabischen Meeres
          Rundfunksendungen aus, mit denen dazu aufgerufen werden
          soll, terroristische Aktivit&auml;ten zu melden. Gesendet
          wird 05.00-10.00 Uhr auf 6125 kHz und 16.00-21.00 Uhr auf
          15500 kHz. In Handzetteln (Repros), die das
          Kontaktb&uuml;ro der US Navy in Bahrain verteilt, werden
          diese Sendungen als "Radio One" bezeichnet. Nach Angaben
          des CNN-Journalisten Mika M&auml;kel&auml;inen werden
          hierf&uuml;r schiffsgebundene Kleinsender mit einer
          Leistung von nur 250 Watt benutzt. Es werde jedoch
          erwogen, die Ausstrahlungen zu professionellen
          Rundfunksendern in den Vereinigten Arabischen Emiraten
          und in Gro&szlig;britannien zu verlegen. Diese
          Darstellung wird vom aktuellen Sendeplan des Betreibers
          VT Merlin Communications gest&uuml;tzt, in dem bereits
          entsprechende Sendepl&auml;tze f&uuml;r ein "Radio for
          Peace" reserviert sind, und zwar auf dem englischen
          Sender Rampisham 02.30-04.00 Uhr auf 9845 kHz,
          03.00-04.00 Uhr auf 9575 kHz, 08.00-10.00 Uhr auf 17780
          kHz, 13.00-14.00 Uhr auf 15360 kHz, 16.00-17.00 Uhr auf
          17720 kHz, 16.00-19.00 Uhr auf 15500 kHz, 17.00-18.00 Uhr
          auf 17895 kHz und 18.00-19.00 Uhr auf 17855 kHz. F&uuml;r
          den Sender Al-Dhabbaya bei Abu Dhabi sind entsprechende
          Ausstrahlungen 04.00-06.00 Uhr auf 6125 kHz, 10.00-13.00
          Uhr auf 15170 kHz und 19.00-20.30 Uhr auf 9815 kHz
          vorgesehen.</P>

          <H3><B>Kuba: Kredit aus China f&uuml;r
          Sendeanlagen</B></H3>

          <P>China hat Kuba einen Kredit in H&ouml;he von 200
          Millionen US-Dollar zur Modernisierung seiner
          Sendeanlagen gew&auml;hrt. Nach kubanischen
          Ver&ouml;ffentlichungen wurden mit diesen Mitteln auf der
          Station Bauta sieben neue Sender installiert, von denen
          einer f&uuml;r die &Uuml;bertragung von Radio Rebelde auf
          5025 kHz reserviert ist. Die bisherige Ausr&uuml;stung
          der Station stammt aus den 60er Jahren. Zu ihr
          geh&ouml;rten je zwei aus der Schweiz bzw. der
          Sowjetunion importierte 100 kW-Rundfunksender.
          Dar&uuml;ber hinaus werden insgesamt sieben
          Nachrichtensender von Siemens und dem Funkwerk
          K&ouml;penick mit 20 bzw. 30 kW Leistung genannt.
          Entsprechende Angaben der kubanischen Seite konnten von
          einem Ausl&auml;nder, dem ein fl&uuml;chtiger Blick in
          den Sendersaal in Bauta gelang, weitgehend best&auml;tigt
          werden. Die Havannaer Zeitung Granma f&uuml;hrt
          dar&uuml;ber hinaus in einem Bericht auch eine
          Rekonstruktion der Sendestationen Bejucal und
          Quivic&aacute;n/Tit&aacute;n an. Diese Standorte waren
          bislang im Ausland nicht bekannt. An ihnen d&uuml;rfte
          sich auch die offenbar vorhandene, vermutlich aus der
          Sowjetunion gelieferte Sendetechnik h&ouml;herer Leistung
          (mindestens ein 250 kW-Sender) befinden.</P>

          <H3><B>Chinesische und andere Sendungen aus Kuba</B></H3>

          <P>&Uuml;ber die Kurzwellensender in Kuba werden seit
          wenigen Jahren Programme von China Radio International
          ausgestrahlt. Von der chinesischen Seite wurden
          hierf&uuml;r folgende Frequenzen mit Sendeleistungen von
          jeweils 250 kW koordiniert: 5990 kHz (01.00-03.00 Uhr),
          9570 kHz (14.00-16.00 Uhr), 9580 kHz (03.00-05.00 Uhr),
          9790 kHz (05.00-07.00 Uhr), 13650 kHz (01.00-02.00 Uhr),
          13740 kHz (16.00-18.00 Uhr) und 15120 kHz (02.00-03.00
          Uhr).</P>

          <P>Seit kurzem laufen &uuml;ber die Sender in Kuba auch
          Programmme von Radio Nacional de Venezuela in
          gr&ouml;&szlig;erem Umfang, nachdem bereits seit einiger
          Zeit die w&ouml;chentlichen "Al&oacute;
          Presidente"-Sendungen von Pr&auml;sident Ch&aacute;vez
          &uuml;bernommen wurden. Beobachtet wurden diese
          Ausstrahlungen bislang auf den auch f&uuml;r
          Eigenprogramme von Radio Habana Cuba genutzten Frequenzen
          9550, 9820, 11760, 13740 und 17750 kHz.</P>

          <P>Wieder eingestellt zu sein scheinen hingegen die vor
          einiger Zeit ebenfalls praktizierten &Uuml;bertragungen
          der Stimme Vietnams. Bereits seit den fr&uuml;hen 90er
          Jahren Geschichte sind die Sendungen von Radio Moskau aus
          Kuba, f&uuml;r die im Gegenzug Programme von Radio Habana
          Kuba in Richtung Europa &uuml;ber Sender in der
          Sowjetunion ausgestrahlt wurden. Die jeweils
          erforderlichen &Uuml;berspielungen d&uuml;rften &uuml;ber
          sowjetische Fernmeldesatelliten abgewickelt worden sein.
          F&uuml;r deren Nutzung wurde im knapp 40 km &ouml;stlich
          von Havanna liegenden Jaruco eine Uplinkstation des Typs
          Orbita 2 errichtet wie sie bei allen Teilnehmer des
          Systems Intersputnik und damit auch in der DDR im Einsatz
          war (die Orbita-Station der Deutschen Post befand sich in
          Neu Golm bei F&uuml;rstenwalde und war von 1976 bis 1996
          in Betrieb).</P>

          <P>F&uuml;r Eigenprogramme von Radio Habana Cuba liegt
          kein vollst&auml;ndiger Sendeplan vor. In den sp&auml;ten
          Abendstunden wird in Richtung Europa auf 11760 und 17750
          kHz gesendet. F&uuml;r Nordamerika bestimmte Programme
          werden nachts auf 6000, 9550 und 9820 kHz ausgestrahlt.
          Generell ist ein Empfang nur unzuverl&auml;ssig und in
          schlechter Qualit&auml;t m&ouml;glich. &Uuml;berdies
          leiden die Ausstrahlungen aus Kuba unter zum Teil
          erheblichen technischen M&auml;ngeln.</P>

          <H3><B>Neue Frequenzen f&uuml;r Radio Multikulti</B></H3>

          <P>Seit 01.05.2004 wird Radio Multikulti auch &uuml;ber
          Stadtfrequenzen in Cottbus und Frankfurt (Oder)
          verbreitet. Genutzt werden die urspr&uuml;nglich f&uuml;r
          Inforadio installierten Sender in Boo&szlig;en-Treplin
          99,3 MHz und in Klein O&szlig;nig auf 91,6 MHz. Inforadio
          war an diesen Standorten auf die zuvor von Radio Kultur
          genutzten, etwas st&auml;rkeren Frequenzen 102,0 bzw.
          99,9 MHz gewechselt.</P>

          <P>Die bisherige Frequenz von Radio Multikulti in Berlin,
          106,8 MHz, wurde zum 30.04.2004 abgeschaltet. Sie wird
          von der Medienanstalt Berlin-Brandenburg zur
          k&uuml;nftigen Nutzung durch einen anderen Veranstalter
          ausgeschrieben.</P>

          <H3><B>Hohe Wurzel 107,9 MHz umgeschaltet</B></H3>

          <P>Am 30.04.2004 wurde, wie urspr&uuml;nglich bereits
          f&uuml;r den 04.03.2004 angek&uuml;ndigt, die
          &Uuml;bertragung von SWR 4 Rheinland-Pfalz &uuml;ber den
          Sender Hohe Wurzel (bei Wiesbaden) auf 107,9 MHz
          eingestellt. In den Mittagsstunden des 03.05.2004 waren
          erstmals Aufschaltungen von Rockland Radio zu beobachten,
          das ab 04.05.2004 offiziell auf dieser Frequenz
          verbreitet werden soll.</P>

          <P>Im Gegenzug soll die derzeit noch von Rockland Radio
          genutzte Frequenz 105,2 MHz in Ober-Olm bei Mainz
          k&uuml;nftig dem S&uuml;dwestrundfunk zur Verf&uuml;gung
          stehen. Eine Best&auml;tigung f&uuml;r diese Angaben
          steht aber immer noch aus.</P>

          <H3><B>Weitere Sendereinschaltungen</B></H3>

          <P>In den letzten Tagen ging in Bayern ein weiterer
          Kleinsender f&uuml;r Deutschlandradio Berlin in Betrieb:
          Burglengenfeld auf 107,3 MHz (100 Watt).</P>

          <P>In Th&uuml;ringen wurde f&uuml;r MDR Info ein Sender
          in Schm&ouml;lln auf 107,9 MHz (200 Watt) eingeschaltet.
          Damit wird MDR Info in Th&uuml;ringen jetzt &uuml;ber 24
          zumeist leistungsschwache UKW-Sender verbreitet, nachdem
          es bis vor wenigen Jahren nur &uuml;ber die Mittelwellen
          Wiederau 783 kHz und Wachenbrunn 882 kHz zu empfangen
          war. Vorbereitet wird derzeit die Inbetriebnahme weiterer
          Sender f&uuml;r MDR Info in Lobenstein (101,8 MHz),
          P&ouml;&szlig;neck (101,6 MHz) und Schmalkalden (100,0
          MHz).</P>
          <HR>

          <P><FONT color="#000080" size=
          "5"><B>Langwelle</B></FONT></P>

          <H3><B>Allgemeines</B></H3>

          <P>Die Langwelle ist der Frequenzbereich, in dem die
          ersten Rundfunk&uuml;bertragungen &uuml;berhaupt gemacht
          wurden. Er liegt noch unter dem bekannteren
          Mittelwellenbereich. Der Langwellenbereich erstreckt sich
          von 153kHz bis 279 kHz. Dieser Bereich wird wie die
          Mittelwelle unterteilt in Frequenzen im 9kHz Abstand,
          weshalb es also 15 Kan&auml;le auf LW gibt, auf denen
          gesendet werden kann. Lediglich rund um 180kHz wird von
          dem 9kHz Raster abgweichen. Da hier eigentlich 2
          Langwellensender auf der gleichen Frequenz w&auml;ren und
          sich gegenseitig erheblich st&ouml;ren w&uuml;rden, hat
          man den einen (Oranienburg, derzeit DeutschlandRadio
          Berlin) auf 177kHz verlagert, den anderen auf 183 kHz
          (Saarlouis, Europe 1), weshalb sich beide Sender nur noch
          gering st&ouml;ren. Alle Empf&auml;nger mit digitaler
          Frequenzabstimmung lassen sich aus diesem Grunde im 3kHz
          Raster statt im 9kHz Raster abstimmen.</P>

          <H3><B>Das Spektrum der Rundfunkwellen</B></H3>

          <P><B>Reichweite der Langwelle</B><BR>
           Wie auf der Mittelwelle, breitet sich das Signal der
          Langwelle auf zweierlei Art und Weise aus, &uuml;ber die
          Bodenwelle und die Raumwelle Je kleiner die Frequenz ist,
          desto weiter reicht die Bodenwelle. Da die Frequenzen der
          Langwelle im Vergleich zur Mittelwelle sehr viel
          niedriger sind, erreichen Langwellensender &uuml;ber die
          Bodenwelle nicht nur eine etwas gr&ouml;&szlig;ere
          Reichweite als UKW-Sender, sondern sind in einem Radius
          von 500-2000km zu empfangen. Der Empfang eines
          Langwellensenders ist bei entsprechender Leistung also in
          ganz Europa m&ouml;glich, auch tags&uuml;ber. Nachts
          kommt auch auf der Langwelle die Raumwelle als
          &Uuml;bertragungsweg hinzu, allerdings spielt dieser in
          Punkto Erh&ouml;hung der Reichweite kaum mehr eine
          Rolle.</P>

          <P><B>Amplitudenmodulation (AM)</B><BR>
           Oftmals wird die Langwelle (zusammen mit der
          Mittelwelle) auch als AM bezeichnet. AM steht f&uuml;r
          Amplitudenmodulation und bezeichnet die Art und Weise,
          wie die zu &uuml;bertragenden T&ouml;ne auf die sog.
          Tr&auml;gerfrequenz, also auf die Frequenz, die man dann
          am Empf&auml;nger einstellen muss, aufmodulie Zukunft der
          Langwelle.</P>

          <P>Der bessere Klang von UKW hat in den letzten
          Jahrzehnten dazu gef&uuml;hrt, dass zumindest hierzulande
          die Mittelwelle ein Schattendasein f&uuml;hrt. Die
          Langwelle, die bedingt durch ihren relativ kleinen
          Frequenzbereich nur wenigen Sendern Platz bietet, fehlt
          in sehr vielen modernen Empf&auml;ngern sogar komplett.
          Allerdings ist die Langwelle aufgrund der sehr hohen
          Reichweite der Bodenwelle auch tags&uuml;ber f&uuml;r
          einen fl&auml;chendeckenden deutschlandweiten Empfang
          geeignet. So kann man das Programm des Deutschlandfunks
          auf 153 kHz und 207 kHz in ganz Deutschland gut
          empfangen. Als Alternative zu der sehr l&uuml;ckenhaften
          UKW-Versorgung des DLFs ist die LW hier doch noch sehr
          wichtig. Gerade auch im Urlaub kann man hier auch
          tags&uuml;ber Sender aus Deutschland empfangen. Dies ist
          sonst nur auf der Kurzwelle oder via Satellit
          m&ouml;glich, sowie nur abends und nachts auf der
          Mittelwelle. Dennoch hat die Langwelle heute eher noch
          weniger Bedeutung als die Mittelwelle.</P>

          <P>Wie auch im Mittelwellenbereich, so scheint sich auch
          f&uuml;r die Langwelle ein Revival anzubahnen. Vor kurzem
          wurde in Sachsen-Anhalt eine Langwellenfrequenz neu
          vergeben an eine neue Radiostation, die ein Programm
          speziell f&uuml;r Leute anbieten will, die viel unterwegs
          sind und das in verschiedensten Teilen Europas. Dies
          l&auml;sst sich auf Langwelle mit nur einer Frequenz
          bewerkstelligen, was auf UKW ein Ding der
          Unm&ouml;glichkeit ist. Wie auch auf Mittelwelle,
          erwarten die Anbieter f&uuml;r die kommenden Jahre, durch
          die Digitalisierung der AM-Bereich eine h&ouml;here
          Klangqualit&auml;t anbieten zu k&ouml;nnen und damit eine
          gr&ouml;&szlig;ere Attraktivit&auml;t zu erreichen.</P>

          <P><B>Wo finde ich eine Frequenzliste aller
          LW-Sender?</B><BR>
           In den UKW-Sendertabellen der jeweiligen L&auml;nder und
          Bundesl&auml;nder sind neben allen UKWFrequenzen auch die
          LW-Frequenzen enthalten, soweit im jeweiligen Lande
          befindlich. Da die UKW-Tabellen nur den deutschsprachigen
          Raum und Umgebung abdecken, fehlen hier einige sehr
          wichtige Langwellensender, au&szlig;erdem sind die
          Angaben nat&uuml;rlich sehr verteilt.</P>

          <P>Eine komplette und &uuml;bersichtlichere Auflistung
          finden Sie unter http://go.to/emwg, dem European
          Mediumwave Guide, der auch Langwellenfrequenzen
          enth&auml;lt.</P>
          <HR>

          <H3><B>Optisches Mikrofon ohne elektrische
          Leiter</B></H3>

          <P>Das Fraunhofer Institut f&uuml;r Angewandte Optik und
          Feinmechanik (IOF) hat gemeinsam mit dem
          Soundspezialisten Sennheiser electronic ein optisches
          Mikrofon entwickelt. Der Mikrofonkopf kommt dabei ohne
          elektrische Leiter aus. Wie bei einem herk&ouml;mmlichen
          Mikrofon nimmt eine Membran den Schall auf, die
          Schwingungen werden jedoch optisch detektiert. Das
          Prinzip dahinter ist die konfokale Abbildung bei der
          Licht aus einer Leuchtdiode &uuml;ber eine Glasfaser
          durch ein Linsen-Array geschickt wird. Dieses Feld
          optischer Elemente verteilt und fokussiert den Strahl auf
          eine verspiegelte Membran. Das reflektierte Licht gelangt
          durch Linsen in eine Empf&auml;ngerglasfaser. Sobald die
          Membran schwingt, ver&auml;ndert sich das Lichtsignal.
          Ein entfernter Photodetektor wandelt es
          anschlie&szlig;end in elektrische Spannung um. Der
          Vorteil des optischen Mikrofons ist seine
          Unempfindlichkeit gegen extreme Magnetfelder, wie
          beispielsweise in Computertomographen. Der Patient hat
          die M&ouml;glichkeit auch w&auml;hrend der Untersuchung
          aus der R&ouml;hre zu kommunizieren. Au&szlig;erdem kann
          es in explosionsgef&auml;hrdeten oder feuchten
          R&auml;umen eingesetzt und oder bei
          schwei&szlig;treibenden Auftritten von Musikern oder
          S&auml;ngern genutzt werden.</P>
          <HR>

          <H3><B>Radiowerbung erobert China</B></H3>

          <P>Radiowerbung ist in China stark im Kommen.
          Begr&uuml;nden l&auml;sst sich das steigende Interesse an
          Radiowerbung an den hohen Kosten der Werbung im TV:
          Einschaltungen kosten dort um bis zu 15 Mal mehr als im
          Radio, von den h&ouml;heren Produktionskosten einmal
          abgesehen. 14,5 Mrd. Dollar betragen die Werbeausgaben in
          China j&auml;hrlich, rund zwei Drittel davon
          flie&szlig;en in Fernsehwerbung, nur zwei Prozent davon
          in Radiowerbung. In den n&auml;chsten f&uuml;nf Jahren
          sollen der Prozentanteil auf bis zu zehn gesteigert
          werden, berichtet das Wall Street Journal (WSJ) heute.
          Konkrete Zahlen &uuml;ber den Radiokonsum in China gibt
          es kaum, was viele Unternehmen davon abh&auml;lt, im
          Radio zu werben. Das Marktforschungsunternehmen CSM
          t&auml;tigt seit dem Jahr 2002 drei Mal j&auml;hrlich in
          vier St&auml;dten Umfragen zum Thema Radio. CSM kam zu
          dem Ergebnis, dass der durchschnittliche H&ouml;rer
          t&auml;glich mehr als eine Stunde Radio h&ouml;rt und
          dies vor allem zu Hause w&auml;hrend der Hausaufgaben
          oder Hausarbeit tut. AC Nielsen will damit beginnen, die
          Haushalte, die bereits in den Fernseh-Erfassungen
          teilnehmen, auch zum Thema Radio zu befragen, um genauere
          Angaben zu erhalten und so Werber zu gewinnen. Wenn
          Chinesen Radio h&ouml;ren, sind es vor allem Nachrichten.
          Unterhaltungs- und Kulturprogramme sind nur in reicheren
          Regionen popul&auml;r. Talk Radio wird meist im
          vornhinein aufgezeichnet, um den Inhalt besser
          kontrollieren zu k&ouml;nnen. Fr&uuml;her diente das
          Radio in China ausschlie&szlig;lich als Propagandamittel.
          Um Werbung publikumsbezogener gestalten zu k&ouml;nnen,
          sollen speziellere Radioformate entstehen, wie zum
          Beispiel reine Jazz- oder Popsender. Profitieren
          k&ouml;nnte der Radio-Werbemarkt auch durch den
          erh&ouml;hten Verkauf von Autos. Menschen sollen im Auto
          verst&auml;rkt Radio h&ouml;ren. 2003 wurden 4,1 Mio.
          Autos verkauft, bis zum Jahr 2009 sollen es 10,4 Mio.
          sein. Der Erfolg dessen ist jedoch nicht garantiert, in
          Vergleichen der Jahre 2002 und 2003 hat die Anzahl der
          Radioh&ouml;rer dadurch nicht zugenommen.</P>
          <HR>

          <P><FONT color="#000080" size=
          "5"><B>Kurzwelle</B></FONT></P>

          <H3><B>Allgemeines</B></H3>

          <P>Die Kurzwelle ist wohl von allen Bereichen die
          interessanteste, k&ouml;nnen hier doch den ganzen Tag
          Sender aus der ganzen Welt empfangen werden. Was
          unterscheidet die Kurzwelle von den anderen
          Wellenbereichen, dass man hier zu jeder Zeit fast die
          ganze Welt empfangen kann?</P>

          <P><B>Bodenwelle und Raumwelle</B><BR>
           Von der Mittelwelle ist bekannt, dass man dort
          tags&uuml;ber wie auf UKW nur nahegelegene Stationen
          empfangen kann, nachts jedoch Sender aus ganz Europa. Der
          Grund darin liegt, dass zu der sog. Bodenwelle, die sich
          geradlinig ausbreitet und nur in einigen 100 km
          Entfernung empfangbar ist, abends und nachts die sog.
          Raumwelle hinzu kommt. Diese erm&ouml;glicht den Empfang
          in sehr viel weiteren Entfernungen. M&ouml;glich macht
          dies die Reflexion der Signale an der Ionosph&auml;re,
          einer Schicht um die Erde. Die Ionosph&auml;re ist nun
          gerade so beschaffen, dass im Bereich unter 3000 kHz
          solche Reflexionen nur w&auml;hrend der Dunkelheit
          vorkommen, w&auml;hrend sie im Kurzwellenbereich von 3000
          MHz aufw&auml;rts bis ca. 30 MHz st&auml;ndig, also auch
          tags&uuml;ber, vorkommen k&ouml;nnen. Diesen Sachverhalt
          nutzt man aus, um auf Kurzwelle mit einem Programm die
          ganze Welt versorgen zu k&ouml;nnen. Aus diesem Grunde
          empf&auml;ngt man auf der Kurzwelle vor allem
          Auslandsdienste der jeweiligen L&auml;nder, die von dort
          aus mit Sendungen in verschiedensten Sprachen &uuml;ber
          das jeweilige Land informieren. Da die Frequenzen im
          Vergleich zur Mittelwelle h&ouml;her sind, ist die
          Reichweite der Bodenwelle nicht ganz so gro&szlig; wie
          dort, sie ist vergleichbar mit der Reichweite von UKW
          Sendern. Daf&uuml;r hat man auf KW ja auch tags&uuml;ber
          bereits die Raumwelle, die einen Empfang erm&ouml;glicht.
          Jedoch kann man diese erst in einem gewissen
          Mindestabstand zum Sender empfangen, schlie&szlig;lich
          muss diese ja zun&auml;chst in der Ionosph&auml;re
          reflektiert werden und wieder zur Erde gelangen. Meist
          kann man die Raumwelle erst ab ca. 150 km empfangen,
          w&auml;hrend die Bodenwelle durchaus bereits ab 50km
          nicht mehr empfangbar sein kann. Den Bereich, in dem
          weder Boden- noch Raumwelle zu empfangen ist, nennt man
          Tote Zone.</P>

          <P><B>Empfang Kurzwelle</B><BR>
           Die Abbildung zeigt beide Verbreitungsarten. Links
          Empfang durch die Raumwelle, rechts direkter Empfang
          &uuml;ber die Bodenwelle. In der Mitte kein Empfang, da
          in Toter Zone.</P>

          <P><B>Die Kurzwellenb&auml;nder</B><BR>
           Der Kurzwellenbereich erstreckt sich von 3000kHz bis 30
          MHz. Dieser riesige Bereich ist allerdings nicht komplett
          f&uuml;r Rundfunk erschlossen, genutzt wird nur ein Teil.
          Amateurfunk und andere Funkdienste nutzen ebenfalls
          diesen Bereich. Der Rundfunk darf in mehreren
          festgelegten B&auml;ndern senden, von denen es derzeit 10
          gibt. Diese 10 B&auml;nder haben alle eine
          unterschiedliche Charakteristik, was die Ausbreitung je
          nach Tageszeit betrifft. Aus diesem Grunde wechseln die
          Anbieter z.T. die Frequenzen mehrmals t&auml;glich, um
          f&uuml;r das angepeilte Zielgebiet das optimale
          herauszuholen. Meist gibt es mehrere
          Alternativfrequenzen, die den Empfang auf zumindest einer
          Frequenz erm&ouml;glichen sollen, bzw. dann alle
          verschiedene Gebiete der Erde abdecken. Desweiteren ist
          die Ausbreitung der Raumwelle &uuml;ber die
          Ionosph&auml;re auch von Monat zu Monat unterschiedlich,
          sodass es regelm&auml;&szlig;ig (2-4x j&auml;hrlich) zu
          Umstellungen im Frequenzplan der einzelnen Stationen
          kommt.</P>

          <P><B>Was kann ich wo empfangen?</B><BR>
           Welche Station nun auf welcher Frequenz sendet und
          hierzulande wann empfangbar ist, w&uuml;rde den Rahmen
          dieser Internetseite sprengen, daf&uuml;r gibt es dicke
          B&uuml;cher wie z.B. das Buch "Sender &amp; Frequenzen"
          vom Siebel-Verlag, das g&auml;ngigste Werk aus diesem
          Bereich. Dieses wird j&auml;hrlich neu herausgebracht und
          liefert zudem w&auml;hrend des Jahres Updates aus, um die
          Daten auf dem aktuellen Stand zu behalten. Im Internet
          gibt es sehr viele Seiten, die sich mit dem
          Kurzwellenbereich besch&auml;ftigen, hier lohnt sich der
          Einsatz einer Suchmaschine wie Google. Aktuelle
          Frequenzlisten deutsch-, englisch-,
          franz&ouml;sischsprachiger u.a. Programme finden Sie z.B.
          unter diesem Link bei der ADDX (Assoziation
          deutschsprachiger Kurzwellenh&ouml;rer). Eine Liste
          deutschsprachiger Programme auf Kurzwelle sowie aktuelle
          Nachrichten finden Sie auch bei der AGDX, der
          Arbeitsgemeinschaft DX.</P>

          <P><B>Amplitudenmodulation</B><BR>
           Wie auf Mittelwelle, so wird auch auf Kurzwelle
          amplitudenmoduliert gesendet. . F&uuml;r die
          Klangqualit&auml;t bedeutet das, dass Kurzwellensendungen
          &auml;hnlich klingen wie die auf Mittelwelle. D.h, sie
          sind in Mono, klingen relativ dumpf und sind
          St&ouml;rungen relativ stark ausgesetzt. Bei Kurzwelle
          kommen noch die durch die st&auml;ndig sich &auml;ndernde
          Ionosph&auml;re st&auml;ndig wechselnden
          Empfangsbedingungen hinzu, was in manchen F&auml;llen zu
          schwankender Signalst&auml;rke f&uuml;hrt. Allerdings ist
          die Kurzwelle der einzige Bereich, in dem man mit nur
          einem Sender theoretisch nahezu um die ganze Welt
          kommt.</P>

          <P><B>Die Zukunft der Kurzwelle</B><BR>
           Auch wenn die Kurzwelle hierzulande nicht mehr die
          Bedeutung hat, die sie fr&uuml;her hatte, so kann sie
          interessierten H&ouml;rern immer noch als interessante
          Informationsquelle dienen. Viele L&auml;nder der Erde
          bieten Fremdsprachensendungen in deutscher Sprache
          &uuml;ber ihre Kurzwellensender an, die man sogar
          hierzulande noch empfangen kann. Ganz egal, ob Radio
          China International, die Stimme Ru&szlig;lands oder der
          Polnische Rundfunk. Alle wollen &uuml;ber ihr Land
          informieren und tun dies meistens aus ihrer Sichtweise,
          die man in den hiesigen Medien nat&uuml;rlich nicht
          pr&auml;sentiert bekommt. Aber auch Kulturelles und
          Interessantes &uuml;ber das jeweilige Land kann man hier
          h&ouml;ren. Es lohnt sich also, hin und wieder die
          Kurzwelle einzuschalten. Wie auch bei Mittel- und
          Langwelle, so ist auch bei der Kurzwelle die
          Digitalisierung geplant. Diese hat den Vorteil, dass dann
          mit erheblich besserer Klangqualit&auml;t gesendet werden
          kann. Die M&ouml;glichkeiten, die die Kurzwelle dann mit
          UKW-nahem Mono-Klang den Programmanbietern bieten
          k&ouml;nnte, sind kaum absehbar. Sollte die Kurzwelle
          tats&auml;chlich durch die Digitalisierung wieder
          attraktiver werden, so k&ouml;nnten hier viele neue
          Programme ihre Heimat finden und mit einer Frequenz eine
          riesige Fl&auml;che versorgen. Insgesamt kann also die
          digitalisierte Lang-, Mittel- und Kurzwelle &uuml;ber
          kurz oder lang wieder eine ernstzunehmende Alternative zu
          UKW werden.</P>
          <HR>

          <P><FONT color="#000080" size=
          "5"><B>Mittelwelle</B></FONT></P>

          <H3><B>Allgemeines</B></H3>

          <P>Die Mittelwelle ist vielen von alten R&ouml;hrenradios
          bekannt, auf deren Skala man Programme aus ganz Europa
          finden konnte. In der Zeit, in der es noch kein UKW gab,
          war dies neben der Langwelle und der Kurzwelle der
          einzige Verbreitungsweg f&uuml;r Radioprogramme. Zur
          damaligen Zeit hatte die Mittelwelle also gro&szlig;e
          Bedeutung, w&auml;hrend sie heute kaum mehr geh&ouml;rt
          wird. Der Mittelwellenbereich erstreckt sich von 531kHz
          bis 1611 kHz. Dieser Bereich wird unterteilt in
          Frequenzen im 9kHz Abstand, weshalb es also 121
          Kan&auml;le auf MW gibt, auf denen gesendet werden kann.
          In Amerika ist die Mittelwelle im Abstand von 10kHz
          belegt und geht bis ca. 1800 MHz. F&uuml;r
          gew&ouml;hnlich kann man im Bereich oberhalb 1600 MHz so
          manchen Piratensender h&ouml;ren. Da neue Empf&auml;nger
          mit digital einstellbarer Frequenz abrupt bei 1611 MHz
          enden, ist der Empfang dieser Piratensender meist nur mit
          alten Kofferradios mit analoger Abstimmung oder
          speziellen Weltempf&auml;ngern m&ouml;glich.</P>

          <H3><B>Das Spektrum der Rundfunkwellen</B></H3>

          <P><B>Bodenwelle und Raumwelle</B><BR>
           Charakteristisch ist f&uuml;r den Mittelwellenbereich,
          dass man tags&uuml;ber nur wenige Stationen aus der
          Umgebung empfangen kann, jedoch ab der D&auml;mmerung
          sehr viele Sender im gesamten Frequenzbereich. Dies liegt
          daran, dass sich die Signale im Mittelwellenbereich auf
          zweierlei Art und Weise ausbreiten k&ouml;nnen:</P>

          <P><B>Empfang direkt</B><BR>
           Zum einen geradlinig, &auml;hnlich wie man es von UKW
          kennt, d.h. je nachdem, wie stark gesendet wird,
          betr&auml;gt die Reichweite zwischen wenigen Kilometern
          oder mehreren 100 km. Diese Welle nennt man Bodenwelle.
          Sie tr&auml;gt also dazu bei, dass Sie tags&uuml;ber ein
          paar wenige Mittelwellensender aus Ihrer n&auml;heren
          Umgebung empfangen k&ouml;nnen. Je kleiner die Frequenz,
          desto weiter reicht die Bodenwelle, weshalb die
          Reichweite von Mittelwellensendern im Allgemeinen etwas
          weiter als die vergleichbarer UKW-Sender ist.</P>

          <P><B>Empfang indirekt</B><BR>
           Das ausgesendete Signal strahlt nat&uuml;rlich ebenso
          Richtung Himmel. Ab der D&auml;mmerung ist eine Schicht,
          die sog. Ionosph&auml;re f&auml;hig, Wellen im
          Mittelwellenbereich zu reflektieren. Aus diesem Grunde
          kann man also abends und nachts sehr viel mehr Sender
          empfangen, da man nicht mehr nur auf das direkte Signal
          angewiesen ist, sondern auch das reflektierte Signal
          empfangen kann. So k&ouml;nnen sehr viel gr&ouml;ssere
          Entfernungen &uuml;berbr&uuml;ckt werden, es ist
          m&ouml;glich, zus&auml;tzlich zu den nahegelegenen
          Sendern, Sender aus ganz Europa zu empfangen. Diese Welle
          nennt man die Raumwelle.</P>

          <P><B>Amplitudenmodulation (AM)</B><BR>
           Oftmals wird die Mittelwelle (zusammen mit der
          Langwelle) auch als AM bezeichnet. AM steht f&uuml;r
          Amplitudenmodulation und bezeichnet die Art und Weise,
          wie die zu &uuml;bertragenden T&ouml;ne auf die sog.
          Tr&auml;gerfrequenz, also auf die Frequenz, die man dann
          am Empf&auml;nger einstellen muss, aufmoduliert wird.</P>

          <P><B>Tr&auml;gerwelle</B><BR>
           F&uuml;r jeden Punkt wird also die Amplitude (der Wert
          in y-Richtung) der Grundschwingung der
          Tr&auml;gerfrequenz 1) mit dem Betrag der Amplitude des
          zu &uuml;bertragenden Signals 2) multipliziert, das
          ergibt dann die fertige Welle 3).</P>

          <P><B>Signalwelle</B><BR>
           Je lauter der zu &uuml;bertragende Ton, desto
          gr&ouml;&szlig;er also die Amplitude der resultierenden
          Welle. Je h&ouml;her der zu &uuml;bertragende Ton, desto
          gr&ouml;&szlig;er die n&ouml;tige Bandbreite. D.h., die
          &uuml;bertragbare Maximalfrequenz wird durch die erlaubte
          Bandbreite des AM-Signals eingeschr&auml;nkt.</P>

          <P><B>AM modulierte Welle</B><BR>
           Es gibt noch ein Sonderform der Amplitudenmodulation,
          die EinseitenbandAmplitudenmodulation (SSB). Hier spart
          man sich einfach einen der beiden Teile der Welle (oben
          oder unten). Aus diesem Grunde braucht man weniger
          Amplitude und bringt in der selben Bandbreite h&ouml;here
          Frequenzen des Signals unter. Allerdings ben&ouml;tigt
          man hierf&uuml;r etwas aufwendigere Empf&auml;nger, die
          aus diesem "halben" Signal wieder das urspr&uuml;ngliche
          rekonstruieren k&ouml;nnen.</P>

          <P>Das menschliche Ohr kann jedoch Schall bis zu 20kHz
          h&ouml;ren. Fehlen Frequenzen unterhalb von 16kHz,
          &auml;ussert sich dies in einem dumpferen Klang. Die
          Klangqualit&auml;t der Mittelwelle ist nun gegen&uuml;ber
          UKW um einiges schlechter. Dies liegt daran, dass der
          Kanalabstand bei 9kHz liegt. Die Bandbreite ist
          hierzulande aus diesem Grunde auf 4,5 kHz begrenzt. D.h,
          die maximal &uuml;bertragbare Frequenz liegt bei 4,5 kHz.
          Deshalb fehlen bei der Mittelwelle die H&ouml;hen.</P>

          <P>Ein weiteres Problem, das die Amplitudenmodulation mit
          sich bringt, ist die hohe St&ouml;ranf&auml;lligkeit.
          St&ouml;rungen haben fast immer eine feste Frequenz, aber
          meist eine hohe Amplitude. Da die Information &uuml;ber
          das Signal &uuml;ber die Amplitude "kodiert" ist, ergeben
          sich nat&uuml;rlich aus den hohen Amplituden der
          St&ouml;rfrequenzen ein hoher St&ouml;rpegel, der sich in
          Knacksern, Rauschen oder Brummen &auml;u&szlig;ert.
          Schwierigkeiten bereiten v.a. Halogenlampen, aber auch
          bei Autos der Motor, die L&uuml;ftung oder die
          Bordelektronik.</P>

          <P><B>Stereo auf Mittelwelle?</B><BR>
           Hierzulande ist die Mittelwelle nur in monophoner
          Qualit&auml;t zu empfangen, Stereo ist bei der ohnehin
          engen Bandbreite undenkbar. Allerdings wird in Amerika
          und auch bei einigen wenigen Stationen in Europa in
          Stereo gesendet. Mittels spezieller Verfahren kann man
          hier trotz der niedrigen Bandbreite ein Stereosignal
          unterbringen. In Amerika ist dies einfacher m&ouml;glich,
          da dort mit 10kHz ein breiteres Kanalraster existiert.
          Allerdings beeintr&auml;chtigt die Stereoausstrahlung
          nat&uuml;rlich die Klangqualit&auml;t und hat sich nicht
          verbreitet durchgesetzt, weshalb es kaum Empf&auml;nger
          gibt, die Stereosendungen auf Mittelwelle auch in Stereo
          empfangen k&ouml;nnen. Weitere Infos zu AM-Stereo gibt es
          unter http://users.hfx.eastlink.ca/~amstereo/.</P>

          <P>Zukunft der Mittelwelle Der bessere Klang von UKW hat
          in den letzten Jahrzehnten dazu gef&uuml;hrt, dass
          zumindest hierzulande die Mittelwelle ein Schattendasein
          f&uuml;hrt. Kaum jemand kennt mehr diesen Bereich. Gerade
          in Deutschland gab es bis vor Kurzem auf Mittelwelle nur
          die selben Programme wie auf UKW. Viele der ARD-Anstalten
          fuhren die Sendeleistung zur&uuml;ck, um Strom zu sparen,
          wodurch die Mittelwellen immer schlechter zu empfangen
          wurden. Kein Grund also f&uuml;r die meisten Leute, auf
          Mittelwelle umzuschalten, wenn man das Programm sowieso
          in besserer Qualit&auml;t auf UKW empfangen kann. Einzig
          bei einem Auslandsaufenthalt greifen so manche auf die
          Mittelwelle zur&uuml;ck, um zumindest abends und nachts
          ihre Sender aus der Heimat zu h&ouml;ren. Allerdings
          scheint momentan ein kleiner Aufschwung im Kommen zu
          sein. Das besser klingende UKW-Band ist mehr als voll,
          neue Sender sind kaum mehr m&ouml;glich. Anders auf der
          Mittelwelle: hier sind noch Kapazit&auml;ten frei. So
          wurden in letzter Zeit einige brachliegende
          Mittelwellenfrequenzen neu vergeben, meist an den
          Anbieter "Mega Radio". Dieser verbreitet auf der
          Mittelwelle ein bundesweites Jugendradio. Mit einer
          gro&szlig; angelegten Werbeaktion und Kooperation z.B.
          mit der beliebten Fastfood Kette McDonalds will der
          Sender trotz der derzeit eher ung&uuml;nstigen
          Mittelwelle bekannt werden. Ausserdem wird wohl darauf
          spekuliert, dass mit der Digitalisierung der bisherigen
          AM-Bereiche und der daraus resultierenden h&ouml;heren
          Klangqualit&auml;t die Mittelwelle wieder sehr viel
          beliebter wird. Auf der Mittelwelle 531 kHz finden
          derzeit digitale Testsendungen im DRMVerfahren statt.
          Genaueres zur geplanten Digitalisierung unter dem
          Stichwort DRM.</P>

          <P><B>Wo finde ich eine Frequenzliste aller
          MW-Sender?</B><BR>
           In den UKW-Sendertabellen der jeweiligen L&auml;nder und
          Bundesl&auml;nder sind neben allen UKW-Frequenzen auch
          die MW-Frequenzen enthalten, soweit im jeweiligen Lande
          befindlich. Da die UKW-Tabellen nur den deutschsprachigen
          Raum und Umgebung abdecken, fehlen hier einige sehr
          wichtige Mittelwellensender, ausserdem sind die Angaben
          nat&uuml;rlich sehr verteilt.</P>

          <P>Eine komplette und &uuml;bersichtlichere Auflistung
          finden Sie unter http://go.to/emwg, dem European
          Mediumwave Guide.</P>
          <HR>

          <H3><B>Power von der Eastside</B></H3>

          <P>Mit einem anspruchsvollen, nicht immer linientreuen
          Programm erf&uuml;llte DT64 in der DDR eine wichtige
          Funktion als Sprachrohr der Jugendlichen. Nach dem Fall
          der Mauer drohte dem Jugendradio das Aus und es begann
          ein jahrelanger Kampf ums &Uuml;berleben. Trotz massiver
          Proteste der DT64-H&ouml;rer scheiterte im Juni 1992 die
          Vision eines kritischen Jugendsenders f&uuml;r
          Ostdeutschland. Aufregend waren die Monate nach dem 9.
          November 1989, als um uns herum Mauern fielen, die
          Freiheit Einzug hielt und Vertrautes zusammenbrach.
          Innerhalb weniger Monate existierte der Staat nicht mehr,
          in dem ich geboren wurde, bekamen Stadt, Schule und
          Stra&szlig;en neue Namen oder die alten zur&uuml;ck, war
          das vorher Richtige nun falsch und umgekehrt. Zum
          Mittagessen im Schulkeller ging keiner mehr. Pommes mit
          Mayo als cooler Ersatz. Idealistisch waren wir und voller
          Pl&auml;ne. Endlich weg von DDR-Mief, stinklangweiligen
          FDJ-Nachmittagen im Blauhemd und verordneten
          Betriebsbesichtigungen. Wir lie&szlig;en uns den Wind der
          Freiheit um die Nase wehen und begriffen doch bald,
          da&szlig; wir die Ost-Identit&auml;t zu verteidigen
          h&auml;tten, wenn die Gleichung unserer Eltern, Freiheit
          gleich D-Mark plus Neuwagen plus Reise nach Rimini, nicht
          aufgehen sollte. Den Montagsdemos, den
          Endlos-Diskussionen im Unterricht, den Artikeln in der
          Sch&uuml;lerzeitung folgte eine gewisse Apathie. Das Rad
          der Geschichte hatte sich zu schnell gedreht. Wir waren
          wendem&uuml;de. Der Protest stagnierte. Dann, am 7.
          September 1990, lief auf zw&ouml;lf der 18 Frequenzen von
          Jugendradio DT64 pl&ouml;tzlich das Programm von RIAS 1.
          Eine Welle der Emp&ouml;rung durchkochte ost-deutsche
          Klassenzimmer und Universit&auml;ten. Schon am
          n&auml;chsten Tag war DT64 landesweit wieder auf
          Sendung.</P>

          <H3><B>Sprachrohr der Ost-Jugendlichen</B></H3>

          <P>Mir ging es damals wohl wie vielen. Jugendradio DT64
          habe ich erst als Sprachrohr begriffen, als es
          abgeschaltet werden sollte. Die Solidarit&auml;t der
          ostdeutschen Jugendlichen mit dem Sender war enorm. Mit
          spektakul&auml;ren Aktionen, Mahnwachen in eiskalten
          Dezembern&auml;chten, Unterschriftensammlungen mit 80.000
          Namen, Protesten im Bundestag, sollte das
          kritisch-kompetente, spritzige Programm des Jugendradios
          gerettet werden. Schlie&szlig;lich bescheinigte sogar
          DFF(1) - Abwickler Rudolf M&uuml;hlfenzl (CSU) dem
          Jugendradio einen "Sympathie-Effekt".(2) Gen&uuml;tzt hat
          es nichts. Am 31.12.1991 um 23.58 Uhr legte Moderatorin
          Marion Brasch die Blankenfelder Boogie-Band auf: "Wir
          spielen keinen Ton mehr, aber wir kommen wieder,
          irgendwann...".(3) Der Rest war Schweigen. Und
          Erinnerung. Doch wie kam es zu einer derart
          bedingungslosen Identifikation der Ost-Jugendlichen mit
          DT64, dem ehemaligen "H&auml;tschelkind Honeckers", in
          einer Zeit, in der Rebellion in den K&ouml;pfen
          l&auml;ngst Hartgeldgeklimper in den Taschen Platz
          gemacht hatte? Geboren wurde DT64 in Berlin. 1964 sendete
          der DDR-Rundfunk ein Serviceprogramm f&uuml;r die
          500.000, die vom Dar&szlig; bis zum Erzgebirge in die
          Hauptstadt gekommen waren, zum "Deutschlandtreffen von
          1964". Das Treffen war nach 99 Stunden vor&uuml;ber, der
          Name blieb und wurde Programm, anfangs mit einer
          w&ouml;chentlichen Sendezeit von 10 Stunden, 1990 erst
          mit einem 24-Sunden-Programm. Mu&szlig; man in der DDR
          gelebt haben, um zu verstehen, was Jugendradio DT64 den
          Jugendlichen bot? Im Rundfunk der DDR herrschten strikte
          Prozentvorgaben: H&ouml;chstens 40 Prozent der im Radio
          gespielten Musik durfte im "nichtsozialistischen Ausland"
          entstanden sein, den Rest lieferten DDR-Bands. F&uuml;r
          uns war es eine Art Strategie, nicht auf J&ouml;rg
          Hindemiths "Bitte, bitte Hanni" angewiesen zu sein,
          sondern auch The Cure und Die Einst&uuml;rzenden
          Neubauten h&ouml;ren zu k&ouml;nnen. Man wollte mitreden,
          anerkannt sein.</P>

          <P>Gratwanderung zwischen Staatskonformit&auml;t und
          freiem Denken Aber ich greife vor. Denn schon 1965
          reglementierte Erich Honecker den Jugendsender, der
          "einseitig Beatmusik propagiere" und "die Fragen der
          allseitigen Bildung und des Wissens junger Menschen
          au&szlig;er Acht"(4) lasse. Im Zuge einer allgemeinen
          Versch&auml;rfung der staatlichen
          Kontrollma&szlig;nahmen, bei der u. a. Wolf Biermann
          ausgewiesen wurde, hatte "man" ein Auge auf den Sender,
          in einigen Kasernen und in so mancher Familie wurde DT64
          verboten. Jugendradio &uuml;berlebte nur durch seine
          immense Popularit&auml;t. Erst 1978 durfte ganze 30
          Minuten lang Udo Lindenberg gespielt werden. Ein
          H&ouml;rer erinnert sich. "... zwei- bis dreimal in der
          Woche bekam der geplagte DDR-Musikfan erstklassiges
          Material aufs Band... Bei Udo Lindenberg mu&szlig;te man
          schnell sein, denn es war immer eine Frage der Zeit, ob
          er noch mal gespielt werden durfte... Mal kam er, mal kam
          er nicht." (5) Trotzdem schafften die DT64-Macher es
          meistens, nicht abzust&uuml;rzen bei der Gratwanderung
          zwischen Staatskonformit&auml;t und freiem Denken. Sie
          boten Reibungsfl&auml;che und hingen am G&auml;ngelband;
          FDJ-Interessen sollten st&auml;rker im Programm
          ber&uuml;cksichtigt werden. DT64 infizierte sich mit der
          "DDR-Krankheit Schizophrenie".(6) Einerseits mu&szlig;ten
          Leistungen zu Ehren der Republik belobhudelt werden,
          andererseits dr&ouml;hnten die Rolling Stones und Frank
          Zappa aus den Boxen. Trotzdem sendete DT64 bis zum Ende
          der DDR ein anspruchsvoll-informatives Programm, nutzte
          geschickt Nischen aus. Progressive DT-Sendungen wie
          "Parocktikum" etablierten sich bald im Programm, auch
          wenn die Gestaltung oft vom Zufall abhing: "Immer wenn
          gerade mal ein Bekannter mit Reisem&ouml;glichkeiten Zeit
          und Lust hatte, in Westberlin einen Plattenladen
          aufzusuchen, war die Programmaussch&uuml;ttung
          ergiebig."(7) 1987 wurde Berlin 750 Jahre alt. DT64
          &uuml;bertrug Konzerte internationaler Gratulanten. Im
          gleichen Jahr zog der Sender um, in einen neuen
          Studiokomplex mit verbesserter Technik. 1988 konnten
          DDR-Jugendliche "Artists Against Apartheid" aus dem
          Wembley Stadium h&ouml;ren. Die DT64-Reporter
          kommentierten live aus London.</P>

          <H3><B>Produktive und streitbare Jahre</B></H3>

          <P>Im Sommer 1989 dann brach die untergr&uuml;ndig
          schwelende Unzufrieden-heit der DDR-B&uuml;rger hervor:
          Tausende &uuml;berquerten die
          ungarisch-&ouml;sterrei-chische Grenze.(8) Im September
          endlich verfa&szlig;ten Mitglieder des Komitees f&uuml;r
          Unterhaltungskunst eine Resolution, die die
          "unertr&auml;gliche Ignoranz der Partei- und
          Staatsf&uuml;hrung"(9) anprangerte. Der Stein war
          l&auml;ngst ins Rollen gekommen, der den "real
          existierenden Sozialismus" zerschlagen sollte, auch wenn
          das Unterzeichnen des Papiers noch einen Akt
          pers&ouml;nlicher Courage bedeutete. An Oktobermontagen
          demonstrierten Tausende. Am 8. November erkl&auml;rten
          &uuml;ber 100 Mitarbeiter von DT64 der bisherigen
          Chefredaktion das Mi&szlig;trauen. Ab 9. November gab es
          keine Mauer mehr. Am 11. November meldeten sich die
          "Morgenrock"-Reporter vom Ku'damm. Mit einem
          "hei&szlig;en Draht zu den H&ouml;rern" (10) und einem
          "kultivierten, politisch engagierten Programm" (11)
          begannen f&uuml;r DT64 produktive und streitbare Jahre.
          Die letzten seiner Geschichte. 1990 war f&uuml;r
          Jugendradio das Jahr der H&ouml;hen und Tiefen. Oben:
          Neun Tage mit Top 2000 D, der l&auml;ngsten Hitparade der
          Welt, mit Sinead O'Connors "Nothing compares to you" auf
          Platz 1 und "True love" von Bing Crosby auf dem 2000.
          Platz. Unten: Abschaltung am 7. September. Der amtierende
          H&ouml;rfunk-Intendant Christoph Singelnstein (SPD)
          brachte mit dem "schwarzen Freitag" DT64 in die
          Schlagzeilen. Was blieb, war tiefes Mi&szlig;trauen und
          ein Publicity-Erfolg f&uuml;r Jugendradio. Inzwischen
          stand fest, wie der Rundfunk der ehemaligen DDR zu
          rationalisieren sei. Auch DT64 brachte einen Vorschlag
          (12) ein: Drei Landesrundfunkanstalten, ein
          &uuml;berregionaler Nachrichten- und ein Jugendkanal
          sollten zuk&uuml;nftig senden. Explizit sah Jugendradio
          seinen Auftrag darin, den sensiblen Vorgang der
          deutsch-deutschen Einigung f&uuml;r die junge Generation
          als Chance eigener Zukunftsgestaltung mit den Erfahrungen
          in DDR und BRD zu f&ouml;rdern.(13) Im Verlaufe des
          Jahres allerdings wurde immer klarer, da&szlig; ein
          &uuml;berregionales Jugendradio keine Chance haben
          w&uuml;rde, auch nicht bei einer privaten
          Anbietergemeinschaft: "Immer wieder griff folgender
          Mechanismus: Kein Landesmediengesetz - keine
          Landesmedienanstalt - keine Lizenzierung m&ouml;glich -
          kein DT64."(14) Pro-DT64-Schreiben von Politikern und
          Medienexperten f&uuml;llten bald Archive. Die
          Medienpolitik jedoch versagte. Der DDR-H&ouml;rfunk galt
          als "&uuml;berdimensioniert und nicht mehr
          finanzierbar."(15) Mehr als zwei Sendeanstalten waren
          anscheinend nicht zu realisieren.</P>

          <H3><B>DT64 als Piratensender</B></H3>

          <P>Im Herbst 1991 horchten DT-H&ouml;rer erstaunt auf:
          "Wegen der Temperatu-ren unter dem Gefrierpunkt ist die
          Elbschiffahrt zum Erliegen gekom-men..." Im September?
          F&uuml;r einige Stunden sendete DT64 als Piratensen-der,
          simulierte mit einer Live-&Uuml;-Wagen-Aktion den
          31.12.1991 und die Probe des Ernstfalls. Mit dem
          l&auml;ngsten H&ouml;rspiel der deutschen
          Radioge-schichte wurde deutlich, was die Abschaltung des
          Senders bedeutete. Allein in Dresden gingen Zehntausende
          f&uuml;r DT64 auf die Stra&szlig;e, in Chemnitz entstand
          der Freundeskreis des Jugendradios, sogar
          Bundestagsmitglieder unterschrieben f&uuml;r den Sender,
          "Power von der Eastside" wurde Schlagwort. Der Kampf um
          DT64 war eine der phantasievollsten und energischsten
          B&uuml;rgerbewegungen in der ehemaligen DDR. Endlich
          erkl&auml;rte sich der MDR bereit, DT64 f&uuml;r ein
          halbes Jahr auf der alten Frequenz auszustrahlen. Am
          31.12.1991 verabschiedete sich DT64 von den H&ouml;rern
          in Mecklenburg-Vorpommern, denn der NDR war zu einer
          befristeten Ausstrahlung des Jugendprogramms nicht
          bereit.(16) In Sachsen, Sachsen-Anhalt und Th&uuml;ringen
          sendete DT64 nun als Jugendradio des MDR auf neuen
          UKW-Frequenzen weiter, auf den vier ORB-Frequenzen wurde
          das Programm t&auml;glich f&uuml;r drei Stunden f&uuml;r
          das ORB-Jugendmagazin Rockradio B(17) unterbrochen.</P>

          <H3><B>Das symbolische Ende von DT64</B></H3>

          <P>Im Juni 1992 entschied der MDR-Rundfunkrat das
          symbolische Ende von DT64: Vom 1. Juli bis 31. Dezember
          sollte Jugendradio auf Mittelwelle 1044 kHz senden. Noch
          wehrten sich die Mitarbeiter, denn es stand fest,
          da&szlig; "den Menschen in den neuen Bundesl&auml;ndern
          wiederum von au&szlig;en ein neuer Rundfunk
          verpa&szlig;t"(18) werden sollte. Am 18. Juni schallte
          f&uuml;r einen Tag Superradio 2000 durch den &Auml;ther,
          die Fiktion eines Privatsenders, Motto: "Gute Laune, wann
          immer Sie wollen." DT64 prophezeite, was die H&ouml;rer
          k&uuml;nftig auf der Frequenz des Senders zu erwarten
          h&auml;tten. Ab 1. Juli war die Sendequalit&auml;t auf
          Mittelwelle im MDR-Sendegebiet deprimierend, daf&uuml;r
          gingen Empfangsbest&auml;tigungen aus Irland, London,
          Prag, Tirol, Korsika, Belgien, Schweden und vom Balaton
          ein. Im November beschlo&szlig; der MDR, das
          Jugendprogramm ab Mitte 1993 &uuml;ber Satellit
          auszustrahlen, seit Januar 1993 produzierte das
          Jugendradio in Halle. Seit Sommer 1993 sendet der
          Jugendsender unter dem neuen Namen MDR-Sputnik. Die
          Vision des kritischen Jugendsenders f&uuml;r
          Ostdeutschland fiel der Medienpolitik im vereinten
          Deutschland zum Opfer.</P>
          <HR>

          <H3><B>Die Fernbedienung wird 50 Jahre</B></H3>

          <P>Kein Nutzer kann sich den Fernsehgenuss ohne sie
          vorstellen: die Fernbedienung. Sie ist Ausdrucksmittel
          f&uuml;r Bequemlichkeit, Flexibilit&auml;t und
          Spontanit&auml;t. Gerade zwei Jahre war das
          Nachkriegsfernsehen alt, da sorgten 1954 die ersten
          Kabel-Fernbedienungen f&uuml;r Aufsehen. Zun&auml;chst
          als Sch&ouml;pfung modernster Technik gefeiert, erhielten
          sie allerdings schon f&uuml;nf Jahre sp&auml;ter
          &uuml;berlegene Konkurrenz: 1959 eroberten drahtlose
          Ultraschall-Fernbedienungen das Terrain. Damals wurden
          Fernbedienungen noch separat verkauft. Erst 1975 kamen -
          so die Gesellschaft f&uuml;r Unterhaltungs- und
          Kommunikationselektronik (gfu) in einem R&uuml;ckblick -
          die ersten Fernsehger&auml;te, die serienm&auml;&szlig;ig
          mit Fernbedienungen ausgestattet waren, auf den Markt.
          Inzwischen z&auml;hlt die damalige, noch nicht sehr
          zuverl&auml;ssige Ultraschall-Technik zum alten Eisen.
          Sie wurde l&auml;ngst durch Infrarottechnik und durch
          Funk abgel&ouml;st. Aber auch die Aufgaben und die
          M&ouml;glichkeiten der Fernbedienung selbst haben sich
          ver&auml;ndert. Sie geh&ouml;rt heute nicht nur als
          Selbstverst&auml;ndlichkeit zu jedem station&auml;ren
          Audio- und Videoger&auml;t, sondern steuert als besonders
          hochwertige Variante auch alle Komponenten der
          gro&szlig;en Heimkinoanlage. Als bidirektionale
          Fernbedienung informiert sie den Nutzer auch bereits
          &uuml;ber den eingestellten Sender, die gerade
          angespielte CD und vieles mehr. Die gfu-Experten gehen
          davon aus, dass sich in den deutschen Haushalten aktuell
          weit mehr als 120 Millionen station&auml;re Ger&auml;te
          der Unterhaltungselektronik befinden: Fernseher,
          Videorecorder, HiFi-Anlagen und -Komponenten sowie
          DVD-Spieler und Festplatten-Receiver. &Auml;hnlich hoch
          d&uuml;rfte auch die Zahl der Fernbedienungen sein. Kein
          Wunder, dass sich die Forschungs- und
          Entwicklungsabteilungen der Industrie diesen Utensilien
          mit besonderer Aufmerksamkeit widmen. Das betrifft das
          Design ebenso wie die Bedienfreundlichkeit. Der Konsument
          verlangt beides und es ist durchaus keine Seltenheit,
          dass die Gestaltung der Fernbedienung den Ausschlag
          f&uuml;r den Kauf eines Fernsehger&auml;tes oder
          DVD-Spielers gibt.</P>
          <HR>

          <H3><B>Digitales Radio ver&auml;ndert den
          Rundfunk-Begriff</B></H3>

          <P>Durch weitreichende Zusatzangebote kann digitales
          Radio den Wert des Mediums deutlich erh&ouml;hen. Das
          betonten Entwickler und Anbieter digitaler
          Dienstleistungen auf dem Medientreffpunkt
          Mitteldeutschland. Bereits heute k&ouml;nne man mit
          entsprechenden Endger&auml;ten zahlreiche Services
          nutzen, zuk&uuml;nftige Anwendungen seien unendlich. Das
          digitale Radio werde perspektivisch den Begriff vom
          Rundfunk grundlegend ver&auml;ndern, sagte Michael
          Richter, Leiter der Gesch&auml;ftsstelle Digital Radio
          Mitteldeutschland. Vom reinen Abspielen von T&ouml;nen
          wandle sich das Radio zur zuverl&auml;ssigsten,
          g&uuml;nstigsten und &uuml;berall einsetzbaren
          Datenplattform. Schon heute seien Informationen wie
          Nachrichten und Verkehrsinformationen oder Zug- und
          Flugverbindungen mit etwa 150 Euro teuren Endger&auml;ten
          via digitaler Radio-Frequenzen jederzeit abrufbar, so
          Richter. Weitere Entwicklungsm&ouml;glichkeiten des
          Systems seien die Kombination mit dem Navigationssystem
          des Autos zu einem intelligenten Verkehrsleitsystem, das
          Staus automatisch umfahren kann oder Informationen zum
          Kultur- und Veranstaltungsangebot der Region bereit
          h&auml;lt, in der sich der Fahrer befindet. Andreas
          Vierling, Gesch&auml;ftsbereichsleiter Planung beim MDR,
          betonte, auch die &ouml;ffentlich-rechtlichen Sender
          wollten die M&ouml;glichkeiten des digitalen Radios
          konsequent nutzen. Die vorhandenen M&ouml;glichkeiten von
          Fernsehen und Radio seien ausgereizt, jetzt m&uuml;sse es
          technische Neuentwicklungen geben. F&uuml;r den MDR sei
          das digitale Radio ein kostenfreies Zusatzangebot, das
          die Attraktivit&auml;t des Kernbereichs Radio und
          Fernsehen steigert. Es sollen keine neue, redaktionellen
          Kompetenzen daf&uuml;r aufgebaut werden. Die Entwicklung
          neuer Standards m&uuml;sse jedoch st&auml;rker als bisher
          an den tats&auml;chlichen Bed&uuml;rfnissen der Nutzer
          orientiert sein und nicht am technisch Machbaren,
          forderte Vierling. Professor Dr. Claus Sattler
          Projektmanager der Initiative bmco - Broadcast Mobile
          Convergence, arbeitet an der Verbindung von Radio,
          Fernsehen und Mobilfunk. Damit will die
          Arbeitsgemeinschaft aus Nokia, Philips, Vodaphone und
          Universal interaktives Fernsehen auf mobile
          Endger&auml;te &uuml;bertragen. Sein Credo zu den neuen
          digitalen M&ouml;glichkeiten: Neue technische
          M&ouml;glichkeiten lassen auch neue - interaktive -
          Inhalte entstehen. Ein &uuml;berall empfangbarer
          Musiksender mit Voting-Funktionen sei eine
          M&ouml;glichkeit. Eine kommerzielle Anwendung digitaler
          Radio-Formate pr&auml;sentierte Oliver Dunk,
          Gesch&auml;ftsf&uuml;hrer der Digital Radio Berlin GmbH:
          Sein "Kaufradio" verbindet H&ouml;rfunk und
          Online-Shopping: Nach einem aktuellen Chart-Hit hat der
          H&ouml;rer die M&ouml;glichkeit, Produkte telefonisch zu
          bestellen.</P>
          <HR>

          <H3><B>Was ist Worldspace?</B></H3>

          <P>Worldspace ist Satellitenrundfunk, den man mit
          kleinsten Antennen empfangen kann. &Uuml;ber drei
          Satelliten - AfriStar, AsiaStar und AmeriStar - werden
          derzeit f&uuml;r Afrika, Asien und Lateinamerika
          Radioprogramme &uuml;bertragen. Diese Radioprogramme
          k&ouml;nnen mit einem tragbaren Empf&auml;nger sowie
          einer nur ca. 10x10cm gro&szlig;en Patch-Antenne
          empfangen werden. Diese Antenne braucht im Gegensatz zu
          gew&ouml;hnlichen Satellitenantennen nicht einmal exakt
          ausgerichtet werden - eine ungef&auml;hre Ausrichtung auf
          den Satelliten reicht v&ouml;llig aus. Die Worldspace
          Satelliten &uuml;bertragen die Programme digital mit
          einer Datenrate von bis zu 128kbps im Frequenzbereich von
          ca. 1,4GHz.</P>

          <P><B>Empfang in Europa</B><BR>
           Nicht nur in Afrika kann der Satellit AfriStar empfangen
          werden, sondern auch hierzulande. Der Westbeam des
          Satelliten reicht bis nach Nordeuropa und kann auch hier
          ohne Probleme mit der kleinen Patch-Antenne empfangen
          werden.</P>

          <P><B>Programmauswahl</B><BR>
           Welchen Anreiz bietet hierzulande der Empfang von
          Worldspace gegen&uuml;ber UKW, Mittelwelle oder normalem
          Satellitenempfang?</P>

          <P>Zum einen ist das die sehr exotische Programmauswahl -
          auf Afristar gibt es Programme mit Afrikanischer
          Tanzmusik, mit indischen Kl&auml;ngen, Countrymusik,
          Rock&acute;N&acute;Roll Oldies der 60er und vieles mehr.
          Das Angebot ist sehr abwechslungsreich und anders als das
          &uuml;ber g&auml;ngige Verbreitungswege.</P>

          <P>Als einziger deutschsprachiger Sender verbreitet
          HitMix-FM sein Programm &uuml;ber das Worldspace System.
          HitMix-FM ist dadurch auch zum Vermarkter von WorldSpace
          f&uuml;r den deutschsprachigen Raum geworden.</P>

          <P>Weitere interessante Programme sind wohl das als
          Seesender bekannt gewordene Radio Caroline (in Zukunft
          leider nur noch als Pay Radio empfangbar), sowie Radio
          Voyager aus Amerika.</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

