<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <!-- Author =  Mathias Klingner -->

    <TITLE>Ausstellung der chinesischen Terrakotta-Armee im Berliner Palast der Republik</TITLE>
  </HEAD>

  <BODY background="images/bg4.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" summary="">
      <TR>
        <TD>
          <CENTER>
            <TABLE border="0" summary="Formatierung" width="740">
              <TR>
                <TD>
                  <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A>

                  <TABLE border="0" summary="Kapitel1" width="100%">
                    <TR>
                      <TD><IMG src="images/tk257.jpg" width="200" height="360"
                      alt="Eintrittskarte"> </TD>

                      <TD valign="top">
                        <P align="center"><FONT color="#000080" size="6"><B>Ausstellung der
                        chinesischen Terrakotta-Armee<BR>
                        im Berliner Palast der Republik</B></FONT></P>

                        <P><FONT size="+1">Am 15.03.2004 besuchte ich morgens, gleich nach
                        &Ouml;ffnung der Ausstellung, die Nachbildung der chinesischen
                        Terrakotta-Armee des ersten Kaisers von China. Die Terrakotta-Armee wurde
                        nach M&uuml;nchen, Mannheim, Bonn und Hamburg nun auch in Berlin im
                        entkernten ehemaligen Palast der Republik gezeigt. Es handelt sich dabei um
                        ca. 180 lebensgro&szlig;e Nachbildungen der 1974 in China gefundenen
                        Terrakotta-Armee des ersten Kaisers von China, Qin Shi Huang Di. Die
                        mannsgro&szlig;en Krieger wiegen je ca. 200 und die Pferde je 400
                        Kg.</FONT></P>
                      </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Bilderfolge1" width="100%">
                    <TR>
                      <TD align="center" width="50%">
                      <IMG src="images/tk258.jpg" width="360" height="240" alt=""><BR>
                      Der entkernte Palast der Republik</TD>

                      <TD align="center" width="50%">
                      <IMG src="images/tk260.jpg" width="360" height="240" alt=""><BR>
                      Eingang zur Ausstellung</TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Text1" width="100%">
                    <TR>
                      <TD>
                        <P>Die Kopien der Originalfiguren aus dem &uuml;ber 2200 Jahre alten Grab
                        des Kaisers Qin Shi Huang Di entstanden in China, in Lington nach
                        &uuml;berlieferten Verfahren in alten Brenn&ouml;fen. Von dort aus traten
                        sie ihre Reise per Schiff nach Deutschland an.</P>

                        <P>In der Ausstellung konnte man neben den Terrakotta-Kriegern auch acht
                        lebensgro&szlig;e Pferde der Soldaten, sowie ein Modell im Ma&szlig;stab
                        1:10 der Grabanlage mit ca. 1000 kleinen Soldaten sehen. In Vitrinen
                        befanden sich Waffen und weitere Fundst&uuml;cke, die man bei den Grabungen
                        fand.</P>

                        <P>F&uuml;r die Ausstellung der Tonkrieger richtete man den entkernten
                        Palast der Republik extra wieder notd&uuml;rftig her. Der l&ouml;chrige
                        Fu&szlig;boden wurde mit Asphalt bedeckt sowie die Treppen mit
                        zus&auml;tzlichen Gel&auml;ndern abgesichert. Mit von der Decke
                        h&auml;ngenden Stoffbahnen stellte man W&auml;nde f&uuml;r die Ausstellung
                        her.</P>
                      </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Bilderfolge2" width="100%">
                    <TR>
                      <TD align="center" width="50%">
                      <IMG src="images/tk261.jpg" width="360" height="240" alt=""><BR>
                      Gruppe mit 3 Tonkriegern</TD>

                      <TD align="center" width="50%">
                      <IMG src="images/tk262.jpg" width="360" height="240" alt=""><BR>
                      Der erste Kaiser Qin Shi Huang Di</TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Text2" width="100%">
                    <TR>
                      <TD>
                        <P>Die Geschichte des ersten Kaisers von China Qin Shi Huang Di und die
                        Geschichte der Grabanlage konnte man auf 11 gro&szlig;en Schautafeln
                        lesen.</P>

                        <P>In einem extra Raum wurde interessierten Besucher eine Film &uuml;ber
                        die Entdeckung der Tonkrieger, die Ausgrabungen und die Geschichte der
                        TerrakottaArmee und des ersten Kaisers von China gezeigt.</P>

                        <P>Drei Wochen nach meinem Besuch sollten noch 50 weitere
                        Tonkriegernachbildungen aus China f&uuml;r diese Ausstellung nachkommen, um
                        die Armee zus&auml;tzlich zu verst&auml;rken.</P>

                        <P>Alle Aufnahmen entstanden mit einer Kleinbild-Spiegelreflexkamera und
                        einer Digitalkamera zumeist ohne den Einsatz des Blitzes und ohne Stativ
                        bei sehr schlechten Lichtverh&auml;ltnissen. Fotografiert habe ich auf 27
                        DIN-Negativfilm.</P>

                        <P>Der Rundgang durch die Ausstellung dauert ca. eine Stunde. Die
                        Eintrittskarte kostet 8,50 EUR, erm&auml;&szlig;igt 7,00 EUR, Kinder 5,50
                        EUR, Schulen 5,00 EUR und die Familienkarte 24 EUR (2 Erw. mit Kindern von
                        6-17 J.).</P>

                        <P>F&uuml;r weitere Informationen kann ich die Homepage der Ausstellung
                        unter www.terrakottaarmee.de/ empfehlen.</P>
                      </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Bilderfolge3" width="100%">
                    <TR>
                      <TD align="center" width="50%">
                      <IMG src="images/tk265.jpg" width="360" height="240" alt=""><BR>
                      Thron des Qin Shi Huang Di</TD>

                      <TD align="center" width="50%">
                      <IMG src="images/tk264.jpg" width="360" height="240" alt=""><BR>
                      Tonkriegerminiaturen im Souvenirshop</TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Text3" width="100%">
                    <TR>
                      <TD colspan="2">
                        <P>Mit freundlicher Genehmigung der beiden Pressevertreter der
                        Terrakotta-Ausstellung Nana Mohr und Konstanze Becker gebe ich nun f&uuml;r
                        die NoCover den Text der 11 Schautafeln sowie den Text der Tafel zur
                        Biografie des ersten Kaisers von China wieder:</P>

                        <P><FONT><B>Biographie des Kaisers Qin Shi Huang Di</B></FONT></P>
                      </TD>
                    </TR>

                    <TR>
                      <TD valign="top">259 v. Chr.</TD>

                      <TD>Geburt des sp&auml;teren ersten Kaisers von China als Sohn von Zi Chu
                      (Sohn des F&uuml;rsten Qin An und Enkel des K&ouml;nigs Qin Zhao) und der
                      Konkubine Zhao Ji.</TD>
                    </TR>

                    <TR>
                      <TD valign="top">246 v. Chr.</TD>

                      <TD>Nach dem Tode seines Vaters 247 v. Chr. erfolgte nach chinesischer
                      Konvention die Thronbesteigung im n&auml;chsten Jahr. Die Bauarbeiten
                      f&uuml;r die Grabanlage des Kaisers nahmen kurz nach seiner Thronbesteigung
                      ihren Anfang und wurden erst nach dem Tod des Kaisers abgeschlossen. Sie
                      dauerten 38 Jahre.</TD>
                    </TR>

                    <TR>
                      <TD valign="top">238 v. Chr.</TD>

                      <TD>Nach seinem offiziellen Eintritt in das Erwachsenenalter vermochte sich
                      der junge Herrscher der bisherigen Berater zu entledigen. Er schickte
                      diese, sowie andere Widersacher gegen seine "Politik der eisernen Hand", in
                      die Verbannung.</TD>
                    </TR>

                    <TR>
                      <TD valign="top">230&nbsp;v.&nbsp;Chr.-<BR>
                      221 v. Chr.</TD>

                      <TD>Er betrieb auf diplomatischem Wege und schlie&szlig;lich auch mit
                      milit&auml;rischen Mitteln die Unterwerfung der &uuml;brigen Staaten. In
                      einer zehnj&auml;hrigen Folge von Feldz&uuml;gen vernichtete er die Staaten
                      Han, Zhao, Wei, Chu, Yan und Qi.</TD>
                    </TR>

                    <TR>
                      <TD valign="top">221 v. Chr.</TD>

                      <TD>Nach der Unterwerfung der selbstst&auml;ndigen Staaten, suchte
                      K&ouml;nig Zheng, gerade 38 Jahre alt, nach einem geeigneten Titel. Qin Shi
                      Huang Di -"Erster erhabener Kaiser" oder "Erster Gottkaiser"</TD>
                    </TR>

                    <TR>
                      <TD valign="top">220 v. Chr.</TD>

                      <TD>Auf dem H&ouml;hepunkt seiner Macht unternahm der erste Kaiser Reisen
                      in verschiedene Teile des Reiches. Diese Reisen dienten der Demonstration
                      seiner Macht, sie sollten die symbolische Inbesitznahme des
                      Herrschaftsgebietes und die &Uuml;berlegenheit des Herrschers &uuml;ber
                      alle weltlichen und geistigen M&auml;chte in seinem Territorium zur Schau
                      stellen.</TD>
                    </TR>

                    <TR>
                      <TD valign="top">211 v. Chr.</TD>

                      <TD>Zu seiner letzten Inspektionsreise in den S&uuml;den brach der Kaiser
                      211 v. Chr. auf. Er sollte nicht mehr lebend zur&uuml;ckkehren.</TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="11 Tafeln" width=
                  "100%">
                    <TR>
                      <TD>
                        <H3>Tafel 1:<BR>
                        <B>Die Qin-Dynastie</B></H3>

                        <P>Jeder in China kennt Qin Shi Huang Di, obwohl seine Herrschaft schon
                        &uuml;ber 2000 Jahre zur&uuml;ckliegt. Das ist so, als man einen Franzosen
                        fragt, ob er wisse, wer Napoleon war, oder einen &Auml;gypter, wie eine
                        Pyramide aussieht. Seine strategische Genialit&auml;t interessiert die
                        Gener&auml;le noch immer und die Politiker studieren nach wie vor seine
                        politischen Erfolge und Misserfolge. Eines ist sicher, jeder ist fasziniert
                        von den vielen Geschichten, die &uuml;ber den ersten Kaiser der
                        Qin-Dynastie im Laufe von zwei Jahrtausenden &uuml;bermittelt worden.<BR>
                        Wer war also Qin Shi Huang Di?</P>

                        <P>Geboren wurde er als Ying (Familienname) Zheng (Vorname). Sein
                        Geburtsjahr 259 v. Chr. fiel in die letzte Phase der "Streitenden Reiche" -
                        sieben F&uuml;rstenstaaten Qi, Chu, Yan, Han, Zhao, Wei und Qin, die sich
                        in einem &uuml;ber 200 Jahre andauernden Kampf um die Vorherrschaft
                        verbissen hatten. Sein Vater Zi Chu war Sohn des F&uuml;rsten Qin Au und
                        Enkel des K&ouml;nigs Qin Zhao.</P>

                        <P>Zi Chu war jedoch weder der erstgeborene Sohn, noch ein Sohn der
                        Hauptfrau Qin Ans, sondern lediglich der Sohn einer seiner Nebenfrauen. Und
                        so wurde er als Geisel ins Reich Zhao geschickt, denn damals war es
                        &uuml;blich, um politisch guten Willen zu zeigen und sich so bei den
                        st&auml;ndigen kriegerischen Auseinandersetzungen den R&uuml;cken fei zu
                        halten, eines Angeh&ouml;rigen der herrschenden Familie als Garant f&uuml;r
                        gegebene Versprechen zu benutzen.</P>

                        <P>Zi Chus Lage in Zhao war wenig beneidenswert. Lange Zeit f&uuml;hrte er
                        ein armseliges Leben. Doch dann lernte er in der Stadt Handan den
                        Gro&szlig;kaufmann L&uuml; Buwei kennen, einen Mann mit Weitsicht und einem
                        ausgepr&auml;gten Sinn f&uuml;r den eigenen Vorteil.</P>

                        <P>Er erfasste Zi Chus Situation mit einem Blick und beschloss ihm zu
                        helfen nach Qin zur&uuml;ckzukehren, denn davon versprach er sich
                        langfristig Ruhm und Vorteil. L&uuml; Buwei schenkte Zi Chu sogar seine
                        Lieblingskonkubine Zhao Ji, die schon bald einen Sohn gebar. Sima Qian
                        berichtet in "Shi Ji", die Konkubine Zhao Ji sei schon vor der
                        Eheschlie&szlig;ung mit Zi Chu schwanger gewesen, so dass nicht sicher sei,
                        wer der Vater ihres Sohnes war. Man habe das Kind sogar L&uuml; Zheng
                        genannt, weil viele Leute es f&uuml;r den Sohn L&uuml; Buweis gehalten
                        h&auml;tten. Nachdem es Zi Chu endlich gelungen war, nach Qin
                        zur&uuml;ckzukehren, dauerte es nicht lange, bis er an der Spitze des
                        Staates stand und zum K&ouml;nig gekr&ouml;nt wurde. Sein Herrschaftsname
                        war Zhuang Xiang. Yin Zhen erhielt offiziell den Titel eines "Kronprinzen".
                        Zi Chu starb im Jahre 246 v. Chr.<BR> Ying Zheng wurde 13-j&auml;hrig der
                        neue K&ouml;nig.</P>

                        <H3>Tafel 2:</H3>

                        <P>Da es einem Knaben jedoch unm&ouml;glich gewesen w&auml;re, die sich
                        st&auml;ndig &auml;ndernde B&uuml;ndnis- und Angriffssituation der sieben
                        Staaten zu &uuml;berblicken, f&uuml;hrte L&uuml; Buwei als Kanzler zusammen
                        mit dem Favoriten der K&ouml;nigsmutter, Lao'ai, die
                        Staatsgesch&auml;fte.</P>

                        <P><B>238 v. Chr.</B>,<BR> im Alter von 22 Jahren, wurde Ying Zheng
                        offiziell zum K&ouml;nig gekr&ouml;nt und nahm umgehend selbst das Zepter
                        in die Hand. Die Alleinherrschaft von L&uuml; Buwei und Lao'ai war ihm
                        schon seit langem ein Dorn im Auge. Also liess er Lao' ai t&ouml;ten, seine
                        Mutter in Haft nehmen und L&uuml; Buwei aus dem Amt entfernen.</P>

                        <P>Dann setzte er ein Beratergremium ein, auf dessen Vorschlag eine Anzahl
                        von Zivilbeamten und Gener&auml;len eingestellt und ernannt wurden.
                        Darunter Li Si und Wang Wan, sowie die Gener&auml;le Wang Jian, Yu Liao und
                        Meng Tian.</P>

                        <P>Ying Zheng nahm au&szlig;erdem die Reformpolitik seines Vaters wieder
                        auf und erkl&auml;rte sorgf&auml;ltige Feldbestellung und bedingungslosen
                        Kampfeinsatz zu den obersten Tugenden. Auf diese Weise entwickelte sich das
                        K&ouml;nigreich Qin rasch und hatte bald den ersten Platz unter den sieben
                        "Streitenden Reichen" inne.</P>

                        <P>Eine der Voraussetzungen f&uuml;r die Vereinigung war damit
                        erf&uuml;llt. Von 230-221 v. Chr. f&uuml;hrte der junge K&ouml;nig dann die
                        planm&auml;&szlig;ige Zerschlagung der anderen Staaten durch. Durch
                        Intrigen und B&uuml;ndnisse isolierte er die ihm am n&auml;chsten liegenden
                        Staaten, griff sie an und verleibte sich so einen nach dem anderen ein.
                        China war geeint und der Zerfleischung der Staaten untereinander war ein
                        Ende gesetzt.</P>

                        <P>Das erste feudale Kaiserreich der chinesischen Geschichte mit
                        zentralistischer Macht war geboren.</P>

                        <P>Nach der Staatseinigung befahl Ying Zheng seinen Ratgebern, dar&uuml;ber
                        nachzudenken, welche Bezeichnung f&uuml;r den Herrscher die geeignete sei.
                        Die Beamten und Gener&auml;le kamen zu unterschiedlichen Ergebnissen und
                        Ying Zeng f&auml;llte die Entscheidung &uuml;ber seinen Titel
                        kurzentschlossen selbst. Da er an Tugend die drei mythischen "Huang"
                        (K&ouml;nige) Fuxi, Shen Nong und N&uuml; Wa &uuml;bertreffe und seine
                        Verdienste h&ouml;her seien als die der f&uuml;nf legend&auml;ren "Di"
                        (K&ouml;nige), stehe ihm der Name "Huangdi" zu, also K&ouml;nig der
                        K&ouml;nige oder Kaiser. Danach nannte er sich "Shi Huang di" (erster
                        Kaiser). Den Titel "Huangdi" &uuml;bernahmen alle folgenden Herrscher
                        Chinas und er blieb die Anrede f&uuml;r den "Sohn des Himmels" bis zur
                        Abschaffung der Monarchie im Jahre 1911.</P>

                        <P>Um die Zentralmacht zu st&auml;rken, schaffe Qin Shi Huang Di das seit
                        der Shang- und Zhou-Dynastie bestehende Lehnwesen ab und f&uuml;hrte statt
                        dessen ein Verwaltungssystem mit Bezirken und Kreisen ein. Das ganze Land
                        wurde in 36 Bezirke aufgeteilt.</P>

                        <H3>Tafel 3:</H3>

                        <P>Die n&auml;chste Ebene war der Kreis, ihm folgten die Gemeinden, das
                        Ting und schlie&szlig;lich das Li. Die Zentralregierung bestand aus drei
                        obersten Staatsr&auml;ten und neun Ministern, die direkt dem Kaiser
                        unterstanden und das Land gem&auml;ss seinen Erlassen verwalteten. Die
                        obersten zivilen und milit&auml;rischen Beamten der Zentralregierung, sowie
                        der &ouml;rtlichen Regierung wurden vom Kaiser unmittelbar ernannt bzw.
                        abberufen, das hie&szlig; alle politische und milit&auml;rische Macht
                        konzentrierte sich in den H&auml;nden des Kaisers.</P>

                        <P>Shi Huang Di nutzte diese Macht, um eine Reihe von Gesetzen und Dekreten
                        zu erlassen, denn nur so lie&szlig; sich seine Staatsmacht
                        konsolidieren.</P>

                        <P>Seine wichtigsten Neuerungen f&uuml;r die zuk&uuml;nftige Entwicklung
                        seines Landes, vor allem f&uuml;r seine wirtschaftliche, waren dabei die
                        Vereinheitlichung der Gewichts- und Mengenma&szlig;e, die Vereinheitlichung
                        der Schriftzeichen, die Schreibweise (Qin-Xiaozhuan-Schrift) und die
                        Vereinheitlichung der W&auml;hrung. Das Ban-Lian-Geld des Staates Qin wurde
                        allgemein g&uuml;ltiges Zahlungsmittel.</P>

                        <P>Eine weitere wichtige Ma&szlig;nahme war der Bau neuer
                        Verkehrsstra&szlig;en, deren Spurbreite standardisiert wurde, sowie die
                        Verbindung einzelner gro&szlig;er Abwehrmauern aus der Zeit der
                        "Streitenden Reiche".</P>

                        <P>Das Ergebnis war die Gro&szlig;e Mauer, die vom Kreis Lintao im Westen
                        zum Shanghai-Pass im Osten f&uuml;hrte und 10 000 Li lang gewesen sein
                        soll.</P>

                        <P>F&uuml;nfzigj&auml;hrig, 210 v. Chr. verstarb Qin Shi Huang Di, auf der
                        Sandh&uuml;gel- Terrasse (im jetzigen Guangzon, Provinz Hebei) auf einer
                        Inspektionsreise.</P>

                        <P>Nach seinem Tod verf&auml;lschte sein zweiter Sohn Hu Hai den
                        kaiserlichen Erlass, der die Nachfolge regelte, ermordete seinen
                        &auml;lteren Bruder Fu Su und beanspruchte den Thron. Die
                        Geschichtsschreibung gab ihm die Herrschaftsbezeichnung Qin Er Shi,
                        w&ouml;rtlich: Qin - Kaiser der zweiten Generation.</P>

                        <P>Die Qin-Dynastie hatte ihren H&ouml;hepunkt bereits &uuml;berschritten
                        und stand vor ihrem Untergang. Wenig sp&auml;ter brach, gef&uuml;hrt von
                        Cheng Seng und Wu Guang, ein das ganze Land erfassender Bauernaufstand aus
                        und die Qin-Dynastie brach zusammen.</P>

                        <P>Sie geh&ouml;rte zu den k&uuml;rzesten Dynastien der chinesischen
                        Geschichte, denn von ihrer Gr&uuml;ndung bis zu ihrer Abschaffung vergingen
                        nur rund 15 Jahre.</P>

                        <P>Was waren die Gr&uuml;nde f&uuml;r ihr Scheitern?</P>

                        <P>Es lassen sich drei Hauptursachen feststellen: grausame Gesetze und
                        Strafmissbrauch, gewaltsame Erpressung von Steuern und Fronarbeit f&uuml;r
                        die gigantischen Bauma&szlig;nahmen und schlie&szlig;lich die absolute
                        Unf&auml;higkeit Hu Hai's als Herrscher, die sich in der folgenden Anekdote
                        widerspiegelt:</P>

                        <P>Um die Autorit&auml;t und Standfestigkeit des Kaisers, den er zu
                        entmachten beabsichtigte, zu pr&uuml;fen, lie&szlig; der Kanzler dem Kaiser
                        zwei Hirsche vorf&uuml;hren, die er ihm als "Pferde" vorstellte. Obwohl der
                        Kaiser zun&auml;chst widersprach, schloss er sich, unsicher geworden und
                        feige, der Meinung des Kanzlers an, als dieser darauf beharrte, es handele
                        sich um "Pferde".</P>

                        <H3>Tafel 4:</H3>

                        <P>Der Historiker Lu Jia der Han-Dynastie (205 v. Chr. bis 220 n. Chr.)
                        schrieb in seinem Buch "Neue Worte" dazu: "Das Volk wurde grausam
                        unterdr&uuml;ckt und bestraft." Ein falsches oder unbedachtes Wort, hier
                        wurde kein Unterschied zwischen einem Angeh&ouml;rigen des
                        gew&ouml;hnlichen Volkes und einem Mitglied der Aristokratie gemacht,
                        konnte die Todesstrafe bzw. verschiedene K&ouml;rperstrafen bringen, von
                        denen die meisten so furchtbar waren, dass sie letztlich dieselbe
                        Konsequenz hatten. Den Tod.</P>

                        <P>F&uuml;r die von Shi Huang Di in den 10 Jahren nach der Einigung
                        veranlassten Bauma&szlig;nahmen, darunter die Verbindungsst&uuml;cke
                        f&uuml;r die Gro&szlig;e Mauer und der fortgesetzte Ausbau seiner
                        Grabst&auml;tte, waren insgesamt zwei Millionen Fronarbeiter n&ouml;tig.
                        Die Zahl plus jener Fronarbeiter, die zu anderen Zwangsarbeiten
                        herangezogen wurden, machte fast ein Zehntel der Gesamt- bev&ouml;lkerung
                        aus. Da es sich bei ihnen zumeist um junge und starke Menschen handelte,
                        deren Arbeitskraft f&uuml;r den Aufbau der Volkswirtschaft uner-
                        l&auml;sslich war, wurde der Staat nachhaltig geschw&auml;cht. Und die
                        gewaltigen Steuerlasten taten schlie&szlig;lich das ihre, um die
                        wirtschaftliche Entwick- lung zu ersticken und die Bev&ouml;lkerung in den
                        Aufstand zu treiben.</P>

                        <P>Die Quin-Dynastie und der erste Kaiser sind bis heute zu ein
                        kontroverses Thema geblieben. &Uuml;ber die Jahrhunderte haben sich
                        Historiker wie Politiker &uuml;ber Erfolg und Misserfolg seiner Handlungen
                        auseinandergesetzt, das Pro und Contra abgew&auml;gt und sind bisher zu
                        keinem endg&uuml;ltigen Ergebnis gekommen.</P>

                        <P>Eines ist jedoch unumstritten: Qin Shi Huang Di stand am Anfang der
                        Geschichte Chinas, als eines geeinten Staates und damit kommt ihm eine
                        zentrale Stellung in der chinesischen Geschichte zu.</P>

                        <H3>Tafel 5:<BR>
                        <B>Die Entdeckung der Tonkrieger</B></H3>

                        <P>Viele Seiten im Buch der Arch&auml;ologie werden ganz zuf&auml;llig
                        aufgeschlagen. Daf&uuml;r gibt es zahlreiche Beispiele. Die Entdeckung der
                        Terrakotta-Armee des Qin Shi Huang Di ist keine Ausnahme.</P>

                        <P>Es war 1974 zu Beginn des Fr&uuml;hlings. Im Dorf Xiyang, Gemeinde
                        Yanzhei, Kreis Lintong, Provinz Shaanxi, hatte man beschlossen, einen neuen
                        Brunnen zu graben, um die unter der Fr&uuml;hjahrstrockenheit leidenden
                        Felder bew&auml;ssern zu k&ouml;nnen. Der Platz lag in einem
                        Persimonw&auml;ldchen s&uuml;dlich des Dorfes. Am f&uuml;nften Tag der
                        Ausschachtungsarbeiten stie&szlig; man auf eine harte Schicht aus
                        gebranntem roten Ton. Sie war so hart, dass es in den Armen schmerzte, wenn
                        die Hacke auf den Ton traf. Als man ungef&auml;hr vier Meter tief war,
                        l&ouml;ste die Hacke pl&ouml;tzlich einen ungew&ouml;hnlichen Klang aus und
                        als n&auml;chstes kamen einige grotesk geformte Tonscherben und ein
                        gef&auml;&szlig;artiger Gegenstand zum Vorschein.</P>

                        <P>Bei ihrem Fundst&uuml;ck handelte es sich um den gepanzerten Brust- und
                        R&uuml;ckenbereich eines Tonkriegers. Kopf sowie Arme und Beine folgten
                        bald und schlie&szlig;lich wurde auch noch eine bronzene Armbrust, Pfeile
                        und Ziegelsteine ans Tageslicht gef&ouml;rdert.</P>

                        <P>Einige &auml;ltere Bauern bef&uuml;rchteten, dass man die G&ouml;tter
                        beleidigen und von ihnen bestraft w&uuml;rde, wenn man die
                        "G&ouml;tterfiguren" ganz ausgrabe. Vorsichtshalber wurde Weihrauch
                        angez&uuml;ndet, man kniete nieder und machte wiederholt Kotau.
                        Schlie&szlig;lich beschloss man erst einmal ins Dorf zur&uuml;ckzukehren,
                        wo sich die Nachricht alsbald wie ein Lauffeuer verbreitete.</P>

                        <P>Wie der Zufall es wollte, hielt sich ein Beamter der Gemeinderegierung
                        im Dorf auf, um den Brunnen zu inspizieren. Da zu seinem
                        Zust&auml;ndigkeitsbereich auch andere D&ouml;rfer aus der Umgebung des
                        Grabh&uuml;gels von Shi Huang Di geh&ouml;rten, fiel ihm bei der
                        Besichtigung des Fundortes auf, dass die entdeckten Ziegelsteine eine
                        gro&szlig;e &Auml;hnlichkeit mit jenen hatten, die in der N&auml;he des
                        Grabh&uuml;gels gefunden worden waren. Die Arbeit am Brunnen wurde umgehend
                        eingestellt.</P>

                        <P>Die Nachricht von dem Fund verbreitete sich sehr schnell. Von der
                        Kreisstadt Lintong in der Provinzhauptstadt Xi'an und von dort nach
                        Beijing. Im Juli 1974 schlie&szlig;lich traf ein Arch&ouml;ologenteam der
                        Provinz Shaanxi am Fundort ein, das in den folgenden zwei Jahren zahlreiche
                        Testbohrungen und -grabungen vornahm und bewies: es handelt sich um eine
                        gro&szlig;e Ansammlung von Tonkriegern und Tonpferden, die zur Grabanlage
                        des Shi Huang Di geh&ouml;rt.</P>
                      </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Bilderfolge4" width="100%">
                    <TR>
                      <TD valign="top" width="33%">
                      <IMG src="images/tk266.jpg" width="240" height="360" alt=""><BR>
                      bei Ausgrabungen gefundene Schwerter der Tonkrieger</TD>

                      <TD valign="top" width="33%">
                      <IMG src="images/tk269.jpg" width="240" height="360" alt=""><BR>
                      Die von Meisterhand modellierten Figuren wurden, nachdem sie vier Wochen an
                      der Luft getrocknet waren, in solchen &Ouml;fen gebrannt.</TD>

                      <TD valign="top" width="34%">
                      <IMG src="images/tk272.jpg" width="240" height="360" alt=""><BR>
                      einzeln stehender, lebensgro&szlig;er Terrakotta-Krieger</TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="11 Tafeln ff" width="100%">
                    <TR>
                      <TD>
                        <H3>Tafel 6:</H3>

                        <P>Viele Jahre sp&auml;ter erz&auml;hlten die Bauern bei einem Interview,
                        wie sie mit der zerbrochenen Terrakottafigur im Leiterwagen nach Lington
                        gezogen waren und wie sie f&uuml;r den Verdienstausfall und als Belohnung
                        vom zust&auml;ndigen Amt 30 Yuan bekamen, wor&uuml;ber sie sich sehr
                        freuten. 30 Yuan sind aus heutiger Sicht nicht sehr viel. Aber das hat sie
                        nie gest&ouml;rt. Denn sie sind ungemein stolz darauf, dass sie es waren,
                        die die Tonarmee entdeckten. Die alten Bauern erinnern sich, dass schon
                        ihre V&auml;ter bei der Ausschachtung von Brunnen oder bei Beerdigungen auf
                        Teile von Terrakottafiguren gesto&szlig;en waren.</P>

                        <P>Niemand kam damals auf die Idee, dass es sich um Gegenst&auml;nde von
                        gro&szlig;em arch&auml;ologischen und geschichtlichen Wert handeln
                        k&ouml;nnte. Die Ausgrabungen der Tonarmee sorgten nicht nur in China
                        f&uuml;r &Uuml;berraschung und Aufsehen, sondern in der ganzen Welt.</P>

                        <P>Seit ihrer Entdeckung 1974 bis heute wurde sie von einer st&auml;ndig
                        wachsenden Zahl in- und ausl&auml;ndischer Touristen besucht. Die
                        Besucherzahl geht inzwischen in die Millionen.</P>

                        <P>Singapurs Premierminister Lee bezeichnete die Figuren als ein
                        Weltwunder, auf das die chinesische Nation stolz sein k&ouml;nne. Der
                        ehemalige US-Au&szlig;enminister Dr. Henry Kissinger besuchte die Tonarmee
                        sogar dreimal und sah f&uuml;r ein Volk, das ein solches Werk geschaffen
                        habe, eine gl&auml;nzende Zukunft voraus.</P>

                        <P>1987 schrieb der ehemalige franz&ouml;sische Premierminister Jaques
                        Chirac nach der Besichtigung ins G&auml;stebuch: "Es gibt sieben
                        Weltwunder. Die Tonarmee ist das achte. Wer die Pyramiden nicht gesehen
                        hat, kennt &Auml;gypten nicht. Wer die Tonkrieger nicht gesehen hat, war
                        nicht in China."</P>

                        <P>Nat&uuml;rlich besteht China nicht nur aus der Terrakottarmee, genauso
                        wenig wie &Auml;gypten sich in den Pyramiden ersch&ouml;pft. Aber sie ist
                        mit Sicherheit eine Art Geschichtsbuch, dass &uuml;ber viele Aspekte des
                        damaligen Lebens Aufschluss gibt. Vorausgesetzt, man verf&uuml;gt &uuml;ber
                        den richtigen Schl&uuml;ssel. Die nachfolgenden Tafeln sollen diesen
                        Schl&uuml;ssel liefern.</P>
                      </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Bilderfolge5" width="100%">
                    <TR>
                      <TD valign="top" width="40%">
                      <IMG src="images/tk274.jpg" width="360" height="240" alt=""><BR>
                      Modell der Grabanlage Nr.1 im Ma&szlig;stab 1:10</TD>

                      <TD valign="top" width="60%">
                      <IMG src="images/tk273.jpg" width="360" height="240" alt=""><BR>
                      Erkl&auml;rungstafel zum Bild nebenan</TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="11 Tafeln ff" width="100%">
                    <TR>
                      <TD>
                        <H3>Tafel 7:<BR>
                        <B>Eine Grabanlage von immenser Gr&ouml;&szlig;e</B></H3>

                        <P>Die Grabanlage des ersten Kaisers der Qin-Dynastie, Shi Huang Di, liegt
                        im Ostteil des Kreises Lintong in der Provinz Shaanxi, 7,5 Kilometer von
                        der Kreisstadt entfernt. Die Grabanlage liegt zwischen dem Berg Li im
                        S&uuml;den und dem Fluss Wei im Norden. Der Grabh&uuml;gel erhebt sich
                        majest&auml;tisch aus der umgebenden Landschaft.</P>

                        <P>Shi Huang Di hatte den Ort gew&auml;hlt, weil es ganz in der N&auml;he,
                        im Berg Li, reiche Gold- und Jadevorkommen gab.</P>

                        <P>Die Grabanlage ist inzwischen eines der wichtigsten Objekte des
                        staatlichen Kulturdenkmalschutzes und steht dar&uuml;ber hinaus als
                        einziges in China auf der Liste des Weltkulturerbes der UNESCO.</P>

                        <P>Fast alle feudalistischen Kaiser in der chinesischen Geschichte
                        schenkten in ihrem Leben besonders zwei Dingen gro&szlig;e
                        Aufmerksamkeit:</P>

                        <P>Das war die Suche nach einer Methode, Unsterblichkeit zu erlangen, das
                        andere war der Bau einer imposanten Grabst&auml;tte, die ihre
                        Gr&ouml;&szlig;e auch nach dem Tod demonstrieren sollte.</P>

                        <P>Den historischen Aufzeichnungen zufolge schickte Shi Huang Di im Laufe
                        seines Lebens mehrere Expeditionen, bestehend aus einigen Jungen und
                        M&auml;dchen los, welche "auf den drei heiligen Bergen in der Ostsee", die
                        nach der Legende dort wachsenden Kr&auml;uter der Unsterblichkeit suchen
                        sollten. Der Kaiser war jedoch gleichzeitig Realist, ihm war klar, dass die
                        Suche wahrscheinlich vergeblich sein w&uuml;rde.</P>

                        <P>Deshalb wurde mit dem Bau der Grabst&auml;tte begonnen, kaum dass er den
                        Thron bestiegen hatte.</P>

                        <P>&Uuml;ber Bauzeit und Beschaffenheit der Grabanlagen ist in vielen
                        B&uuml;chern geschrieben worden. Die ber&uuml;hmteste Schilderung aber
                        stammt mit Sicherheit von Sima Qian, dem gr&ouml;&szlig;ten Historiker
                        Chinas. In seinem Werk "Shi Ji" beschreibt er, wie kurz nach der
                        Thronbesteigung des ersten Kaisers von Zwangs- und Fronarbeitern mit dem
                        Bau der Grabst&auml;tte begonnen wurde.</P>

                        <H3>Tafel 8:</H3>

                        <P>Zum Zeitpunkt h&ouml;chster Baut&auml;tigkeit arbeiteten 700 000
                        Menschen an der Anlage. Zuerst wurde eine tiefe Grube ausgehoben, deren
                        Boden mit Kupfer ausgegossen wurde. Darauf kam der Sarkophag. Die
                        Grabst&auml;tte wurde wie ein Palast ausgebaut und mit seltenen
                        Sch&auml;tzen ausgestattet.</P>

                        <P>Um sie vor Pl&uuml;nderungen zu sch&uuml;tzen, baute man verdeckte
                        Schie&szlig;scharten, aus denen Pfeile auf die Gr&auml;ber gerichtet waren.
                        Der Abschuss erfolgte "automatisch".</P>

                        <P>Der Boden war eine Landkarte Chinas, auf der die Fl&uuml;sse und Seen
                        mit Quecksilber markiert waren und die Decke des Grabes war ein Himmel mit
                        Sonne, Mond und Sternen. Kerzen wurden aus menschlichem Fett und Tran
                        gefertigt, dadurch sollten sie eine besonders lange Brenndauer
                        erhalten.</P>

                        <P>Alle kaiserlichen Konkubinen, die Shi Huang Di kein Kind geboren hatten,
                        wurden mit ihm begraben. Ebenso die Architekten und die Erbauer der
                        "Alarmanlagen", die bei Schlie&szlig;ung des Grabes lebendig in seinem
                        Inneren eingesperrt wurden.</P>

                        <P>Laut Sima Qian begannen die Bauarbeiten 246 v.Chr. und wurden erst nach
                        dem Tod des Kaisers abgeschlossen. Sie dauerten 38 Jahr.</P>

                        <P>Der Verbrauch an Arbeitskr&auml;ften und Geld war h&ouml;her als bei der
                        Cheopspyramide.</P>

                        <P>Da die Grabst&auml;tte als Abbild des wirklichen Lebens von Shi Huang Di
                        gedacht war, gibt sie uns Einblicke in seinen luxuri&ouml;sen
                        Lebensstil.</P>

                        <P>Um die Richtigkeit der Aufzeichnungen von Sima Qian zu
                        &uuml;berpr&uuml;fen, f&uuml;hren Arch&auml;ologen seit den 60er Jahren
                        Untersuchungen und Testgrabungen durch. Man wei&szlig; heute, dass die
                        Erdschicht &uuml;ber dem Grab 115 Meter dick war. Heute ist sie unter
                        anderem durch Erosion auf 76 Meter geschrumpft.</P>

                        <P>Der Grundriss der Grabst&auml;tte ist fast rechteckig und misst von
                        Osten nach Westen 345 Meter und von S&uuml;den nach Norden 350 Meter. Die
                        Anlage aus gestampfter Erde hatte urspr&uuml;nglich Pyramidenform, welche
                        damals von einer doppelten Mauer umgeben war. Die Seitenl&auml;nge der
                        inneren Mauer von S&uuml;den nach Norden betrug 1355 Meter und von Osten
                        nach Westen 580 Meter. Die in einigem Abstand dazu befindliche
                        &auml;u&szlig;ere Mauer hatte einen Umfang von 6210 Metern. Aus dem an ein
                        paar Stellen noch erhaltenen Fundament kann man schlie&szlig;en, das sie
                        etwa 8 Meter breit war.</P>

                        <P>Beide Mauern hatten nach allen Seiten hin &Ouml;ffnungen. Die
                        &Auml;u&szlig;ere je ein Tor mit Wacht&uuml;rmen auf jeder Seite, die
                        Innere ein zus&auml;tzliches Tor auf der Nordseite. An den vier Ecken jeder
                        Mauer befanden sich weitere Wacht&uuml;rme.</P>

                        <P>Die gesamte Anlage innerhalb der beiden Mauern bestand aus Bauten
                        f&uuml;r Opferzeremonien, Unterk&uuml;nften f&uuml;r das Wachpersonal und
                        Lagerh&auml;user, von denen heute nur noch Ruinen stehen.</P>

                        <H3>Tafel 9</H3>

                        <P>In das Erdreich eingef&uuml;hrte Sonden weisen einen relativ hohen
                        Quecksilberanteil auf, der die Aufzeichnungen des Sima Qians best&auml;tigt
                        und erkl&auml;rt.</P>

                        <P>Die exakte Lage des Grabes ist noch ungewiss, da die &uuml;berirdischen
                        Bauten fast vollst&auml;ndig zerst&ouml;rt sind. Man hat auf einer
                        Fl&auml;che von 56,25 km bisher &uuml;ber 400 weitere gr&ouml;&szlig;ere
                        und kleinere Gruben entdeckt. Dabei ist ein Fund von rund 50 000
                        arch&auml;ologisch und k&uuml;nstlerisch wertvollen Gegenst&auml;nden
                        gemacht wurden.</P>

                        <P>Durch die bislang durchgef&uuml;hrten Grabungen und Entdeckungen
                        k&ouml;nnen sich die Fachleute inzwischen ein genaueres Bild von Aufbau und
                        Anordnung der Anlage machen. Zu diesen Funden geh&ouml;ren eine Grube mit
                        zwei Pferdegespannen aus Bronze, die eine exakte Nachbildung der
                        kaiserlichen Wagen sind. In einer Grube wird das Kaiserliche Jagdrevier
                        dargestellt und in einer weiteren befindet sich ein Duplikat der
                        Kaiserlichen Pferdest&auml;lle. Der unterirdische Palast war ein
                        Spiegelbild des &uuml;berirdischen, inklusive der m&auml;chtigen Armee, die
                        die Hauptstadt zu verteidigen hatte.</P>

                        <P>Die Tonarmee des Kaisers ist in drei Gruben untergebracht. In seinem
                        unterirdischen Palast sollte der Kaiser seine Herrscherposition innehaben
                        und seine Armee befehligen. Sie war sein Garant f&uuml;r ewigliche
                        Herrschaft weit &uuml;ber seinen Tod.</P>

                        <P>Die Arch&auml;ologen sind sich einig, dass die Tonkrieger in derselben
                        Zeit entstanden wie der Bau der gesamten Grabanlagen. Dies wird im Jahre
                        220 bis 210 v. Chr. gewesen sein. Man ist geteilter Meinung, weshalb die
                        Figuren Brandspuren aufweisen. Manche sind der Ansicht, dass eine
                        Selbstentz&uuml;ndung von F&auml;ulnisgasen daf&uuml;r verantwortlich
                        gewesen sei, andere behaupten, dass das Verbrennen von den Arbeitern
                        vorgenommen wurde und es ein Teil der Beerdigungszeremonie war. Die meisten
                        Fachleite, vor allem die, die an den Ausgrabungen direkt beteiligt waren,
                        sagen, dass die Tonsoldaten Opfer einer kriegerischen Auseinandersetzung
                        wurden.</P>

                        <P>Im Jahr 206 v. Chr. drang die von Xiang Yu gef&uuml;hrte Aufstandsarmee
                        gegen die Qin-Dynastie in die Hauptstadt ein. Dabei kam es zu Br&auml;nden,
                        von denen die Tonarmee nicht verschont blieb.</P>

                        <P>Eine Beschreibung des Aufstandes findet man in vielen historischen
                        Werken. Aber auch die Spuren an Ort und Stelle sprechen f&uuml;r diese
                        Theorie. Diese besagt, dass die gro&szlig;e Armee des Shi Huang Di, ihren
                        Glanz schon kurz nach ihrer Vollendung verlor.</P>

                        <H3>Tafel 10:</H3>

                        <P>Die Gruben mit der Tonarmee liegen 1,5 km &ouml;stlich des
                        Grabh&uuml;gels. Nach der Reihenfolge der Ausgrabungen wurden die Gruben
                        mit 1, 2 und 3 nummeriert. Die drei Gruben wurden mit Holz und
                        festgestampften Lehm befestigt. Zuerst wurde ein riesiges 5 Meter tiefes
                        Loch ausgehoben. Auf den Boden wurde dann lose Erde gestreut, die
                        festgestampft wurde. So entstand Schicht f&uuml;r Schicht ein festes
                        Fundament.</P>

                        <P>Danach zog man Zwischenw&auml;nde ein, die ebenfalls aus festgestampfter
                        Erde bestanden und 3 Meter hoch waren. Die Strebe zwischen den W&auml;nden
                        bekam einen Boden aus grauen Ziegeln. Darauf wurden die Tonfiguren
                        gestellt.</P>

                        <P>Entlang beider Seiten, am Fu&szlig; einer jeden Zwischenwand und entlang
                        des gesamten Grubenrandes wurden Balkensockel befestigt, auf denen man in
                        gleichm&auml;&szlig;igen Abst&auml;nden h&ouml;lzerne S&auml;ulen
                        anbrachte. Diese S&auml;ulen trugen Quer- und L&auml;ngsbalken, auf denen
                        das Dach ruhte, das aus mit Matten bedeckten, dicken Holzplatten war.
                        Darauf lag eine dicke Schicht aus Lehm, Sand und Kalk. Die Anzahl der Ein-
                        und Durchg&auml;nge ist je nach Bedarf in den einzelnen Gruben
                        unterschiedlich.</P>

                        <P>Nach der Aufstellung der Tonfiguren wurden die Durchg&auml;nge mit
                        Holzbl&ouml;cken und festgestampfter Erde dicht verschlossen. Obwohl die
                        drei Gruben voneinander getrennt sind, vermitteln die in ihnen
                        aufgestellten Figuren dennoch den Eindruck einer geschlossenen Armee.</P>

                        <P>Die Grube Nr.1: Die Seitenl&auml;nge von Osten nach Westen betr&auml;gt
                        230 Meter und die von S&uuml;den nach Norden 62 Meter. Sie nimmt eine
                        Fl&auml;che von 14 260 Quadratmetern ein und ist die gr&ouml;&szlig;te der
                        drei Gruben. Urspr&uuml;nglich standen 6 000 nach Osten ausgerichtete
                        Tonsoldaten und Tonpferde sowie 40 h&ouml;lzerne Kampfwagen in einer
                        rechteckigen Formation. Die ersten drei durchgehenden Reihen, die den
                        Soldaten in den Streben vorangestellt sind, bestehen aus 204 Figuren und
                        bilden die Vorhut. Ihre Haare sind auf dem Kopf zu Knoten gebunden, die
                        Unterschenkel sind mit Gamaschen umwickelt. Sie tragen urspr&uuml;nglich
                        Schwerter und Bogen oder Armbr&uuml;ste in den H&auml;nden.</P>

                        <P>Hinter der Vorhut stehen in den elf Streben in einer Kolonne aus je 38
                        Reihen die Infrantriesoldaten, ab und zu unterbrochen von den inzwischen
                        verfallenen Kampfwagen. Heute sind nur noch die Pferde &uuml;brig. Die
                        gepanzerten Soldatenfiguren mit Wickelgamaschen und Beinsch&uuml;tzern
                        waren mit Hellebarden, Hieb&auml;xten und langen schmalen Dolchen
                        bewaffnet.</P>

                        <P>An den beiden kurzen Seiten der Grube (der s&uuml;dlichen und der
                        n&ouml;rdlichen) stehen die t&ouml;nernen Krieger mit dem R&uuml;cken zu
                        ihren Kameraden, bereit, diese vor einem feindlichen Flankenangriff zu
                        verteidigen. Fr&uuml;her standen auch hinten Soldaten mit dem Gesicht nach
                        au&szlig;en, die dieselbe Aufgabe hatten.</P>

                        <H3>Tafel 11:</H3>

                        <P>Die Grube Nr.2 liegt 20 Meter nord&ouml;stlich der Grube Nr.1 und nimmt
                        eine Fl&auml;che von 6 000 Quadratmetern ein. Der Grundriss entspricht zwei
                        rechtwinklig ineinandergeschobenen Vierecken.</P>

                        <P>Nach Testgrabungen geht man davon aus, dass die Grube &uuml;ber 350
                        Wagenpferde, h&ouml;chstwahrscheinlich 116 Reitpferde, rund 900 Soldaten
                        und vermutlich 89 Kampfwagen enth&auml;lt. Reiter, Soldaten und Kampfwagen
                        sind in vier unterschiedlich zusammengesetzten Formationen aufgestellt.</P>

                        <P>Der Kern der ersten Formation besteht aus 160 kniehenden
                        Bogensch&uuml;tzen. Sie sind in 8 Kolonnen zu 20 Reihen angeordnet. Um sie
                        herum gruppieren sich weitere 170 Bogensch&uuml;tzen. Beim Kampf schossen
                        sie ihre Pfeile als erste ab. Danach gingen sie sofort auf die Knie,
                        derweil die in der Mitte sich erhoben und ihrerseits schossen usw.. Damit
                        wurde garantiert, dass auf den Gegener ein fast ununterbrochener Pfeilhagel
                        niederging. Hinter den Bogensch&uuml;tzen haben von Norden nach S&uuml;den
                        die drei anderen Formationen Aufstellung genommen. Die s&uuml;dliche
                        Formation besteht aus 64 in 8 Kolonnen angeordneten Kampfwagen. Auf jeden
                        Wagen entfallen zwei gepanzerte Soldaten und ein Wagenlenker. Die Formation
                        in der Mitte besteht aus 260 auf 3 Kolonnen verteilte Soldaten,
                        unterbrochen von 19 Kampfwagen. Zwei der drei Kolonnen schlie&szlig;en mit
                        je vier Reitern ab. Diese Anordnung war sehr schnell zu &auml;ndern.</P>

                        <P>Die vierte Formation besteht gleichfalls aus drei Kolonnen, die sich aus
                        108 Reitern und 6 Wagen zusammensetzen. Die beiden letztgenannten
                        Formationen stehen unmittelbar hinter den Bogensch&uuml;tzen. Die Reiter
                        wirken sehnig und stark. Sie tragen Brustpanzer, Pelzm&uuml;tzen und
                        Stiefel. Bei den Pferden handelt es sich um kr&auml;ftige Tiere, die in der
                        Lage scheinen, den Feind gegebenenfalls auch niederzutrampeln.</P>

                        <P>Im chinesischen Altertum setzte sich eine Streitmacht aus drei Teilen
                        plus Gefechtsstand zusammen. Grube Nr.1 und Nr.2 repr&auml;sentieren zwei
                        Teile. Wo aber ist die dritte Streitmacht? Eine weitere Testgrabung ergab,
                        das sich n&ouml;rdlich der ersten Grube eine weitere Grube befindet, die
                        genauso tief ist wie die drei anderen. Aber in ihr gibt es weder Tonfiguren
                        noch andere Gegenst&auml;nde. Sie ist ganz mit Erdreich gef&uuml;llt. Die
                        Arch&auml;ologen nehmen an, dass bevor die Grube vollendet werden konnte,
                        der Bauernaufstand ausbrach, der der Qin-Dynastie das Ende bereitete.</P>

                        <P>Bei allen in den Gruben gefundenen Waffen handelt es sich um echte, d.
                        h. einsetzbare Waffen. So haben die Schwerter trotz der 2 000 Jahre unter
                        der Erde noch immer eine scharfe Schneide. Analysen ergaben, dass die
                        bronzenen Schwerter, Hieb&auml;xte, Lanzen etc. (bisher gefundene
                        Waffenst&uuml;ckzahl: 30 000) mit einer Chromsalzl&ouml;sung behandelt
                        wurden und somit vor dem Zerfall gesch&uuml;tzt waren, ein Beweis
                        daf&uuml;r, dass man diese Technik in China bereits damals beherrschte.</P>
                      </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Bilderfolge6" width="100%">
                    <TR>
                      <TD colspan="2">
                        <HR>
                        <B>Bilder der Kampfaufstellung von weit &uuml;ber 100 lebensgro&szlig;en
                        Terrakotta-Kriegern</B> 
                      </TD>
                    </TR>

                    <TR>
                      <TD valign="top" width="50%">
                      <IMG src="images/tk282.jpg" width="360" height="240" alt=""> </TD>

                      <TD valign="top" width="50%">
                      <IMG src="images/tk285.jpg" width="360" height="240" alt=""> </TD>
                    </TR>

                    <TR>
                      <TD><IMG src="images/tk286.jpg" width="360" height="240" alt=""> </TD>

                      <TD><IMG src="images/tk288.jpg" width="360" height="240" alt=""> </TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Bilderfolge7" width="100%">
                    <TR>
                      <TD>
                      </TD>
                    </TR>

                    <TR>
                      <TD valign="top">
                      <IMG src="images/tk116.jpg" width="240" height="360" alt=""><BR>
                      Detailaufnahmen der Terrakotta-Armee</TD>

                      <TD valign="top">
                      <IMG src="images/tk118.jpg" width="240" height="360" alt=""><BR>
                       </TD>

                      <TD valign="top">
                      <IMG src="images/tk129.jpg" width="240" height="360" alt=""><BR>
                      Terrakotta-Krieger mit Pferd</TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" summary="Text1" width="100%">
                    <TR>
                      <TD>
                        <HR>
                        <BR>

                        <P>Ich hoffe, der Bericht war informativ und anschaulich genug und hat
                        vielleicht den einen oder anderen Leser dazu bewogen, diese Ausstellung
                        auch einmal zu besuchen.</P>

                        <P>Die n&auml;chsten Standorte der Terrakotta-Krieger sind vom
                        11.07.-19.09.04 Oberhausen - Centro und ab dem 03.10.04 in N&uuml;rnberg.
                        F&uuml;r 2005 sind Ausstellungen in Wien und in Stuttgart geplant.</P>
                        <HR>

                        <P>Mathias Klingner<BR>
                        E-Mail: Tschandru.Shing@Berlin.de</P>
                      </TD>
                    </TR>
                  </TABLE>
                  <BR>
                  <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A>
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

