<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>&lt;waschweib@blindzeln.net&gt;</TITLE>
  </HEAD>

  <BODY background="images/bgd.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <A name="top"></A> 

          <P align="center"><FONT color="#000080" size=
          "7"><B>&lt;waschweib@blindzeln.net&gt;</B></FONT><BR>
          "'Der stets gutgelaunte Treffpunkt f&uuml;r Tratsch und
          Klatsch'"</P>

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">[WASCHWEIB] Die Zwillinge</A></LI>

            <LI><A href="#a02">[WASCHWEIB] Tiere</A></LI>

            <LI><A href="#a03">[WASCHWEIB]
            Lebensweisheiten</A></LI>

            <LI><A href="#a04">[WASCHWEIB] Ein gel&ouml;stes
            Problem!</A></LI>

            <LI><A href="#a05">[WASCHWEIB] So stirbt man
            standesgem&auml;&szlig;</A></LI>

            <LI><A href="#a06"></A></LI>

            <LI><A href="#a07"></A></LI>

            <LI><A href="#a08"></A></LI>

            <LI><A href="#a09"></A></LI>

            <LI><A href="#a10"></A></LI>
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>Die Zwillinge</H3>

          <P>"Herr Bundeskanzler Schr&ouml;der, was haben Sie da
          eigentlich f&uuml;r eine Narbe am Kopf?"<BR>
          "Ich war ein siamesischer Zwilling."<BR>
          "Wie kommt es, da&szlig; Sie &uuml;berlebt haben?"<BR>
          "Wir wurden schon als S&auml;uglinge getrennt."<BR>
          "Wer ist denn Ihr Zwillingsbruder?"<BR>
          "Berlusconi, der italienische
          Ministerpr&auml;sident."<BR>
          "Ja, das h&auml;tte jeder erkennen k&ouml;nnen."<BR>
          "Genau. Er, wie ich, lieben den Fu&szlig;ball und haben
          die gleichen sch&ouml;nen schwarzen Haare. Wir beide
          wissen mit den Medien perfekt umzugehen. Auch ich schaue
          hinter jede Hecke, ob dort nicht jemand ist, dem ich die
          H&auml;nde sch&uuml;tteln k&ouml;nnte. Und &uuml;ber die
          Frauen m&ouml;chte ich gar nicht sprechen."<BR>
          "Ja, man h&auml;tte es merken m&uuml;ssen. Aber nun gibt
          es doch diesen Streit."<BR>
          "Mit meinem Zwillingsbruder streite ich nicht. Er hat mir
          einen Gefallen getan. Wegen der beschissenen
          innenpolitischen Lage brauche ich ein
          au&szlig;enpolitisches Ventil. Das hat vor der Wahl auch
          so wunderbar geklappt. Da ging der Streit mit den USA
          allerdings von mir aus. Das konnte ich nat&uuml;rlich
          nicht ein zweites Mal machen. So hat mein Bruder zum
          Schein den Streit begonnen. Wir beide bel&uuml;gen und
          betr&uuml;gen das Volk, ohne mit der Wimper zu
          zucken."<BR>
          "Aber nun k&ouml;nnen Sie Ihren Bruder nicht sehen."<BR>
          "Meinen Bruder kann ich auch am Maschsee in Hannover
          sehen."<BR>
          "Wieso?"<BR>
          "Silvio ist die Sonne meines Lebens."</P>

          <P>Thea Petersen &lt;Thea@petersen-web.com&gt;<BR>
          <A href="#top">zum Inhaltsverzeichnis</A></P>
          <HR>
          <A name="a02"></A> 

          <H3>Tiere</H3>

          <P>Es wurde eine neue Rasse von Sporttauben
          gez&uuml;chtet, indem man eine Taube mit einem Papagei
          kreuzte. Sollte sich die Taube einmal verfliegen, kann
          sie jetzt nach dem Weg fragen.</P>

          <P>Zwei Fl&ouml;he treffen sich auf dem Bauch einer Frau.
          Sagt der eine: "Was machst du so?" Sagt der andere: "Ich
          mache Urlaub im S&uuml;den, und du?" Sagt der eine: "Ich
          mache Urlaub im Norden." Nach 3 Wochen treffen die beiden
          sich wieder. "Und wie war es?" fragt der eine. Diese
          Berge, diese T&auml;ler einfach wundervoll! Und bei dir?
          Einfach spitzenm&auml;&szlig;ig: Abenteuerurlaub &agrave;
          la Indiana Jones. Erst musste ich mich durch den Urwald
          k&auml;mpfen, dann habe ich eine sch&ouml;ne H&ouml;hle
          gefunden, aber am letzten Tag - zum Teufel - kam doch so
          ein Glatzkopf mit Rollkragenpullover und kotzte mir die
          ganze Bude voll!</P>

          <P>Eine Fliege fliegt an einer Spinne vorbei, und da sag
          die Spinne: "Na warte, morgen krieg ich dich!" Darauf die
          Fliege: "Sorry, ich bin eine Eintagsfliege!"</P>

          <P>Treffen sich ein Schaf und ein Rasenm&auml;her auf
          einer gr&uuml;nen Wiese. Sagt das Schaf zum
          Rasenm&auml;her: "M&auml;h!"</P>

          <P>Zwei Ratten sitzen vor dem Fenster. Eine Fledermaus
          fliegt vorbei. Die eine Ratte sagt zu der anderen:
          "Schau, ein Engel."</P>

          <P>Ein Hase und ein B&auml;r gehen durch den Wald und
          pl&ouml;tzlich h&ouml;ren sie: "Helft mir, helft mir!"
          Die beiden laufen zu der Stelle wo das Geschrei herkommt.
          Dort ist ein Kobold unter einem umgefallenen Baum
          eingeklemmt. Der B&auml;r hebt den Baum auf und der Hase
          hilft dem Kobold auf. Der Kobold: "Weil ihr mir geholfen
          habt, habt ihr jetzt jeder 3 W&uuml;nsche frei!" Der
          B&auml;r denkt nach und antwortet: "Ich w&uuml;nsche mir,
          dass es im ganzen Wald nur B&auml;rinnen gibt und ich bin
          der einzige B&auml;r!" Kobold: "Wunsch gew&auml;hrt!" Der
          Hase w&uuml;nscht sich eine coole Lederjacke.
          "Gew&auml;hrt!" Der B&auml;r w&uuml;nscht sich dass es in
          ganz Europa nur B&auml;rinnen gibt und er der einzige
          B&auml;r! "Gew&auml;hrt!" Der Hase w&uuml;nscht sich eine
          Harley Davidson. "Wunsch gew&auml;hrt!" Der B&auml;r:
          "Ich w&uuml;nsche mir, dass es auf der ganzen Welt nur
          B&auml;rinnen gibt und ich bin der einzige B&auml;r."
          "Gew&auml;hrt!" Der Hase macht sich bereit, setzt sich
          auf seine Harley und will losfahren. Der Kobold h&auml;lt
          ihn aber auf: "Hase, du hast ja noch einen Wunsch frei!"
          Der Hase: "Ich w&uuml;nsche dass der B&auml;r schwul
          ist", und f&auml;hrt davon.</P>

          <P>Zwei Fr&ouml;sche sitzen am Ufer. Es beginnt zu
          regnen. Sagt der eine: "Schnell, springen wir ins Wasser,
          sonst werden wir nass!"</P>

          <P>Treffen sich zwei Pinguine in der W&uuml;ste, sagt der
          eine: "Hier muss es aber glatt sein." Fragt der andere:
          "Warum??" - "Na weil die hier so viel gestreut
          haben!"</P>

          <P>Was macht eine Elefanten-Dame wenn sie sich ein Tampon
          einf&uuml;hren will? - Setzt sich auf ein Schaf!</P>

          <P>Warum gehen Ameisen nicht in die Kirche? - Na, weil
          sie INSEKTEN sind!</P>

          <P>Der Bauer hat f&uuml;r seinen H&uuml;hnerhof einen
          jungen Hahn gekauft. Der alte Hahn weist ihn ein: "Du
          kannst alle Hennen haben bis auf die Berta. Die
          geh&ouml;rt mir!" Selbstbewusst t&ouml;nt darauf der
          junge Gockel: "Nix da, Ich will alle!" "Dann lass uns
          einen Wettlauf zum Misthaufen machen, der Sieger bekommt
          alle Hennen." Die beiden H&auml;hne rennen los. Der
          &auml;ltere liegt vorne, aber als sie den Hof zur
          H&auml;lfte &uuml;berquert haben, legt sich der junge
          m&auml;chtig ins Zeug und r&uuml;ckt ganz dicht auf.
          Pl&ouml;tzlich knallt es, und der junge Hahn f&auml;llt
          tot um. Der Bauer nimmt sein Gewehr von der Schulter und
          meint verwundert: "Komisch, schon der dritte schwule Hahn
          in dieser Woche!"</P>

          <P>Kommt eine Pferd in eine Bar und sagt : "Ich
          h&auml;tte gerne ein Bier." Sagt der Barkeeper: "Bier ok!
          Aber warum machst du denn so ein langes Gesicht?"</P>

          <P>Der Tiger hat Geburtstag! Alle sind eingeladen, bis
          auf den Hamster. Weil der Hamster aber trotzdem kommen
          m&ouml;chte, fragt er vor dem Haus des Tigers, das gerade
          ankommende K&auml;nguru: "Nimmst du mich in deinem Beutel
          mit?" Das K&auml;nguru meint: "Nein, ich will mich nicht
          mit dem Tiger zerstreiten." Traurig wartet der Hamster
          weiter und fragt den L&ouml;wen: "Kannst du mich in
          deiner M&auml;hne mitnehmen?" Doch auch der L&ouml;we
          verneint. Der Hamster gibt nicht auf und fragt den
          B&auml;ren, ob er ihn in seinem Fell mitnimmt und der
          B&auml;r nimmt ihn mit! Die Party l&auml;uft
          gro&szlig;artig und keiner merkt was. Dann wird ein Spiel
          gespielt, bei dem man seine Taschen ausr&auml;umen muss.
          Als der B&auml;r dran ist, r&auml;umt er seinen Maskara,
          seinen Wasserball und alles aus, was ein B&auml;r halt
          nun mal so dabei hat aus. Alles bis auf den Hamster. Der
          Tiger merkt etwas und meint: "Du hast noch was bei dir,
          ich wei&szlig; das!" und der B&auml;r nimmt seine Pfote
          und schl&auml;gt sich mit aller Kraft auf die Schulter wo
          der Hamster sich versteckt und meint: "Ja, ein Bild vom
          Hamster."</P>
          Thea Petersen &lt;Thea@petersen-web.com&gt;<BR>
          <A href="#top">zum Inhaltsverzeichnis</A> <BR>
          <BR>
           
          <HR>
          <A name="a03"></A> 

          <H3>Lebensweisheiten</H3>

          <P>Sagt ein Mensch zu den Steinen: "Werdet menschlicher!"
          Die Steine antworten: "Wir sind noch nicht hart
          genug!"</P>

          <P>Wenn du 8 Jahre, 7 Monate und 6 Tage schreien
          w&uuml;rdest, h&auml;ttest du genug Energie produziert um
          eine Tasse Kaffee zu erw&auml;rmen. (Ob sich das
          lohnt?)</P>

          <P>Der Orgasmus eines Schweins dauert 30 Minuten! (In
          meinem n&auml;chsten Leben w&auml;re ich gerne ein
          Schwein!)</P>

          <P>Wenn du Deinen Kopf gegen eine Wand schl&auml;gst,
          verbrauchst du 150 Kalorien. (Ich muss immer noch an das
          Schwein denken!)</P>

          <P>Eine Kakerlake kann 9 Tage ohne Kopf &uuml;berleben
          bevor sie verhungert.</P>

          <P>Einige L&ouml;wen paaren sich bis zu 50 mal am Tag.
          (Ich w&auml;re trotzdem lieber ein Schwein. Qualit&auml;t
          geht &uuml;ber Quantit&auml;t!)</P>

          <P>Schmetterlinge lecken an ihren eigenen F&uuml;ssen.
          (Das musste mal gesagt werden!)</P>

          <P>Elefanten sind die einzigen Tiere die nicht springen
          k&ouml;nnen. (Ist wohl auch besser so!)</P>

          <P>Der Urin einer Katze phosphorisiert im Dunkeln. (Wen
          bezahlt man eigentlich um so etwas zu erforschen?)</P>

          <P>Das Auge eines Strau&szlig;es ist gr&ouml;&szlig;er
          als sein Gehirn. (Ich kenne Menschen, bei denen ist das
          nicht anders!)</P>

          <P>Seesterne haben kein Gehirn. (Auch solche Typen kenne
          ich!)</P>

          <P>Polarb&auml;ren sind Linksh&auml;nder. (Na und?)</P>

          <P>Menschen und Delphine sind die einzigen Lebewesen, die
          aus Freude Sex haben. (Hey! Was ist mit dem
          Schwein???)</P>

          <P>Thea Petersen &lt;Thea@petersen-web.com&gt;<BR>
          <A href="#top">zum Inhaltsverzeichnis</A></P>
          <HR>
          <A name="a04"></A> 

          <H3>Ein gel&ouml;stes Problem!</H3>

          <P>Nach einem reich erf&uuml;llten Leben stand Bill Gates
          vor der Eingangst&uuml;r von Petrus. Dieser sagte: "Nun
          Bill, ich wei&szlig; nicht ob ich Dich in den Himmel oder
          in die H&ouml;lle schicken soll. Eigentlich hast du
          Millionen von Menschen durch die Installation von
          Computern geholfen. Auf der anderen Seite erfandest du
          das schreckliche Windows 2000. Ich glaube, ich lasse dich
          entscheiden wohin du gehen willst, aber um dir eine
          Meinung bilden zu k&ouml;nnen, kannst du vorher beide
          Orte besuchen."</P>

          <P>Alsdann ging Bill in die H&ouml;lle, wo er
          m&auml;rchenhafte Sandstr&auml;nde mit toll aussehenden
          Frauen und wundersch&ouml;nen Wetter vorfand. Au&szlig;er
          sich vor Freude sagte er: "Wenn dies die H&ouml;lle ist,
          wie sieht es dann erst im Himmel aus!" Der Himmel
          entpuppte sich als Ort, hoch in den Wolken, in einer
          warmen, angenehmen Umgebung mit dahinschwebenden,
          harfespielenden Engeln. Nichtsdestotrotz befand Bill die
          H&ouml;lle als wesentlich verlockender und machte sich
          auf den Weg.</P>

          <P>Zwei Wochen sp&auml;ter begab sich Petrus in die
          H&ouml;lle um nach Bill zu sehen und fand ihn an eine
          Wand gefesselt und von b&ouml;sen D&auml;monen gepeinigt.
          "Hier ist es schrecklich", schrie Bill, "diese H&ouml;lle
          hat nichts mit der zu tun, die ich noch vor kurzem
          besuchte. Was geschah um Gottes Willen mit dem
          vorhergehenden Ort?" Sichtlich erheitert sagte Petrus:
          "Aber das war doch nur die Demo-Version!"</P>

          <P>Thea Petersen &lt;Thea@petersen-web.com&gt;<BR>
          <A href="#top">zum Inhaltsverzeichnis</A></P>
          <HR>
          <A name="a05"></A> 

          <H3>So stirbt man standesgem&auml;&szlig;</H3>

          <UL>
            <LI>Der G&auml;rtner bei&szlig;t ins Gras...</LI>

            <LI>Der Maurer springt von der Schippe...</LI>

            <LI>Der Kellner gibt den L&ouml;ffel ab...</LI>

            <LI>Der Turner verreckt...</LI>

            <LI>Den Elektriker trifft der Schlag...</LI>

            <LI>Der Pfarrer segnet das Zeitliche...</LI>

            <LI>Der Spachtelfabrikant kratzt ab...</LI>

            <LI>Der Schaffner liegt in den letzten
            Z&uuml;gen...</LI>

            <LI>Der Beamte entschl&auml;ft sanft...</LI>

            <LI>Der Religi&ouml;se muss dran glauben...</LI>

            <LI>Der Zahnarzt hinterl&auml;sst eine schmerzliche
            L&uuml;cke...</LI>

            <LI>Der Gem&uuml;seh&auml;ndler schaut sich die
            Radieschen von unten an...</LI>

            <LI>Der Fechter springt &uuml;ber die Klinge...</LI>

            <LI>Die Putzfrau kehrt nie wieder...</LI>

            <LI>Der Anwalt steht vor dem j&uuml;ngsten
            Gericht...</LI>

            <LI>Der Autoh&auml;ndler kommt unter die
            R&auml;der...</LI>

            <LI>Der Kfz-Mechaniker schmiert ab...</LI>

            <LI>Der F&ouml;rster geht in die ewigen Jagdgr&uuml;nde
            ein...</LI>

            <LI>Der Gyn&auml;kologe scheidet dahin...</LI>

            <LI>Der Schornsteinfeger erbleicht...</LI>

            <LI>Der Rabbi geht &uuml;ber den Jordan...</LI>

            <LI>Der Optiker schlie&szlig;t f&uuml;r immer die
            Augen...</LI>

            <LI>Der Eremit wird heim gerufen...</LI>

            <LI>Der Tenor h&ouml;rt die Englein singen...</LI>

            <LI>Der Lampenh&auml;ndler geht zu den Lichtern...</LI>

            <LI>Der Marathonl&auml;ufer wird mit den
            F&uuml;&szlig;en zuerst herausgetragen...</LI>

            <LI style="list-style: none">.</LI>

            <LI>Der Spanner ist weg vom Fenster...</LI>
          </UL>

          <P>Thea Petersen &lt;Thea@petersen-web.com&gt;<BR>
          <A href="#top">zum Inhaltsverzeichnis</A></P>
          <HR>
          <A name="a06"></A> 

          <P></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a07"></A> 

          <P></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

