<HTML>
<HEAD>
<TITLE>REFLECTOR 040</TITLE>
</HEAD>
<BODY BACKGROUND="../Pix/Back.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../Pix/Reflecto.GIF" ALT="[REFLECTOR]"></A><P>
Leserbriefe</H1></CENTER>
<HR SIZE=5><P>

Dem<B> REFLECTOR-Team</B> liegt viel an Eurer Meinung zu unserem Magazin, zu<B> REFLECTIONS</B> und jeden
anderen Thema. In der Abteilung Leserbriefe kann der Leser des<B> REFLECTOR</B>-Magazins sein
Statement zur Diskussion stellen.<P>

<B>Bevor es nun losgeht, etwas in eigener Sache: Wir bitten Euch uns Eure Zusendungen bzw.
Leserbriefe als ASCII - Text auf Disk zukommen zu lassen. Es ist eine &auml;u&szlig;erst undankbare
Aufgabe, seitenlange Briefe abzutippen. Hinzu kommt, da&szlig; diese meistens sowieso auf einem
Rechner geschrieben und anschlie&szlig;end ausgedruckt wurden. In Zukunft werden wir Leserbriefe,
die nicht  als ASCII-File vorliegen zwar zur Kenntnis nehmen, aber nicht ver&ouml;ffentlichen.</B><P>

<HR><P>
<B>Marcel K&uuml;hn</B> f&auml;ngt diesmal an:<P>
<A NAME="MarcelKuehn"></A>
<div align=right><B>M&auml;rz 98</div></B>

<B>Hallo  Reflektoraner !</B><P>

<B>Ich m&uuml;chte Euch heute wieder mal etwas schreiben (das letzte mal ist doch schon etwas her). 
Ich glaube auch mein Beitrag war jetzt irgendwann einmal f&auml;llig aber leider war bei meiner 
letzten Reflector Ausgabe (No. 36) kein Zettel wie im vorigem Jahr, da&szlig; das Jahr wieder mal 
rum ist. Ich schicke Euch ein paar Disks mit auf die Ihr mir bitte die seit der 36 fehlenden 
Ausgaben kopiert (nachdem Ihr die Best&auml;tigung der Zahlung von der Bank habt - ich bin 
n&auml;mlich verge&szlig;lich und manchmal auch unordentlich so das mal etwas verschwindet). 
Desweiteren w&uuml;rde ich ganz gern auch noch die Ausgabe 33 haben wollen, denn die kam bei 
mir nie an und bei der Ausgabe 35 war die Disk "C" doppelt und die Disk "d" fehlte - also 
diese bitte auch noch. So jetzt noch zu einem Wunsch von Euch und dann genug der 
W&uuml;nsche.  Meine Systemconfig A1200, Blizzard 1240ECR, 16MB FastRAM, 1GB HD, Floppy 
DD, Floppy HD (leider derzeit defekt deshalb bitte keine HD`s), CD 4X, HP DJ400, Monitor 
M1764 - irgendwo noch ein DCTV rumliegen das Ganze ist nicht in einem Tower sondern in 
einem Cupboard (es mu&szlig; ja englisch klingen man k&ouml;nnte auch Sekret&auml;r sagen).
Weshalb habe ich so lange nichts von mir h&ouml;ren lassen und liefere jetzt auch nur 1 Objekt. Tja 
ich habe mich sehr mit der Einf&uuml;hrung von Reflections besch&auml;ftigt. Ich habe T&uuml;rme aus 
Zylindern gebaut und einrei&szlig;en lassen um Fallstudien f&uuml;r Animationen zu haben. Ich habe 
die Rollbewegung von B&auml;llen aus unterschiedlichen Materialien studiert und das Reflections- 
und Defomationsverhalten beobachtet. Und derzeit befa&szlig;e ich mich mit den 
Bewegungsabl&auml;ufen beim Schaukeln von Schaukelpferden sowie den Bewegungen vom 
Lichtkegel einer Taschenlampe in den H&auml;nden meines Sohnes (10 Monate). Unter ihm leidet 
auch Reflections und der Komm-Puter &uuml;berhaupt zeitm&auml;&szlig;ig.
So jetzt zu einigen Sachen die mich an REF wundern (bitte an Carsten weiterleiten) aber 
sicher schon viele bemerkt haben.<P>
1. Die Slider:   Sehr gut aber die letzte Zeile ist nicht voll sichtbar zu machen mittels des 
                          Sliders. Warum gibt es keine Proportionalen Slider?<P></B>

Dr. Reflectus: Gute Frage, wir wissen es leider auch nicht. Wir haben es dem Carsten mindestens
schon 100 mal gesagt, oder war es 1000 mal ??!!<P>

<B>2. Beams:                Bei einem Abbruch von Beams und anschlie&szlig;enden Neustart wird nach  
                         dem Neustart nur das Kameramaterial gerendert - keine Objekte:<P></B>

Dr. Reflectus: Das k&ouml;nnen wir <B>nicht</B> nachvollziehen, bei uns klappt der gute Beams.<P>

<B>3. Texturen:             Die Texturen werden als Gitter mit 9x9 Feldern angezeigt. Ich finde damit 
                         ist ein absch&auml;tzen bei der Texturanpassung an das Objekt schlecht      
                         m&ouml;glich. Die Einteilung in 8x8 Felder ist denke ich am besten, da sich         
                         jeder die H&auml;lfte von ¼ noch gut vorstellen kann.<P></B>

Dr. Reflectus: Carsten lie&szlig;t auch Reflector, vielleicht kann man das ja &auml;ndern.<P>

<B>4. Texturparameter: Es ist nicht m&ouml;glich per Slider negative Parameter zur Ausrichtung der 
                         Textur einzustellen. Eine Gr&ouml;&szlig;en&auml;nderung ist auch nur im Bereich 0...1 
                         mittels des Sliders m&ouml;glich.<P></B>

Dr. Reflectus: Auch hier sollte sich der gute Herr Fuchs mal was einfallen lassen.<P>

<B>5. Boolsche Op.:        Es treten Probleme mit Objekten auf deren Dreiecksdrehsinn falsch ist.
                         Siehe Beispielszene BoolError.r4 . Beide dreieckigen Objekte sind mit der 
                         Funktion Pol - 3DK&ouml;rper entstanden. Den einen habe ich durch           
                         Umdrehen der einzelnen Dreiecke schon richtig hingebogen. Was bei der 
                         Bool-Op. a(-)b herauskommt sieht man ja.<A HREF="../Bilder/BoolEr.jpg">Bild dazu</A><P>
 
6. Das Handbuch:         Der Version 4 . Im Index sind die Boolschen Operationen nicht mal      
                         erw&auml;hnt - im Buch auch nicht. So ergeht es leider auch einigen anderen 
                         Funktionen. Sie werden entweder gar nicht oder nur sehr sp&auml;rlich       
                         beschrieben. Das ist denke ich der gr&ouml;&szlig;te Schwachpunkt von Reflections 
                         bei Neueinsteigern.<P>
7. Online-Hilfe:         Leider immer noch nicht ge&auml;ndert. Jeder Text macht ein Fenster auf und 
                         in dem mu&szlig; man sich mit Tastaturkomandos auch noch durchk&auml;mpfen. 
                         Wie w&auml;re es mit HMTL und der Nutzung eines Browsers den ja doch        
                         jeder besitzt (es gibt auch gute PD oder Demo Programme).<P></B>

Dr. Reflectus: Dein Wunsch mit der Online Hilfe im HTML wurde erh&ouml;rt. Bei Ref 4.2 ist das Teil
als HTML Dokument enthalten.<P>
  

<B>K&ouml;nnte Oberland nicht &uuml;ber REFLECTOR kleine Bilder von den Mathematischen Texturen 
ver&ouml;ffentlichen so, da&szlig; man sich &uuml;berlegen kann welche f&uuml;r einen in Frage kommt?</B><P>

Dr. Reflectus: K&ouml;nnen vielleicht ja, wollen .... ? Wir werden das jetzt einfach nachholen.
<A HREF="../Bilder/MathTex1.GIF">Mathe Texturen 1</A> - <A HREF="../Bilder/MathTex2.GIF">Mathe Texturen 2</A><P>

<B>So jetzt noch etwas zum Objekt. Es stellt einen Raumer der Beibootflottille der Gurrads (Perry 
Rhodan) dar. Die Hintergrundtextur liegt in zwei Gr&ouml;&szlig;en vor. Einmal in Normalgr&ouml;&szlig;e ca. 
2.2MB (zum Rendern werden ca.7 MB ben&ouml;tigt und viel Zeit durch ein gro&szlig;es V-Licht) gro&szlig;
oder halbier 630KB gro&szlig;. Deshalb schicke ich Euch auch ein BackUp (mit FinalBackup) zu. 
Dieser Text ist auch als ASCII dabei. Plus einiger Bilder meines Bruders der w&auml;hrend ich mit 
dem Kind besch&auml;ftigt war sich meinen Rechner ausgeborgt hatte und etwas mit REF spielte.
<A HREF="../GALERIE.HTM"> ArtGalerie </A> - <A HREF="../OBJEKTE.HTM"> Objekte </A><P>

Habt Ihr immer noch ein Problem mit DD- Disks? Bei Conrad Electronic Katalog Seite 1107 10 St&uuml;ck
BASF 3½ DD Disks DM 6,95. Oder Oberland 8,00 DM.<P></B>

Dr. Reflectus: Danke f&uuml;r den Tip.<P>

<B>Tsch&uuml;&szlig;<P></B>
<P>
<HR><P>
Jetzt macht <B>Claus Peter Nandelstaedt</B> weiter:<P>
<A NAME="ClausPeterNandelstaedt"></A>
<div align=right><B>Februar 98</div>

Hallo Team.<P>
..<P>
Anbei ein Mini- Workshop.<P>
..<P>
 Bei meiner Zugszene stellte sich das Problem aus einem geraden Gleis
ein gebogenes zu machen.
Da ich jede unn&ouml;tige Arbeit vermeide, wollte ich nicht m&uuml;hsam die
unterteilten Schienen  Punkt f&uuml;r Punkt verschieben. Wenn das n&auml;mlich eine
Kurve , mit exact parallel verlaufenden Schienen, werden soll, ist es
eine m&uuml;hsame Arbeit.
Ganz einfach, dachte ich, denn es gibt ja die Funktion zum Zylinder wickeln.
Denkste.<P>
Diese Funktion taugt nichts, wenn man auf bestimmte Ma&szlig;e angewiesen ist,
weil der Radius, den man angeben muss, nacher &uuml;berhaupt nicht stimmt.
Das mu&szlig; aber unbedingt sein,weil man gebogene Sachen nicht so ohne
Weiteres verkleinern oder vergr&ouml;&szlig;ern kann,weil es da Verzerrungen gibt!!
Was bleibt ist noch Poly um Poly und das haut ganz phantastisch hin, wenn
man einen kleinen Trick anwendet.So kann ich mir den Verlauf nicht nur einer
Kurve, sondern eines ganzen Streckenverlaufs hinbiegen.Ich mache dann das
Pfadpoly entsprechend.
Da man dies nat&uuml;rlich auch f&uuml;r andere Zwecke verwenden kann, dachte ich,
schreib mal wieder.
Ich mach das mal ganz grob,weil es hier nur ums Prinzip und nicht um
Feinheiten geht.
Der Einfachheit wegen sollen n&auml;mlich 2! Polys an einem  Pfadpoly gleichzeitig
entlanglaufen.Dies ist aber bei Ref nicht vorgesehen.
Also verbinde ich die Polys mit einer Linie zu einem neuen Poly.
Der Trick: Diese Verbindungslinie hat in der Mitte einen zus&auml;tzlichen
Punkt.Ist nun Poly um Kreissegment fertig zu einem neuen Objekt, werden die
mittleren Punkte mit dem Lasso selectiert und gel&ouml;scht.Die verbindende
Fl&auml;che l&ouml;st sich dadurch auf.Ich habe dann 2 K&ouml;rper in einem Objekt.
Werden die Punkte nicht gel&ouml;scht kann man so auch eine gebogene Br&uuml;cke
machen. <A HREF="../Workshop/Bild.iff">Workshop Bild</A> -
<A HREF="../Workshop/fb-Gleise.iff">Workshop Bild1</A> -
<A HREF="../Workshop/Gleis.zip">Gleise entpacken</A><P>

Hallo Oliver.<P>
Sch&ouml;n das Du wieder dabei bist.
Wenn Du ne AMIGA-Zeitschrift suchst,beschaffe Dir die AMIGA-Plus.
Ist ne gute Zeitschrift und vertreibt auch ne Menge guter Scheiben.<P>

Hallo Thorsten.<P>
Wie, wo, was, keine Objekte?? Du hast doch Reflector. :-)
Und da sollten die Objekte auch bleiben,weil alle Mitglieder was davon haben.
Nach dem Prinzip eine Hand w&auml;scht die Andere.<P>

Meine Objekte und Bilder gibt es kostenlos nur in Reflector,ansonsten sind
sie gesperrt,auch f&uuml;r Rigo und Oberland. Ich z.B.verdiene auch sonst kein
Geld damit, weil ich die Objekte aus Spa&szlig; an der Freud mache und f&uuml;r
Reflector!
Wenn wir unsere Sachen also &uuml;berall verstreuen,wozu soll dann noch
Jemand Mitglied im Club werden?? Der Club wird dann sterben. Wollen wir das??<P>

zu Rigo:<P>
Urspr&uuml;nglich sollten seine Scheiben zum Selbskostenbeitrag nur f&uuml;r
Clubmitglieder gemacht werden.Ich hatte damals schon meine Zweifel,weil
ich nicht von gestern bin und habe daf&uuml;r im Reflector Pr&uuml;gel bezogen.
Trotzdem hat Rigo von mir eine Sperre bekommen und das war auch gut so.
Heute bekommen die Scheiben auch Nichtmitglieder und man staune,Rigos Scheibe
wurde auch auf einer AMIGA-PLUS mitgebrannt.Gott sei Dank auch mit
Sperrungen.Uwe war wohl auf einer wohlgemeinten Werbetour?<P></B>

Uwe: Ja ja, l&auml;sstern kann ein jeder. Fakt ist, da&szlig; ich schon seit ca. 1 ½ Jahren
der Amiga Plus hinterherlaufe, um Reflector mal der &Ouml;ffentlichkeit vorzustellen.
Dann auf der K&ouml;lner Messe 1997 hab ich mit Rolf Boyke und Onur Pekdemir (er macht die
Amiga Plus CD) endlich pers&ouml;hnlich sprechen k&ouml;nnen. Onur habe ich damals gesagt, da&szlig;
er nur auszugweise Texte und Bilder Ver&ouml;ffentlichen d&uuml;rfe. Was daraus geworden ist 
wissen wir ja jetzt alle. Ich werde mich wohl nur noch auf Reflector konzentrieren und
nicht mehr an irgendeine Zeitschrift gehen um unser Magazin bekannter zu machen und
um mehr Mitglieder zu bekommen. Das soll mal sch&ouml;n jemand anderes machen. Wie w&auml;re es mit
CPN, der kennt sich ja wohl am besten in der Szene aus, oder?<P>

<B>Zu Oberland: Hier sitzen knallharte Gesch&auml;ftsleute. Nur nehmen,aber nichts
geben, oder hat schon mal Jemand im Reflector kostenlos was Brauchbares von
Oberland gefunden? An dem was Ihr an Oberland zur Ver&ouml;ffentlichung sendet
verdient sich die Firma eine goldene Nase,weil es eine gute Werbung f&uuml;r
Ref ist und nix kostet.Ansonsten m&uuml;sste sie n&auml;mlich daf&uuml;r eine Menge
Geld ausgeben.</B><P>

Dr. Reflectus: Klar mu&szlig; Oberland auch mit Reflections Geld verdienen, oder glaubt 
irgendjemand das Herr Fuchs oder Herr Koppisch oder sonst jemand von Oberland unter
einer Br&uuml;cke wohnt. Wir wollen Oberland mit Sicherheit nicht in Schutz nehmen und
uns gefallen so manche Sachen auch nicht. Aber es ist halt so.<P>

<B>Man sagt,jeden Tag steht ein Dummer auf,man muss ihn nur finden.
Wer nicht unter Profilneurose leidet sollte es sich gut &uuml;berlegen, wem
er seine mit viel Zeit und Schweiss erstellte Arbeit kostenlos &uuml;berl&auml;sst.
Wenn es um den freien Zugriff geht,steht bestimmt Jemand im Hintergrund,
der sich mit Einsendungen Dummer sein Lebensunterhalt verdient.
Meidet die Leute welche nicht mal einen Dank &uuml;ber die Lippen bringen und
so tun,als sei es eine Gnade Eure Arbeiten anzunehmen.<P>

Also entweder Reflector,oder von Kumpel zu Kumpel.Wer was Bestimmtes sucht,
im Reflector fragen.<P>

Zum Schlu&szlig; noch ein gutes Beispiel.<P>
Wer an AMIGA-PLUS seine Bilder zur Ver&ouml;ffentlichung schickt, erh&auml;lt die
Scheibe, auf der die  Bilder ver&ouml;fffentlicht werden, kostenlos.
Da auf dieser Scheibe auch andere hervorragende Sachen zu finden sind,ist
es weit mehr als ein Dankesch&ouml;n.So etwas muss  man unterst&uuml;tzen, weil
hier anst&auml;ndige Umgangsformen signalisiert werden.Wie schon gesagt,eine Hand
w&auml;scht die Andere.<P></B>

Dr. Reflectus: Verdient die Amiga Plus etwa kein Geld mit Ihren CD's ?<P>

<B>Vario ist mal wieder angesagt.<P>
Von mir noch eine kleine Feldbahn.
Erst die Lok laden.Es ist die Schwarze.
Wer die rote mit mehr Details m&ouml;chte,mu&szlig; bei der schwarzen Lok die Kabine
l&ouml;schen und dann die Datei Zub nachladen.
Wagen gibts auch dazu.(Nach den Loks laden,dann passt Alles.)
Ein Wagen ist ohne Aufbauten,der kann ja endlos gedoppelt werden.
So kann Jeder verladen,was ihm gef&auml;llt.Weinfass,Motorrad,Gartenh&auml;usken usw.
 Man kann das nat&uuml;rlich endlos verfeinern,ich m&ouml;chte aber nicht
&uuml;bertreiben.Tobt Euch selbst aus.
Wer die Fahrzeuge auf den Gleisen verschieben m&ouml;chte mu&szlig; unbedingt in den
Punkt-editor gehen,weil der Geo-editor daf&uuml;r v&ouml;llig ungeeignet ist.
Im Punkteditor am Fahrzeug alle Punkte setzen und dann auf der x-Achse
verschieben,wenn es ein gerades Gleis ist,sonst mu&szlig; man etwas fummeln.
Ansonsten ist weiteres Zubeh&ouml;r in der anderen ver&ouml;ffentlichten Zugszene
zu finden.Gr&ouml;&szlig;e passt.Gebogenes Gleis ist zus&auml;tzlich dabei.
Diese Minibahnen lassen sich noch sehr oft an K&uuml;sten finden, zum Transport
von Bade-oder Kurg&auml;sten.
In meinem Bekanntenkreis gibt es halt ein paar Modellbahner,die sowas von
mir haben wollen.Da die Dinger nun sowieso fertig sind,kann ich sie auch
an Reflector schicken.Sollte Jemand weiteres Interesse an den Z&uuml;gen haben,
bitte melden,ich fertige dann noch Weiteres. Zu den<A HREF="../OBJEKTE.HTM"> Objekten</A><P><P>

So long<P>

CPN<P>

<HR><P>
<A NAME="Markus Schmidt"></A>
<B>Markus Schmidt</B> aus Dortmund schreibt:<P>

<B>Hi Olaf,<P>

habe mir mal ein paar Gedanken zu Reflector gemacht...<P>
----------------------------------------------------------------<P>
LESERBRIEF! (also ruhig auf die n&auml;xte Reflector damit)<P>

Was ich noch loswerden wollte:<P>

Reflector ist ja nun mal ein Magazin f&uuml;r Raytracing-Fans und speziell f&uuml;r  
Reflections User. OK. Was ich ein bischen schade finde ist, da&szlig; da optisch  
irgenwie nicht so viel von r&uuml;berkommt. Ich will jetzt nicht meckern und  
sagen, das Reflector ist totaler Mist. Das ist es ganz bestimmt nicht! Ich  
freue mich eigentlich auf jede Ausgabe, obwohl ich in erster Linie Real3D- 
User bin und Reflections (4.1) nur noch auf der Arbeit benutze.(Was  
bedeutet, da&szlig; ich da nicht mehr so fit drin bin). Ich w&uuml;rde mir w&uuml;nschen,  
das sich die Kreativit&auml;t der User auch in dem Aussehen des Magazins  
wiederfindet. Das Layout ist zwar funktional, aber ein bischen, wie soll  
ich sagen, hausbacken.
Wenn ich mir manche privaten Homepages von Hobby Tracern ansehe, fallen  
mir teilweise die Augen aus dem Kopf, wie sch&ouml;n die teilweise sind. Und  
das sogar OHNE Frames und Tables. Aber die kann ja mittlerweile sogar  
jeder Amiga-Browser, w&auml;ren also kein Hindernis.
Als Beispiel, seht Euch doch mal folgende Homepage an:<P>

<A HREF="http://web.ukonline.co.uk/frank.dodd/Real3D">http://web.ukonline.co.uk/frank.dodd/Real3D</A><P>

Die ist nicht so wahnsinnig aufwendig, hat aber ein sehr sch&ouml;nes Design.  
Ich finde sie sogar m.E. spartanisch ausgefallen. Weniger ist eben auch  
hier mehr.<P>

Oder schaut mal hier drauf:<P>

<A HREF="http://www.realsoft.fi/userforum">http://www.realsoft.fi/userforum</A><P>

Die befindet sich zwar auf der Homepage des Herstellers von Real3D, ist  
aber von einem engagierten Privatmann gebastelt. Mir gef&auml;llt sie  
jedenfalls! Auch diese ist einfach gehalten.<P>

Klar, wei&szlig; ich, das Olaf nicht so viel Zeit hat, st&auml;ndig an der Reflector  
zu basteln. Ich will seine Arbeit auch ganz bestimmt nicht schm&auml;lern  
(ehrlich nicht, Olaf!). Aber ich denke (wer lacht da?), da&szlig; das Layout mal  
einer dringenden &Uuml;berarbeitung bedarf. Ich glaube, da&szlig; Aussehen einer  
"Homepage" macht den Betrachter schon neugierig auf mehr. Bzw, die  
Oberland Seite f&uuml;r Ref finde ich auch nicht besonders elegant gel&ouml;st. Die  
braucht viel zu lange, um geladen zu werden. Optisch spiegelt sie auch  
nicht die F&auml;higkeiten von Ref wieder, oder?</B><P>

Dr. Reflectus: Also, Olaf macht Reflector nicht alleine, Werner und Uwe sind auch mit
Begeisterung dabei. Klar sind wir immer f&uuml;r Verbesserungen offen. Wenn Ihr
Vorschl&auml;ge und Kritiken habt, immer her damit. Es ist Euer Magazin. Wir geben
nur wieder was Ihr sehen wollt.<P>

<B>Und da habe ich gezz folgende Idee:<P>

Sicher gibt es ja noch mehr User als Olaf, die sich mit HTML besch&auml;ftigen  
(mich z.B.). Wie w&auml;re es also, wenn sich eine kleine Arbeitsgruppe  
zusammentun w&uuml;rden, und die Reflector mal ordentlich renoviert? Ich stelle  
gerne meine R&auml;umlichkeiten zur Verf&uuml;gung um z.B. ein Wochenende die  
Reflector zu moderniesieren. Sozusagen ein Arbeitstreffen zugunsten der  
Reflector. Da m&uuml;ssten dann folgende Themen bearbeitet werden:<P>
<B>
1. Welche Vorarbeiten k&ouml;nnen die User leisten? (Thumbnails usw.)<P>
2. Betrachtung der F&auml;higkeiten der Unterschiedlichen Browser vor allem auf   
  dem Amiga (&uuml;ber PC-Browser brauchen wir uns wohl kaum Gedanken machen,    
  die k&ouml;nnen eh fast alles)<P>
3. Festsetzung der verwendbaren HTML-Tags<P>
4. Erarbeitung eines durchg&auml;ngigen Layouts<P>
        - Inhalte (bisheriges Konzept?)<P>
        - Aufbau einer Struktur (schnell ladbar!)<P>
        - Frames?<P>
        - Tables?<P>
        - Hintergrundbild/Kachel?<P>
        - Vergabe von Schriftattributen<P>
        - Farbwahl<P>
        - Erstellung der graphischen Elemente mir Ref<P>

5. Aufbau der HTML-Seiten durch entsprechende Programme inkl. der  
  Erstellung von "Templates" die nur noch mit Inhalt gef&uuml;llt werden m&uuml;ssen.  
  So wird die Arbeit, beim sp&auml;teren zusammenstellen einer neuen Ausgabe,  
  viel leichter.<P></PRE>

Es gibt sicher noch viel mehr zu bedenken, was mir gezz nicht so einf&auml;llt.  
Aber das ergibt sich dann ja auch von selbst.
Was halten denn die User davon? Wie seht Ihr das optische Erscheinungsbild  
der Reflector? Und vor allem: Wer ist bereit, da mitzumachen falls ein  
Interesse besteht? Ich alleine kann das nicht leisten, da brauche ich  
schon Hilfe! Vor allem Olaf (Werner?/Uwe?) hat da auch noch ein Wort  
mitzureden, weil er ja, soweit ich weiss, gr&ouml;&szlig;tenteils die Ausgaben  
zusammenstellt.<P>

Also, was denkt Ihr?<P>

Bis bald,<P>
Markus<P>


Ich hoffe, Du f&uuml;hlst Dich jetzt nicht auf den Schlips getreten!
Ich wei&szlig;, da&szlig; Du Dir viel M&uuml;he mit der Reflector machst und das es nicht  
wenig Arbeit ist.
Ich habe Dir noch ein weiteres Bild zugemailt. Du kannst beide Bilder auch  
gerne auf die Reflector packen, da h&auml;tte ich nichts dagegen!</B><P>

Dr. Reflectus: Wie gesagt, wir haben immer f&uuml;r Verbesserungen ein offenes Ohr.
Dank an Markus. Wir sind gespannt ob sich da in n&auml;chster Zeit etwas tut.</B><P>

<B>Ciao,<P>
Markus<P>



E-Mail: <A HREF="mailto:ms@mark-ami.ruhr.de">ms@mark-ami.ruhr.de<P></A>
"Cool, Man!" (Bartholomew J. Simpson)<P></B>

<HR><P>

Damit w&auml;ren wir am Ende der Leserbriefe angelangt. Nat&uuml;rlich harren wir
der weiteren Post, die da auf uns zukommen wird. Also ran an die Tasten
und her mit Euren Statements.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<A HREF="../Hauptmen.HTM"><IMG WIDTH=69 HEIGHT=49 SRC="../Pix/Pfeilz.GIF" ALT="[ZURUECK]"></A> ZURUECK
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
