<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, pretty, maids, pretty maids, carpe diem">
<title>Pretty Maids: Carpe Diem</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Pretty Maids: Carpe Diem</font></center></h1></P>

<p>Schon seit jeher stehen die aus D&#228;nemark kommenden Pretty Maids f&#252;r musikalische Qualit&#228;t im Bereich des Melodic Metal und lieferten im Laufe der Bandgeschichte schon den einen oder anderen Klassiker ab. Auch das `99er Album &quot;Anything Worth Doing Is Worth Overdoing&quot; war sicherlich nicht von Pappe und bewies damals eindrucksvoll, da&#223; die Pretty Maids noch lange nicht zum alten Eisen geh&#246;ren. Jetzt liegt mit &quot;Carpe Diem&quot; der langerwartete Nachfolger vor, der sich stilistisch nat&#252;rlich nicht sonderlich von den Vorg&#228;ngern unterscheidet. Was allerdings schon beim ersten Durchlauf auff&#228;llig ist, ist die Tatsache, da&#223; sich mit Ausnahme des Openers &quot;Violent Tribe&quot; und &quot;Until It Dies&quot; - zwei St&#252;cke im bew&#228;hrten harten Pretty Maids Gewand mit hohem Wiedererkennungswert - nur zwei wirklich nach vorne peitschende St&#252;cke mit der n&#246;tigen H&#228;rte befinden. Das restliche Songmaterial f&#228;llt deutlich gem&#228;&#223;igter aus und ist im gro&#223;en und ganzen zwar grundsolide, aber wirkliche Kn&#252;ller sucht man dann doch vergebens und auch der Titeltrack ist, entgegen der bisherigen Pretty Maids Tradition (man denke nur an &quot;Spooked&quot; oder &quot;Future World&quot;), eine nur (?) gute Komposition. Nat&#252;rlich hat die Band ihre bisherigen Qualit&#228;ten nicht verlernt und auch Kompositionen wie &quot;Unwritten Pages&quot; oder &quot;Tortured Spirit&quot; kommen mit den &#252;blichen Pretty Maids Elementen wie Bombast, dem untr&#252;glichen Gesp&#252;r f&#252;r Melodien sowie tollen Riffs daher, aber mit Jahrhundertwerken wie &quot;Future World&quot; kann sich &quot;Carpe Diem&quot; sicherlich nicht messen. &quot;Carpe Diem&quot; ist ohne Frage ein gutes Album geworden, welches keinen Pretty Maids Fan wirklich entt&#228;uschen wird, aber ein Meilenstein ist es nun auch wieder nicht. Das d&#252;rfte aber auch das Problem bei Bands wie den Pretty Maids sein: Jeder (und ich schlie&#223;e mich da nicht aus) erwartet immer die uneingeschr&#228;nkte H&#246;chstleistung und kommt unter dem Strich nur ein gutes und vielleicht nicht ganz so spektakul&#228;res Album heraus, werden sofort kritische Stimmen laut und das Album f&#228;llt trotz qualitativer H&#246;hepunkte irgendwie durch. Somit beende ich diese Kritik mit den Worten, da&#223; &quot;Carpe Diem&quot; ein gutes Album geworden ist - nicht mehr, aber sicherlich auch nicht weniger!</P>

<p>Fazit: 8 von 10 Punkten</P>
<center><p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P></Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
