<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, usm, balance of power, silver step child">
<title>USM: Silver Step Child</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">USM: Silver Step Child</font></center></h1></P>

<p>Die wenigsten unter Euch werden wohl bisher den Namen USM geh&#246;rt haben - Balance Of Power wird demhingegen dem einen oder anderen vielleicht ein Begriff sein. Was das miteinander zu tun hat? Ganz einfach: USM sind ein Sideprojekt der Balance Of Power Members Pete Southern (Gitarre), Lionel Hicks (Drums) und Tony Ritchie (Vocals, Bass), der auch das Balance Of Power Debut &quot;When The World Falls Down&quot; eingesungen hat. Stilistsich orientieren sich USM (steht &#252;brigens f&#252;r United States Of Mind) nat&#252;rlich stark an Balance Of Power, gehen dabei einen ganzen Zacken aggressiver und h&#228;rter zur Sache, ohne allerdings die Hardrock Schiene jemals zu verlassen. Herausgekommen sind 10 gelungene, klischeefreie Hardrock Kompositionen, von denen insbesondere die besonders eing&#228;ngige Hymne &quot;Believe It Or Not&quot;, der f&#252;r Balance Of Power Verh&#228;ltnisse recht heavy ausgefallene Opener &quot;Beneath The Low&quot; sowie die beiden Balladen &quot;It`s All Over Now&quot; und &quot;The Weird And The Wonderful&quot; hervorstechen. Was etwas &#252;berrascht ist die Tatsache, da&#223; die Prog. Elemente auf &quot;Silver Step Child&quot;, die bei Balance Of Power ab und an durchkommen, total in den Hintergrund r&#252;cken und somit die eing&#228;ngigen Arrangements in den Vordergrund stellen und &quot;Silver Step Child&quot; aus dem Wulst der Ver&#246;ffentlichungen der letzten Monate hervorragen lassen. Weitere Pluspunkte kann die Scheibe durch S&#228;nger Tony Ritchie sammeln, der seinen Job auf dieser Debut CD einfach nur hervorragend macht. Auch die Produktion ist &#252;ber jede Kritik erhaben, f&#252;r die sich &#252;brigens Dennis Ward, seines Zeichens Bassist bei Pink Cream 69, verantwortlich zeichnet. Somit kann man noch &#252;ber die beiden durchschnittlichen Nummern &quot;That Paranoia Thing&quot; (schwacher Abschluss einer ansonsten tollen CD) sowie &quot;Terrorphobiac&quot; 
(recht heavy, aber irgendwie belanglos) hinwegsehen und die Debutascheibe neben Balance Of Power Fans, die bei &quot;Silver Step Child&quot; einfach zugreifen m&#252;ssen, auch all jenen empfehlen, die auf perfekt inszenierten Hardrock der alten Schule (&quot;Fifth Angel&quot; k&#246;nnten hier als Anhaltspunkt dienen) stehen. Ein gelungener Einstand einer Band, die hoffentlich nicht zu einem simplen Balance Of Power Sideprojekt verkommen wird!</P>

<p>Fazit: 8 von 10 Punkten</P>
<center><p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P></Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
