<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, virgin, steele, house, of, atreus, act 2">
<title>Virgin Steele: The House Of Atreus-Act II</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Virgin Steele: The House Of Atreus-Act II</font></center></h1></P>

<p>Vor gut einem Jahr erschien der erste Teil der Rock Oper aus dem Hause Virgin Steele - jetzt ist endlich der zweite Teil erschienen, der gleich auf einer Doppel CD mit rund 90 Minuten Spielzeit daherkommt. Ge&#228;ndert hat sich im Vergleich zum superben Vorg&#228;nger nat&#252;rlich nichts: Noch immer gibt es zahlreiche kurze, meist instrumentale Zwischenst&#252;cke zwischen den wieder einmal recht heavy ausgefallenen Songs, die daf&#252;r sorgen, da&#223; der epische Aspekt und vor allem der Spanungsmoment der Rockoper in den Vordergrund ger&#252;ckt werden. Basis f&#252;r die Rockoper ist nach wie vor die Atridensage, die Virgin Steele mit dem zweiten Teil jetzt gekonnt in musikalischer Form zu Ende erz&#228;hlen. Hervorhebenswert sind vor allem die typischen Virgin Steele Banger &quot;Wings Of Vengeance&quot;, &quot;The Voice As A Weapon&quot;, &quot;Flames Of Thy Power&quot; sowie das wohl st&#228;rkste und eing&#228;ngiste St&#252;ck &quot;The Wine Of Violence&quot;, die Virgin Steele mal wieder in Bestform zeigen. Nat&#252;rlich sei an dieser Stelle auch nicht verschwiegen, da&#223; es sich bei &quot;The House Of Atreus-Act II&quot;, wie auch schon beim ersten Teil, um keineswegs einfache Kost der Marke HammerFall zum nebenbei h&#246;ren handelt. Vielmehr sollte man seine ganze Aufmerksamkeit dem Album widmen, um optimal in die Atmosph&#228;re der Atridensage eintauchen zu k&#246;nnen und auch die spannungsgeladenen Zwischenst&#252;cke genie&#223;en zu k&#246;nnen - wenn man diese Rockoper nur so nebenbei genie&#223;t, was sicherlich auch m&#246;glich ist, kann es n&#228;mlich passieren, da&#223; einem die eine oder andere Zwischenpassage auch nerven kann. Virgin Steele Fans d&#252;rfte das aber reichlich egal sein, zumal sich mal wieder zahlreiche Anspielungen
auf &#228;ltere Virgin Steele Alben hier finden lassen und zudem diverse musikalische Themen vom ersten Teil aufgegriffen werden, wobei ich es recht schade finde, da&#223; das &quot;In Triumph Or Tragedy&quot; Thema, welches beim ersten Teil auch in &quot;Agony Or Shame&quot; vorkam, beim zweiten Teil nicht mehr aufgegriffen wird. Anyway, &quot;The House Of Atreus-Act II&quot; ist ein sicherlich mehr als w&#252;rdiger Nachfolger geworden und d&#252;rfte niemanden, der schon den ersten Teil mochte, entt&#228;uschen. Virgin Steele Fans haben das Teil ohnehin schon abgegriffen und alle anderen, die auch mal in den Genuss einer anspruchsvollen mit Tiefgang versehenen CD kommen wollen, die einen ab der ersten Sekunde in den Bann zieht, k&#246;nnen hier ebenfalls bedenkenlos zugreifen, wobei man sich dann auch gleich den ersten Teil zulegen sollte....</P> 

<p>Fazit: 10 von 10 Punkten</P>
<center><p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P></Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
