<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, konzert, westfalen, festival, rage">
<title>Festivalbericht: Westfalenfestival</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="yellow">Konzertbericht: Westfalenfestival 2000</Font></center></h1></P>

<p>Das Westfalenfestival hat sich in den letzten Jahren zu einer wirklich lohnenswerten Veranstaltung gemausert: F&#252;r 19 DM bekommt man drei Tage lang ein wirklich gutes Programm geboten (Kino &amp; Discos billiger, viele verschiedene Konzerte etc.) und den Abschluss am Sonntag Abend bildete ein Metal Konzert mit wirklich guten Acts - vorneweg kann ich gleich sagen, da&#223; es sich gelohnt hat.</P>

<p>Aber fangen wir vorne an: Nachdem man am Big Island angekommen war, eine gute Halle mit toller Akkustik, ging`s auch schon gleich mit der ersten Band namens Stormhammer los. Zwar fand ich das Debutalbum der True Metaller &quot;Fireball&quot;, welches im Sommer erschienen ist, nicht besonders herausragend, aber live trat die Band mit einem neuen S&#228;nger sehr souver&#228;n auf und auch die Songs knallten - mit einem neuen S&#228;nger - wesentlich besser als von CD. Der sympathische Haufen stand zwar nicht alzu lange auf der B&#252;hne, aber es war ein rundherum gelungenes Set und ich bin mir sicher, da&#223; die Band einige n
eue Fans gewonnen hat.</P>

<p>Danach traten die mir bisher unbekannten Everflow auf, die mit ihrem Prog. Metal mit leichter Gothic Schlagseite zwar nicht unbedingt in den musikalischen Rahmen passten, aber ihre Sache im gro&#223;en und ganzen recht passabel machten und zumindest im spielerischen Sektor mit leichten Anleihen an Dream 
Theater gl&#228;nzen konnten. Alzu spanned fand ich diese Band zwar nicht unbedingt, aber einige Prog. Fans, die anwesend waren, hatten mit der Band durchaus Spa&#223;, auch wenn ich pers&#246;nlich das Songmaterial nicht gro&#223;artig mitrei&#223;end fand. Nicht schlecht, aber auch nicht wirklich n&#246;tig...</P>

<p>Weiter ging es dann mit At Vance, die ich einige Wochen vorher schonmal in der Matrix (zusammen mit Edguy) gesehen hatte. Immerhin stand ihnen im Big Island eine gr&#246;&#223;ere B&#252;hne zur Verf&#252;gung, die die Herrschaften auch ausgiebig nutzten um geile Melodic Metal Songs im Stil der alten Stratovarius in`s Publikum zu peitschen. So sind Songs wie &quot;The Brave And The Strong&quot;, &quot;Heart Of Steel&quot;, &quot;One For All, All For One&quot; und &quot;King Of Your Dreams&quot; einfach nur Ohrw&#252;rmer vor dem Herrn und kamen bei den Fans nat&#252;rlich sehr gut an, auch wenn die Band durch das Set hindurch arge Probleme mit der Technik hatte - insbesondere Ausnahmegitarrist Olaf Lenk f&#252;hrte einen erbitterten &quot;Krieg&quot; mit der Technik, denn seine Klampfe war am Anfang so gut wie gar nicht zu h&#246;ren. Trotzdem war es ein unterhaltsamer und kurzweiliger Gig einer meiner Lieblingsnewcomer der Jahre 1999 &amp; 2000. </P>

<p>Danach sollten Squealer f&#252;r Unterhaltung sorgen und die machten ihren Job ganz hervorragend und auch die Menge feierte jeden Song der Truppe euphorisch ab. Wie schon in Wacken trat die Band dabei wieder mit zwei S&#228;ngern auf, was dem Gesamterscheinungsbild nur gut tat. Aber auch ohne zwei S&#228;nger w&#228;re
n Songs wie &quot;Eternity Of A Day&quot;, &quot;Free Your Mind&quot; (an alle Zlatkos &amp;J&#252;rgens da drau&#223;en), &quot;Friends For Life&quot; oder &quot;The Final Daylight&quot; &#252;ber jede Kritik erhaben gewesen. Die Band wird sicherlich ihren Weg gehen und sollten Squealer demn&#228;chst hier nochmal live auftreten, werde ich auf jeden Fall dabei sein - die Stimmung bei Squealer war auf jeden Fall sehr euphorisch. Die aktuelle Scheibe der Band sollte mal jeder, der auf bombastischen Power Metal mit einigen Trash Einfl&#252;ssen steht, unbedingt mal antesten und an den Live Qualit&#228;ten der Combo besteht sp&#228;testens seit dem Wacken Gig keinerlei Zweifel mehr.</P>  

<p>Angel Dust waren die n&#228;chste Band, wobei ich von denen bisher nur sehr wenig Material kannte. Live hatte die Truppe aus Dortmund auf jeden Fall einiges auf dem Kasten, wobei ich mit dem Songmaterial der Band nicht unbedingt viel anfangen konnte. Die Songs waren zwar sicherlich nicht schlecht, aber mir pers&#246;nlich zu unspektakul&#228;r, was vielleicht auch am etwas matschigem Sound zu diesem Zeitpunkt gelegen haben k&#246;nnte. Einem Gro&#223;teil der Fans war das aber auf jeden Fall egal und Angel Dust wurden kr&#228;ftig abgefeiert - auf CD t&#246;nt die Truppe &#252;brigens richtig gut, wie ich im Nachhinein feststellen konnte.</P> 

<p>Nach einer langen Umbauphase war es dann endlich so weit: Rage betraten als Trio die B&#252;hne und er&#246;ffneten ihren Set mit der XIII Nummer &quot;From The Cradle To The Grave&quot;. Klaro, da&#223; schon hier die Stimmung kochte und das sollte sich im weiteren Verlauf des tighten Sets, den die Multi-Kulti Truppe hinlegte, auch nicht mehr &#228;ndern: Es folgten viele unsterbliche Highlights wie &quot;Back In Time&quot;, &quot;Firestorm&quot;, &quot;Solitary Man&quot;, &quot;Higher Than The Sky&quot;, &quot;Don`t Fear The Winter&quot; und nat&#252;rlich das obligatorische Drum Solo von Mike Terrana sowie das Gitarrensolo von Victor Smolski. Beide sind auf jeden Fall Experten in ihrem Fach und wer geglaubt hat, da&#223; Rage nach dem Split im letzten Jahr mit nur einer Gitarre nicht mehr rocken w&#252;rden, der irrt gewaltig, denn Victor Smolski macht seine Sache als einziger Gitarrist besser als seine beiden Vorg&#228;nger zusammen - was er an der Gitarre bringt ist einfach nur g&#246;ttlich und hat schon die Klasse von Dream Theater. Ach ja: Rage stellten mit &quot;Sister Demon&quot; sogar noch einen neuen Song vom neuen Album, welches im Fr&#252;hjahr 2001 erscheinen soll, vor. &quot;Sister Demon&quot; kam unglaublich heavy aus den Boxen und erinnerte st&#228;rker an die h&#228;rtere Phase der Band zu &quot;End Of All Days&quot; bzw. &quot;Black In Mind&quot; Phase als an die orchestralen letzten Alben. Auf das neue Werk bin ich auf jeden Fall schon gespannt, denn wenn alle Songs das Niveau von &quot;Sister Demon&quot; halten k&#246;nnen, dann steht uns eines der Highlights des Jahres 2001 bevor. Ansonsten boten Rage zwar keinerlei gro&#223;e &#220;berraschungen mehr, machten aber ihre Sache hervorragend und sorgten somit f&#252;r den perfekten Ausklang eines sch&#246;nen Konzertabends. Bis zum n&#228;chsten mal, Jungs! </P>


<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
