<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>

<p><li> Nach l&#228;ngerer Zeit gibt`s endlich mal wieder ein Lebenszeichen der Melodic Metaller <b>Rough Silk</B>: Die Aufnahmen f&#252;r das n&#228;chste Album &quot;Symphony Of Life&quot; sind bereits im vollen Gange, wobei man mit Gr&#252;ndungsmitglied Herbert Hartmann (Drums) auch gleich einen alten Bekannten zur&#252;ck in die Band geholt hat, da der etatm&#228;&#223;ige Drummer Curt Doernberg mit dem neuen Songmaterial wohl recht wenig anfangen konnte. Ach ja: Als Co-Producer konnte die Band niemand geringeren als <b>Jon Olivia</B> (Savatage) gewinnen....</LI></P>

<p><li> Nach dem <b>Angra</B> Split scheint es jetzt richtig rund zu gehen: Die ehemaligen Bandmitglieder Andre Matos, Luis Mariutti sowie Ricardo Confessori wollen zusammen mit Hugo Mariutti,  Bruder von Luis, eine neue Formation aus dem Boden stampfen und m&#246;glichst bald mit einem Longplayer auf den Markt losgehen. Der restliche Teil von Angra will nat&#252;rlich eher mit selbigem pr&#228;sent sein, wobei sich die Frage stellt, ob nicht zuletzt die Qualit&#228;t darunter leiden k&#246;nnte.</LI></P>

<p><li><b> Dream Theater</B> haben mal wieder etwas f&#252;r ihre Fans: Der rund dreieinhalbst&#252;ndige Gig im Roseland Ballroom wurde f&#252;r eine Live CD / DVD mitgeschnitten und enth&#228;lt u.a. das komplette &quot;Scenes From A Memory&quot; Album und das Epos &quot;A Change Of Seasons&quot;. Wann das Teil erscheinen wird, ist zwar noch nicht ganz klar, aber daran, da&#223; es wohl der absolute Kn&#252;ller wird, d&#252;rfte wohl kein Zweifel bestehen.</LI></P>

<p><li> Nach dem verungl&#252;ckten <b>Metal Church</B> Reunionalbum &quot;Masterpeace&quot; arbeitet die Band mit dem kreativen K&#246;pfen Kurt Vanderhoof und David Wayne zusammen mit den neuen Leuten Brian Lake (Bass) und Jeff Wade (Drums) an einem neuen Album, welches im Februar spruchreif sein soll.</LI></P>

<p><li> Die noch vor einigen Wochen angek&#252;ndigte B-Seiten / Rarit&#228;ren Compilation aus dem Hause <b>Rage</B> wurde aufgrund eines Streites zwischen dem alten Label Noise und den neuen Partnern G.U.N. ersatzlos gestrichen. Eigentlich schade drum, aber daf&#252;r soll im Fr&#252;hjahr ein neues Album erscheinen, welches deutlich h&#228;rter ausfallen wird und somit mit den Klassik Alben &quot;XIII&quot; und &quot;Ghosts&quot; nur noch sehr wenig zu tun hat. Ein erster neuer Track namens &quot;Sister Demon&quot; wurde auf dem Westfalen Festival Live vorgestellt und unterstreicht die vorherige Aussage auf jeden Fall.</LI></P>

<p><li> Die neue <b>Manowar</B> Langrille wurde erneut verschoben: Zun&#228;chst steht im Hause Manowar ersteinmal der zweite Teil der Video / DVD Dokumentation &quot;Hell On Earth&quot; auf dem Program. Gleichzeitig arbeitet man auch noch an der offiziellen Homepage der Band <a href="http://manowar.com" target="_blank">(http://manowar.com)</A>, auf der man in Zukunft alle legend&#228;ren Manowar Konzerte, die man je mitgeschnitten hat, ver&#246;ffentlichen will. Und als ob das alles noch nicht genug w&#228;re, wollen diverse Manowar Mitglieder auch noch Soloprojekte auf den Markt bringen. Wer hat bei all diesen tollen und absolut wichtigen Sachen noch Interesse an einem stinknormalen Manowar Album, welches uns wohl fr&#252;hestens 2002 heimsuchen wird? Eben, wohl nur die Fans der Band sowie die restliche Heavy Metal Community...</LI></P>

<p><li> Nachdem in den letzten Monaten viel rund um die Zukunft von <b>Judas Priest</B> ger&#252;chtet wurde, ging die Band nun an die &#214;ffentlichkeit: Der Jugalator Nachfolger wird wohl im Februar / M&#228;rz 2001 erscheinen, wobei es evtl. auch eine Doppel CD werden k&#246;nnte. An eine Reunion zusammen mit Rob Halford verschwendet man derzeit im Priest Camp keinen Gedanken, womit wohl alle Ger&#252;chte um das aktuelle Line-up gekl&#228;rt sein d&#252;rften. </LI></P>

<p><li> Sachen gibt`s: Nachdem <b>Al Pitrelli</B> bei <b>Savatage</B> aus- und bei <b>Megadeth</B> eingestiegen ist - die offizielle Begr&#252;ndung war, das Al Pitrelli nicht gen&#252;gend Zeit f&#252;r beide Combos zur Verf&#252;gung h&#228;tte - hat der gute jetzt ein Sideprojekt namens Place Called Rage am Start. Da die Debutascheibe schon im Herbst erscheinen soll, kann es mit der fehlenden Zeit nicht alzu weit her sein...</LI></P>

<p><li> Die geplante US Tour von <b>ex-Iron Maiden</B> Frontman <b>Paul Di`Anno</B> fiel in letzter Sekunde in`s Wasser, da sich der amerikanische Zoll weigerte, Di`Anno einreisen zu lassen. Grund daf&#252;r: In England steht dem sympathischen S&#228;nger ein Haftbefehl in`s Haus, weil er angeblich seine Frau verpr&#252;gelt hat. Di`Anno`s  Reaktion war dann gegen&#252;ber dem amerikanischen Zoll recht kurz: &quot;Fuck You And Your Point Of View&quot;...</LI></P>

<p><li> <b>Roy Z</B>, momentan als Starproducer / Co-Songwriter von Rob Halford, Helloween und Bruce Dickinson, in aller Munde, kann nun endlich auch mal seine eigene Kapelle <b>Tribe Of Gypsies</B> einen Schritt nach vorne bringen: Die Jungs konnten den begehrten Posten des Supports von Latin Rock Ikone Carlos Santana f&#252;r sich beanspruchen. Insgesamt wird es 8 Shows in den Staaten geben, wobei im Anschluss daran auch schon die Arbeiten f&#252;r das n&#228;chste Studioalbum beginnen sollen. </LI></P>

<p><li> <b>Spock`s Beard</B> denken nur an die Fans und bringen, wie gewohnt, demn&#228;chst mal wieder ein neues Live Album &#252;ber ihr eigenes Label auf den Markt, auf dem sich wohl auch recht obskure Coverversionen sowie drei Dream Theater Tracks befinden sollen. </LI></P></UL>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
