<html>
 <head>
  <title>Digital Retro</title>
  <meta name="author" CONTENT="David Brunet obligement@free.fr">
 </head>

<body bgcolor="#000000" text="#cccccc" link="#cccc33" vlink="#aaaa22" alink="#cccccc" marginheight="0" marginwidth="0" topmargin="5" leftmargin="0">

<a name="top">

<map name="ObMap">
  <area shape="rect" coords="0,0,760,82" href="http://obligement.free.fr">
  <area shape="rect" coords="8,87,62,104" href="../index.html" alt="Intro">
  <area shape="rect" coords="80,87,168,104" href="edito.html" alt="Editorial">
  <area shape="rect" coords="186,87,278,104" href="apropos.html" alt="A Propos">
  <area shape="rect" coords="296,87,399,104" href="sommaire.html" alt="Sommaire">
  <area shape="rect" coords="414,87,473,104" href="quizz.html" alt="Quizz">
  <area shape="rect" coords="491,87,589,104" href="musiques.html" alt="Musiques">
  <area shape="rect" coords="607,87,648,104" href="pub.html" alt="Pub">
  <area shape="rect" coords="666,87,756,104" href="archives.html" alt="Archives">
</map>

<table align="center" valign="top" width="760" height="100%" background="../gfx/fondsommaire.jpg" bgcolor="#112233" cellspacing="0" cellpadding="0">
 <tr align="top">
  <td align="center">
   <img src="../gfx/oblogo.jpg" ismap usemap="#ObMap" border="0" height="108" width="760" alt="Obligement">

   <br><br><br>
   <table align="center" width="75%">
    <tr>
     <td>

<div align="center"><font size="+3">Livre&nbsp;: Digital Retro </font>par&nbsp;<a href="mailto:ashitaka@brutele.be">Thomas&nbsp;Adam</a></div><br><br><br>


<font size="+1" color="#ccbb33">Introduction</font><br><br>

<img src="../gfx/digiretro_cover.jpg" align="right" hspace="7" vspace="7" alt="DIGITAL RETRO" border="0" width="170" height="180">

« Les ordinateurs que l'on utilise de nos jours permettent de faire beaucoup plus que tout ce qu'on aurait pu imaginer, 
mais la ferveur pour le mat&eacute;riel actuel s'est consid&eacute;rablement amoindrie.
Alors, avec une larme de nostalgie au coin de l'oeil, accompagnez-moi dans un voyage dans le temps, vers un &acirc;ge
plus innocent o&ugrave; les claviers en caoutchouc, les beeps stridents et une palette de 16 couleurs étaient
consid&eacute;r&eacute;s au top de la technique. Bienvenue dans Digital Retro, la naissance de la micro-informatique
personnelle.&nbsp;»<br><br>

Ainsi débute le livre de Gordon Laing, un journaliste ind&eacute;pendant et ancien &eacute;diteur du magazine
Personal Computer World.<br><br>

<b>Attention :</b> je me dois d'ajouter que cet extrait est traduit de l'Anglais par mes soins, et qu'une fois encore
je m'en vais vous parler d'un ouvrage r&eacute;dig&eacute; dans la langue de Shakespeare. Amis anglophobes, passez
votre chemin :).<br><br>

<font size="+1" color="#ccbb33">Contexte historique</font><br><br>

De la fin des ann&eacute;es soixante-dix au tournant des ann&eacute;es quatre-vingt-dix s'&eacute;tend une p&eacute;riode  
qui a vu l'av&egrave;nement des micro-ordinateurs personnels (le terme "PC" recouvrait alors une r&eacute;alit&eacute;
bien plus vaste qu'aujourd'hui).<br><br>

Au cours de cette p&eacute;riode, que les plus anciens d'entre nous consid&egrave;rent parfois comme un &acirc;ge d'or,
une pl&eacute;thore de machines improbables se sont succ&eacute;d&eacute;es avec un rythme et une diversit&eacute; affolante.
Il va sans dire que la notion de compatibilit&eacute; leur &eacute;tait alors &eacute;trang&egrave;re, 
et chacune de ces machines incarnait une vision personnelle de la micro-informatique.<br><br>

<font size="+1" color="#ccbb33">L'ouvrage</font><br><br>

Ce livre peut être vu comme un mus&eacute;e dont l'auteur nous propose une visite guid&eacute;e.
Gordon Laing nous décrit en effet, tout au long des 192 pages de cet ouvrage, la micro-informatique des ann&eacute;es quatre-vingt
au travers des principales machines qui en ont jalonn&eacute; l'histoire.<br><br>

Ce ne sont ainsi pas moins de 38 micro-ordinateurs et 6 consoles de jeux qui sont abord&eacute;s dans ce livre, du
MITS Altair 8800 de 1975 au NeXT Cube de 1988, en passant par les in&eacute;vitables Apple II, Commodore 64 et...
Commodore Amiga !<br><br>

Les ordinateurs sont ainsi d&eacute;crits en d&eacute;tails sous forme de "fiches individuelles", class&eacute;es dans
l'ordre chronologique. D'un brochage de bonne facture, le livre est en outre très agr&eacute;able à feuilleter : les
pages sont en papier glaçé et la mise en page, impeccable et tr&egrave;s lisible,
est admirablement r&eacute;hauss&eacute;e par de grandes photos des ordinateurs, pr&eacute;sentant ces derniers sous
toutes les coutures.<br><br>

De plus, les fiches sont g&eacute;n&eacute;ralement accompagn&eacute;es de textes pr&eacute;sentants le contexte dans
lequel l'ordinateur a &eacute;t&eacute; con&ccedil;u et fabriqu&eacute;,
s'il fait suite &agrave; un autre mod&egrave;le de la même marque, ou s'inspire d'une autre machine.
On trouve &eacute;galement en g&eacute;n&eacute;ral un petit paragraphe "Did you know ?" qui raconte une anecdote en
rapport avec l'ordinateur pr&eacute;sent&eacute;. Je ne peux d'ailleurs pas m'empêcher de vous en citer une&nbsp;:<br><br>

Dans les pages concernant l'Apple 2 :<br><br>

Alors qu'il travaillait encore pour HP, Steve Wozniak s'est amus&eacute; &agrave; lancer un 
service t&eacute;l&eacute;phonique appell&eacute; "Dial-a-joke" : tous les matins, il enregistrait
une blague sur son r&eacute;pondeur t&eacute;l&eacute;phonique, que les gens pouvaient consulter.
Jusqu'à 2000 personnes par jour ont alors appell&eacute; ce r&eacute;pondeur !
Malheureusement Wozniak n'y a pas gagn&eacute; un sou, car &agrave; l'&eacute;poque personne
ne savait comment facturer ce genre d'appels t&eacute;l&eacute;phoniques...<br><br>

<font size="+1" color="#ccbb33">Conclusion</font><br><br>

Ce livre peut &ecirc;tre vu comme un magnifique r&eacute;f&eacute;rentiel des principales machines qui ont
jalonn&eacute;e l'univers de la micro.
Mais au travers des pages de ce livre, c'est une certaine histoire de la micro-informatique qui est
retra&ccedil;&eacute;e pour le lecteur.
Et &agrave; la lecture de l'ouvrage, ce dernier (re)d&eacute;couvre les &eacute;v&egrave;nements qui,
&agrave; partir de cette foisonnante h&eacute;t&eacute;rog&egrave;n&eacute;it&eacute;, ont fa&ccedil;onn&eacute;s
le monde informatique tel qu'on le connaît aujourd'hui.<br><br>

En tout cas, le voyage dans le temps qui est propos&eacute; ici justifie &agrave; lui seul la lecture de ce livre&nbsp;!<br><br>

Addendum : ha, et puisqu'on en est &agrave; parler de machines "old skool", permettez-moi de vous pr&eacute;senter 
une chanson qui parle de ce sujet (attention, c'est une animation Flash) :
<a href="http://www.sautebroussailles.net/files/Hey_Hey_16k.html" target="_blank">"Hey Hey, 16K"</a>.<br><br>

<font size="+1" color="#ccbb33">Pour en savoir plus</font><br><br>

Digital Retro, 192 pages, environ 13,5 Euros sans le port.<br>
Site officiel de l'ouvrage&nbsp;: <a href="http://www.digitalretro.co.uk/" target="_blank">www.digitalretro.co.uk/</a>.<br>
Pour commander&nbsp;: <a href="http://www.amazon.com/exec/obidos/ASIN/078214330X/qid=1102349356/sr=2-1/ref=pd_ka_b_2_1/103-0338610-5680625" target="_blank">amazon.com</a> ou <a href="http://www.ilex-press.com/2_digi_graph/xretr/XRETR_BOOK.htm" target="_blank">Ilex Press</a>.<br><br>

Et encore une fois, je vous encourage &agrave; consulter les liens suivants&nbsp;:<br><br>

Freax, "LE" livre sur la scène démo&nbsp;: <a href="http://www.freax.hu/welcome.html" target="_blank">www.freax.hu/welcome.html</a>.<br>
Mindcandy DVD&nbsp;: <a href="http://www.mindcandydvd.com" target="_blank">www.mindcandydvd.com</a>

<br><br><br>



<div align="center"><a href="#top">Retour en haut</a> | <a href="sommaire.html">Retour au sommaire</a></div><br><br> 



     </td>
    </tr>
   </table>
  </td>
 </tr>
</table>


</body>
</html>

