<html>
 <head>
  <title>Installation de MacOnLinux sur Pegasos 2</title>
  <meta name="author" CONTENT="David Brunet obligement@free.fr">
 </head>

<body bgcolor="#000000" text="#cccccc" link="#cccc33" vlink="#aaaa22" alink="#cccccc" marginheight="0" marginwidth="0" topmargin="5" leftmargin="0">

<a name="top">
</a>

<map name="ObMap">
  <area shape="rect" coords="0,0,760,82" href="http://obligement.free.fr" alt="Obligement">
  <area shape="rect" coords="8,87,62,104" href="../index.html" alt="Intro">
  <area shape="rect" coords="80,87,168,104" href="edito.html" alt="Editorial">
  <area shape="rect" coords="186,87,278,104" href="apropos.html" alt="A Propos">
  <area shape="rect" coords="296,87,399,104" href="sommaire.html" alt="Sommaire">
  <area shape="rect" coords="414,87,473,104" href="quizz.html" alt="Quizz">
  <area shape="rect" coords="491,87,589,104" href="musiques.html" alt="Musiques">
  <area shape="rect" coords="607,87,648,104" href="pub.html" alt="Pub">
  <area shape="rect" coords="666,87,756,104" href="archives.html" alt="Archives">
</map>

<table summary="" align="center" valign="top" width="760" height="100%" background="../gfx/fondsommaire.jpg" bgcolor="#112233" cellspacing="0" cellpadding="0">
 <tr valign="top">
  <td align="center">
   <img src="../gfx/oblogo.jpg" ismap usemap="#ObMap" border="0" height="108" width="760" alt="Obligement">

   <br><br><br>
   <table summary="" align="center" width="75%">
    <tr>
     <td>

<div align="center"><font size="+3">En pratique&nbsp;: installation de MacOnLinux sur Pegasos </font>par&nbsp;<a href="mailto:niffo@free.fr">Nicolas&nbsp;Gressard</a></div><br><br><br>

<div align="center">
<img alt="MacOnLinux" src="../gfx/mol_top.gif" height="149" width="255"><br><br>
</div>

<font color="#ccbb33" size="+1">Introduction<br><br></font>

Le but de cet article n'est pas de vous familiariser avec Linux ni
m&ecirc;me avec MacOS mais simplement de vous offrir un tutoriel qui
vous permettra, si vous suivez scrupuleusement les &eacute;tapes,
d'installer Mac-On-Linux (MOL) sur votre Pegasos&nbsp;2. Il est fort probable que
ce tutoriel s'applique &eacute;galement au Pegasos&nbsp;1 puisque la
distribution de Linux que nous allons utiliser, la Debian, supporte
ces deux machines maintenant officiellement. Nous allons donc installer
une distribution
Linux Debian minimale afin de simplement pouvoir lancer MOL. L'avantage
de ce type de solution par rapport &agrave; PegXMac, par exemple, est
que vous ma&icirc;trisez ce que vous faites, c'est gratuit, et les
mises &agrave; jour de MOL seront &eacute;galement gratuites.<br><br>

<font color="#ccbb33" size="+1">Principe de fonctionnement</font><br><br>

Mac-On-Linux n'est pas un &eacute;mulateur &agrave; proprement parler
mais plut&ocirc;t une machine virtuelle. En effet, le microprocesseur
n'est pas &eacute;mul&eacute; et c'est celui de la machine h&ocirc;te
qui est utilis&eacute; nativement. Seules certaines
sp&eacute;cificit&eacute;s mat&eacute;rielles du Macintosh sont
&eacute;mul&eacute;es comme l'interface son, l'interface r&eacute;seau,
le firmware, etc. MOL n'est d'ailleurs pas sp&eacute;cifiquement une
machine virtuelle destin&eacute;e &agrave; faire tourner MacOS, mais
plut&ocirc;t une machine virtuelle g&eacute;n&eacute;rique pour
plate-forme PowerPC. Un syst&egrave;me de plugins/pilotes permet ensuite
d'&eacute;muler les sp&eacute;cificit&eacute;s d'une plate-forme et
d'un OS particulier. Ainsi, on peut th&eacute;oriquement faire tourner
n'importe quel OS con&ccedil;u pour une plate-forme PowerPC pour peu que le
pilote existe. Les pilotes existant sont pour l'instant&nbsp;:<br><br>

- MacOS (versions de MacOS jusqu'au syst&egrave;me 9).<br>
- MacOSX (versions de MacOS &agrave; partir de 10).<br>
- Linux.<br><br>

Vous l'aurez compris, MOL ne fonctionnera donc que sur une machine dont
le processeur est un PowerPC. Avant l'arriv&eacute;e des Pegasos et
AmigaOne, il n'y avait gu&egrave;re que sur le Macintosh lui m&ecirc;me
que l'on pouvait le faire tourner. Cela permettait de ne pas avoir
&agrave; rebooter sous MacOS, lorsque l'on &eacute;tait sous Linux,
pour lancer des applications Mac. Sur nos machines
pr&eacute;f&eacute;r&eacute;es, MOL a une toute autre dimension&nbsp;;).<br><br>

Pour les connaisseurs, on peut comparer MOL &agrave; VMWare sur PC qui,
&agrave; l'instar de MOL sur PowerPC, permet de lancer des machines
virtuelles X86 afin d'y faire tourner n'importe quel syst&egrave;me d'exploitation X86.<br><br>

<font color="#ccbb33" size="+1">Installation de la distribution Linux minimale</font><br><br>

Nous allons proc&eacute;der &agrave; l'installation de la distribution
Debian en mode "Net-Install". Ceci implique que vous devez avoir une
connexion internet pr&eacute;sente sur votre r&eacute;seau, soit par
l'interm&eacute;diaire d'un routeur, soit par l'interm&eacute;diaire
d'un autre ordinateur qui partage sa connexion internet (PC sous
Windows ou Amiga avec MiamiDX par exemple), soit encore par
l'interm&eacute;diaire d'une Freebox qui se comporte plus ou moins
comme un routeur...<br><br>

Si vous ne souhaitez ou ne pouvez pas installer Linux Debian de cette
fa&ccedil;on, installez le par vos propres moyens, &agrave; partir par
exemple de cédés, et allez directement &agrave; la case "Installation de
MOL" sans toucher 20.000 francs...<br><br>

Pour pouvoir installer Linux il nous faut d'abord un "Installer". Vous
allez pouvoir trouver cet "installer", sur le site de "Monsieur Debian
pour Pegasos", Sven Luther&nbsp;:
<a href="http://people.debian.org/~luther">people.debian.org/~luther</a>
et plus pr&eacute;cis&eacute;ment dans le r&eacute;pertoire
<a href="http://people.debian.org/~luther/debian-installer/daily-powerpc-built/daily/powerpc/">/debian-installer/daily-powerpc-built/daily/powerpc/</a>.<br><br>

Choisissez le r&eacute;pertoire "netboot-minimal" si vous n'installez
Linux que dans le cadre de cet article, sinon vous pouvez choisir
"netboot" ce qui lancera une proc&eacute;dure d'installation plus
compl&egrave;te. Dans le r&eacute;pertoire suivant, je vous conseille
d'utiliser la version 2.4 de la distribution (et donc du noyau) qui
s'av&egrave;re plus simple &agrave; installer pour l'instant sur
Pegasos. Le fichier &agrave; r&eacute;cup&eacute;rer est celui qui se
nomme "vmlinuz-chrp.initrd".<br><br>

Afin de pouvoir lancer l'"installer" depuis le firmware de votre
Pegasos, il va falloir le copier sur une partition FFS. La partition
FFS sur laquelle figure votre noyau MorphOS doit pouvoir faire
l'affaire si elle est suffisamment dimensionn&eacute;e. Dans le cas
contraire, il va falloir cr&eacute;er une partition FFS &agrave; cet
effet. En ce qui me concerne, j'ai d&eacute;di&eacute; un disque dur
&agrave; MorphOS, un &agrave; Linux et un autre &agrave; MacOSX. Sur le
disque Linux, j'ai cr&eacute;&eacute; une petite partition FFS
(gr&acirc;ce &agrave; SCSIConfig sous MorphOS) de quelques Mo en
d&eacute;but de disque destin&eacute; &agrave; cet usage. Une fois
votre "installer" copi&eacute; sur une partition FFS, red&eacute;marrez
votre Pegasos et interrompez la proc&eacute;dure de d&eacute;marrage
&agrave; l'aide de la touche "Echap". Vous vous retrouvez alors dans le
firmware du Pegasos. Tapez la ligne de commande suivante pour lancer le
programme d'installation de Linux&nbsp;: "boot /pci/ide/disk@1,0:0
vmlinuz-chrp.initrd" (sans les guillemets).<br><br>

Cette ligne de commande est bien entendu &agrave; adapter en fonction
de l'emplacement de votre partition FFS. Le premier chiffre
apr&egrave;s le "@" d&eacute;signe le num&eacute;ro de port IDE (0 ou
1). Le second chiffre d&eacute;signe le num&eacute;ro de disque
(0=master, 1 = slave). Enfin, le dernier chiffre d&eacute;signe le
num&eacute;ro de partition.<br><br>

<div align="center">
<img alt="MacOnLinux" src="../gfx/mol_firmware.jpg" height="256" width="508"><br><br>
</div>

Une fois cette commande lanc&eacute;e, et
apr&egrave;s quelques secondes d'attente, vous devriez vous retrouver
dans le programme d'installation de Linux.<br><br>

Les trois premiers &eacute;crans vous demandent de choisir une langue
pour le syst&egrave;me, la localisation et le clavier. Pour le
"hostname", vous pouvez laisser la valeur par d&eacute;faut, idem pour
le nom de domaine qui de toute fa&ccedil;on n'est pas bien important
pour nous. Si vous n'avez pas de serveur DHCP sur votre r&eacute;seau,
il vous sera sans doute demand&eacute; une adresse IP, un masque de
sous-r&eacute;seau ainsi que l'adresse IP de votre passerelle internet.
Le programme d'installation vous demande ensuite dans quel pays vous
souhaitez s&eacute;lectionner un site miroir pour le
t&eacute;l&eacute;chargement&nbsp;: s&eacute;lectionnez la France tant
qu'&agrave; faire&nbsp;;). Sur l'&eacute;cran suivant, s&eacute;lectionnez le
site-miroir par d&eacute;faut. N'entrez pas de proxy. Si votre
acc&egrave;s internet et votre r&eacute;seau sont fonctionnels, le
programme d'installation va t&eacute;l&eacute;charger l'outil de
partitionnement.<br><br>

<div align="center">
<img alt="MacOnLinux" src="../gfx/mol_partman.jpg" height="304" width="409"><br><br>
</div>

Vous pouvez utiliser les modes de partitionnement
automatique qui fonctionnent pas mal ou alors lancer le
partitionnement manuel si vous savez ce que vous faites, mais dans tous
les cas pensez &agrave; gardez de
la place pour MacOS. Si vous optez
pour le mode manuel, vous devrez au moins cr&eacute;er une partition de
type "ext3" avec "/" comme point de montage. Une partition de 1 Go
suffira largement si vous n'envisagez pas d'utiliser Linux &agrave;
d'autres fins. Si vous disposez de moins de 512 Mo de mémoire il est
fortement conseill&eacute; de cr&eacute;er une partition de SWAP
(m&eacute;moire virtuelle), surtout si vous ne d&eacute;diez pas Linux
uniquement &agrave; MOL.<br><br>

Si vous optez pour le mode automatique, une partition de SWAP sera
cr&eacute;&eacute;e. Apr&egrave;s avoir valid&eacute; et
confirm&eacute; la nouvelle table de partition, l'installation de base
de Debian va se charger et s'installer. Cette &eacute;tape prend
environ une quinzaine de minutes sur une liaison ADSL/1024 Mb.<br><br>

A la fin de cette &eacute;tape, le programme d'installation aura
reconnu qu'il tourne sur un Pegasos et vous donnera la commande exacte
&agrave; taper dans le firmware afin de d&eacute;marrer Linux. Notez
scrupuleuse cette ligne&nbsp;! Il sera &eacute;ventuellement possible par la
suite de faire un menu dans le firmware de votre machine afin de
pouvoir s&eacute;lectionner le syst&egrave;me &agrave; d&eacute;marrer
au boot, mais ceci fera peut-&ecirc;tre l'objet d'un article futur...<br><br>

Apr&egrave;s 2 ou 3 messages &agrave; valider, le syst&egrave;me va
red&eacute;marrer et il faudra taper la ligne de commande
sus-not&eacute;e dans le firmware afin de relancer Linux. Le programme
d'installation de Linux red&eacute;marre pour la
derni&egrave;re fois afin de terminer quelques r&eacute;glages&nbsp;:<br><br>

- Horloge GMT&nbsp;: r&eacute;pondez non.<br>
- Fuseau horaire Paris&nbsp;: r&eacute;pondez oui.<br>
- Entrez le mot de passe administrateur (root).<br>
- Cr&eacute;ez un utilisateur et donnez-lui &eacute;galement un mot de
passe.<br>
- Mode de mise &agrave; jour, s&eacute;lectionnez&nbsp;: FTP.<br>
- Pays du miroir&nbsp;: France.<br>
- Site miroir&nbsp;: celui par d&eacute;faut.<br><br>

Un &eacute;cran vous proposant d'installer certaines parties de Linux
s'affiche ensuite. Sauf si vous souhaitez installer un Linux complet
pour certaines raisons, nous n'en avons pas besoin ici. Choisissez
"s&eacute;lection manuelle des paquet &agrave; installer" (ou quelque
chose dans le genre&nbsp;;). Cette action a pour cons&eacute;quence de
lancer un utilitaire nomm&eacute; "Aptitude". Quittez simplement cet
utilitaire pour n'installer aucun "paquet" suppl&eacute;mentaire. Un
dernier &eacute;cran vous invite ensuite &agrave; configurer "Exim",
choisissez simplement "Pas de configuration".<br><br>

L'installation de Linux devrait maintenant &ecirc;tre termin&eacute;e.
A l'invite de "login", identifiez-vous en tant que "root" avec le mot
de passe que vous avez cr&eacute;&eacute; pr&eacute;c&eacute;demment.<br><br>

<font color="#ccbb33" size="+1">Installation de Mac-On-Linux</font><br><br>

La distribution Linux Debian dispose sans doute du syst&egrave;me
d'installation et de mise &agrave; jour de programmes le plus
&eacute;volu&eacute; et &agrave; la fois le plus simple &agrave;
utiliser, comme vous allez pouvoir vous en rendre compte. Avant de
commencer l'installation de Mac-On-Linux, nous allons ajouter un petit
quelque-chose dans le fichier de description des sources de programmes
disponibles, sinon nous n'aurons pas acc&egrave;s aux pilotes
sp&eacute;cifiques de MOL pour MacOS-X.<br><br>

Tapez en ligne de commande (ne tapez pas le "#"&nbsp;!)&nbsp;:<br><br>

# pico /etc/apt/sources.list<br><br>

Vous vous retrouvez alors dans un &eacute;diteur de texte. A la fin de
la deuxi&egrave;me ligne - celle qui commence normalement par "deb ftp
..." - ajoutez "&nbsp;non-free contrib".<br><br>

Tapez CTRL-X pour quitter, "O" pour confirmer et "Enter" pour valider.<br><br>

Il faut maintenant informer le syst&egrave;me d'installation de
programmes de Debian de la pr&eacute;sence de nouvelles sources pour
le t&eacute;l&eacute;chargement en tapant la commande&nbsp;:<br><br>

# apt-get update<br><br>

Apr&egrave;s un peu de moulinage, le syst&egrave;me vous rend la main.
Nous sommes maintenant pr&ecirc;t &agrave; installer MOL. Avant toute
chose, sachez qu'il est possible de faire tourner MOL sous X-Windows,
l'environnement graphique de Linux, en mode fen&ecirc;tr&eacute;. Ce
mode de fonctionnement serait beaucoup plus compliqu&eacute; &agrave;
installer et ne vous apporterait pas grand chose si Linux ne vous
int&eacute;resse pas particuli&egrave;rement. Dans notre cas, MOL se
lancera en mode "Frame-Buffer" en plein &eacute;cran.<br><br>

Pour t&eacute;l&eacute;charger MOL, tapez simplement&nbsp;:<br><br>

# apt-get install mol<br><br>

Ensuite, il faut savoir que pour fonctionner, MOL n&eacute;cessite un
"module" dont la version doit correspondre &agrave; la version du noyau Linux
utilis&eacute;. Vous pouvez voir les modules
pr&eacute;compil&eacute;s &agrave; votre disposition gr&acirc;ce
&agrave; cette commande&nbsp;:<br><br>

# apt-cache search mol |grep modules<br><br>

Si vous avez suivi scrupuleusement cet article, vous
devriez avoir un noyau linux 2.4.27 et donc vous pouvez taper la commande&nbsp;:<br><br>

# apt-get install mol-modules-2.4.27-powerpc<br><br>

Derni&egrave;re chose &agrave; r&eacute;cup&eacute;rer&nbsp;: les pilotes
sp&eacute;cifiques pour OSX. Pour voir la liste des pilotes
pr&eacute;compil&eacute;s disponibles, vous pouvez taper cette commande&nbsp;:<br><br>

# apt-cache search mol |grep drivers<br><br>

Celui qui nous int&eacute;resse est celui pour MacOS X. Tapons donc la
commande&nbsp;:<br><br>

# apt-get install mol-drivers-macosx<br><br>

Avant de pouvoir lancer MOL en lui m&ecirc;me, il reste deux ou trois
petites choses &agrave; faire. En premier lieu, il faut cr&eacute;er un
disque qui servira au syst&egrave;me d'exploitation MacOS. Il y a trois
solutions pour cela.<br><br>

<b>1)</b> Cr&eacute;er un fichier qui servira de disque virtuel pour le Mac.
Nous ne nous &eacute;tendrons pas sur cette solution dont les
performances sont g&eacute;n&eacute;ralement mauvaises.<br><br>

<b>2)</b> Cr&eacute;er une partition sous Linux qui servira de disque pour le
Mac.<br><br>

<b>3)</b> Allouer un disque physique complet pour le Mac.<br><br>

Si vous choisissez la deuxi&egrave;me solution, il faudra cr&eacute;er
une partition sous Linux d'un type quelconque (EXT3 par exemple)
gr&acirc;ce, par exemple, &agrave; l'outil "cfdisk" fourni avec la
distribution. Un autre outil permettant de g&eacute;rer directement des
partitions au format Mac est disponible&nbsp;: "mac-fdisk", mais je ne l'ai
pas essay&eacute;. "cfdisk" prend comme argument le device
correspondant au disque que l'on veut g&eacute;rer. Sous Linux, le
disque maître du premier connecteur IDE se nomme /dev/hda ainsi de
suite&nbsp;: /dev/hdb, /dev/hdc et enfin /dev/hdd pour le disque esclave
du second connecteur IDE. Si vous souhaitez cr&eacute;er une partition sur le
disque esclave du premier connecteur IDE, vous taperez donc&nbsp;:<br><br>

# cfdisk /dev/hdb<br><br>

Attention, la partition Mac doit se trouver dans les 8 premiers Go du
disque pour fonctionner sous MacOS-X&nbsp;!<br><br>

Si vous avez choisi l'option "3", alors il n'y a pas de partition
&agrave; cr&eacute;er sur votre disque d&eacute;di&eacute; &agrave;
MacOS pour l'instant.<br><br>

Nous allons maintenant renseigner les fichiers de configuration de MOL.
Editons le fichier contenant la configuration g&eacute;n&eacute;rale
pour MacOS-X&nbsp;:<br><br>

# pico /etc/mol/molrc.osx<br><br>

Mettez sur la ligne "ram_size" la quantit&eacute; de m&eacute;moire que
vous souhaitez allouer &agrave; MacOS X. Par d&eacute;faut cette valeur
est positionn&eacute;e &agrave; 96, mais elle est trop faible pour
MacOS X. Mettez au moins 128 ou 256. Il faut laisser environ 128 Mo
&agrave; Linux si l'on ne veut pas qu'il swape.<br><br>

Ensuite, juste apr&egrave;s "blkdev: /dev/cdrom -cd ${cdboot}", ajoutez
la ligne&nbsp;:<br><br>

<b>1)</b> "blkdev: /dev/hdxy -rw -force -boot" si vous avez choisi d'utiliser
une partition comme disque Mac. Remplacez "x" dans la chaine "hdxy" par
votre disque (a, b, c ou d) et "y" par le num&eacute;ro de votre
partition (1, 2, 3,...).<br><br>

<b>Ou</b><br><br>

<b>2)</b> "blkdev: /dev/hdx -rw -force -boot -whole" si vous avez choisi
d'utiliser un disque entier pour le Mac. Remplacez "x" dans la chaine
"hdx" par votre disque (a, b, c ou d).<br><br>

Comme pr&eacute;c&eacute;demment, quittez par CTRL-X puis "O" puis
"Enter".<br><br>

Configurons maintenant le r&eacute;seau en &eacute;ditant le fichier
/etc/mol/molrc.net&nbsp;:<br><br>

# pico /etc/mol/molrc.net<br><br>

Il existe trois types diff&eacute;rent de pilotes r&eacute;seau pour
MOL. La solution la plus simple &agrave; mettre en oeuvre est d'activer
le pilote "sheep". Pour
cela, ajoutez la ligne suivante dans le fichier&nbsp;:<br><br>

"netdev: eth0 -sheep"<br><br>

Quittez par CTRL-X puis "O" puis "Enter".<br><br>

Le son ne peut, &agrave; ma connaissance, pas fonctionner pour
l'instant avec la sortie int&eacute;gr&eacute;e de la carte
m&egrave;re du Pegasos. Si vous souhaitez le faire fonctionner, il
faudra vous &eacute;quiper d'une SoundBlaster Live et &eacute;diter
le fichier "/etc/mol/molrc.sound".<br><br>

D'autre part, avec cette version de la distribution Debian, votre
souris ne fonctionnera que si elle est connect&eacute;e &agrave; un
port USB et non pas PS/2. Ce petit soucis semble &ecirc;tre
r&eacute;gl&eacute; avec la derni&egrave;re version (2.6.8), mais cette
derni&egrave;re est quelque peu plus difficile &agrave; installer dans
le sens ou elle reconna&icirc;t les trois interfaces r&eacute;seau du
Pegasos-2 et ou il vous faudra "trifouiller" un peu la configuration
r&eacute;seau de Linux pour lui faire utiliser la bonne puisque par
d&eacute;faut il se r&egrave;gle sur la sortie Gigabit (ou FireWire,
je ne sais plus...).<br><br>

Encore une derni&egrave;re chose avant de pouvoir enfin booter sur le
cédé de MacOS&nbsp;: configurer les modes vid&eacute;o support&eacute;s par
votre moniteur. Pour cela, il faut lancer la commande&nbsp;:<br><br>

# molvconfig<br><br>

Laissez-vous guider par les questions. Appuyez sur une touche pour
valider chaque mode qui s'affiche correctement (d&eacute;grad&eacute;
de couleur). Evitez de tester les modes pour lesquels vous savez que
votre moniteur ne fonctionnera pas.<br><br>

Je crois qu'un reboot est n&eacute;cessaire afin que MOL puisse "voir"
ses modules fra&icirc;chement install&eacute;s. Tapons donc la commande&nbsp;:<br><br>

# reboot<br><br>

Red&eacute;marrez sous Linux toujours avec la ligne de commande magique
&agrave; taper dans le firmware. Reloguez-vous en "root".<br><br>

<font color="#ccbb33" size="+1">Installation de MacOS X</font><br><br>

Ins&eacute;rez le premier cédé de MacOS X dans le lecteur de cédé de votre
Pegasos. Vous devez, je suppose, l&eacute;galement poss&eacute;der un
Mac pour avoir le droit d'effectuer cette op&eacute;ration. J'ai
personnellement utilis&eacute; l'installation en 3 cédés de "MacOS X 10.3
- Panther".<br><br>

Lancez la ligne de commande suivante&nbsp;:<br><br>

# startmol -X --cdboot<br><br>

Si tout se passe bien, vous devriez sous peu voir appara&icirc;tre un
petit Pingouin serrant amoureusement dans ses bras une pomme. Vous avez
saisi le symbole&nbsp;?&nbsp;;). Quelques instants encore plus tard, votre cédé
commence &agrave; s'agiter puis vous acc&eacute;dez au premier
&eacute;cran du programme d'installation de MacOS X. Si votre souris ne
fonctionne pas, branchez une souris USB. Laissez-vous guider &agrave;
travers les &eacute;crans (que je ne d&eacute;taillerai pas)
jusqu'&agrave; ce que le programme vous demande de s&eacute;lectionner
le "volume d'installation". Aucun volume ne doit appara&icirc;tre dans
la liste sauf si peut-&ecirc;tre vous avez utilis&eacute; "mac-fdisk" pour
partitionner pr&eacute;c&eacute;demment. Pour lancer l'utilitaire de
partitionnement de MacOS, allez dans le menu "Installer" et
s&eacute;lectionnez "Ouvrir Utilitaire de disque". S&eacute;lectionnez
dans la colonne de gauche le volume qui correspond au disque que vous
avez allou&eacute; au Mac et validez le partitionnement. Laissez toutes
les valeurs par d&eacute;faut, c'est tr&egrave;s simple d'emploi.
Quittez l'utilitaire de partitionnement. Il me semble qu'il faut
relancer l'installation de MacOS X pour que le disque soit
d&eacute;finitivement reconnu, ce que vous pouvez faire avec l'option
"Quitter l'installation" du menu "Installer".<br><br>

Relancer alors MOL avec la m&ecirc;me ligne de commande que
pr&eacute;c&eacute;demment.<br><br>

Je ne commenterai pas la suite de l'installation puisqu'il suffit de
suivre ce qui est &eacute;crit &agrave; l'&eacute;cran. Une fois MacOS
compl&egrave;tement install&eacute;, vous pourrez lancer MOL avec la
ligne de commande suivante&nbsp;:<br><br>

# startmol -X<br><br>

<div align="center">
<img alt="MacOnLinux" src="../gfx/mol_osx.jpg" height="312" width="403"><br><br>
</div>

Le r&eacute;seau ainsi que le son ne fonctionneront pas encore sous
MacOS car il faudra installer les "drivers" ou encore "extensions" en
terminologie Mac. Ceci se fait tr&egrave;s simplement en ouvrant
l'ic&ocirc;ne "MOL-Install" qui a d&ucirc; monter automatiquement sur
le bureau de MacOS. Cliquez simplement sur "MOL Package.pkg" pour
installer les pilotes. Ensuite, il faudra aller dans les
"Pr&eacute;f&eacute;rences Syst&egrave;me" sous MacOS pour
param&eacute;trer le r&eacute;seau et &eacute;ventuellement le son.<br><br>

Lorsque vous &ecirc;tes sous MacOS, vous pouvez &agrave; tout moment
basculer sur la console Linux d'ou MOL a &eacute;t&eacute; lanc&eacute;
gr&acirc;ce &agrave; la combinaison de touche "CTRL-ALT-F1" ou sur une autre
console gr&acirc;ce &agrave; "CTRL-ALT-F2", etc. Pour retourner sous
MacOS, tapez "ALT-F7". Lorsque vous &ecirc;tes sur la console qui a
lanc&eacute; MOL, vous pouvez "breaker" MOL en appuyant deux fois de
suite sur les touches "CTRL-C".<br><br><br>


<div align="center"><a href="#top">Retour en haut</a> | <a href="sommaire.html">Retour au sommaire</a></div><br><br> 

     </td>
    </tr>
   </table>
  </td>
 </tr>
</table>


</body>
</html>