<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, primal, fear, primal fear, nuclear fire, jaws of death, ralf scheepers, mat, sinner">
<title>Primal Fear: Nuclear Fire</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Primal Fear: Nuclear Fire</font></center></h1></P>


<p>Wer dachte, da&#223; sich Primal Fear nach ihren beiden bisherigen Alben &quot;Primal Fear&quot; (1998) sowie &quot;Jaws Of Death&quot; (1999) nicht nocheinmal steigern k&#246;nnen, wird von dem neuesten Werk &quot;Nuclear Fire&quot; eines besseren belehrt: Waren schon die beiden Vorg&#228;ngeralben alles andere als schwach auf der Brust, kommt &quot;Nuclear Fire&quot; nochmal eine ganze Ecke wuchtiger und aggressiver aus den Boxen, was nicht zuletzt an der &#252;beraus fetten Produktion, f&#252;r die sich das eingespielte Duo Mat Sinner und Achim K&#246;hler erneut verantwortlich zeichnet, liegt. Aber was n&#252;tzt das alles, wenn die Songs schwach w&#228;ren? So zaubern Primal Fear auf &quot;Nuclear Fire&quot; erneut 12 Sahnekompositionen aus dem Hut, die allesamt die internationale Klasse der Band eindrucksvoll untermauern. Schon der brachiale Opener &quot;Angel In Black&quot; macht unmissverst&#228;ndlich klar, da&#223; Primal Fear auf &quot;Nuclear Fire&quot; keine Kompromisse eingehen werden und untermauern diese Einstellung gleich mit dem bisher aggressivsten und schnellsten Primal Fear St&#252;ck &#252;berhaupt, welches auf den Namen &quot;Back From Hell&quot; h&#246;rt und Ralf Scheepers als S&#228;nger perfekt in Szene setzt - nicht nur hier f&#228;llt einem als passender Vergleich Judas Priest zur &quot;Painkiller&quot; Phase ein. Nat&#252;rlich ist auch das weitere Material &#252;ber jede Kritik erhaben und bietet zudem mit der &#220;berballade &quot;Bleed For Me&quot;, dem stampfenden Track &quot;Now Or Never&quot; und dem Groovemosnter &quot;Eye Of An Eagle&quot; Abwechselung pur. Zus&#228;zlich haben die Jungs es geschafft, mit dem Titeltrack &quot;Nuclear Fire&quot; eine Hymne par excellence abzuliefern, die sicherlich mit zu den besten Kompositionen geh&#246;rt, die die Band bisher zustande gebracht hat. Negativ bemerkbar machte sich lediglich der platte Umgang mit Klischees, was nicht zuletzt auch an Songtitel wie &quot;Living For Metal&quot; liegt. Anyway, das eine Band nicht unbedingt mit lyrischen Erg&#252;ssen gl&#228;nzen muss, um eine geile Scheibe abzuliefern ist hinl&#228;nglich bekannt und insofern kann man &quot;Nuclear Fire&quot; nur ein verdammt hohes Niveau attestieren, welches Primal Fear von ihrer besten und kompromisslosesten Seite zeigt und bisherige Fans der Band ausnahmslos begeistern wird. Und das Judas Priest Fans Primal Fear ohnehin mal antesten sollten, brauche ich wohl auch nicht mehr zu erw&#228;hnen...</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
