<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, stratovarius, konzert, heavenly, silent force">
<title>Konzertbericht: Stratovarius, Heavenly und Silent Force</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="yellow">Konzertbericht: Stratovarius, Heavenly und Silent Force</Font></center></h1></P>

<p>Am 12.12. gastierten Stratovarius nochmals in meinem unmittelbaren Umkreis (Turbinenhalle in Oberhausen) und obwohl ich die Band in diesem Jahr schon zweimal gesehen hatte (Wacken und Zeche Bochum), wollte ich es mir nicht nehmen lassen, die Band vor der nun anstehenden dreij&#228;hrigen Pause nochmals live zu erleben.</P>

<p>Die beiden Vorbands habe ich leider verpasst, da der Terminkalender es an diesem Dienstag einfach nicht anders zulie&#223;, wobei ich von Silent Force (mit ex-Royal Hunt S&#228;nger D.C. Cooper) immerhin noch das gut gemachte Judas Priest Cover &quot;All Guns Blazing&quot; mitgekriegt habe. Na ja, zwar etwas &#228;rgerlich, da&#223; ich die beiden Newcomer nicht live erleben konnte, aber immerhin war ich prim&#228;r wegen Stratovarius gekommen....</P>

<p>.... die ein &#228;hnliches Sett spielten, wie schon Anfang des Jahres in der Zeche und folgerichtig mit &quot;Hunting High And Low&quot; und &quot;Millennium&quot; er&#246;ffneten. Aber schon bei diesem eigentlich fulminanten Einstieg merkte man, da&#223; dieser Abend irgendwie merkw&#252;rdig war: Obwohl die Band in bester Spiellaune war und technisch alles perfekt meisterte, wollte keine richtige Stimmung aufkommen, was wohl in erster Linie an einem Gro&#223;teil der Fans lag, die total demotiviert und lustlos in der Gegend rumstanden und auch nichts taten, um diesen Zustand abzu&#228;ndern. Selbst in den ersten drei Reihen war nur wenig los - ein Dank an dieser Stelle an die wenigen, die wenigstens versucht haben, ordentlich mitzugehen. Wie gesagt, an der Band und an der Setlist lag es wirklich nicht, denn Songs wie &quot;Paradise&quot;, &quot;Against The Wind&quot;, &quot;Father Time&quot;, &quot;Black Diamond&quot; oder auch die Nummern vom neuen Album wieetwa &quot;Phoenix&quot; oder &quot;Infinity&quot; haben bisher immer f&#252;r Stimmung gesorgt. Gl&#252;cklicherweise hat sich die allgemeine Unlust im Publikum nicht auch noch auf die Band &#252;bertragen, die trotz allem alles gab und somit daf&#252;r sorgte, da&#223; wenigstens diejenigen, die Lust auf ein richtig gutes Konzert hatten, die Vollbedienung bekamen. Aufgrund der schlechten Erfahrungen der vergangenen Monate hatte die Band an diesem Abend &#252;brigens auf den Einsatz von Pyros verzichtet, denn sowohl S&#228;nger Timo Kotipelto als auch Keyboarder Jens Johansson hatten auf der &quot;Infinite&quot; Tour bereits Verletzungen durch selbige davongetragen - ein durchaus verst&#228;ndlicher Grund also, wof&#252;r man als optischen Ersatz mal wieder die bereits bekannte Leinwand im Gep&#228;ck hatte, dessen Motive sich im Laufe des Sets kontinurirlich &#228;nderten und insbesondere beim 10 min&#252;tigen Epos &quot;Infinite&quot; zu einem gewissen Grad f&#252;r G&#228;nsehautatmosph&#228;re 
sorgte. Auch das obligatorische J&#246;rg Michael Drum Solo fehlte an diesem Abend, was sicherlich auch auf die fehlende 
Stimmung im Publikum zur&#252;ckzuf&#252;hren ist. Immerhin gab es im Laufe des Sets mit &quot;Twilight Symphony&quot; vom &quot;Fourth Dimension&quot; Album noch eine kleine &#220;berraschung, die zumindest ich nicht unbedingt erwartet h&#228;tte.</P>

Alles in allem also ein recht schwacher Gig, was aber keineswegs an der Band, am Sound, am Wetter oder am Weihnachtsmann sondern ausschlie&#223;lich an den Fans lag. Schade, da&#223; sich Stratovarius zwangsweise so verabschieden mussten, denn genau so wollte ich die Band nicht in Erinnerrung behalten. Aber zwei bis drei Jahre sind ja auch nicht die Ewigkeit und vielleicht sorgt diese Pause bei einigen, offenbar Stratovarius &#252;bers&#228;ttigten Fans auch mal f&#252;r ein Umdenken in Sachen Konzerte, so da&#223; die Band wieder euphorischer abgefeiert wird....</P>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
