<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>
<p><li>  Konstanz ist wohl ein Wort, welches man garantiert niemals in Bezug auf die Rhytmus Sektion bei <b>Iced Earth</B> anwenden wird: So besteht die neue Rhytmusabteilung bei Iced Earth, derren &quot;Melancholy EP&quot; beim erscheinen dieser Ausgabe bereits erh&#228;ltlich ist, nunmher aus Steve DiGiorgio (Bass) und Richard Christy (Drums). Das neue Album &quot;Horror Show&quot; wird &#252;brigens im April spruchreif sein.</LI></P>

<p><li>  Neuigkeiten gibt es auch aus dem <b>Nightwish</B> Lager: Im April wird zun&#228;chst eine DVD erscheinen, auf der s&#228;mtliche Videoclips, massenhaft Live Aufnahmen sowie diverse Backstage Szenen verbraten werden. Zeitgleich wird es auch eine neue EP der finnischen Senkrechtstarter geben.</LI></P>

<p><li>  Da leider die geplante <b>Elegy</B> Tour abgesagt werden musste, zieht Elegy S&#228;nger <b>Ian Parry</B> seine zweite <b>&quot;Consortium Project&quot;</B> Scheibe vor, die angeblich schon im Februar erscheinen soll und auf der sich wieder einige nahmhafte Musiker die Klinke in die Hand geben.</LI></P>

<p><li>  Ruhe scheint bei <b>Royal Hunt</B> momentan einfach nicht einkehren zu wollen: Nun musste auch Drummer <b>Allan Sorenson</B> dran glauben, wobei man noch keinen Ersatzmann pr&#228;sentieren konnte. Eine EP, an der man momentan arbeitet, soll dennoch in absehbarer Zeit erscheinen.</LI></P>

<p><li>  Ein absolutes Highlight k&#252;ndigt sich wohl f&#252;r das n&#228;chste Jahr an: <b>Bruce Dickinson</B> (Iron Maiden), <b>Rob Halford</B> (ex-Judas Priest) und <b>Geoff Tate</B> (Queensryche) haben sich unter dem Namen &quot;Three Tremors&quot; zusammen getan und wollen im Jahr 2001 eine gemeinsame CD aufnehmen. Wenn das mal nicht eines der Ereignisse im Jahre 2001 wird...</LI></P>

<p><li>  Keine guten Nachrichten gibt es aus dem <b>Grave Digger Camp</B>: Nachdem die Band am 11.11. in der Zeche noch das 20-j&#228;hrige Bandjubil&#228;um feierte (Konzertbericht in der letzten Ausgabe), ist nun Gitarrist <b>Uwe Lulis</B> bei den Totengr&#228;bern ausgestiegen. Und als ob das noch nicht genug w&#228;re, scheint man anscheinend auch das Live Album / Video, welches man im Janaur 2000 ebenfalls in der Zeche mitgeschnitten hat, gecancelt zu haben. Momentan h&#228;lt sich das Ger&#252;cht, nachdem es sich bei dem neuen Gitarristen um ein ehemaliges Mitglied von Rage handeln soll...</LI></P>

<p><li>  Die bisher absolut unterbewerteten Prog. Metaller von <b>Shadow Gallery</B>, die 1998 mit &quot;Tyranny&quot; ein schlicht und ergreifend hervorragendes Prog. Metal Konzeptalbum abgeliefert haben, haben die Aufnahmen zu ihrem neuen , mitlerweile viertem Album abgeschlossen. Ver&#246;ffentlicht wird das ganze wohl im Fr&#252;hjhar 2001 - ich bin 
jetzt schon gespannt, ob das neue Album die Qualit&#228;t von &quot;Carved In Stone&quot; oder &quot;Tyranny&quot; halten kann.</LI></P>

<p><li>  Und wo wir gerade beim Thema Prog. Metal sind: <b>Dream Theater</B> basteln momentan flei&#223;ig an einem Video und einer DVD, wobei ich allen Dream Theater Fans die DVD nur w&#228;rmstens empfehlen kann, soll diese doch immerhin mehr als eine Stunde l&#228;nger sein als die normale Video Version. </LI></P>

<p><li>  Kaum hat <b>Rob Halford</B>, seines Zeichens ex-S&#228;nger von Judas Priest und momentan mit seinem Soloausflug &quot;Resurrection&quot; in aller Munde, den klassischen Metal wieder f&#252;r sich entdeckt, steht uns f&#252;r das Fr&#252;hjahr 2001 ein <b>Live Album</B> von Rob Halford in`s Haus. Ob das nach nur einem Studioalbum und einer 
aus meiner Sicht eher m&#228;&#223;igen Performance im Vorprogramm von Iron Maiden wirklich sein muss?</LI></P>

<p><li>  Obwohl <b>Stratovarius</B> jetzt erstmal f&#252;r zwei bis drei Jahre von der Bildfl&#228;che verschwinden, wird es im April eine Rarit&#228;ten Compilation geben, was wir in einer der vergangenen Ausgaben ja auch schon angeschnitten hatten. Nun gibt`s konkretere Infos: Auf der CD werden sowohl einige Japan Bonus Tracks, diverse Live Aufnahmen und sogar der eine oder andere neue Track verewigt sein. Was die Solo CD`s der Stratovarius Members betrifft: <b>Timo Kotipelto</B> und <b>Timo Tolkki</B> werden auf jeden Fall im Jahr 2001 mit jeweils einem Album am Start sein und auch Keyboarder <b>Jens Johansson</B> hat etwas in der Mache - lassen wir uns einfach &#252;berraschen.</LI></P>

<p><li>  Es h&#228;tte mich auch ziemlich gewundert, wenn das Line-up von Egozentriker <b>Yngwie Malmsteen</B> mal &#252;ber eine l&#228;ngere Zeit stabil geblieben w&#228;re: Nun musste S&#228;nger <b>Mark Boals</B>, wie viele schon vor ihm, dran glauben, der durch Jorn Lande (u.a. The Snakes, Millenium) ersetzt wird. Mark Boals arbeitet derweil schon flei&#223;ig an einer Solokarriere.</LI></P>

<p><li>  Bei <b>Gamma Ray</B> scheint es ausnahmsweise mal etwas schneller als geplant voranzugehen - ein Gro&#223;teil der Songs f&#252;r das neue Langeisen der Hamburger sollen schon so gut wie fertig sein und mit einem Release soll noch im Fr&#252;hjahr zu rechnen sein. </LI></P>

<p><li>  Vinyl Fans aufgepasst: <b>Century Media</B> haben einen Gro&#223;teil der Releases der letten Monate jetzt in einer limitierten St&#252;ckzahl auf <b>Vinyl</B> zu einem Preis von knapp 20 DM anfertigen lassen. Wer also dem CD Sound nix abgewinnen kann und nach wie vor auf Vinyl steht, der sollte schonmal anfangen zu spaaren...</LI></P>

<p><li>  Das geplante <b>Iron Maiden Live Album</B> wird am 16.1. in Rio mitgeschnitten - mit einem Release ist aber fr&#252;hestens im Sommer zu rechnen. </LI></P>
</UL>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
