<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. AMIGA schlie&szlig;t Kooperationen mit Wonder Computer und Software Hut</H2>
<P>
&raquo;AMIGA INC. GIBT VEREINBARUNG ZUR HERSTELLUNG AUTHORISIERTER ENTWICKLER-
WORKSTATIONS IN NORDAMERIKA BEKANNT.
</P>
<P>
13. Juli 2000 - AMIGA Inc., Snoqualmie, Washington, gibt Vereinbarungen mit
Wonder Computers International Inc. in Ottawa, Kanada und Software Hut,
Inc. in West Chester, Pennsilvania, f&uuml;r Herstellung und Vertrieb bekannt.
Diese Vereinbarungen gestatten die Herstellung von Entwickler-Workstations
mit AMIGA-Authorisation in Nordamerika.
</P>
<P>
Sowohl Software Hut wie auch Wonder Computers sind wohl bekannt und hoch
geachtet in der Amiga-Gemeinschaft. Seit gut einer Dekade setzen sie sich
f&uuml;r den Amiga ein.
</P>
<P>
AMIGA, Software Hut und Wonder Computers haben gemeinsame Visionen und
Strategien, um den Amiga der N&auml;chsten Generation als herausragende Media-
Plattform und Operationsumgebung der Zukunft zu begr&uuml;nden.
</P>
<P>
&quot;Es ist sehr befriedigend f&uuml;r uns, das Software Development Kit (SDK)
planm&auml;&szlig;ig herausgebracht zu haben und dass wir nun der Gemeinschaft mit der
Amiga Developer Workstation so eine ausgezeichnete Aufwertung bieten
k&ouml;nnen. Es freut uns ebenso, die Unterst&uuml;tzung von Software Hut und Wonder
Computers f&uuml;r dieses Ger&auml;t zu haben. Mit dieser Entwickler-Maschine
erreichen wir unser Ziel, die den Entwicklern versprochene bin&auml;re
Kompatibilit&auml;t &uuml;ber die Plattformen hinweg mit ausgezeichneter Qualit&auml;t als
hervorragende Hardware zur Verf&uuml;gung zu stellen. Ohne Zweifel ist dies eine
willkommene Nachricht f&uuml;r all jene in der Gemeinschaft, die etwas f&uuml;r ihr
Geld sehen wollen, wenn sie f&uuml;r die gro&szlig;e Zahl an Zielplattformen
entwickeln, die Amiga unterst&uuml;tzt,&quot; sagte Randall Hughes, Vize-Pr&auml;sident
f&uuml;r Verkauf und Strategische Verbindungen (Sales and Strategic Alliances)
bei AMIGA Inc.
</P>
<P>
&quot;Bei Software Hut sind wir sehr erfreut, zum offiziellen US-Vertrieb f&uuml;r
die authorisierte Amiga Developer Workstation erw&auml;hlt zu sein. Viele
unserer Kunden und Vertriebspartner warteten dringend auf ein Ger&auml;t mit
allen F&auml;higkeiten, das Amiga-SDK in einem einzigen Verbund laufen zu
lassen. Unsere gemeinsamen Anstrengungen mit AMIGA Inc. und Wonder Computer
werden sicher stellen, dass alle Entwickler leicht und preiswert Zugang zu
den Werkzeugen haben werden, um die notwendige Software zu entwickeln, die
den Computerbetrieb, den wir heute kennen. revolutionieren wird,&quot; sagte
Joseph Muoio, Pr&auml;sident von Software Hut, Inc.
</P>
<P>
&quot;Wir sind stolz darauf, ein Teil dieses Quantensprungs der
Computertechnologie zu sein und freuen uns auf die enge Zusammenarbeit mit
AMIGA und Software Hut in den n&auml;chsten Wochen und Monaten bei diesem
Projekt. Die Entwickler-Maschine ist mehr als nur ein Werkzeug. Sie bietet
den jetzigen und fr&uuml;heren Amiga-Freunden &uuml;berall die erste erkennbare
Gelegenheit, sich zusammen zu tun und eine wirkliche Wende in der Art, wie
Computer arbeiten, einzuleiten.
</P>
<P>
Die Entwicklermaschine kann dazu so konfiguriert werden, dass auf ihr durch
Emulation auch originale Amiga-Software (Amiga Legacy software) laufen kann
und dadurch potentiell an Wert f&uuml;r jeden gewinnt, der sie kaufen m&ouml;chte,&quot;
hebt Mark Habinski, Pr&auml;sident von Wonder Computers International Inc.,
hervor.
</P>
<P>
Die Entwicklermaschine stellt einen unvergleichlichen Wert dar, sie
verwendet Markenbauteile h&ouml;chster Qualit&auml;t und ist mit einer umfassenden
Garantie auf die Hardware und einer hochwertigen Unterst&uuml;tzung durch AMIGA
Inc. ausgestattet. Die Workstation enth&auml;lt auch das Amiga SDK. &quot;Bei AMIGA
sind wir stolz darauf, dass unser Name auf der von Amiga authorisierten
Workstation steht, &quot; sagte Mr. Hughes bez&uuml;glich des hohen Wertes und des
g&uuml;nstigen Preises. So ein Preis/Leistungsverh&auml;ltnis ist mit geklonter
Hardware nicht m&ouml;glich. Wenn nicht das offizielle Amiga-Boing-Zeichen
darauf ist, ist es keine authorisierte Amiga-Workstation. Bitte informieren
Sie sich bei www.amiga.com bez&uuml;glich umfassender Einzelheiten.
</P>
<P>
&Uuml;ber AMIGA Inc.
</P>
<P>
Das Ziel von AMIGA ist es, genau die richtige Plattform, Architektur und
die richtigen Werkzeuge f&uuml;r das entstehende digital umfassende Universum
(Digital Content Universe) zur Verf&uuml;gung zu stellen. Mit diesem Vorsatz
werden wir unsere Partner und Kunden in einzigartiger Weise unterst&uuml;tzen
Produkte zu schaffen, die sich aus den Versprechungen des digitalen
Zeitalters ergeben. Die Freigabe unserer ersten Produkte, des Amiga-
Entwicklungspakets (SDK) und nun der Amiga-Entwicklermaschine erlaubt es
Tausenden von Entwicklern, die der alten f&uuml;r Dienste der Vergangenheit
bestimmten Plattformen m&uuml;de sind, sich mit den Zehntausenden Amiga-
Entwicklern zu verbinden, die mit dem Amiga arbeiten, um nun den Inhalt zu
erschaffen, der das Heute und das Morgen erf&uuml;llen wird. Um zus&auml;tzliche
Informationen zu erhalten, besuchen Sie bitte <A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>.
</P>
<P>
&Uuml;ber Software Hut, Inc.
</P>
<P>
Software Hut, Inc. begann 1982 als kleiner Familienbetrieb spezialisiert
auf Apple-Produkte. Nach dem Erscheinen des AMIGA 1000 erkannte Software
Hut das Marktpotential dieses &uuml;berlegenen grafischen Systems und widmete
die letzten 12 Jahre der F&ouml;rderung und dem Verkauf der Produktlinie des
Amiga. Die Beliebtheit des Amiga und seine unglaublichen grafischen
Anwendungen haben Software Hut aus seinen einfachen Anf&auml;ngen heraus zu
einem der gr&ouml;&szlig;ten Amiga-Vertriebe der Welt geformt. Um weitere
Informationen zu erhalten, besuchen Sie bitte <A HREF="http://www.softhut.com" TARGET="_top">http://www.softhut.com</A> oder
senden Sie eine Nachricht an <A HREF="mailto:amiga@softhut.com.">amiga@softhut.com.</A>
</P>
<P>
&Uuml;ber Wonder Computers International, Inc.
</P>
<P>
Wonder Computers International Inc. in Ottawa, Ontario, Kanada, ist nun
seit f&uuml;nf Jahren im Gesch&auml;ft. Aus einem einfachen Anfang als Zwei-Mann-
Verkaufs-Team entwickelte es sich zu einem Mehr-Millionen-Dollar-Gesch&auml;ft
und besch&auml;ftigt zwanzig Mitarbeiter. Wonder Computers baut seine eigene
Linie von Desktop-Computern bei agressiver Preisgestaltung, arbeitet als
ISP (Internet Service Provider), unterh&auml;lt eine vollst&auml;ndige
Dienstleistungsabteilung mit der F&auml;higkeit zur ortsunabh&auml;ngigen
Unterst&uuml;tzung und verkauft Einzel- und Gemeinschafts-L&ouml;sungen, Netzwerke,
Computer und Bauteile. Der Markt, auf den Wonder hinzielt, schlie&szlig;t den
Amiga-Computer und die zugeh&ouml;rige Peripherie, Angel Notebooks und jede Art
nichtlinearer L&ouml;sungen f&uuml;r Video- und Multimedia-Computer ein. Auch &uuml;ber
seine Website erledigt Wonder Computers ein wachsendes Versandgesch&auml;ft und
liefert Systeme und verwandte Produkte &uuml;berall hin nach Nordamerika.
Weitere Informationen &uuml;ber Wonder Computers finden Sie bei einem Besuch auf
<A HREF="http://www.wonder.ca" TARGET="_top">http://www.wonder.ca</A> oder senden Sie eine eMail an <A HREF="mailto:sales@wonder.ca.">sales@wonder.ca.</A>&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
