<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. AMIGA-Pr&auml;sident Bill McEwen antwortet auf Fragen der Community</H2>
<P>
Nachdem in Teilen der Amiga-Gemeinde Verwirrung bez&uuml;glich der
Implementierung von Memory Protection in das AmigaNG-Betriebssystem, der
Ber&uuml;cksichtigung des Desktop-Marktes sowie der Software-Lizensierung
herrscht, hat sich heute AMIGA-Pr&auml;sident Bill McEwen zu diesen Punkten zu
Wort gemeldet. Nachfolgend sein Statement in einer deutschen &Uuml;bersetzung:
</P>
<P>
&raquo;Eine Antwort auf Bedenken der Gemeinschaft, die bei MooBunny ge&auml;u&szlig;ert
wurden
</P>
<P>
Wir freuen uns sehr &uuml;ber die Reaktionen, die wir in den ersten paar Wochen,
nachdem die Amiga SDK-Version 1 in die Welt hinaus ging, erhalten haben.
Wir haben eine Menge Feedback bekommen, meistens positiv, manches nicht so
positiv, aber drei einzelne Punkte sind aufgekommen, die wir ansprechen
m&ouml;chten, bevor sie sich zu ganz gew&ouml;hnlichen Unwahrheiten entwickeln.
</P>
<P>
Erstens, es ist richtig, dass der Amiga Foundation Layer, der mit dem SDK
ausgeliefert wird, kein Memory Protection (Speicherschutz) hat. Das
bedeutet jedoch nicht, dass AmiTM, die n&auml;chste Generation der digitalen
Amiga-Umgebung (Amiga Digital Environment) keinen Speicherschutz haben
wird. Eine Bemerkung, die in einem Artikel der letzten AmigaWorld gemacht
wurde, ist offenbar so interpretiert worden, als ob das der Fall sei,
w&auml;hrend tats&auml;chlich ausgedr&uuml;ckt werden sollte, dass AMIGA sich viele
L&ouml;sungsm&ouml;glichkeiten anschaut, um Stabilit&auml;t und Sicherheit zu
gew&auml;hrleisten. AmiTM wird eine stabile und sichere Betriebsumgebung bieten
und wir werden die elegantesten und wirkungsvollsten Mittel verwenden, um
das zu erreichen.
</P>
<P>
Zweitens, die Endverbraucher-Lizenz-Vereinbarung (End User Licence
Agreement), die in das SDK hineingeraten ist, ist aufgrund eines
juristischen Missverst&auml;ndnisses fehlerhaft. Es braucht f&uuml;r Applikationen,
die entweder mit Hilfe des SDK erzeugt wurden oder die auf AmiTM laufen
werden, KEINE LIZENZGEB&Uuml;HR gezahlt zu werden. AMIGA wird ein System
entwickeln, wonach Dritte eine Geb&uuml;hr bezahlen, wenn sie offiziell eine
AMIGA-Lizenz, ein Markenzeichen und Promotion erhalten m&ouml;chten. Dadurch
erzielt AMIGA Einnahmen und die Drittgesellschaften einen Wertzuwachs.
Dieses System beruht vollkommen auf Freiwilligkeit.
</P>
<P>
Der dritte Punkt ergab sich aus den ersten beiden, n&auml;mlich dass AMIGA sich
aus dem Desktop-Markt zur&uuml;ckzieht. Nichts k&ouml;nnte falscher sein als diese
Aussage! Der angek&uuml;ndigte AmigaOne wird Prozessortaktraten von 600 MHz bis
1 GHz unterst&uuml;tzen, und noch leistungsf&auml;higere, bereits in Planung
befindliche Typen. Daraus k&ouml;nnen Sie entweder schlie&szlig;en, dass Amiga dem
Desktop-Markt sehr verpflichtet ist, oder aber dass wir planen, ein
&uuml;berdimensionales Handy auf den Markt zu bringen...
</P>
<P>
Wir sind entschlossen, den Amiga zu DEM besten Computersystem der Welt zu
machen. Ja, wir werden auch in andere M&auml;rkte einsteigen, aber das hei&szlig;t
nicht, dass wir den Desktop, die Amiga-Philosophie oder die loyalen Amiga-
Freunde, die in guten und in schlechten Zeiten zu dieser Plattform standen,
verlassen werden.
</P>
<P><B>Wir danken Ihnen,</B></P>
<P><B>Das AMIGA-Team</B></P>
&gt;&lt;&gt; Bill McEwen &gt;&lt;&gt;<BR>
Pr&auml;sident/CEO<BR>
AMIGA Inc.<BR>
Tel 425-396-5660<BR>
Fax 425-396-5671<BR>
<A HREF="mailto:bill@amiga.com">bill@amiga.com</A>&laquo;<BR>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
