<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. AMIGA stellt &raquo;Mr. Photogenics&laquo; Paul Nolan ein</H2>
<P>
&raquo;<B>Paul Nolan kommt zu AMIGA</B>
</P>
<P>
AMIGA engagiert sich daf&uuml;r auf Anwender-Erfahrungen zu bauen, um den
Standard f&uuml;r die Zukunft des digitalen Lebens setzen zu k&ouml;nnen.
</P>
<P>
Als Teil der ersten Phase brachten wir eine namhafte Gruppe von
Konstrukteuren und Entwicklern zusammen. Wir freuen uns sehr bekannt geben
zu k&ouml;nnen, dass Paul Nolan dem Team von AMIGA beitreten wird. Paul kommt zu
uns mit seiner langj&auml;hrigenll Erfahrung im Entwurf und der Herstellung
zahlreicher grafischer Entwicklungen und Interface-Produkten.
</P>
<P>
&quot;Ich freue mich sehr, dass es mir m&ouml;glich ist, AMIGA Inc. dabei zu helfen,
ihre Tr&auml;ume f&uuml;r den Amiga der n&auml;chsten Generation in die Wirklichkeit
umzusetzen, und freue mich ebenso darauf, die Unterst&uuml;tzung f&uuml;r die Amiga-
Gemeinschaft fortsetzen zu k&ouml;nnen,&quot; sagte Nolan.
</P>
<P><B>&Uuml;ber Amiga</B></P>
<P>
Amiga hatte den Begriff &quot;Multimedia&quot; abgesteckt und legt heute mit seinen
Produkten, dem Amiga Software Development Kit und der d'AMIGA Developer
Workstation, die Ma&szlig;st&auml;be f&uuml;r eine neue digitale Medienrealit&auml;t fest. Diese
Produkte gestatten es Emtwicklern, die Programme f&uuml;r die digitalen Medien-
Anwendungen der n&auml;chsten Generation zu schaffen, die die vernetzte Welt in
eine sehr nahe vor uns liegende Zukunft f&uuml;hren werden.
</P>
<P><B>&Uuml;ber Paul Nolan</B></P>
<P>
Paul Nolan, ein hervorragender Programmentwickler und Grafikexperte, ist
der Begr&uuml;nder und CEO der &quot;Paul Nolan Software Inc.&quot;, einer Gesellschaft,
die in San Diego, Kalifornien¸ zu Hause ist. Sein mit Preisen bedachtes
Programm &quot;Photogenics&quot; f&uuml;r grafische Bearbeitungen hat seit 1994 weiten
Zuspruch beim klassischen Amiga gefunden und wird bald in den L&auml;den im
ganzen Land auch f&uuml;r Linux erh&auml;ltlich sein. Weitere Informationen &uuml;ber Paul
Nolan und die weitere Entwicklung von Photogenics sind bei
<A HREF="http://www.PaulNolan.com" TARGET="_top">http://www.PaulNolan.com</A> zu finden.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
