<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. AMIGA und Matrox bilden strategische Allianz</H2>
<P>
&raquo;<B>AMIGA und Matrox freuen sich, die Gr&uuml;ndung einer strategischen Verbindung
zwischen beiden Gesellschaften bekannt geben zu k&ouml;nnen.</B>
</P>
<P>
&quot;Der Amiga hatte schon immer ausgezeichnete Eigenschaften bei der 2D- und
Video-Darstellung und in der engen Zusammenarbeit mit Matrox k&ouml;nnen wir
diese F&auml;higkeiten in die n&auml;chste Stufe und auch noch weiter mit nehmen&quot;
sagte Fleecy Moss, Vizepr&auml;sident f&uuml;r Technologie bei AMIGA. &quot;3D ist f&uuml;r den
Amiga eine verh&auml;ltnism&auml;&szlig;ig neue Sache und mit dem, was Matrox bereit h&auml;lt,
werden die Amigas der n&auml;chsten Ebene die 3D-Erwartungen in die Realit&auml;t
umsetzen.&quot;
</P>
<P>
&quot;Matrox ist immer gern bereit, bei der Entwicklung von Produkten Dritter
unterst&uuml;tzend mitzuarbeiten,&quot; sagte Alain Thiffault, Produkt-Manager,
Matrox Graphics. &quot;Amigas Tradition ist das Angebot einer soliden Plattform
und wir freuen uns, Betriebsmittel f&uuml;r ihre zuk&uuml;nftigen Produkte bieten zu
k&ouml;nnen.&quot;
</P>
<P><B>&Uuml;ber AMIGA</B></P>
<P>
AMIGA Incorporated widmet sich der Schaffung einer Multi-Media-Betriebs-
Umgebung (multi-media operating environment), die Entwicklern und Anwendern
ein neues erfreuliches Niveau erleben lassen wird. Wie in den fr&uuml;hen 80er
Jahren ist AMIGA bereit, die F&uuml;hrung auf die n&auml;chste Stufe der Computer-
Leistung zu &uuml;bernehmen.
</P>
<P><B>&Uuml;ber Matrox</B></P>
<P>
Matrox Graphics Inc. ist der einzige Entwickler von Grafik-Chips und
Hersteller von Grafikkarten, der auf eine 24-j&auml;hrige Industrie-Erfahrung
zur&uuml;ckblickt, um den Kunden 2D-, 3D- und digitale Video-Beschleunigung,
ausgezeichnete Bildqualit&auml;t und echte Funktionalit&auml;t zu bieten. Diese
F&uuml;hrung bei Qualit&auml;t und Innovation hat Matrox die von anderen unerreichte
Zahl von 900 internationalen Auszeichnungen f&uuml;r die Produktlinien
Millennium, Marvel, Productiva and Mystique erhalten. Mit ihrer Zentrale in
Montreal, Kanada, ist Matrox eine Gesellschaft im Privatbesitz mit
Au&szlig;enstellen in den Vereinigten Staaten, in Gro&szlig;britannien, Frankreich,
Deutschland, Italien und Hong Kong. Informationen &uuml;ber Produkte von Matrox,
Treiber, technische Unterst&uuml;tzung und weiteres finden Sie bei
www.matrox.com.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
