<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Diverse Amiga-News</H1>
<H2>1. Bericht vom Amiga-User-Treffen in Wolfenb&uuml;ttel (von Oliver Tacke)</H2>
<P><B>08.07.2000</B></P>
<P>
Gegen 09:00 Uhr trudelte der erste Teilnehmer des Treffens ein und half
sogleich, den Weg zu den R&auml;umlichkeiten durch Aufh&auml;ngen von einigen &quot;AMIGA
</P>
<UL>
<LI> Back for the Future&quot; Postern auszuschildern. Kurz darauf gesellte sich
</LI>
</UL>
auch Christian Steigies dazu, der im weiteren Verlauf des Tages den Debian
68k Linux Workshop leiten sollte.
<P>
Nach und nach f&uuml;llte sich der Raum mit Leuten und auch Rechnern.
Gl&uuml;cklicherweise hielten die Stromleitungen das aus. Zeitweise hingen
n&auml;mlich &uuml;ber 10 Computer samt Peripherie an zwei Steckdosen - und niemand
hatte vorher testen k&ouml;nnen, ob das &uuml;berhaupt geht.
</P>
<P>
<A HREF="img/Meeting1.jpg"><IMG SRC="thumb/Meeting1.jpg" WIDTH="120" HEIGHT="96" ALT="Bild"  BORDER="0"></A>
</P>
<P>
Gegen Mittag wurde dann gegrillt. Eigentlich h&auml;tte das erst gegen Abend
passieren sollen, aber Kaffee und Sandwiches, die bereit standen, konnten
dem Hunger nicht standhalten. Nach ein paar Problemchen mit dem Anwerfen
des Grills ging dann doch alles glatt.
</P>
<P>
Wie eingangs bereits erw&auml;hnt, gab Christian Steigies Interessierten eine
Einf&uuml;hrung in Debian 68k Linux. Thomas Wenzel pr&auml;sentierte den Besuchern
die neuesten PlugIns f&uuml;r seinen beliebten mp3-Player AmigaAMP. Marius
Schwarz pr&auml;sentierte zum einen seine umfangreiche Workbencherweiterung
DirectDOS und zum anderen eine Fernbedienung, mit der man &uuml;ber die serielle
Schnittstelle diverse Programme komfortabel vom Sofa aus fernsteuern kann,
so z.B. AmigaAMP. Rudolph Riedel f&uuml;hrte den von ihm geschriebenen
Dateimanager Diskmaster auf seinem Amiga vor, dem er ein seinen
Bed&uuml;rfnissen selbst angepa&szlig;tes Geh&auml;use spendiert hatte. Au&szlig;erdem konnte man
Norman Thiel dabei zusehen, wie er am Netzteil eines Amiga 4000
heruml&ouml;tete. An meinem Amiga 4000 :-) Aber er l&auml;uft einwandfrei. Danke
Norman!
</P>
<P>
<A HREF="img/Meeting2.jpg"><IMG SRC="thumb/Meeting2.jpg" WIDTH="120" HEIGHT="96" ALT="Bild"  BORDER="0"></A>
</P>
<P>
Gegen 1:30 Uhr waren die meisten G&auml;ste dann bereits auf dem Heimweg bzw.
auf dem Weg zu Ihrem Nachtquartier. Die letzten beiden erheiterten sich
noch bis 4:30 Uhr am Spiel &quot;You don't know Jack&quot;, das per Mac-Emulation zum
Laufen gebracht wurde, bevor auch sie schlie&szlig;lich zu Bett, nein, zu
Schlafsack gingen.
</P>
<P><B>09.07.2000</B></P>
<P>
Bumm, bumm, bumm. Morgens um 09:00 h&auml;mmern die ersten G&auml;ste bereits an die
T&uuml;r und rissen die dort N&auml;chtigenden aus ihrem viel zu kurzen Schlaf. Also
auf, Kaffee gekocht und Br&ouml;tchen aufgebacken... Schnell hatten sich die
R&auml;umlichkeiten wieder gef&uuml;llt mit Leuten und der muntere
Erfahrungsaustausch ging weiter. Wider Erwarten war es mindestens genauso
voll wie am Samstag, da einige Leute unangemeldet erschienen, was nat&uuml;rlich
kein Problem war - im Gegenteil.
</P>
<P>
Gegen Mittag trafen dann zwei besondere G&auml;ste ein: J&uuml;rgen Haage und Markus
P&ouml;llmann. W&auml;hrend ersterer sofort von neugierigen Amiga Usern umringt war
und geduldig Fragen beantwortete, demonstrierte Herr P&ouml;llmann
Interessierten das OS3.5 und gab einen Crash-Kurs in Intuition-
Programmierung.
</P>
<P>
<A HREF="img/Meeting3.jpg"><IMG SRC="thumb/Meeting3.jpg" WIDTH="120" HEIGHT="96" ALT="Bild"  BORDER="0"></A>
</P>
<P>
Als besondere &Uuml;berraschung hatte Herr Haage die Vollversion von Tornado 3D
(Wert von fast 900 DM!) mitgebracht und zur Verlosung freigegeben.
Gl&uuml;cklicher Gewinner war Jens Marksteiner.
</P>
<P>
Langsam, aber sicher, verlie&szlig;en nach und nach die G&auml;ste das Treffen und
gegen Abend war dann alles vorbei. Aber Spa&szlig; hat es gemacht. Und im
n&auml;chsten Jahr wird es wahrscheinlich wieder hei&szlig;en: Amiga User Treffen in
Wolfenb&uuml;ttel, vielleicht sogar mit mehr als rund 45 Leuten...
</P>
<P>
<A HREF="img/Meeting4.jpg"><IMG SRC="thumb/Meeting4.jpg" WIDTH="120" HEIGHT="68" ALT="Bild"  BORDER="0"></A>
</P>
<P><B>Dank gilt:</B></P>
<P>
Andreas Steep<BR>
von Amiga Deutschland<BR>
f&uuml;r die Bereitstellung von Postern, Kugelschreibern,...
</P>
<P>
Marius Schwarz und Thomas Wenzel<BR>
f&uuml;r die Fotos<BR>
</P>
<P>
meiner Familie<BR>
f&uuml;r die Unterst&uuml;tzung beim Treffen<BR>
</P>
<P>
Anmerkung zum Schlu&szlig;: Dieter M&uuml;ller, der freundliche Support von Ossowskis
Schatztruhe, der eigentlich auch am Treffen teilnehmen wollte, konnte
leider wegen einer b&ouml;sen Magen/Darm-Verstimmung (O-Ton: Montezumas Rache
:-) ) doch nicht erscheinen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">AmiOlli&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">(Oliver Tacke &lt;<A HREF="mailto:O.Tacke@surfway.de">O.Tacke@surfway.de</A>&gt;)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
