<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum9.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>8. Hilfe bei Erstellung von Internet-Website ben&ouml;tigt</H2>
<P><B>Thorsten Sch&ouml;lzel schreibt:</B></P>
<P>
&raquo;Amiga-User, ich brauche Eure Hilfe!
</P>
<P>
Da ich vor habe, mich wieder verst&auml;rkt dem Umweltschutz zu widmen und
obendrein eine eigene Umweltorganisation namens &quot;NAUTILUS&quot; gr&uuml;nden m&ouml;chte,
bin ich nun auf Eure Hilfe angewiesen.
</P>
<P>
Als erste Phase wollen wir eine Internetpr&auml;senz bieten, genau dort w&uuml;rdet
Ihr zum Zuge kommen, w&auml;re denn jemand bereit, ehrenamtlich die &quot;NAUTILUS&quot;-
Homepage zu kreieren?
</P>
<P>
Desweiteren w&uuml;rde uns ein Logo gut zu Gesicht stehen, w&uuml;rde auch dies
jemand &uuml;bernehmen?
</P>
<H3>Infos &uuml;ber &quot;NAUTILUS&quot;:</H3>
<P>
Da ich eine Umweltorganisation gr&uuml;nden m&ouml;chte, die sich speziell dem
Wasserschutz und der Bek&auml;mpfung des &uuml;bels an der Wurzel (dem Menschen!)
widmet, erkl&auml;rt sich der Name NAUTILUS eigendlich von selbst. Die nicht
wissenden sollten sich einmal den Film &quot;20.000 Meilen unter dem Meer&quot;
anschauen um den Hintergrund meiner Organisation besser betrachten zu
k&ouml;nnen.
</P>
<P>
Momentan befindet sich die Organisation in der Planungsphase, ein Konzept
muss noch erarbeitet werden. Daher ist auch eine Webpr&auml;senz unser erster
Schritt uns der &Ouml;ffentlichkeit zu pr&auml;sentieren.
</P>
<P>
Da sich unsere T&auml;tigkeit auf den Niederrhein (NRW) ausrichtet, werden wir
sehr eng mit anderen Umweltorganisationen zusammen arbeiten wie z.B. die
Greenpeace-Gruppe Niederrhein (www.gp-niederrhein.de).
</P>
<H3>Infos &uuml;ber die Homepage:</H3>
<P>
Die &quot;NAUTILUS&quot;-Homepage sollte grafisch sehr ansprechend sein und alle
aktuellen Standarts wie; JavaScript,CSS,...unterst&uuml;tzen. Ein interaktiver
Bereich mit G&auml;stebuch und Foren sollte ebenso dabeisein, wie ein News-,
Status-, Aktivit&auml;ten-Bereich. Zudem eine Rubrik in der wir uns vorstellen
k&ouml;nnen.
</P>
<P>
Die Farben der Homepage sollten sich auf verschiedene Blaut&ouml;ne und Weiss
beschr&auml;nken, wobei evtl. ein blaues Backgroundbild Verwendnung finden
sollte. Wie schon oben beschrieben, behandelt diese Organisation das Thema
Wasser bzw. Wasserschutz.
</P>
<H3>Infos &uuml;ber das Logo:</H3>
<P>
Die Farben f&uuml;r die Homepage sollten auch f&uuml;r das Logo gelten, doch m&ouml;chte
ich Euch hierbei mal Freiraum lassen. Das Logo kann also rund, viereckig,
dreieckig, achteckig...sein.
</P>
<P>
Achtet bei der Herstellung des Logos bitte darauf, dass Ihr ein &copy; Copyright
mit ins Logo einf&uuml;gt. Die Gr&ouml;sse des Logos sollte einer Aufl&ouml;sung von
800x600 in 24Bit entsprechen. Schickt mir dieses als IFF-Bild zu.
</P>
<P>
Sofern Ihr Interesse habt, mir zu helfen, wendet Euch bitte an meine eMail-
Adresse: <A HREF="mailto:amiga-freak@t-online.de">amiga-freak@t-online.de</A>
</P>
<P><B>Thorsten Sch&ouml;lzel &lt;<A HREF="mailto:amiga-freak@t-online.de">amiga-freak@t-online.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum9.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
