<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Gedanken zur Amiga-PowerPC- und -Spiele-Zukunft (von Andreas Volkmann)</H2>
<P>
Immer wieder sieht man doch eure Aufrufe zum Thema Mac. Aber leider ist es
doch auch in dem Bereich so, dass ohne eine ordentliche Emulation im PPC-
Bereich der Amiga ins Hintertreffen kommt, oder sieht das jemand anders?
Wenn man aus dem Aminet die Liste f&uuml;r die Macprogs sieht, die auf der Emu
laufen, und dann vergleicht, was ihr auch schon getestet habt, ist doch
fast alles durch.
</P>
<P>
Ich hab im Spielebereich auch mir damals mal WarCraftII geleistet, und bis
auf den letzten Level alles auf dem Amiga durchgespielt, aber wie lang ist
das schon wieder her, und wieviel Neues gibt es daraufhin schon wieder, was
aber alles nur auf PPC l&auml;uft?
</P>
<P>
Und wartet man auf das Prog (Fusion) und bekommt man es endlich mal,
reichen da die 604e-Karten &uuml;berhaupt noch aus?
</P>
<P>
Gut, wir warten alle sowieso auf Spiele und Programme f&uuml;r den Amiga selbst,
aber diejenigen, die wirklich spielen wollen, m&ouml;chten bestimmt auch auf
neuere Spiele nicht verzichten, wenn sie die M&ouml;glichkeit haben. Ich selbst
bin eigentlich nicht so ein Spieletyp, wenn &uuml;berhaupt Strategiespiele in
Echtzeit oder rundenbasierend, wie Napalm, Warcraft, Ufo oder Age of
Empire. Was anderes interessiert mich eigentlich wenig.
</P>
<P>
Aber es gibt ja noch genug, die wirklich gerne auch alle neuen Spiele
zocken. :-)
</P>
<P>
Ich hab mir damals die Emulatoren geholt, um auch f&uuml;r andere Programme, die
ich brauche, eine kompatible L&ouml;sung zum Datenaustausch zu haben, habe aber
auch nur nebenbei 'nen 68k-Mac und bin deshalb auch schon wieder ins
Hintertreffen gekommen. 'Nen PPC-Mac werde ich mir nicht leisten, nur wenn
es irgendwann nicht mehr anders geht.
</P>
<P>
Aber damit sieht es doch so aus, dass, wenn ihr Tests f&uuml;r Programme
bekommt, die doch dann warscheinlich auch schon in 2- oder 3-facher
Ausf&uuml;hrung vorliegen, gut, man kann dann zwar sagen, das Spiel oder
Programm l&auml;uft in der oder der Konfig, aber was richtig Neues bekommt ihr
doch nicht mehr, oder?
</P>
<P>
Abschlie&szlig;end hoffe ich doch, dass irgentwann eine PPC-Emulation rauskommt,
ich dann auch noch gute PPC-Karte kaufen kann, leider wird das wohl nicht
der Fall sein.
</P>
<P>
Meinen A1200 werd ich bestimmt nicht gro&szlig;artig aufr&uuml;sten, nur damit 'ne
Emulation laufen kann, dann kann ich mir wirklich 'nen Powermac anschaffen,
so wie das aussieht, wird es f&uuml;r meine A4000 und A3000 ja keine Karten
geben.
</P>
<P>
Ich kann dazu nur sagen: Schade. Es werden ja bestimmt mehr A1200 verkauft
worden sein, aber werden die auch alle aufger&uuml;stet? Ich glaube nicht, w&uuml;rde
aber bestimmt sagen, dass derjenige, der seinen A4000 oder A3000 noch in
Betrieb hat und bislang wartet, auch 'ne G3- oder G4-Karte kaufen w&uuml;rde.
Ich w&uuml;rde das tun und wahrscheinlich sogar gleich 2 Karten kaufen.
</P>
<P><B>Andreas Volkmann &lt;<A HREF="mailto:Andreas-V@gmx.de">Andreas-V@gmx.de</A>&gt;</B></P>
<P>
Anm. d. leit. Red.: Auch ich pers&ouml;nlich sehe keine Zukunft mehr f&uuml;r den
Amiga-PowerPC-Markt. Wenn &uuml;berhaupt, wird es offenbar erst 2001 neue
PowerPC-Erweiterungen geben. Die Frage ist, wer die Produkte dann &uuml;berhaupt
kaufen soll, wenn zu dem Zeitpunkt bereits der neue Amiga erschienen ist.
&Auml;hnliches d&uuml;rfte &uuml;brigens auch f&uuml;r den seit Jahren angek&uuml;ndigten &raquo;BoXeR&laquo;
und das Atari-Pendant &raquo;Milan II&laquo; gelten, sofern der Preis f&uuml;r ein
Komplettger&auml;t nicht unter etwa 1500 Mark liegt.
</P>
<P>
Einzig und allein die angek&uuml;ndigte Mediator-PCI-Erweiterung k&ouml;nnte einigen
Erfolg haben - dazu muss sie jedoch erst einmal in einer einwandfrei
lauff&auml;higen Version erscheinen. Und wenn nur alte 4- oder 8 MByte-
Grafikkarten daran betrieben werden k&ouml;nnen, wie ger&uuml;chteweise zu h&ouml;ren ist,
macht auch dieses Projekt kaum Sinn.
</P>
<P ALIGN="RIGHT">
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
