<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Am Gewinnspiel der letzten Ausgabe haben 49 Leser teilgenommen, das
bedeutet eine leichte Steigerung im Vergleich zum Vormonat.
</P>
<P>
Bitte denkt auch diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr
bereits mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P><B>Jetzt aber zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Metabox plant derzeit, seine PowerPC-G3-Erweiterung AmiJoe&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">nur noch f&uuml;r ein Amiga-Modell auf den Markt zu bringen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Welches?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Die &raquo;AmiJoe&laquo;-Erweiterung ist leider nur noch f&uuml;r den A1200&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">geplant.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Neben Metabox plant noch eine zweite Firma, PowerPC-G3-&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Karten f&uuml;r die heutigen Amiga-Rechner auf den Markt zu&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">bringen. Wie hei&szlig;t sie?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Das gesuchte Unternehmen hei&szlig;t Escena.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Glaubst du &uuml;berhaupt, dass es irgendwann PowerPC-G3/G4-&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Karten f&uuml;r die heutigen Amiga-Rechner geben wird?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Die Auswertung:</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Ja)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">28&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Nein)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">20&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ein Teilnehmer machte keine klare Angabe.
</P>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Ralph Bernecker antwortet mit: &raquo;Ja, aber bis dahin werden wesentlich
leistungsst&auml;rkere AMD-Prozessoren weniger als 100 DM kosten... sad but
true!
Ich will endlich einen neuen Amiga, denn mein A4000 ist einfach zu alt und
l&auml;uft auf Hardwareebene zu instabil, um da hinein noch Geld  zu
investieren.
</P>
<P>
Au&szlig;erdem br&auml;uchte ich dann einen G3, neue Grafikkarte und mindestens noch
einen schnellen SCSI-Controller, sonst w&auml;re der Geschwindigkeitsvorteil nur
teilweise ausgenutzt.
</P>
<P>
Bis 2000 DM zahle ich sofort f&uuml;r einen neuen Amiga, der dann aber schon
meine Mindestanforderungen an Software erf&uuml;llen sollte, da w&auml;ren schnelles
OS &amp; MP3 in Topqualit&auml;t abspielen &amp; GNU-C++ &amp; eine gute Grafiksoftware
(z.B. fxPaint).&laquo;
</P>
<P>
Christian Kortemeiers Hoffnungen schwinden: &raquo;Ich hoffe wirklich, dass es
bald G3/G4-Karten f&uuml;r den Amiga geben wird, aber so langsam glaube ich
nicht mehr so recht daran. Diese Hinhalte-Taktiken kennen wir im Amiga-
Bereich ja inzwischen gut genug.&laquo;
</P>
<P>
Markus Tillmann meint: &raquo;Ich denke schon, da&szlig; wir noch eine G3-Karte zu
sehen bekommen, denn warum h&auml;tte <A HREF="mailto:Met@box">Met@box</A> nicht jetzt sagen sollen, da&szlig; das
Projekt ganz eingefroren wurde?
Auch wenn man nie sicher sein kann, glaube ich an eine G3-Karte f&uuml;r Amigas,
allerdings k&ouml;nnte ein sp&auml;terer Erscheinungstermin nat&uuml;rlich nicht gerade zu
gro&szlig;en Umsatzzahlen w&uuml;rden, wenn der neue Amiga wirklich Ende dieses/Anfang
n&auml;chsten Jahres erscheint!&laquo;
</P>
<P>
Martin Cornelius setzt dagegen auf Escena: &raquo;Da nur die Antworten &raquo;Ja&laquo; und
&raquo;Nein&laquo; zur Auswahl standen, hoffe ich, dass es wenigstens Escena
hinbekommt, G3/G4-Karten auszuliefern. Im Gegensatz zu <A HREF="mailto:Met@box">Met@box</A> wurden von
Escena keine so vollmundigen Ank&uuml;ndigungen get&auml;tigt. Dadurch erscheint
Escena glaubw&uuml;rdiger. Also wieder einmal s&auml;mtlichen Amiga-Optimismus
aufbringen ;-), vielleicht kommen wir ja doch noch in den Genuss von G3/G4-
Karten. Ich jedenfalls traue es eher Escena als <A HREF="mailto:Met@box">Met@box</A> zu, die G3/G4-
Karten auf den Markt zu bringen. Ich habe wenigstens das Gl&uuml;ck, schon eine
PPC-Karte zu besitzen, aber &uuml;ber eine G3/G4 w&uuml;rde sich mein A4000 trotzdem
freuen. ;-)&laquo;
</P>
<P>
Oliver Hummel ist skeptisch: &raquo;Ich w&uuml;rde das Erscheinen einer G3/G4-Karte
nach wie vor begr&uuml;&szlig;en, schon im Hinblick auf das zu erwartende neue OS,
auch eine 68k-Emulation auf solchen Prozessoren d&uuml;rfte sich auf dem
bisherigen OS gut machen, von nativen PPC-Programmen ganz abgesehen!
Allerdings scheint es so, dass alle bisherigen Anstrengungen im Sande
verlaufen...die Brainstormer von Escena scheint meiner Ansicht nach nicht
den richtigen Weg zu verfolgen, und die Ank&uuml;ndigung seitens Metabox, man
wolle nur f&uuml;r den 1200er bauen, ist f&uuml;r mich ein Schlag ins Gesicht derer,
die sich damals bewusst f&uuml;r einen A4000 als &quot;professionelle&quot; Maschine
entschieden haben. Aber wir werden sehen... der Amiga-Markt hat in der
Vergangenheit schon die seltsamsten Bl&uuml;ten getrieben, wer wei&szlig;, vielleicht
kommt auch eines Tages noch ein G3-Board f&uuml;r den Amiga!&laquo;
</P>
<P>
Rainer Traub hat m&ouml;glicherweise den Metabox-Fragenkatalog in der letzten
Ausgabe nicht aufmerksam genug gelesen: &raquo;Soweit ich wei&szlig; sind die Karten
von Metabox bereits im Endstadium und werden ausf&uuml;hrlisch getestet. Es
stellt sich nur die Frage, welche Software es gibt, die die G3/G4-Prozzis
so richtig ausnutzt...&laquo;
</P>
<P>
Gerhard Schmid geht auf die Probleme beim &raquo;AmiJoe&laquo;-Projekt ein: &raquo;Das
Redesign eines Chips kann sehr lange dauern. Wenn wir Pech (oder Gl&uuml;ck)
haben, kommt der Amiga ONE eher.&laquo;
</P>
<P>
&Auml;hnlich sieht es Andre Beer: &raquo;Bei voraussichtlichen Erscheinungsterminen
Ende 2000 bzw. 2001 sollte (hoffe ich) der Amiga One ebenfalls bereits auf
dem Markt sein. Dann macht eine solch gro&szlig;e (finanzielle) Investition in
den &quot;Classic&quot;-Amiga meiner Meinung nach keinen Sinn mehr. Ich w&uuml;rde mir
jedenfalls lieber den neuen NG-Amiga kaufen. (Ich besitze allerdings auch
bereits eine PPC603-Karte.)&laquo;
</P>
<P>
Michael Seibt &auml;u&szlig;ert sich wie folgt: &raquo;Ich hoffe, dass Metabox noch VOR 2001
die angek&uuml;ndigten G3-Karten auf den Markt bringen wird, ansonsten glaube
ich, dass das Projekt ein Riiiieeeesen-Flop wird. Wer kauft sich eine G3-
Karte f&uuml;r seinen alten Ami, wenn es bis dahin den Amiga One geben wird???&laquo;
</P>
<P>
Auch Frank Schulz setzt eher auf den AmigaNG: &raquo;Sollte der Amiga ONE
wirklich p&uuml;nktlich erscheinen und ein erweiterungsf&auml;higes Gebilde sein
(Tower/Desktop), so wird sich die Entwicklung wohl nicht mehr lohnen. Aber
warten wir mal wieder ein halbes Jahr ab. Dann sieht man weiter.&laquo;
</P>
<P>
Frank Bergmann antwortet auf die Frage kurz mit &raquo;Ja, und zwar von
<A HREF="mailto:Met@box...">Met@box...</A>&laquo;
</P>
<P>
Thomas M&uuml;nzberg ruft die Entwickler auf, sich auf einen PowerPC-Standard zu
einigen: &raquo;Bin ein unverzeihlicher Optimist! Leider ist das G3-Projekt f&uuml;r
den A2000 gestorben. Meine wohlausger&uuml;stete 060er-Maschine h&auml;tte mehr Power
vertragen k&ouml;nnen.
</P>
<P>
Eine Bitte an die unerm&uuml;dlichen Programmierer: Einigt Euch bitte auf ein
PPC-Betriebssystem, mein Sohn hat einige M&uuml;he, wenn er das eine Mal f&uuml;r
PowerUp, das andere Mal f&uuml;r WarpUp konfigurieren mu&szlig;.&laquo;
</P>
<P>
Nicolas Negretti meint: &raquo;Amiga One wird der G3/G4-Karte zuvor kommen, so
dass diese nicht mehr gen&uuml;gend Interessenten finden wird. Die G3-Karte w&auml;re
eine gute Zwischenl&ouml;sung gewesen, allerdings ist jetzt der Zug schon (fast)
abgefahren.&laquo;
</P>
<P>
Christian Aichinger glaubt nicht an ein Erscheinen von G3/G4-Erweiterungen
und antwortet: &raquo;&Auml;hm, nein! Phase5 w&auml;re f&uuml;r mich die einzige Firma gewesen,
die entsprechenden Enthusiasmus f&uuml;r ein derartiges Projekt gehabt h&auml;tte.
Metabox und Escena sind meiner Meinung nach weder interessiert noch in der
Lage, G3/G4 f&uuml;r den Amiga umzusetzen - Spr&uuml;cheklopfer wie es sie im
Amigabereich schon viel zuviele gibt.&laquo;
</P>
<P>
Oliver Tacke wartet mit selbst recherchierten Informationen auf: &raquo;Ich habe
erst gestern mit Martin Sch&uuml;ler telefoniert - und er hat mir versichert,
da&szlig; immer noch an den Karten gearbeitet wird, auch wenn die Finanzierung
des Projekts nicht ganz einfach ist.&laquo;
</P>
<P>
Gernod Schomberg sieht die Chancen f&uuml;r G3/G4-Karten schwinden: &raquo;Ich
f&uuml;rchte, die Ank&uuml;ndigung des Amiga One wird den Eifer der Hersteller, die
Karten f&uuml;r die alten Modelle heraus zu bringen, noch weiter d&auml;mpfen. Ich
h&auml;tte die neue Amiga-Betriebsumgebung gern auf meinem Amiga installiert,
aber wenn die Hersteller schon jetzt mit Abstrichen und
Terminverschiebungen kommen, werde ich wohl gleich auf den neuen Rechner
umsteigen und den A4000 als Reserve stehen lassen.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Eine - wenn auch nicht &uuml;berw&auml;ltigende Mehrheit - geht davon aus, dass
G3/G4-Erweiterungen f&uuml;r den heutigen Amiga erscheinen werden. Relativ hoch
ist allerdings der Anteil jener, die in diesem Fall einen Flopp bef&uuml;rchten,
zumindest dann, wenn der AmigaNG zu dem Zeitpunkt bereits auf dem Markt
ist.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Oliver Hummel&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x sechs Grafik- und Raytracing-CD-ROMs: Christian Britz&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x FD-Sammlung &quot;Aminet-Set 9&quot;: Dirk Neubauer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
