<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses11.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Ist der neue Amiga noch ein Amiga?
</P>
<P>
Diese oft gestellte Frage verdient nur eine Antwort: Nein - nat&uuml;rlich
nicht. Denn es gab, streng genommen, nur einen einzigen Amiga - den A1000.
So, wie ihn Jay Miner (zusammen mit anderen) konzipiert hatte. Alle
weiteren Modelle, angefangen vom A500 und A2000 bis hin zum DraCO als
Extrembeispiel waren - von Jay Miner nicht gewollte - Abwandlungen, die, so
oder &auml;hnlich d&uuml;rfte der Erschaffer es wohl gesehen haben, nur &raquo;rein
zuf&auml;llig&laquo; dasselbe Betriebssystem verwendeten und zum Original
softwarekompatibel waren - wenn &uuml;berhaupt. Denn seien wir doch mal ehrlich:
Hat unser AmigaOS 3.5 noch sehr viel &Auml;hnlichkeit mit der ersten Version 1.0
aus dem Jahr 1985? Rein &auml;u&szlig;erlich kaum, und wie hoch ist der Anteil der in
den Anfangsjahren geschriebenen Amiga-Programme, die vollkommen problemlos
auf einer heutigen Rechnerhardware lauff&auml;hig sind?
Bei objektiver Betrachtung haben wir im Verlauf der letzten 15 Jahre
mindestens zwei bis drei &raquo;neue Amigas&laquo; erlebt, ob wir das nun an den
Betriebssystem-Versionen festmachen oder an der im Laufe der Zeit
grundlegend ver&auml;nderten Rechner- und Zusatzhardware, bleibt sich gleich.
Und wie verh&auml;lt es sich dann mit dem AmigaNG? Der AmigaNG ist ebenso sehr
(oder wenig) ein Amiga, wie der heutige VW Golf ein aus den 70er Jahren
stammender Golf der ersten Generation ist, oder, um gleich beim Automobil
zu bleiben, der &raquo;New Beetle&laquo; ein VW K&auml;fer.
</P>
<P>
Viel wichtiger als die anfangs gestellte Frage ist meiner Meinung nach
folgende: VERDIENT der neue Rechner den Namen Amiga? Das wird die Zukunft
zeigen. Eines jedoch steht fest: Der Amiga 1000 setzte bei seinem
Erscheinen Ma&szlig;st&auml;be - und die Menschen in Erstaunen. Er bot, speziell im
Grafik- und Soundbereich, M&ouml;glichkeiten, mit denen bis dahin nur weitaus
teurere Computer aufwarten konnten.
</P>
<P>
Wir m&uuml;ssen aber die ver&auml;nderten Umst&auml;nde ber&uuml;cksichtigen: In den Dom&auml;nen
des Original-Amigas, Grafik und Sound, ist heute kein Blumentopf mehr zu
gewinnen, zu schnelllebig ist die Entwicklung in diesen Bereichen - so ist
etwa eine Grafikhardware, die heute auf den Markt kommt, in wenigen Monaten
schon wieder veraltet.
</P>
<P>
Nein, in den n&auml;chsten Jahren wird etwas ganz anderes immer aktueller
werden: Die zunehmend fortschreitende Vernetzung der unterschiedlichen
techn(olog)ischen Ger&auml;te, bis hin zu deren Verschmelzung, indem sie eine
einzige Rechen- und Steuerungseinheit nutzen. Damit verbunden ist die
Notwendigkeit einer Lauff&auml;higkeit von ein und derselben Software auf
verschiedensten Hardwareplattformen.
</P>
<P>
Und exakt darauf, so sind die Pl&auml;ne, ist der neue Amiga mit seinem extrem
skalierbaren Betriebssystem, das sich gleicherma&szlig;en auf Handys wie auf
Gro&szlig;rechnern nutzen lassen wird, ausgerichtet! Nicht nur, dass Programme,
die in der plattformunabh&auml;ngigen Sprache Java geschrieben sind, mit bis zu
22-mal h&ouml;herer Geschwindigkeit abgearbeitet werden k&ouml;nnen als von
irgendeiner anderen Java Virtual Machine; der &raquo;virtuelle Prozessor&laquo; l&auml;sst
sich zudem ohne allzu gro&szlig;en Aufwand an andere Hardware-Architekturen
anpassen und erm&ouml;glicht damit Plattformunabh&auml;ngigkeit auf einer weiteren
Ebene.
</P>
<P>
AMIGA ist dabei, sich in einem absoluten Zukunftsmarkt gl&auml;nzend zu
positionieren. Damit ist noch l&auml;ngst nicht gesagt, dass das Unternehmen
Erfolg haben wird. Aber: Die Richtung stimmt.
</P>
<P><B>Bis n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses11.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
