<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Review: Heretic II</H2>
<P>
Wer die Bildschirmfotos von Heretic II sieht, wird ohne gro&szlig;e
Diskussion zugeben, dass es sich hier um das aufwendigste Amiga-Spiel
aller Zeiten handelt. Dies unterstreichen die Systemanforderung,
die z.B. 64MB Ram sowie einen PowerPC Prozessor ben&ouml;tigen. Heretic
II ist also nach WipeOut 2097 das zweite Amiga-Spiel, welches nur
auf PowerPC-Rechnern l&auml;uft. Da viele Amiga-User das Spiel schon
vom PC her kannten, war die Erwartung an die Amiga-Version gro&szlig;
und keiner konnte die Ver&ouml;ffentlichung abwarten. Auf der Messe
in Neuss war es dann soweit. Heretic II stand in den Regalen.
Dabei kommt Heretic II in der mittlerweile schon un&uuml;blichen
Vollverpackung; also mit Karton und gedruckter Anleitung. Au&szlig;erdem
fasst das Spiel 2 CD-ROMs.
</P>
<P>
<A HREF="img/Heretic2-1.jpg"><IMG SRC="thumb/Heretic2-1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Wie der Name schon vermuten l&auml;sst, ist Heretic II die Fortsetzung
des alten Heretic, welches mittlerweile OpenSource ist und auch
auf den Amiga portiert wurde. Im Endkampf zwischen Corvus, dem
Helden, und D'sparil gewinnt zwar Corvus, wird aber vom B&ouml;sewicht
mit einem Flucht belegt, der ihn in eine andere Dimension verbannt.
Diese konnte er erst Jahre sp&auml;ter wieder verlassen, n&auml;mlich als
er das Zaubern erlennte und so das Dimensionstor &ouml;ffnen konnte.
</P>
<P>
<A HREF="img/Heretic2-2.jpg"><IMG SRC="thumb/Heretic2-2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Installation von Heretic II geht ohne Probleme von statten,
dauert halt nur entsprechend lang, da etwa 500 Megabyte installiert
werden. Die Installation wurde ansprechend gestaltet und es
musste auch eine Seriennumer eingegeben werden, die jedem Spiel
beiliegt. Nach vollendeter Installation kann man das Spiel nun
von Festplatte aus starten. Die CD-ROM muss allerdings auch im
Laufwerk sein.
</P>
<P>
<A HREF="img/Heretic2-3.jpg"><IMG SRC="thumb/Heretic2-3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Heretic II startet mit einer richtig 'dicken' Intro, in der
nochmals die oben beschriebene Geschichte in Bildern erz&auml;hlt
wird. Die Intro l&auml;uft relativ fl&uuml;ssig und wird zeitweise nur
durch das CD-ROM etwas gebremst; dies sollte aber schnelleren
CD-ROMs (&gt;20-fach) kein Problem sein. Im Spiel angekommen wird
man erstmal beinahe erdr&uuml;ckt von der Grafik-Power, die auch
auf Intel-Plattformen l&auml;ngst nicht selbstverst&auml;ndlich ist.
Ansonsten handelt es sich bei Heretic II um einen Standard
3D-Shooter, der allerdings durch ungeheuren Grafik- und auch
Sound-Aufwand f&uuml;r immensen Spielspa&szlig; sorgt. Denn bei Heretic II
sieht keineswegs jeder Level gleich aus. Hier gibt es Extras,
viele &Auml;nderungen im Design von Level zu Level und auch viele
verschiedene, toll animierte Waffen und Gegner.
</P>
<P>
<A HREF="img/Heretic2-4.jpg"><IMG SRC="thumb/Heretic2-4.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Auf PowerPC's mit Grafikkarten und 3D-Beschleuniger l&auml;sst
sich Heretic II teilweise selbst in 640x480 noch gut spielen.
Im AGA-Modus dagegen muss man - verst&auml;ndlicherweise - wesentlich
geringere Aufl&ouml;sungen w&auml;hlen. AGA-Usern kann man hier nur
zu einer Grafikkarte raten, denn diese beschleunigt immens.
</P>
<P>
<A HREF="img/Heretic2-5.jpg"><IMG SRC="thumb/Heretic2-5.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Fazit: Heretic II ist der absolute Topkracher f&uuml;r Action-Fans.
So eine Grafik hat der Amiga noch nie gesehen. Dieses Spiel
sollten sich selbst Leute zulegen, die 3D-Shooter hassen. Wer
ein f&uuml;r Heretic II geeignetes System hat, der muss sich das
Spiel einfach zulegen; denn es ist das bislang einzige, welches
wirklich alles rausholt, was drinsteckt. Einfach ph&auml;nomenal!
</P>
<TABLE><TR><TD BGCOLOR="#e0e0e0"><PRE>
+-------------------------------------------------------------------------+
|  Name:          Heretic II                                              |
|  Hersteller:    Hyperion Software, Vertrieb &uuml;ber Titan Computer         |
|                 <A HREF="http://www.titancomputer.de/" TARGET="_top">http://www.titancomputer.de/</A>                            |
|  Preis:         99 DM                                                   |
|  Datentr&auml;ger:   2 CD's                                                  |
|  Genre:         3D Action              | Spieler: 1                     |
|  Sprache:       deutsch                | Anleitung: deutsch             |
|  System:        PowerPC mit 160mhz, AGA oder Grafikkarte, 64 MB Ram,    |
|                 300 MB Festplatte, schnelles CD-ROM, WarpOS/3D          |
|                                                                         |
|  Fazit:         Ein Meilenstein in der Amiga-Geschichte!                |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:    10/10                            |
|                             Sound:     10/10                            |
|                             Handhabung: 9/10                            |
|                             Spielspa&szlig;: 10/10                            |
|                             GESAMT:      98%                            |
+-------------------------------------------------------------------------+
</PRE></TD></TR></TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
