<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele8.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. Interview mit Hyperion Software (von Fabio Trotta)</H2>
<P>
Im Interview pr&auml;sentiere ich euch heute Thomas Frieden und Steffen H&auml;user,
Programmierer bei Hyperion Software. Hyperion ist momentan wohl der
flei&szlig;igste Spieleentwickler und k&uuml;ndigt einen Hit nach dem anderen an.
Dabei hat sich die Firma bisher auf HighEnd-PC-Portierungen spezialisiert.
</P>
<H3>1. Seit wann bist du AMIGA User?</H3>
<P><B>Thomas:</B></P>
<P>
Meinen ersten Amiga habe ich 1988 bekommen. Das war ein A500.
Irgendwann wurde der dann durch einen A2000 ersetzt, und dann durch
einen A4000, den ich heute noch besitze.
</P>
<P><B>Steffen:</B></P>
<P>
Mein erster Amiga war der A500, den ich 1989, als er auf den Markt
kam, gekauft hatte. Ich hatte zunaechst vor, den A1000 zu kaufen, aber
der war dann doch zu teuer, also hatte ich noch ein wenig gewartet,
bis der A500 rauskam.
</P>
<H3>2. Warum gerade AMIGA?</H3>
<P><B>Thomas:</B></P>
<P>
Der Amiga hat mich fasziniert, als ich ihn zum ersten Mal in einem
Kaufhaus gesehen habe. Auf diesem Teil lief n&auml;mlich gerade irgendein
Kopierprogramm, und das spielte immer einen Sample im Hintergrund ab:
&raquo;Yo ho yo ho, a pirate's life for me!&laquo;. Das hat mich total
fasziniert. Sp&auml;ter war der Amiga dann einfach die beste Maschine weit
und breit, in der Zeit als auf dem PC Hercules-Grafikkarten oder
h&ouml;chstens CGA oder EGA aktuell war. Und wenn man mal Windows benutzt
hat und beim Verschieben von Fenstern mal eben sekundenlang warten mu&szlig;
bis das Teil reagiert, dann merkt man, warum man so lange beim Amiga
geblieben ist. Nichts f&uuml;hlt sich so an (fast nichts ;)..
</P>
<P><B>Steffen:</B></P>
<P>
Ich hatte schon immer einen Amiga, und mir gefaellt einfach das OS. Es
ist einfach das Beste. Natuerlich ist mir klar, dass man mit dem Amiga
allein kein Geld verdienen kann (hoffentlich aendert das Bill McEwen
dann :) ), daher programmieren wir by Hyperion auch auf Linux und
Mac. (Hyperion unterstuetzt Amiga, Linux und Mac, dabei werden bei
Linux sowohl Linux-x86 als auch LinuxPPC unterstuetzt).
</P>
<H3>3. Was machst du, wenn du nicht gerade Spiele f&uuml;r uns programmierst?</H3>
<P><B>Thomas:</B></P>
<P>
Spiele spielen :) Man kann eigentlich kein Spieleprogrammierer sein,
ohne selbst gerne zu spielen. Ansonsten lese ich ganz gerne (vor allen
Dingen Science Fiction und Fantasy), und h&ouml;re Musik, oder sehe mir
Babylon 5 oder die Harald-Schmidt-Show an (Bimmel und Bommel for ever
:)
</P>
<P><B>Steffen:</B></P>
<P>
Nun... Emulatoren programmieren :) (Spass beiseite, ich lese gerne,
hauptsaechlich Fantasy-Romane, spiele gerne Computer-Spiele, hoere
gern Musik, mag Kino, und bin einem Pen-And-Paper-Rollenspiel oder
einer Runde MtG nicht abgeneigt... ausserdem: Emailing :) )
</P>
<H3>4. Was sind momentan deine Lieblingsspiele?</H3>
<P><B>Thomas:</B></P>
<P>
Im Moment spiele ich Baldur's Gate, ein Rollenspiel, und Unreal
Tournament (Es geht nichts &uuml;ber einen gepflegten &raquo;Headshot&laquo;
:). Au&szlig;erdem habe ich ganz gerne Shogo, Freespace und Hidden&amp;Dangerous
gespielt.
</P>
<P><B>Steffen:</B></P>
<P>
Nun ja: Heretic II (ehrlich!!!), ausserdem zocke ich schon seit
einiger Zeit an ein paar PSX Spielen rum (Fear Effect, Suikoden 2,
Final Fantasy VIII), aber komm nie so richtig dazu, und ab und zu ne
Runde Warcraft II, Quake oder Warlords 3 gegen meinen kleinen
Bruder... aber zu so was bin ich eigentlich seit EWIGKEITEN nicht mehr
gekommen... vielleicht spaeter wieder... :)
</P>
<H3>5. Welchen Rechner besitzt du privat?</H3>
<P><B>Thomas:</B></P>
<P>
Privat besitze ich nat&uuml;rlich einen Amiga, und auch einen PC, auf dem
Windows und Linux laufen. Im Moment arbeite ich an einem Projekt f&uuml;r
Monolith, da komme ich nat&uuml;rlich an Windows nicht vorbei. Wenn man
sich mal an das &raquo;Das System ist ausgelastet&laquo; gew&ouml;hnt hat....
</P>
<P><B>Steffen:</B></P>
<P>
Einen Amiga 4000 PPC und einen PowerMac G3 und einen (nicht lachen...)
Pentium mit Linux-x86 und 120 MB freiem Plattenplatz. Des
oefteren verwende ich auch den A3000 meines Bruders zum
Mailen... (Birdland BBS: telnet 62.132.131.18). Falls sich jemand
ueber den Pentium wundert: eigentlich ist der nur dafuer gut, dass das
Onlinespiel &quot;Lords&quot; auf der Birdland BBS per telnet laeuft, das gibt's
naemlich nicht fuer Amiga.
</P>
<H3>6. Wie lange arbeitest du schon bei Hyperion?</H3>
<P><B>Thomas:</B></P>
<P>
Ich bin einer der &raquo;Gr&uuml;ndungsmitglieder&laquo;, da&szlig; hei&szlig;t ich bin seit etwas
mehr als einem Jahr dabei.
</P>
<P><B>Steffen:</B></P>
<P>
Offiziell oder inoffiziell? Nun ja, wenn man auf die Credits von
Heretic II schaut bin ich schon laenger dabei... offiziell aber erst
kuerzlich (bisher arbeitete ich fuer eine PC-Anwendungssoft-Firma,
Quark...)
</P>
<H3>7. Wieviele Leute sind derzeit f&uuml;r Hyperion t&auml;tig?</H3>
<P>
Bei der letzen Z&auml;hlung waren es etwa 10, aber es werden immer mehr...
Da ist zun&auml;chst Ben Hermans, der Gr&uuml;nder von Hyperion, und der Anwalt
der Firma. Er ist einer der Managing Partners, zusammen mit Evert
Carlton. Unser PR Manager ist Ben Yoris. Der Website wird von Patrick
Ceuppens verwaltet. Unsere amerikanischen Aktivit&auml;ten (wie z.B.
Vorf&uuml;hrung bei Lizenzgebern) werden von James Sellman ausgef&uuml;hrt. Tim
DeGroote erf&uuml;llt &auml;hnliche Aufgaben hier in Europa. Der gr&ouml;&szlig;te Teil
der Mannschaft sind nat&uuml;rlich Programmierer: Hans-J&ouml;rg Frieden, Joe
Sera, Steffen H&auml;user, Peter Annuss, Stephan Rusdorf, Mathias &raquo;Amidog&laquo;
Roslund, Harry Sintonnen, und nat&uuml;rlich ich (Thomas) :) Wir haben auch
noch einige &raquo;Freiberufler&laquo;, Axel Deising und Michael Siegel, die beide
f&uuml;r Mac-Versionen (und Smacker-Umsetzungen :) zust&auml;ndig sind.
</P>
<H3>8. Was ist deine T&auml;tigkeit bei Hyperion Software?</H3>
<P><B>Thomas:</B></P>
<P>
Ich bin Programmierer. Meine Hauptaufgabe im Moment ist ein Projekt
f&uuml;r Monolith, bei dem es um einen Software Renderer geht (also ohne 3D
Hardware). Dieses Projekt bestreite ich gerade mit Stephan
zusammen. Ansonsten bin ich der hauseigene Experte f&uuml;r LithTech, und
allgemein f&uuml;r 3D-Programmierung.
</P>
<P><B>Steffen:</B></P>
<P>
Meine Haupttaetigkeit ist derzeit- zusammen mit Peter Annuss - die
Amiga- und die Linux-Version des Spieles Sin. Ausserdem arbeite ich an
einem Bugfix von Heretic II betreffs der Savegames. Ich bin ausserdem
(aber nicht allein) zustaendig, wenn jemand Installationsprobleme bei
Heretic II hat. Des weiteren kuemmere ich mich um Kontakte zu einigen
anderen Amiga-basierten Firmen, etwa H&amp;P.
</P>
<H3>9. Werden die angek&uuml;ndigten Spiele, trotz geringen HereticII Verkaufszahlen noch erscheinen ?</H3>
<P>
Die angek&uuml;ndigten Spiele werden auf jeden Fall erscheinen. Dar&uuml;ber
hinaus wird die Zeit und der Markt entscheiden, ob es in Zukunft
weitere Amiga-Titel von uns geben wird. Ich pers&ouml;nlich bin
zuversichtlich, da&szlig; wir beim Amiga bleiben werden. Unser bisheriges
Modell, Ports parallel durchzuziehen, scheint zu funktionieren, also
ist der Zeitaufwand f&uuml;r zwei Versionen faktisch gleich. Dies soll
jedoch keine Einladung f&uuml;r Raubkopierer sein. Auch wenn vieles bei
einem Port f&uuml;r beide Versionen n&ouml;tig ist, so ist doch auch die
Umsetzung f&uuml;r ein zweites System &quot;harte Arbeit&quot;, die wir nicht &quot;f&uuml;r
die Katz&quot; machen wollen. Hyperion ist eine Firma, kein
Coder-Gr&uuml;ppchen, und wir m&uuml;ssen uns mit finanziellen Erw&auml;gungen
auseinandersetzen. Ob sich die zus&auml;tzlichen Kosten f&uuml;r eine
Amiga-Version noch rechnen, wird sich zeigen m&uuml;ssen. Ich hoffe es auf
jeden Fall....
</P>
<H3>10. Wie steht es mit den aktuellen Release-Terminen von euren anderen Projekten?</H3>
<P>
Shogo ist zu etwa 95 % fertig. Es fehlt nur noch der Sound, und der
OpenGL-Renderer. Eben dieser bereitet im Moment einiges an
Kopfzerbrechen, da diverse Probleme das ganze Projekt erschweren. Shogo
benutzte bisher DirectX, der Schritt zu OpenGL ist hier etwas
schwierig. Obwohl die Systeme im Allgemeinen den gleichen
Funktionsumfang bieten, sind doch die kleinen Unterschiede, die die
Umsetzungen sehr schwer machen....
</P>
<P>
SiN is durch das Benutzen der Quake2-Engine, die ja auch in Heretic 2
zum Einsatz kam, recht schnell vorangeschritten und zu etwa 90 %
fertig. Eine erste Alpha-Test-Version f&uuml;r Activision wurde dieser Tage
fertiggestellt (allerdings derzeit nur die Linux-Version, die
Amiga-Version wird sich jedoch demn&auml;chst in einem &auml;hnlich
fortgeschrittenen Stadium befinden, beide Versionen haben jedoch noch
einige offene Punkte). Die restlichen Projekte befinden sich noch in
sehr fr&uuml;hen Stadien, so da&szlig; hier ein Absch&auml;tzen sehr schwer ist. Shogo
und SiN sollten im dritten Quartal dieses Jahres erh&auml;ltlich sein...
</P>
<H3>11. Was denkst du &uuml;ber die momentane Situation des AMIGA-Markts?</H3>
<P>
Nur ein Wunder kann uns noch retten. Leider ist es wirklich so
schlimm. Das Wunder sollte in Form neuer Hardware kommen, also G3/G4
und bessere 3D-Hardware. Die Neuigkeiten &uuml;ber die Elbox-PCI-L&ouml;sung
kann man schon als kleines Wunder bezeichnen, wenn jetzt noch die neue
Generation von PPC-Hardware kommt, dann k&ouml;nnte sich der Markt dieses
Jahr noch halten. Mit der Einigung zwischen <A HREF="mailto:M@tabox">M@tabox</A> und H&amp;P ist hier
zumindest mal ein gutes Signal gesetzt, jedoch sind wir sehr
ungl&uuml;cklich mit dem angepeilten Release-Termin der Amijoe-Karte. Wie
die Entwicklung nach dem Erscheinen des AmigaOne (endlich ein echter
Name, kein AmigaNG mehr) aussehen wird, kann man sich wohl schon
denken....
</P>
<P>
Aber mit Fleecy und Bill hat Amiga jetzt Leute an der Spitze, die sich
wirklich um den Amiga bem&uuml;hen. Wenn man an die Zeit unter Gateway
denkt....
</P>
<H3>12. Was willst den ganzen kurzsichtigen Leuten mit auf den Weg geben, die immer noch raubkopieren?</H3>
<P>
Raubkopien sch&auml;digen jeden Markt, egal ob es Videos, CDs oder
Computerspiele sind. Einige M&auml;rkte verkraften das, indem
z.B. Computerspiele auf dem PC im Preis etwas h&ouml;her angesetzt werden,
so wird zum Beispiel ein Spiel f&uuml;r 80 DM verkauft, obwohl es auch f&uuml;r
50 DM m&ouml;glich w&auml;re, nur um die Verluste durch Kopien zu kompensieren.
</P>
<P>
Bei Verkaufszahlen von schlechten 30000 bis hin zu 1000000 Kopien ist
das kein so gro&szlig;es Problem, obwohl auch hier bereits viel Geld f&uuml;r
aufwendige Kampagnen ausgegeben wird. Auf einem kleinen Markt wie dem
Amiga ist Kopieren jedoch extrem sch&auml;digend. Ich kenne F&auml;lle, bei
denen Programme wenige hundert mal verkauft werden (&uuml;ber den Zeitraum
von einem Jahr), aber auf jedem Pirate-FTP-Site finden sich in den
Log-Files viele tausend Downloads. Dieser Zustand ist
unhaltbar. Niemand kann erwarten, da&szlig; eine Firma das mitmacht, ohne
entsprechend vorzugehen.
</P>
<P>
Deshalb meine Bitte: Keine Raubkopien auf dem Amiga. Auch wenn ihr
nicht f&uuml;r ein Spiel bezahlt, andere bezahlen eure Kopie mit, entweder
durch h&ouml;here Preise bei den Originalen, oder, am Ende, dadurch da&szlig;
Firmen den Amiga nicht mehr unterst&uuml;tzen. Diese Rechnung bezahlen
alle Amiga-User.
</P>
<P>
Ich glaube, wir haben gezeigt, da&szlig; es M&ouml;glich ist, absolute Top-Titel
zu bekommen, und es kann noch viel passieren in der Zukunft (und es
wird auch passieren), wenn Raubkopierer dies nicht kaputt machen.
</P>
<H3>13. M&ouml;chtest du der Community abschlie&szlig;end noch etwas sagen?</H3>
<P><B>Thomas:</B></P>
<P>
Die Zeit, die ich auf dem Amiga verbracht habe war die beste Zeit, die
der Computer (und speziell ich mit dem Computer) jemals erlebt
hat. Ich kann mich noch an die erste Fish-Disk erinnern, und an die
Anf&auml;nge des AmiNet, als es noch ein einzelner A3000 an einer
Universit&auml;t war (wer kennt noch den Hostnamen des Servers? Auf jeden
Fall irgendwas mit amiga.unizh.*.ch).
</P>
<P>
Heute wird bei Linux von einer &auml;hnlichen &raquo;Community&laquo; geredet, aber ich
denke, auf dem Amiga war es, speziell am Anfang, wesentlich
mehr. Leider ist das in den letzten Jahren immer weiter ins
Hintertreffen geraten, durch viele unn&ouml;tige Konflikte. Auf jeden Fall
wird der Amiga eine Philosophie bleiben (Wie schreibt man Philosophie
eigentlich nach der neuen Rechtschreibreform ? :)
</P>
<P><B>Steffen:</B></P>
<P>
Nun ja... kauft Amiga-Software. Unterstuetzt die Firmen, die euch
unterstuetzen. Und habt noch ein bisschen Geduld mit Amiga, die werden
die Sache schon noch zum Losstarten bringen. :)
</P>
<P><B>Fabio Trotta von NRNF:</B></P>
<P>
Weiterhin w&uuml;nsche ich euch und dem AMIGA noch viel Erfolg. Schaut ruhig
&ouml;fters mal bei uns vorbei. Es hat mich echt gefreut, mich mit zwei
Mitgliedern der momentan besten AMIGA-Entwicklungsschmiede zu unterhalten.
</P>
<P>
An dieser Stelle will ich nochmal auf die Hyperion-Software-Websites
verweisen.
</P>
<P>
 <A HREF="http://www.hyperion-software.de" TARGET="_top">http://www.hyperion-software.de</A><BR>
 <A HREF="http://www.hyperion-software.com" TARGET="_top">http://www.hyperion-software.com</A><BR>
</P>
<P>
(Quelle: No Risc No Fun Website)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
