<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Vorwort (mit R&uuml;ckblick auf den vergangenen Monat)</H1>
<P>
+++ AMIGA-Pr&auml;sident Bill McEwen informiert &uuml;ber weitere Details zum AmigaNG
+++ AMIGA gibt diverse Partnerschaften bekannt +++ Weitere AmigaNG-
Programme erschienen +++
</P>
<P>
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Zun&auml;chst kurz zur Leserumfrage in AMIGA aktuell 06/00: Leider bin ich aus
Zeitgr&uuml;nden gezwungen, die Auswertung bis zur Septemberausgabe zu
verschieben.
</P>
<P>
Achtung: All diejenigen, die f&uuml;r die Umfrageteilnahme das Online-Formular
verwendet und darin die M&ouml;glichkeit einer Mitarbeit bei AMIGA aktuell nicht
ausgeschlossen haben, sollen sich bitte per E-Mail bei mir (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>)
melden.
</P>
<P>
Damit zum Amiga: Abgesehen vom Erscheinen des NG-Entwicklerrechners
&raquo;d'AMIGA&laquo; verlief der vergangene Monat, wie es in einem Sommermonat schon
beinahe zu erwarten ist, relativ ruhig. Die Nachrichtenlage pl&auml;tscherte so
vor sich hin und wurde nur durch gelegentliche Presseerkl&auml;rungen AMIGAs
kurzzeitig etwas interessanter. Erst gegen Ende des Monats sind einige
bedeutsamere Neuigkeiten bekannt geworden.
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Wir suchen dringend einen Mitarbeiter, der jeden Monat eine der Rubriken
  &raquo;Tests und Erfahrungsberichte&laquo; ODER &raquo;Workshops&laquo; f&uuml;r unsere internationale
  Ausgabe ins Englische &uuml;bersetzt. Grund ist, dass unser Mitarbeiter Jens
  Neubauer mittlerweile leider beruflich sehr eingespannt ist. Meldet euch
  bitte bei <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</LI>
<BR><LI> Existiert die Essener Mailbox Empire noch?
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber
  an AMIGA aktuell (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>).
</LI>
<BR><LI> Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich
  an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> wenden.
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
