<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Der Commodore-Untergang aus meiner Sicht - Teil 10 (von Rainer Benda)</H2>
<P>
Mit an Board war noch Gwynne Thomas, der damals f&uuml;r C= in Hong Kong
arbeitete und bei Amiga Tech. die &quot;Teileversorgung&quot; sicherstellen sollte,
sowie die Produktion in Gang zu bekommen.
</P>
<P>
Sp&auml;ter kam noch Gilles Bourdin dazu, der in der Presseabteilung bei C=
bereits eine Weile t&auml;tig war und diesen Job bei Amiga Tech. &uuml;bernahm und
sich mit Petro darum &quot;streiten&quot; musste, welches Logo wir denn nun nehmen
und wieviel Farben es haben darf (Gilles wollte den Amiga Haken in 4
Farben, Petro nicht, weil zu teuer, bzw. Gilles h&auml;tte es von seinem Budget
abzwacken sollen/m&uuml;ssen)......die Logos &auml;nderten sich jedenfalls ab und
zu....ich dachte mir eigentlich nur, da&szlig; es Wichtigeres gibt....naja.
</P>
<P>
Die Braunschweiger Jungs gab es auch noch (Axel Kr&auml;mer, Andreas Steep)...zu
verkaufen gab es halt jede Menge CD32, der A1200 wurde bei Escom ja
bekannterweise neu aufgelegt.....
</P>
<P>
Es gab viele Fragen, warum der A1200 nicht verbessert wurde, so bez&uuml;glich
der Unterst&uuml;tzung von HD-Laufwerken etc.
</P>
<P>
Ist eigentlich einfach zu beantworten....es war nicht m&ouml;glich die &quot;Paula&quot;
so zu ver&auml;ndern, da&szlig; sie von sich aus HD-Laufwerke verwalten konnte. Es
lagen auch nicht mehr alle Unterlagen seitens C= vor, so da&szlig; man die Paula
schon scheibchenweise(!) abfr&auml;sen musste, um nachzuvollziehen, was in ihr
vorgeht.
</P>
<P>
Im Grunde war man froh, wenigstens den A1200 anbieten zu k&ouml;nnen...damals
f&uuml;hrten wir Gespr&auml;che mit Mitsumi wegen DD-Diskettenlaufwerken, deren
Preise etc.....sicher war ein HD-Laufwerk um 50% g&uuml;nstiger als ein DD-
Laufwerk, das kaum noch im Markt eingesetzt wurde, aber es sollte ja auch
noch funktionieren.
</P>
<P>
Naja, weiteres muss ich wohl kaum erz&auml;hlen, die verschiedenen HD-
Laufwerksvarianten im Markt seitens Vesalia, Amtrade etc. sind ja bekannt.
</P>
<P>
Irgendwann waren wir in der Lage den A4000T aus C= Produktion anbieten zu
k&ouml;nnen...Doc Peter und ich waren der Ansicht, den Preis &quot;niedrig&quot; zu
gestalten, um so St&uuml;ckzahlen in den Markt zu bekommen....wir wurden auch
von Petro gefragt, ob wir es lieber so h&auml;tten, oder doch eher einen hohen
Preis, um die &quot;paar&quot; Ger&auml;te nicht zu verschleudern. Letzteres kam dabei
heraus, da er der Ansicht war, da&szlig; wir nichts zu verschenken h&auml;tten....
</P>
<P>
So vergingen die Tage, und ich empfand die ganze Sache als wenig produktiv.
Gespr&auml;che mit Telenorma wegen Anschl&uuml;ssen im Haus, Beschaffung von
Arbeitsplatzger&auml;ten, die wir aber so nicht bekamen, weil entweder Teile
nicht verf&uuml;gbar oder zu teuer waren. Petro gab uns zwar freie Hand bei der
Beschaffung der Teile, aber ohne Genehmigung ging dann doch nichts und so
verz&ouml;gerte sich die Bestellung f&uuml;r interne CPU-Boards und Speicher schon
deswegen um 2 Wochen, weil Petro im Ausland unterwegs war. Es gab auch die
Anweisung, m&ouml;glichst alle Teile intern &uuml;ber Escom zu beziehen, allerdings
kostete ein 2MB-Chip-RAM Modul dort ca. dreimal soviel als bei Hirsch &amp;
Wolf, und es war schon ein Kampf, ihn davon zu &uuml;berzeugen, da&szlig; Escom eben
nicht zu den &quot;Billigsten&quot; geh&ouml;rte. Auch ein Versuch meinerseits, dem
Verkauf bei ESCOM klarzumachen, da&szlig; a) kaum jemand 2MB-PS/2-Module ben&ouml;tigt
und es b) angebracht w&auml;re, die Preise zu senken, bevor sie abgeschrieben
werden mussten, interessierte irgendwie niemanden. Kurzum, sie wurden dann
von mir bei Hirsch &amp; Wolf gekauft. Ich erlebte noch den Wareneingang und
&uuml;bergab die Teile dann Doc Peter, kurz vor meinem Ausscheiden. Nachher
m&uuml;ssen die Teile (nachdem sie im Haus wohl verschiedene Wege gingen) Beine
bekommen haben, jedenfalls wurde ich Wochen nach meinem Abgang darauf
angesprochen, wo die Teile geblieben seien. Da ich sie ordnungsgem&auml;&szlig;
&uuml;bergab, war ich aus der Sache raus.
</P>
<P>
Es kam, wie es kommen musste, mein Ausstieg kam eher unfreiwillig, aber im
Nachhinein bin ich doch froh darum, auch wenn mich die Gr&uuml;nde mehr als nur
ge&auml;rgert haben. Escom hatte damals die CD32-Posten von C= &uuml;bernommen und
Escom-Chef Schmitt wollte die Teile einer spanischen Handelskette vorf&uuml;hren
(oder besser gesagt ich). An der Stelle sei wieder mal anzumerken, sich auf
niemanden zu verlassen und wirklich alles selbst zu erledigen. Na ja,
jedenfalls standen die Teile noch unge&ouml;ffnet &quot;irgendwo&quot; bei Escom herum,
keiner konnte mir sagen, in welchem Zustand die Dinger sind. Lt. Petro alle
orig. verpackt. Ich hab mich dann mit einem Lagermenschen bei Escom
&quot;abgesprochen&quot; (weil er wusste, wo sie sind), da&szlig; ich so ein Teil f&uuml;r
Montag morgen ben&ouml;tige und ich mich mit ihm eine Stunde fr&uuml;her bei Escom
treffen m&ouml;chte, um das Teil in Empfang zu nehmen (Monitor hatte ich bereits
im Auto). Es war Montag morgen, der Lager-Mensch war nicht da, und keiner
wusste von den CD32....schlie&szlig;lich bekam ich doch noch ein Ger&auml;t zu fassen,
und wie sich herausstellte, waren es franz&ouml;sische Versionen mit falschen
Kabeln. Ich bin durch alle Hallen Escoms gewandert und durch den Escom-Shop
plus Technik-Abteilung, es war kein Adapter aufzutreiben und so konnte ich
nur berichten, da&szlig; die Vorf&uuml;hrung nicht stattfinden kann. Dar&uuml;ber war
Schmitt nat&uuml;rlich nicht erfreut.
</P>
<P>
Einige Stunden sp&auml;ter (Anmerkung, meinen Arbeitsvertrag hatte ich noch
nicht unterschrieben, weil er mir nach 4 Wochen noch nicht vorlag) rief
mich Petro rein und meinte, mich dann runterputzen zu m&uuml;ssen (bzw. zu
k&ouml;nnen). Er sei mit mir nicht zufrieden und selbiges habe ich dann zu ihm
gesagt. Vor allem habe ich ihm gesagt, da&szlig; Amiga Technologies vielleicht 1
bis 2 Jahre durchh&auml;lt, bevor sie den Bach runtergehen, wenn man schon
wieder anf&auml;ngt jeden Fehler der Vergangenheit zu wiederholen. Naja, jede
Erwiderung war zwecklos, es lag nicht in seinem Interesse (oder den
M&ouml;glichkeiten) etwas zu &auml;ndern. Es wurde ein S&uuml;ndenbock gebraucht. &quot;Ob ich
ihn l&auml;cherlich machen wollte&quot; etc....so ein Schmarrn.
</P>
<P>
Doc Peter ging nach dem &quot;lautstarken&quot; Gespr&auml;ch zu Petro und gab ihm sein
Mi&szlig;fallen zu verstehen, worauf Petro ihm antwortete, er k&ouml;nne gleich mit
gehen, sollte ihm die Entscheidung nicht passen.
</P>
<P>
Trotzdem sollte/durfte ich einigen G&auml;sten noch zeigen was mein Amiga so
leistete......es &auml;nderte aber nichts an seiner Entscheidung (Jahre sp&auml;ter
sagte er mir, es sei Anweisung von Schmitt gewesen, so zu handeln.....).
</P>
<P>
Ich teilte der Personalabteilung mit, meine Papiere fertigzumachen, die
nat&uuml;rlich erstaunt waren, da sie noch nicht mal mit ihren Unterlagen fertig
waren......man fragte mich nach dem Grund und empfahl mir, mich an den
Betriebsrat zu wenden...ich lehnte ab...ich wollte nur schnell
weg.....Petro versuchte mich an meine K&uuml;ndigungsfrist zu binden....ich
sagte ihm, da&szlig; mir auch pl&ouml;tzlich sehr schlecht werden k&ouml;nne, sollte er
einer Freistellung nicht zustimmen....wir &quot;einigten&quot; uns darauf, die
K&uuml;ndiungsfrist fallen zu lassen und am n&auml;chsten Tag war ich weg.
</P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
