<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P>
Kommt Zeit, kommt ....... garnichts
</P>
<P>
Ich fahre mit meinem 8 Jahre alten VW Polo auf der Autobahn A 9 Richtung
Berlin. Ich mu&szlig; nicht ganz so weit .... beim Hermsdorfer Kreuz gehts auf
die A 4 Richtung Gera.
</P>
<P>
Kurz nach der th&uuml;ringisch-bayerischen Landesgrenze endet die 6-spurig
ausgebaute Autobahn in einem 4-spurigen 30er-Jahre &quot;Autob&auml;hnchen&quot;. Die
Planierraupen haben sich noch nicht bis dahin durchgearbeitet.
</P>
<P>
Pl&ouml;tzlich sehe ich am Fahrbahnrand einen Wartburg. Die Motorhaube nach oben
geklappt .... als ich vorbeifahre meine ich im Augenwinkel eine Person &uuml;ber
die blo&szlig;gelegten Innereien werkeln zu sehen.
</P>
<P>
Ich stelle fest, da&szlig; mir auch fast 10 Jahre nach der deutsch-deutschen
Wiedervereinigung noch dieselben (zugegeben bl&ouml;dsinnigen)
klischeebehafteten Gedanken &uuml;ber Trabbies und Wartburgs durch den Kopf
schie&szlig;en.
</P>
<P>
Als ich an der Ausfahrt Schleiz vorbeibrause kommt mir jedoch ein
erschreckender Gedanke: Ob Stra&szlig;en- oder Datenverkehr, ob Industrie oder
Dienstleistungsbranchen. Fast vier Millionen Arbeitslose in Deutschland,
etwa 12 Millionen in Euro-Land .... zugegeben weniger als noch vor einigen
Jahren, aber immer noch eine ganze Menge.
</P>
<P>
Ich sehe Politiker und Verb&auml;ndevorsitzer von der sch&ouml;nen neuen Zukunft
schw&auml;rmen - das Internet. E-commerce, B2B-commerce. B2C-commerce ....
jedoch kaum einer von den oben genannten Predigern hat selbst Erfahrungen
mit dem Internet gemacht. Jedenfalls kommt mir der Verdacht, wenn ich sehe,
wie kindisch einf&auml;ltig diese Leute mit dem Thema umgehen. Redetext flei&szlig;ig
auswendig gelernt ... Bravo.
</P>
<P>
Dem W&auml;hler/Konsument/Arbeitnehmer wird auch gesagt, da&szlig; er jetzt &uuml;bers
Internet lernen darf .... hat einer der Zwischenruf-Leser mal ernsthaft
versucht, ein Online-Angebot einer Tageszeitung oder einen l&auml;ngeren Artikel
mit 10 und mehr Links ganz durchzulesen? Ohne Standleitung ein l&auml;cherliches
Unterfangen ....
</P>
<P>
Andy Grove, bekannt von Intel, sagte: &quot;Die Zukunft geh&ouml;rt den Paranoiden&quot;.
Wie pa&szlig;t das zur schlecht ausgebauten Autobahn? Nun, wer in Deutschland
(oder vielleicht in ganz Europa) zum Paranoiden avanciert, wird nicht durch
die sch&ouml;ne Zukunft belohnt. Er oder sie wird ganz einfach verr&uuml;ckt ...
</P>
<P>
Es existieren zuviele M&auml;ngel, an denen der Einzelne nichts &auml;ndern kann, und
wenn er sich noch so anstrengt. Vieles wird einfach deshalb vergeigt, weil
man nicht die richtigen Instrumente hat ... und/oder man sich diese ggf.
nicht leisten kann.
</P>
<P>
Der Mann von der Post sagt im Fernsehen: &quot;Sie machen Klick ... wir machen
den Rest&quot;. So soll es in Zukunft sein .... und hoffentlich nicht nur bei
der Deutschen Post AG.
</P>
<P>
Sch&ouml;nen Urlaub .... ich seh' mich schon mit Laptop (5000,-- DEM) und
Lederhose (guter bayerischer Kampfanzug mit Hemd und Hose und Charivari -
wir sind ja traditionell; f&uuml;r schlappe 2000,00 DEM). Fehlt nur noch das
Handy (mit richtigem Internetzugang).
</P>
<P>
Lebt lang und erfolgreich ...
</P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
