<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Aminet 41</TITLE>
</HEAD>
<body background="aminet.gif" text=black link=blue alink=red bgcolor=gray>
<table width=95%>
<p><h1><center><b>Vorstellung: Aminet 41</h1></center></B></P>
<p>So wie es aussieht, wird wohl meine Wenigkeit von nun an die Aminet CD Tests &#252;bernehmen - zumindest hat der Andreas mir die aktuelle Ausgabe Nr.41 zukommen lassen, die ich an dieser Stelle nun besprechen soll. Ich werde mich dabei gr&#246;&#223;tenteils an der Art und Weise von Wolf Zimmer orientieren.
<hr>
<p><h2><center><b>Der Inhalt</h2></center></B></P>
<p><ul><li><b>800 MB neues Material<BR></B>
<li><b>40 MB Amiga News</B><br>
<li><b>15 MB kommerzielle Software (Capital Punishment)</B></UL></P>

<p><b>Kommerzielles Highlight (15 MB)</B><br>
Wie oben bereits erw&#228;hnt, ist das kommerzielle Highlight der 41.Ausgabe der Erfolgsserie mal wieder ein Spiel - aber nicht irgendeines, sondern das Erstlingswerk der bekannten Firma ClickBoom, die uns auch schon &quot;Napalm&quot;, &quot;Myst&quot; und &quot;Nightlong&quot; bescherrt haben. &quot;Capital Punishment&quot; ist ein beeindruckendes Beat em Up Game, welches es in sich hat und sicherlich als Referenz f&#252;r dieses Genre auf dem Amiga angesehen werden kann. Recht &#228;rgerlich ist nur, da&#223; diese Vollversion vor wenigen Monaten schon auf der Leser CD der Amiga Future erschienen ist und somit schon vielen Usern bekannt sein d&#252;rfte. Auch die Tatsache, da&#223; der Kopierschutz immer noch dabei ist, tr&#252;bt den ansonsten positiven Eindruck des 1996 erschienenen Games ein wenig. Nichtdestotrotz ein wirklich erstklassiges kommerzielles Highlight, welches Fans dieses Genres ohne Frage tagelang an den heimischen Amiga fesseln wird.</P>


<p><b>Amiga News (40 MB)</B><br>
Die bekannteste deutsche Amiga News Seite <a href="http://www.amiga-news.de" target="_Blank">(http://www.amiga-news.de)</A> sollte wohl jedem Amiga User mit Internet Zugang hinreichend bekannt sein. F&#252;r alle User, die keinen Internet Zugang haben, bietet diese offline-Version einen Gro&#223;teil der Amiga News, wenngleich diese nat&#252;rlich l&#228;ngst nicht mehr aktuell sind, stammen diese doch noch vom Anfang des neuen Jahres. Trotzdem sollte man zumindest mal einen Blick riskieren, zumal auch einige andere Rubriken - wie z.B. &quot;Free Amiga Jobs&quot; - in der Offline Version enthalten sind. Alles in allem eine runde Sache, welche die Aminet CD ein jedesmal sinnvoll abrundet.</P>

<p><b>Aminet (800 MB - nach dem entpacken)</B><br>
Auch wenn es sicherlich nicht mehr ganz so viele Uploads in`s Aminet gibt wie noch vor einigen Jahren, so kann man dennoch einige interessante Tools, Programme, Guides oder Magazine auf den Aminet Einzel CD`s ausfindig machen, von denen ich in loser Reihenfolge mal einige rauspicken will - das ganze nat&#252;rlich ohne Anspruch auf Vollst&#228;ndigkeit.</P>

<p>Als erstes fiel mir die neue Version (4.66) des Screenmode Promoters &quot;Mode Pro&quot; auf. Dieses Tool erm&#246;glicht es dem User - bei m&#246;glichst hoher Kompatibilit&#228;t - Screens umzulenken, was insbesondere bei Grafikkarten sinnvoll ist. Sollte man als GraKa Besitzer unbedingt mal antesten, zumal das Tool aktiv gepfelgt wird, wie dieses neuerliche Update erneut beweist.</P>

<p>Neue Amiga Programme gibt es nicht mehr? Falsch! Unter comm/www befinden sich einige Screenshots eines neuen Webseiten Erstellungstools, die auch recht vielversprechend aussehen. Weiterreichende Info`s gibt es zwar in dem Archiv noch nicht, aber es wird auf die Homepage des &quot;Leaman WebOffice For Amiga&quot; <a href="http://leamancomputing.co.uk" target="_Blank">(http://leamancomputing.co.uk)</A> verwiesen, auf dem sich bestimmt auch weitere Info`s befinden. Aufgrund eines nicht vorhandenem Internet Zugangs konnte ich das leider nicht testen - bei Interesse, k&#246;nnt ihr Euch ja die Page mal angucken und in der NoCover dar&#252;ber berichten.</P>

<p>Im Verzeichniss pix/mpeg ist ein Haufen an MPEG Dateien zu finden, die nicht nur einen Rundgang &#252;ber die &quot;World Of Amiga&quot;, sondern auch Bill McEwens Seminar auf der ACE 2000 in Australien zeigen. Nat&#252;rlich ist etwas mehr Rechenpower sowie eine Grafikkarte von n&#246;ten, aber daf&#252;r ist es auch interessant. Wer noch keinen MPEG Player sein eigen nennt, wird zudem im Verzeichniss gfx/show in Form von &quot;Frogger&quot;, &quot;AMP&quot; oder &quot;VideoMPEGA&quot; f&#252;ndig.</P>

<p>Wer hingegen schn&#246;den Text in Form von Guides, HTML Dokumenten oder gar ASCII Dateien bevorzugt, der liegt im Ordner &quot;docs&quot; richtig. Insbesondere das neue AmigaGuide Diskmag &quot;Fireball&quot;, von der die ersten drei Ausgaben auf der Aminet CD 41 zu finden sind, sei Euch an dieser Stelle an Herz gelegt. Die &quot;Fireball&quot; ist aus der 4ever hervorgegangen, von der auch die letzte Ausgabe (Nr.18) hier zu finden ist. Aber auch die &quot;Amiga Aktuell&quot; ist sehr stark hier vertreten und kann nochmal in Ruhe durchgeschaut werden. Recht interessant muten auch die diversen Amiga Guide Versionen verschiedener B&#252;cher der Bibel an, die unter docs / hyper zu finden sind. Das in diesen Archiven sehr viel Arbeit steckt, wird nicht nur an der Gr&#246;&#223;e ersichtlich und sollte an dieser Stelle einmal positiv hervorgehoben werden. </P>

<p>Musikalisch geht es nat&#252;rlich auch wieder einmal rund, wobei ich an dieser Stelle nat&#252;rlich keine einzelnen Musik Module hervorheben m&#246;chte. Stattdessen sei Eure Aufmerksamkeit mal auf die verschiedenen Player gerichtet. &quot;Amiga Amp&quot; ist ein ganz toller MPEG Audio Player, der auch auf vergleichsweisen schwachen Systemen seinen Dienst recht gut verrichtet und auf jede Festplatte geh&#246;rt. Auch der Abspieler &quot;Easy Player&quot; wei&#223; zu gefallen und sollte bei Gelegenheit mal angetestet werden.</P>


<p>So, da&#223; war der ganz kurze Rundgang durch die neueste Aminet CD. Ich m&#246;chte an dieser Stelle nochmal klarstellen, da&#223; es sich mitnichten um einen Test, sondern nur um eine Vorstellung gehandelt hat und ich deswegen auf ein abschlie&#223;endes Urteil der 25 DM teuren CD verzichten m&#246;chte. Auch sind nat&#252;rlich nur einige wenige Impressionen der kompletten CD in dieser Vorstellung zu finden. Um Euch nochmal einen groben &#220;berblick zu geben, habe ich - nach Wolf Zimmert`s Vorbild - die Gr&#246;&#223;e der einzelnen Verzeichnisse in eine kleine Tabelle gepackt:</P><center><img src="amtab.gif" NO TRANSPARENCY></Center></P><br>


 


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
