<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Produktvorstellung: Aminet Set 10</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><center><h1><font color="green">Vorstellung: Aminet Set 10</Font></center></h1></P>

<p>In regelm&#228;&#223;igen Abst&#228;nden werden die einzelnen Aminet CD`s zu einem aus 4 CD`s bestehendem Set zusammengefasst - mitlerweile sind wir bei Set Nummer 10 angekommen, das schon vor einigen Wochen erschienen ist. An dieser Stelle m&#246;chte ich eine kleine Zusammenfassung geben, wobei Details bei der riesigen Datenmenge nat&#252;rlich ausbleiben.</P>

<p><center><h2><font color="yellow">4 CD`s - mehr Schein als Sein?</font></center></h2></P>
<p>Zuerst einmal gibt es einen wenig erfreulichen Wechsel bei der Zusammenstelung der CD`s: Anstatt alle zusammengeh&#246;rigen Daten wie &quot;Util&quot;, &quot;Pix&quot; oder auch &quot;Mods&quot; auf einer CD zusammenfassen wie es bisher der Fall war, werden dem K&#228;ufer nun die normalen Einzel CD`s vor den Latz geknallt - nicht mehr, aber auch nicht weniger. Das ist meiner Meinung nach ein sehr unerfreulicher Wechsel, da man sich nun wieder durch zahlreiche CD`s w&#252;hlen muss, um ein bestimmtes Tool zu finden - das war mittels der Set`s in der Vergangenheit deutlich einfacher...</P>

<p>Na ja, kommen wir zu dem positiven Aspekten: Den Vollversionen, die insbesondere f&#252;r Spiele Fans von Interesse sein d&#252;rften.</P>

<p><u>Flipper:</U><BR>
Die drei bekannten erstklassigen Flipper Pinball Dreams, Pinball Fantasies und Pinball Illusions haben es auf das Set geschafft. Auch wenn bei Pinball Fantasies nur zwei Tische (im Original 4) zur Verf&#252;gung stehen, kann man damit jede menge Zeit vor dem heimischen Rechner verbringen, die garantiert schneller um ist, als man sich gedacht hat.</P>

<p><u>Max Ralley:</U><BR>
Max Ralley ist ein Autorennspiel mit einer Sicht von oben auf die Autos. Das Game ist zwar vielleicht kein grafischer Leckerbissen, aber Spa&#223; macht auch Max Ralley und wenn man sich erstmal an die Steuerung gew&#246;hnt hat, kommt unter Garantie auch Spielesucht heraus. Ich jedenfalls mag das Game, auch 
wenn es nicht auf dem aktuellesten Stand der Technik ist. Ach ja: Wer Probleme hat, Max Ralley zu starten, sollte die nicht (!!) mitgelieferte &quot;explode.library&quot; aus dem Aminet laden und installieren. </P>

<p><u>Zombie Massacre:</U><BR>
Das einzigste schwache Spiel auf dem Aminet Set 10 ist Zombie Massacre. Wer &quot;Gloom 3&quot; kennt, wei&#223;, was einem bei Zombie Massacre erwartet: Ein grausam programmierter 3D Shooter, den selbst ein 5-j&#228;hrigr auf dem C64 besser hingekriegt h&#228;tte. Wer mal lachen will, kann sich das Spiel ja mal angucken - alle anderen, sollten nicht mal auf den Gedanken kommen, es zu installieren.</P>

<p><u>Personal Paint</U><BR>
Muss ich zu diesem Malprogramm, welches in der letzten Version (7.1b) vorliegt, noch irgendwelche Worte verlieren? Es ist einfach klasse und eines der besten Malprogramme, die derzeit erh&#228;tlich sind (nicht mit EBV Tools wie ArtEfect etc. verwechseln), auch wenn diverse Vollversionen schon h&#228;ufiger auf CD`s erh&#228;ltlich waren. Bleibt nur zu hoffen, da&#223; es bald auch noch mal eine neue Version gibt...</P>

<p>Soviel also zu den Vollversionen, wobei zu bemn&#228;ngeln ist, da&#223; es sich - mit Ausnahme des Malprogramms PPaint - nur um Spiele handelt. Aber ich will ja schon nicht wieder rummeckern, denn schlie&#223;lich kauf man sich ein Aminet Set nicht wegen den Vollversionen, sondern wegen der frei vertreibbaren Amiga Software, die auf den CD`s enthalten ist.</P>

<p>Um Euch einen groben &#220;berblick &#252;ber die Datenmenge zu geben, habe ich die Gr&#246;&#223;e der jeweiligen Archive einfach mal innerhalb von Turbo Calc zusammengefasst und Euch davon einen Screenshot gemacht:</P><center><p><img src="amset10_1.jpg"></center></P><BR>


<p>Wie man sehen kann, handelt es sich nach wie vor um eine gro&#223;e Datenmenge, wenngleich es nat&#252;rlich nicht mehr so viel neue Software gibt, wie zu Zeiten des Aminet Set`s 3 oder 4. Das soll jetzt aber nicht bedeuten, da&#223; sich der Kauf nicht mehr lohnt - ganz im Gegenteil: Es lassen sich beim gen&#252;sslichen Durchst&#246;bern des Set`s zahlreiche Softwareperlen finden, die es wahrlich in sich haben und die man nach einiger Zeit gar nicht mehr auf seiner Festplatte missen will. Sicherlich wird nicht alles f&#252;r jeden interessant sein - ich z.B. h&#246;re mir nur selten einige der zahlreichen Musikmodule an - aber dabei sein sollte eigentlich f&#252;r jeden Amiga User etwas, zumal man mit den neuen Versionen der Datatypes und Libraries auch mal wieder sein Betriebssystem auf Vordermann bringen kann, was sich nicht zuletzt in der Geschwindkeit und Stabilit&#228;t positiv bemerkbar macht.</P>

<p>Ich m&#246;chte an dieser Stelle auch keine Software explizit auff&#252;hren und bewerten, da die Datenmenge einfach zu riesig ist. Stattdessen kann ich f&#252;r dieses Set - genau wie f&#252;r die diversen Vorg&#228;nger - nur eine Kaufempfehlung aussprechen, da der Preis von 59 DM konkurrenzlos g&#252;nstig ist und seinesgleichen sucht. Da aber ohnehin jeder normale Amiganer entweder die Einzel CD`s im Abo hat oder sich die Set`s so oder so zulegt, kann ich diese Produktvorstellung an dieser Stelle auch beenden. Nach wie vor unersetzlich!</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
