<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>WW7-Antwort</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#000080" bgcolor="#808080">
<a name="top"></a><br>
<table width=100% border=0><tr><td>
<p align=center><font color="#000080" size="7"><b>WW7-Antwort</b></font></p>

<p>Nachfolgend wird meine Mail an J&ouml;rg abgedruckt, weil ich keine Antwort darauf
bekam, also nicht ahnen kann, ob sie &uuml;berhaupt angekommen ist. Die
Anschrift habe ich weggelassen, weil ich nicht weiﬂ, ob eine Bekanntgabe
rechtswidrig w&auml;re, da sie bisher in der NoCover noch nicht aufgetaucht war
und J&ouml;rg sie im Anschluss an seinen Artikel nicht mitgeteilt hatte.
<hr></p></td></tr></table>

<table width=100% border=0><tr><td>
<pre>
   Gr&uuml;ﬂ dich J&ouml;rg!

   Mir pers&ouml;nlich fiel es erst am 31.Januar auf, als pl&ouml;tzlich im Kopf der
   1.Februar auftauchte. Meines Erachtens ein Jahr2000 Bug, der erst durch
   die Erh&ouml;hung von 2000 auf 2001 auftritt.

   Die Support-Abteilung von Schatztruhe teilte mir auf meine Frage:

   &gt; Gibt es ein Update bzw. Patch, das diesen Bug bereinigt?

   folgendes mit:     
   
   &gt; Leider mussten wir dieses Problem auch feststellen. Erst mit dem Jahr
   &gt; 2001 tritt dieser Fehler auf, der sich nicht korrigieren l&auml;sst. Da
   &gt; Digita die Weiterentwicklung des Programms eingestellt hat, ist auch
   &gt; nicht mehr mit Abhilfe zu rechnen :-(

   &gt; Eine (wenn auch provisorische) L&ouml;sung des Problems w&auml;re es, eine
   &gt; Batchdatei zu schreiben, die man dann mit einem Icon versieht und mit
   &gt; IconX ausf&uuml;hrt.
   &gt; In dieser Datei m&uuml;sste zuerst das Datum um einen Tag zur&uuml;ckgesetzt
   &gt; werden (&quot;date gestern&quot;), dann Wordworth gestartet werden und nach
   &gt; Beendigung das Datum dann wieder zur&uuml;ckgesetzt werden (&quot;date morgen&quot;
   &gt; oder &quot;setclock load&quot;). Hab ich zwar auch noch nicht probiert, aber
   &gt; m&uuml;sste so funktionieren. Negativer Nebeneffekt: W&auml;hrend Wordworth
   &gt; l&auml;uft, w&auml;re im gesamten System das Datum um einen Tag zu weit ...
   
   Mit dieser Antwort bin ich keinesfalls zufrieden und habe dies auch
   mitgeteilt. Was passiert bei Laufzeit&uuml;berwachungsprogrammen, was ist
   &uuml;berhaupt bei Terminsteuerungen los und was passiert, wenn WW7 nicht
   ordentlich abgemeldet werden wird, weil ein Guru die Anlage zum Absturz
   gebracht hatte und die Systemzeit vorher nicht wieder aktualisiert
   werden konnte. Beim n&auml;chsten Start wird ja dann wieder um einen
   weiteren Tag zur&uuml;ckgesetzt. Was passiert dann mit Updateprogrammen, die
   schon gelaufen waren und pl&ouml;tzlich gem. umgestelltem Datum wieder aktiv
   sind?

   Ein Patch darf sich nur auf das WW7 selber auswirken und anstelle des
   aktuellen Datums das &acute;date yesterday&acute; holen. Ich pers&ouml;nlich bin nicht
   in der Lage so etwas zu schreiben, auch nicht als AREXX-Script, was
   sich hier wohl anbieten w&uuml;rde.

   Wenn du eine L&ouml;sung gefunden hast, w&uuml;rde ich mich freuen, wenn du sie
   mir mitteilst.

   Mit freundlichen Gr&uuml;ﬂen

   Wolf Zimmer

   Es kann passieren, was will. Es gibt immer einen, der es kommen sah.
   -- Fernandel
</pre&gt;
</td></tr></table>
<table width=100% border=0><tr><td>
<hr>

<p>Jetzt kann ich nur hoffen, dass die Antwort auf die Frage in der NC-83
angekommen ist.
</p>
</td></tr></table>
<br>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#88ccff">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#88ccff">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#88ccff">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
