<html>
<head>
<title>APC & TCP</title>
</head>
<body BACKGROUND="l_bg.gif" TEXT=#000000 LINK="#0000FF" VLINK="#000080" ALINK="#FF0000"
 BGCOLOR="#FFFFF4">
<center>
<h2>Eine Stellungnahme zu Feedback-Frust</h2><br>
<h3>Ja, lieber Wolf Du sprichst mir aus der Seele.</h3><br>
<h4>Aber ich kann mir gut vorstellen, warum kaum noch etwas r&uuml;ber kommt:</h4><br>
</CENTER>
<ol start="1" type="1">
<li>Das Netz, der Netze macht sicher viele "Surfer" sehr s&uuml;chtig. Es gibt so unendlich viel zu schauen, zu lesen, zu h&ouml;ren. Da ist die "magere" NC keine gro&szlig;e Konkurrenz.</li><p></p>
<li>Viele, viele junge Leute sind inzwischen auf die leistungsstarken und wesentlich billigeren PC's umgestiegen. Und mit denen kann man viel besser spielen, das "surfen" geht auch z&uuml;giger und der Austausch mit gleichgesinnten macht mehr Spa&szlig;.</li><p></p>
<li>Dann denke ich auch, da&szlig; die Erstellung einer HTML-Seite vielen jungen Leuten einfach keinen Spa&szlig; macht, denn man mu&szlig; sich doch ernsthaft damit besch&auml;ftigen, um eine halbwegs vern&uuml;nftige Seite zusammen zu stellen.</li><p></p>
<li>Jetzt kommt noch hinzu, da&szlig; die NC nur einmal im Monat erscheint und der Feedback erst in der &uuml;bern&auml;chsten NC erscheint. Viel schneller geht eine eMail an den Freund / Bekannten / den Schreiber usw.. Warum soll man da erst eine Seite basteln und dem guten Andreas zustellen.</li><p></p>
<li><font size="+1"><b>Ein gro&szlig;es Dankesch&ouml;n noch an Dich Andreas, so sp&auml;t wie ich meine Seite an Dich abgeschickt hatte, habe ich nicht erwartet sie noch in der NC83 zu lesen. Danke.</b></font></li><p></p>
<li><font size="+1" color="#E00000">Jedenfalls m&ouml;chte ich hiermit kundtun, da&szlig; ich mich mit Javascript auch schon besch&auml;ftigt habe, aber es gar nicht so einfach ist, keine Fehler einzubauen. Es macht aber einen Heidenspa&szlig; zu sehen, wenn es denn wirklich funktioniert.</font></font></li><p></p>
<li><b><font color="#0000FF">Und dann m&ouml;chte ich allen jungen Leuten, die die NC <u>"noch"</u> lesen, hierdurch mitteilen, es geht auch mit einem PC diese Seiten zu erstellen, denn mein AMIGA macht mir auch keinen richtigen Spa&szlig; mehr.(Vgl. NC83,NC80,NC76+NC74.)</font></b></li>
</ol>
<div align="center"><b><font size="+1">&Uuml;brigens, diese Seite wurde erstellt mit dem HTML-Editor von Ulli Meybaum "Phase  5" - Und um auf dem laufenden zu bleiben lese ich regelm&auml;&szlig;ig die
Zeitschrift "HomeP@ge".</font></b></div>
<HR>
<BR>
<img src="burg.gif" width="40" height="40" border="0" alt="Burg" align=right hspace=10>
von: &#160;<a href="Mitglieder/nuenninghoff.html">Rolf Nue. aus Wue.</a><br>
E-Mail:<a href="mailto:093113563-0001@t-online.de">
093113563-0001@t-online.de</a><p>
</P>
<HR>
</BODY>
</HTML>