<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=red alink=red>
<table width=95%>
<p><center><h1><font color="green">Leserbrief von Kilian "The Bruce" Servais</font></center></h1></P><ul>
<li><a href="#alle.html">An alle Metal Fans</A><BR></LI>
<li><a href="#charlie.html">An Charlie</A><BR></LI>
<li><a href="#wolf.html">An Wolf</A><BR></LI>
<li><a href="#top.html">Top 5 &amp; Feedback</A></UL></LI></P>
<hr>
<a name="alle.html">
<p><b>An alle Metal Fans</B><br>
All jene, die damals die HMG gelesen hatten und Gefallen daran gefunden haben, darf ich an dieser Stelle kurz darauf hinweisen, da&#223; es eine neue Version (4.0) der HMG im Aminet unter docs / hyper gibt. Allerdings habe ich die HMG grundlegend ge&#228;ndert und mit den alten Versionen hat die neue 4.0 auch nicht mehr viel gemeinsam, aber vielleicht kann der eine oder andere trotzdem etwas damit anfangen. Alles weitere steht im Vorwort der HMG. &#220;ber entsprechendes Feedback w&#252;rde ich mich nat&#252;rlich freuen! </P>
<hr>
<a name="charlie.html">
<p><b>Hi Charlie!</B><br>
So ein 17&quot; Monitor ist doch schon was feines - ich habe diesen seit Anfang `99 und will die hohen Aufl&#246;sungen nicht  mehr missen. Auch die PicassoIV ist ein tolles Teil, wenngleich auch etwas teuer.
In Deinem letzten Leserbrief schriebst du, da&#223; Du planst, Dir einen PC samt Amiga Forever zuzulegen. Okay, h&#246;rt sich in der Theorie gar nichtmal so schlecht an. Allerdings kann ich aus Erfahrung sagen, da&#223; dieser Emulator (UAE) in der Praxis nicht immer das gelbe vom Ei ist. Die Geschwindigkeit ist 
zwar mitlerweile recht annehmbar - sofern man einen aktuellen PC hat - aber daf&#252;r hat das Teil noch andere Makken: Das du keine Amiga Disketten benutzen kannst, ist dir hoffentlich klar (liegt am PC Laufwerk). Auch beim Wechseln der CD`s spinnt der UAE rum und ein Neustart ist nach jedem Wechsel von Amiga CD`s n&#246;tig. Du willst OS 3.9 auf dem UAE installieren? Eine automatische Installation klappt nicht - mach alles per Hand und setze die Schutzbit`s anders. Aprospos Schutzbit`s: Wenn Du ab und an mal Probleme mit schreib- oder lesegesch&#252;tzten Dateien hast und das eine oder andere Programm vom 
Aminet den Dienst / Installation verweigert, liegt das an - vom PC nicht gesetzten - Schutzbit`s. Ich will Dir den PC nicht madig machen, aber der &quot;UAE&quot; ist auch nicht die L&#246;sung f&#252;r alles - wundere Dich bitte nicht, wenn nach der ersten Euphorie die Ern&#252;chterrung einsetzt und Du Dir Deinen Original Amiga zur&#252;ckw&#252;nscht, der insbesondere mit vern&#252;nftiger GraKa samt Monitor garantiert mehr Spa&#223; macht, als ein emulierter Amiga auf dem PC.</P>

<p>Bis dann mal!</P>
<hr>
<a name="wolf.html">
<p><b>Gr&#252;&#223; dich, Wolf!</B><br>
Die Versp&#228;tung des Zuges hielt sich im gro&#223;en und ganzen dann doch noch in Grenzen und ich war rechtzeitig auf dem Sportplatz - allerdings musste das Fu&#223;ballspiel nach gut 70 Minuten abgesagt werden, da pl&#246;tzlich die Flutlichtanlange kaputt war. Somit war die Hektik eigentlich &#252;berfl&#252;ssig, auch wenn ich der Meinung bin, eigentlich alles auf der WOA in K&#246;ln gesehen zu haben.</P>

<p>Was den Messeartikel angeht: Wie der Andreas im Vorwort schon sagte, k&#246;nnen zu viele Artikel nie schaden und die verschiedenen Sichtweisen sind sicherlich immer interessant. Aber ich kann es gut verstehen, da&#223; Du Dir nicht noch mehr Stress f&#252;r die NC aufb&#252;rden m&#246;chtest, da Du ja ohnehin schon sehr viel f&#252;r die NC machst. Es freut mich allerdings, da&#223; Dir mein Messebericht gefallen hat. Was den Eternity I angeht: Wie Du weiter oben lesen kannst, bin ich nicht der Fan von Amiga Emulationen, da die bisherigen L&#246;sungen (UAE / Fellow) zwar f&#252;r die Emulation alter Spiele ausreichend sind, aber das Arbeiten mit selbigen doch gewissen Einschr&#228;nkungen unterliegt.</P> 

<p>Zu WW wollte ich auch noch was loswerden: Ich benutze es seit Jahren und m&#246;chte es auch nicht mehr missen, wobei ich die aktuelle Version 7 nicht kenne. Es ist eigentlich sehr schade, da&#223; dieses hervorragende Programm nicht mehr weiterentwickelt wird, aber mit Amiga Writer und Papyrus haben wir ja gleich doppelt adequaten Ersatz im Lager der Textverarbeitungen. Dank der NoCover Guide habe ich auch nochmal Deinen WW Test ausfindig machen k&#246;nnen - im Nachhinein nochmal mein Kompliment zu diesem guten Artikel.</P>

<p>Wie hat Dir eigentlich die letzte Nocover gefallen? Ich finde, da&#223; es einen Tick aufw&#228;rts geht und die NoCover wieder an Qualit&#228;t gewinnt. Dazu habe ich auch noch eine Frage: Sind meine Artikel layouttechnsich zu monoton? Sollte ich in dieser Hinsicht etwas &#228;ndern? Deine Anregung JavaScript betreffend ist zwar ganz reizvoll, aber leider sind da die Amiga Browser noch etwas zu eingeschr&#228;nkt und inkompatibel. F&#252;r kleinere Sachen reicht es zwar bestimmt, aber ich m&#246;chte meine Artikel auch nicht &#252;berladen. Aber wie gesagt: Wenn Du Vorstellungen f&#252;r ein besseres Layout h&#228;ttest, dann sag bitte bescheid.</P> 


<p><h1><center><font color="yellow">Top 5 &amp; Feedback</font></center></h1></P>

<p>1. Wolf Info von Wolf Zimmer<br>
2. Heretic II von Andreas Guldner (das Game hat es Dir wohl angetan, oder?)<br>
3. Webplug von Martin Voepel (ganz sch&#246;n viel Arbeit - sehr interessant)<br>
4. Schillernde Scheiben von Cord Hagen<br>
5. HTML Befehle von Wolf Zimmer</P>

<p>Tja, eigentlich h&#228;tte ich es bei diesen Top 5 belassen k&#246;nnen und damit das Feedback f&#252;r die letzte Ausgabe von meiner Seite beenden k&#246;nnen, aber irgendwie war mir danach zu Mute, noch etwas zu schreiben. So hat mir die letzte Ausgabe wieder etwas besser gefallen als die vorangegangene - man merkt, da&#223; viele bem&#252;ht sind, wieder etwas f&#252;r die NC zu tun, was man nicht zuletzt auch an den drei Diskussionsartikeln sehen kann, die geradezu Resonanz fordern. Es w&#228;re sch&#246;n, wenn dieser positive Trend weiterhin durch die NC ziehen w&#252;rde - selbiges gilt auch f&#252;r die Optik, die der Andreas gerade etwas &#252;berarbeitet hat. Deswegen an dieser Stelle ein kleiner Aufruf von meiner Seite aus: Meine Testberichte sind immer nach einem relativ &#228;hnlichem Muster / Layout aufgebaut und dabei nicht unbedingt immer ansprechend. F&#252;r Tipps &amp; Hinweise, wie ich meine Artikel attraktiver gestalten k&#246;nnte, w&#228;re ich sehr dankbar. Ach ja: Falls noch jemand Gif Animationen oder &#228;hnluches f&#252;r HTML Dokumente zu Hause rumfliegen hat, w&#252;rde ich 
mich freuen, wenn er diese an meine E-Mail Addy kilianservais@gmx.de schicken w&#252;rde. Bleibt zu hoffen, da&#223; auch die n&#228;chsten Ausgaben wieder m&#246;glichst interessant werden. </P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
