<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Flatrate bei T-Online</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#000080" bgcolor="#808080">
<table width=100% border=0 cellpadding=8><tr><td>
<center><font color="#000080" size="7"><b>Flatrate</b></font><br>
<font size=+1>Einstellung durch T-Online</font></center></p>

<p>Dieser Artikel wurde am 15.Febr.01, sp&auml;tabends geschrieben und kann morgen
schon veraltet sein. Und erst recht, wenn er jetzt gelesen wird. Trotzdem
m&ouml;chte ich ein paar Gedanken schriftlich niederlegen. </p>

<p>Heute Mittag hat T-Online
die Details zu den neuen Tarifen und zur Einstellung bekannt geben.

<blockquote><font color="#006000">
<p>Die Vermarktung des Tarifs T-Online flat endet mit der Einf&uuml;hrung der
neuen Tarife zum 1. M&auml;rz 2001. Neuanmeldungen sind ab diesem Zeitpunkt
nicht mehr m&ouml;glich. Die DSL-Flat, T-Online eco und T-Online by call
bleiben weiter bestehen.</p>

<p>Neu eingef&uuml;hrt werden verschiedene Stundenpakete und Tarife mit
Grundgeb&uuml;hr. Hier die neuen Tarife im Einzelnen:<ul>

<li> Der <b>Tarif T-Online by day</b> steht f&uuml;r die monatliche
Grundgeb&uuml;hr von 14,90 DM zur Verf&uuml;gung. Die Nutzer k&ouml;nnen
wochentags in der Zeit von 7 bis 17 Uhr f&uuml;r 1,6 Pfennige pro Minute
surfen. In der restlichen Zeit werden 2,9 Pf pro Minute berechnet.</li>

<li> <b>T-Online by night</b> bietet f&uuml;r die monatliche Grundgeb&uuml;hr
von 9,90 DM in der Zeit zwischen 23 und 9 Uhr surfen f&uuml;r 1,6 Pfennige
pro Minute. Au&szlig;erhalb dieser Zeitfenster f&auml;llt auch hier ein
Nutzungsentgelt von 2,9 Pfennigen pro Minute an. </li></ul>

Zudem f&uuml;hrt T-Online mehrere Budget-Tarife ein: <ul>
<li> <b>T-Online surftime 30</b> beinhaltet 30 Online-Stunden f&uuml;r
29,00 DM monatlich, </li>

<li> <b>T-Online surftime 60</b> erm&ouml;glicht 60 Stunden surfen f&uuml;r 55,00
DM. </li>

<li> <b>T-Online surftime 90</b> kostet inklusive 90 Online-Stunden monatlich
79,00 DM Grundgeb&uuml;hr. </li>

<li> <b>T-Online surftime 120</b> inklusive 120 Online-Stunden 99,00 DM.
</li></ul>

Bei einer Nutzung der Tarife &uuml;ber das vereinbarte Zeitkontingent
hinaus kostet die Online-Minute bei allen Budget-Tarifen 2,9 Pfennige.
Nicht genutzte Stunden k&ouml;nnen nicht in den Folgemonat &uuml;bertragen
werden.
</font></p>
</blockquote>

Der erste Gedanke: <ul><strong>
<li> Eine Sauerei hoch 3 !!!  </li>
<li> Ist das Mittelalter wieder angebrochen? </li>
<li> Ist es nun Zeit endlich einen anderen Provider zu suchen? </li></ul></strong>
Und was sagt T-Online zu der Frage: Was passiert mit Bestandskunden? <br>
Antwort am 15.02.2001 14:14 (Auszug):

<blockquote><font color="#006000">

<p>T-Online flat werden ihren Vertrag bis zum Ende der Vertragslaufzeit nutzen
k&ouml;nnen. </p>

<p>Zur Vertragslaufzeit: Sofern man sich <b>vor</b> dem 11.12.2000 zu "T-Online
flat" angemeldet hatte, gilt f&uuml;r den Vertrag eine einj&auml;hrige
Mindestlaufzeit. Diese Kunden k&ouml;nnen Ihren flat-Tarif dann auf jeden
Fall bis zum Ende dieser Vertragslaufzeit nutzen. Diese Kunden k&ouml;nnen
aber auch unbeachtet der Mindestvertragslaufzeit jederzeit auf einen Tarif
ihrer Wahl wechseln, falls dieser f&uuml;r den Betreffenden attraktiver
erscheint.</p>

<p>Sofern man sich <b>ab</b> dem 11.12.2000 zu "T-Online flat" angemeldet hatte,
unterliegt der Vertrag keiner Mindestvertragslaufzeit. T-Online wird diese
Kunden daher in den n&auml;chsten zwei bis drei Wochen per eMail oder Brief
informieren und mit einem neuen Angebot auf sie zugehen. Diese Kunden haben
auch die M&ouml;glichkeit sich ab dem 22.02.2001 auf der Website von
T-Online einen der neuen Tarife auszuw&auml;hlen.
</font></p>
</blockquote>

T-Online hat eine nicht nachvollziehbare Stellungnahme zur
Einstellung der Flatrate ver&ouml;ffentlicht. So hei&szlig;t es unter anderem:

<blockquote><font color="#006000">
Bislang hatte nur ein kleiner Teil unserer Kunden einen wirklichen Vorteil
durch den Tarif T-Online flat. Denn nur die wenigsten Nutzer sind
l&auml;nger als 90 Stunden pro Monat im Netz wie Marktanalysen ergeben
haben.
</font>
</blockquote>

Weiter hei&szlig;t es:

<blockquote><font color="#006000">
Eine Minderheit von Nutzern hat ihren Internetzugang als Standleitung
genutzt und haben dadurch das Netz f&uuml;r andere Nutzer blockiert. Dies
ist nicht im Interesse der Mehrheit der Nutzer und damit auch nicht im
Interesse T-Onlines. Das Dauereinloggen f&uuml;hrt zu
Netz&uuml;berlastungen, wodurch andere Nutzer nur mit Schwierigkeiten ins
Netz kommen, weil einige wenige Dauersurfer die Leitungen blockieren.
</font>
</blockquote>

Das ist meines Erachtens ein Scheinargument. Dass es User gibt, die den
Pauschaltarif wirklich pauschal nutzen, war vorher absehbar. Au&szlig;erdem
trifft diese von T-Online genannte Problem ja auch genauso auf DSL-Nutzer
zu, die Ihre Flatrate behalten d&uuml;rfen.

<blockquote><font color="#006000">
Durch die neue Tarifstruktur wird sicher auch mehr Gerechtigkeit bei
den Internettarifen hergestellt: Ohne die individuell gestalteten
Tarifangebote hat die gro&szlig;e Mehrheit der Nutzer die Dauersurfer
subventioniert. Die neue Tarifmodelle sind Zeugnis daf&uuml;r, dass in
Zukunft ein gr&ouml;&szlig;erer Teil der Nutzer als bisher von den
gesunkenen Onlinekosten profitieren kann. Auch sollte man
ber&uuml;cksichtigen, dass ganz allgemein die Sicherstellung der
Rentabilit&auml;t eines Unternehmens auch im Interesse seiner Kunden liegt:
Auch im Internetbereich macht es nur die Ber&uuml;cksichtigung der
&ouml;konomischen Realit&auml;ten m&ouml;glich, langfristig die
Qualit&auml;t im Internet sicherzustellen.
</font>
</blockquote>

Mehr Gerechtigtkeit? Wo? Als ISDN-Nutzer, der schon seit Monaten auf DSL
wartet und dessen Termin sich immer wieder verschiebt, darf nun pro Minute
bezahlen w&auml;hrend die DSL-Nutzer f&uuml;r 49 DM pauschal ins Netz
k&ouml;nnen. Was bitte sch&ouml;n ist daran gerecht? Rein technisch
erzeugen DSL-Nutzer ja sogar h&ouml;here Kosten, da sie auch mehr Traffic
erzeugen. Au&szlig;erdem sind auch die neuen Tarife nicht so wirklich
gerecht wenn man den Markt betrachtet. Andere Anbieter k&ouml;nnen nicht
ohne Verlust 120 Stunden f&uuml;r 100 DM anbieten. Sie machen Verlust.
T-Online kann hier durch die direkte Verbindung mit der Telekom als
einziger Anbieter die Gro&szlig;handelsflatrate der Telekom sinnvoll
nutzen. Das ist wieder nicht gerecht.</p>

<p>Die Regierung und die RegTP sollte endlich daf&uuml;r sorgen, dass es
bezahlbare Flatrate f&uuml;r alle von mehreren Anbietern gibt. Das ist
aber Wunschdenken. Es ist es doch verst&auml;ndlich die Flat einzustellen, um
der RegTP doch noch ein auszuwischen. Denn wenn ich mich richtig erinnere,
wollte diese eine bezahlbare Gro&szlig;handelsflat zum M&auml;rz 2001 einf&uuml;hren?
Daraus wird wohl nichts mehr werden. Denn T-Online kann die unprofitable
Flat einstellen und die Telekom braucht sich keine Gedanken um die
Durchleitungsgeb&uuml;hren f&uuml;r dritte mehr machen. Und ganz nebenbei wird das
n&auml;chste Monopol aufgebaut. Da kann ich nur sagen Respekt. Aber das sch&ouml;nste
an der Sache ist, das alles zum Wohle der Allgemeinheit ist. Fraglich ist
nur, wer die Allgemeinheit ist.<br> Aber noch gibt es DSL f&uuml;r 49DM, die
Frage ist aber wie lange noch....</p>

<p>Was war das wohl heute abend in N-TV f&uuml;r eine Meldung? <br>
<big><b>Aktie von T-Online steigt deutlich</b></big>

<br>
W&auml;hrend der gro&szlig;e Teil der User sehr w&uuml;tend und
entt&auml;uscht auf die Einstellung der Flatrate reagiert, scheint der
Aktienmarkt sehr zufrieden damit zu sein.
Der Kurs der T-Aktie stieg seit gestern 11,37% auf 13,03 Euro. Wenn man
sich den Kursverlauf auf der Seite von T-Online ansieht, erkennt
man sehr deutlich, dass der Kurs mit dem Bekanntwerden der
Flatrateeinstellung anfing zu steigen. </p>

<p>Das soll zur Einstellung der Flatrate jetzt reichen. Und zum Schluss noch ein
kleines Kuckucksei, das sich die Telekom wohl unbeabsichtigt selbst ins eigene
Nest gelegt hat. </p>

<p><b>Ostdeutschland: Glasfasertechnologie verhindert T-DSL-Anschl&uuml;sse</b><br>

Die von der Telekom als Zukunftstechnologie gepriesenen
OPAL-Glasfaserleitungen im Osten Deutschlands behindern jetzt das
Einrichten neuer T-DSL-Anschl&uuml;sse, berichtet TELEPOLIS, das Magazin
der Netzkultur. </p>

<p>OPAL steht f&uuml;r optische Anschlussleitung. Mitte 1990 startete die
damalige Post in K&ouml;ln mit 192 Haushalten ein OPAL-Pilotprojekt. Ziel
dieses sehr kostenaufwendigen Experiments war eine Serienproduktion der
Glasfaserleitungen zu Preisen vergleichbarer Kupfersysteme. Denn die
Glasfasertechnologie hat gegen&uuml;ber dem Kupferkabel zwei entscheidende
Vorteile: hohe Bandbreite und geringe &Uuml;bertragungsverluste.
Au&szlig;erdem ist sie relativ unempfindlich gegen elektromagnetische
St&ouml;rungen, die durch technische Ger&auml;te, Gewitter oder Sender
ausgel&ouml;st werden k&ouml;nnen. </p>

<p>Die OPAL-Technik wurde in Ostdeutschland vornehmlich eingesetzt, um
Stadtteile zu versorgen, in denen es vorher keine oder nur wenige
Telefonanschl&uuml;sse gab. Erst 1995 wurde OPAL auch in Westdeutschland in
gr&ouml;&szlig;erem Ausma&szlig; verlegt. Im Telekom-Netz sind derzeit rund
zwei Millionen Anschl&uuml;sse mit optischen Zugangsnetzsystemen
vorhanden. </p>

<p>Die fortschrittliche Technologie offenbart jetzt jedoch ihre Kehrseite:
Schnelle Internetzug&auml;nge sind f&uuml;r Haushalte mit
Glasfaseranschluss nicht m&ouml;glich, da T-DSL auf Kupferkabel angewiesen
ist. Technisch w&uuml;rden sich mehrere Alternativen f&uuml;r das Angebot
eines schnellen Internetzugangs f&uuml;r Haushalte mit Glasfaseranschluss
anbieten. So ist beispielsweise VDSL (Very High Data Rate Digital
Subscriber Line = Digitaler Teilnehmeranschluss mit sehr hoher Datenrate)
eine der vielversprechendsten in Glasfasergebieten einsetzbaren
Technologien. Mit VDSL lie&szlig;e sich die &Uuml;bertragungsrate erheblich
steigern. Die Telekom bietet diese Technologie jedoch noch nicht an. Und so
m&uuml;ssen sich viele ostdeutsche Surfer auch in Zukunft in Geduld
&uuml;ben. Denn wann Glasfaserhaushalte in den Genuss schneller
Internetzug&auml;nge kommen, ist noch v&ouml;llig offen. </p>

</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#88ccff">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#88ccff">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#88ccff">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
