<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Quecksilber in der Luft</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#000080" bgcolor="#808080">
<a name="top"></a><br>
<table width=100% border=0 cellpadding=8><tr><td align=center>
<font color="#000080" size="7"><b>Luftverschmutzung</b></font></dt></tr>
<tr><td> 
<p><img src="st_luftv1.jpg" width="160" height="161" align="left">Die
Polregionen der Erde sind die letzten gro&szlig;fl&auml;chigen
&quot;Reinraumgebiete&quot; unserer Erde. Dennoch lassen sich giftige und
langlebige Substanzen in Luft- und Schneeproben der Arktis und Antarktis
als Spuren des menschlichen Handelns nachweisen. Aus den stark
industrialisierten, gem&auml;&szlig;igten Breiten werden diese Schadstoffe
vornehmlich &uuml;ber den Luftpfad herantransportiert und reichern sich
dann an den K&auml;ltepunkten unserer Erde an. </p>

<p>Forschern des GKSS-Forschungszentrums Geesthacht GmbH gelang es jetzt
erstmalig, sogenannte &quot;atmosph&auml;rische
Quecksilbereinbr&uuml;che&quot; in der Antarktis nachzuweisen. Dieses vor
kurzem erst in der kanadischen Arktis beobachtete Ph&auml;nomen f&uuml;hrt
vermutlich zu einem verst&auml;rkten Eintrag von Quecksilber aus der
Atmosph&auml;re in die polaren &Ouml;kosysteme. In Zusammenarbeit mit dem
Alfred-Wegener-Institut f&uuml;r Polar- und Meeresforschung (AWI) sowie der
Universit&auml;t Jena konnte gezeigt werden, dass kurz nach Beginn des
antarktischen Fr&uuml;hlings die Konzentration des Quecksilbers in der Luft
deutlich unter den Jahresmittelwert, bis an die Nachweisgrenze der
Messmethode, absinkt. </p>

<p>Es wird angenommen, dass &uuml;ber eine Kette von
atmosph&auml;renchemischen Reaktionen das gasf&ouml;rmige Quecksilber aus
der Luft entfernt und in die darunter liegenden Schnee,- Eis- und
Meeresoberfl&auml;chen eingetragen wird. Da dieser Vorgang mit der
Intensit&auml;t der Sonneneinstrahlung gekoppelt ist, sind verst&auml;rkte
Quecksilbereintr&auml;ge insbesondere in der sensiblen Periode des
antarktischen Fr&uuml;hlings zu erwarten, wenn das &Ouml;kosystem nach der
langen Polarnacht wieder erwacht. Nach der Deposition kann das Quecksilber
in die Nahrungskette gelangen, wo es sich stark anreichert und in das
hochgiftige Methylquecksilber umgewandelt wird. </p>

<p>Die GKSS-Forscher haben im Januar 2000, also im antarktischen Sommer,
Messger&auml;te an der deutschen Forschungsstation Neumayer installiert.
Das Messprogramm steht jetzt kurz vor dem Abschluss, und der erste, in der
Antarktis gemessene, Jahresgang der atmosph&auml;rischen
Quecksilberkonzentrationen liegt den Geesthachter Analytikern im Institut
f&uuml;r K&uuml;stenforschung vor. Eine erste, vorsichtige Absch&auml;tzung
ergibt, dass im Zeitraum von Mitte August bis Mitte November etwa 40 Tonnen
Quecksilber aus der Atmosph&auml;re in das Gebiet der Antarktis eingetragen
werden. </p>

<p>Eine Erkl&auml;rung f&uuml;r dieses bislang nur in der Arktis
beobachtete Ph&auml;nomen k&ouml;nnte sein, dass Chlor- und Brom-Atome an
chemischen Reaktionen mit bodennahem Ozon beteiligt sind und die daraus
entstehenden Bromoxid-Molek&uuml;le mit dem Quecksilber in der Luft
reagieren, so dass dieses in eine weniger fl&uuml;chtige und besser
deponierbare Form &uuml;berf&uuml;hrt wird. In den Anrainerstaaten der
Arktis haben &auml;hnliche Ergebnisse dazu gef&uuml;hrt, dass in einer
internationalen Kooperation Messstellen f&uuml;r atmosph&auml;risches
Quecksilber n&ouml;rdlich des Polarkreises in Kanada, Alaska, Norwegen und
in K&uuml;rze auch Russland eingerichtet werden bzw. wurden. </p>

<p>Die Antarktisstation Neumayer wird vom Alfred-Wegener-Institut f&uuml;r
Polar- und Meeresforschung ganzj&auml;hrig betrieben und ist hinsichtlich
ihrer technischen Infrastruktur und des etablierten Messprogramms zur Zeit
wohl die bedeutendste Beobachtungsplattform f&uuml;r luftchemische
Untersuchungen in der Antarktis. In diesen Wochen wird dort der Abschluss
der GKSS-Quecksilbermessungen vorbereitet. In Zusammenarbeit mit der
Universit&auml;t Jena werden weitere luftchemische Untersuchungen
durchgef&uuml;hrt, die auch Messungen an Bord des Polarflugzeugs POLAR 4
des AWI beinhalten, um so erstmalig Informationen &uuml;ber die vertikale
und horizontale Verteilung des Quecksilbers in der Antarktis zu erhalten.
</p>

<p><font size="2">(Quelle: Informationsdienst Wissenschaft (idw)
-Pressemitteilung GKSS-Forschungszentrum Geesthacht GmbH, 08.02.2001; Bild:
NOAA) </font></p>
          
</td></tr></table>
<hr>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#88ccff">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#88ccff">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#88ccff">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
