<html>
<head>
<!-- author = "Wolf Zimmer"   -->
 <script language="JavaScript"><!--

  if (navigator.appVersion.indexOf("2.") != -1){
         check = false;
         }
  if ((navigator.appVersion.indexOf("3.") != -1) && (navigator.appName.indexOf("Explorer") != -1)){
         check = false;
         }
  else {
         check = true;
         }
  if (check == true){
         image1 = new Image();
         image1.src = "st_wolfinfo.jpg";
         image1on = new Image();
         image1on.src = "st_wolfinfo1.jpg";
         image1stay = new Image();
         image1stay.src = "st_wolfinfo1.jpg";
  }

  imageStay = ""

  function imageon(name){
         if (imageStay != name){
                 document[name].src = eval(name + "on.src");
         }
  }

  function imageoff(name){
         if (imageStay != name){
                 document[name].src = eval(name + ".src");
         }
  }

  function on(name){
         if (check == true){
                 imageon(name);
         }
  }

  function off(name){
         if (check == true){
                 imageoff(name);
         }
  }

  function stay(name){
         if (check == true){
         document[name].src = eval(name + "stay.src");
         if (imageStay != name){

                 if (imageStay != ""){
                          document[imageStay].src = eval(imageStay + ".src");
                 }
         }
         imageStay = name
         }
  }
// -->
  </script>
<title>Wolf-INFO</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5">
<tr><td>
<a href="mitglieder/zimmer.html"
     onmouseover="on('image1');window.status='zur Mitgliederliste'; return true;"
     onmouseout="off('image1');window.status=''; return true;"
     onclick="stay('image1');">
<img name="image1" src="st_wolfinfo.jpg" width=95 height=95 border=0
alt="mein Logo - mein Foto" align=left></a></td>
<td valign=top><ul><font color=blue><b>I N H A L T </font></b>
<li> <a href="#a1"> Digitalkameras </a></li>
<li> <a href="#a2"> Entenschreck </a></li>
<li> <a href="#a3"> Mediennachrichten </a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>

<p align=center><a name="a1"><b><font color="800000" size="5">
Test von Digitalkameras </font></b></a></p>

<p>In der NoCover-80 hatte "Charly" Bader einen Bericht &uuml;ber digitale
Fotografie gebracht und auch sein genutztes Modell kurz vorgestellt. Es gab
nur ein verhaltenes Echo und aus diesem Grunde hat Karl-Heinz wohl seine
weiteren Erfolge und Misserfolge f&uuml;r sich behalten. Im Onlinemagazin
Tomorrow 04/2001 sind f&uuml;nf Digicams unter 1000,- DM
profim&auml;&szlig;ig getestet und beschrieben worden. Ob hierf&uuml;r nun
Interesse besteht oder nicht, f&uuml;r den einen, der interessiert ist und
das Heft nicht gekauft hat, f&uuml;r den bringe ich hier eine Kurzfassung.
</p>

<blockquote><i><font color="#006000">
<p>Digitalkameras sind im Trend, denn sie bieten einige Vorteile
gegen&uuml;ber ihren analogen Vorg&auml;ngern: Die Bilder liegen in
digitaler Qualit&auml;t vor und eine umst&auml;ndliche Filmentwicklung
entf&auml;llt. Auch das Nachbestellen von Bildern geh&ouml;rt bei Digicams
der Vergangenheit an, denn Sie k&ouml;nnen Digitalbilder selbst am Computer
beliebig oft kopieren - und zwar ohne Qualit&auml;tseinbu&szlig;en. </p>

<p>TOMORROW hat f&uuml;r Sie durch die Linse g&uuml;nstiger Digitalkameras
geschaut und f&uuml;nf Einsteigermodelle getestet. </p></i></font>
</blockquote>

<p><b>Hier die Testergebnisse:</b><br>
<table border=0>
<tr><td>1. FinePix 1400 von Fuji </td><dt>999,- DM</td><td></td>gut</tr>
<tr><td>2. RDC-6000 von Ricoh </td><dt>899,- DM</td><td></td>gut</tr>
<tr><td>3. DC215 Zoom von Kodak </td><dt>699,- DM</td><td></td>befriedigend</tr>
<tr><td>4. ePhoto CL20 von Agfa </td><dt>399,- DM</td><td></td>ausreichend</tr>
<tr><td>5. EZ 200 von Kodak </td><dt>299,- DM</td><td></td>ausreichend</tr></table

</p>

<p><img src="st_wolfinfo2a.jpg" width=100 heigth=62 hspace=6 align=left
alt="Fuji FinePix 1400">
Fuji FinePix 1400 ("http://www.fuji.de") Komfortable, einfache Bedienung.
Kein Extra-LCD f&uuml;r Statusanzeigen, die zeigt nur der Monitor.
Gro&szlig;es Plus: der optische Dreifach-Zoom, der sich sogar f&uuml;r
Portr&auml;taufnahmen eignet. Die Belichtungssteuerung ist ausreichend. An
der Fuji gefallen die klaren, lebendigen Farben. Die Aufl&ouml;sung von 1,3
Megapixeln gen&uuml;gt f&uuml;r Fotos bis zum Format 13 x 18 cm. Hier
stimmt fast alles. Das richtige Ger&auml;t f&uuml;r den Allround-Einsatz.
</p>

<p><img src="st_wolfinfo2b.jpg" width=100 heigth=62 hspace=6 align=left
alt="Ricoh RDC-6000">
Ricoh RDC-6000 ("http://www.ricoh.de") Fotokenner kommen schnell zurecht,
Einsteiger m&uuml;ssen die vielen Funktionen erst kennen lernen. Recht
flexibel dank einstellbarer Lichtempfindlichkeit und verschiedener
Belichtungsfunktionen. Sehr schade, dass es kein Zoom gibt. Die
Farbwiedergabe wirkt manchmal etwas k&uuml;hl. Dank der Aufl&ouml;sung von
zwei Megapixeln ergeben sich aber detailreiche Bilder. Eine preiswerte,
gute Kamera f&uuml;r den ehrgeizigen Hobbyfotografen. </p>

<p><img src="st_wolfinfo2c.jpg" width=100 heigth=62 hspace=6 align=left
alt="Kodak DC215 Zoom">
Kodak DC215 Zoom ("http://www.kodak.de") Das solide, edle Geh&auml;use ist
sehr griffig. Auch die grafischen Men&uuml;s sind gelungen und
&uuml;bersichtlich. Die z. Z. g&uuml;nstigste Kamera mit optischem Zoom.
Die wichtigsten Funktionen sind vorhanden: Blitz, Makromodus,
Belichtungskorrektur. Mit einer Million Pixeln zeigen die Fotoergebnisse
der Kodak schon viele Details. Ebenfalls gut: die ausgewogene
Farbwiedergabe. Ideales Einsteigermodell, der absolute Geheimtipp f&uuml;r
Sparf&uuml;chse. </p>

<p><img src="st_wolfinfo2d.jpg" width=100 heigth=62 hspace=6 align=left
alt="Agfa ePhoto CL20">
Agfa ePhoto CL20 ("http://www.agfa.de") Mit ihren wenigen Funktionen
einfach zu bedienen. Griffig. Auf den Farbmonitor wurde verzichtet. Nur ein
MB interner Speicher, aber Steckplatz f&uuml;r Speicherkarten. Der
eingebaute Blitz erweitert das Einsatzspektrum. Kein Zoom. Der leichte
Magenta-Stich st&ouml;rt bei Portr&auml;ts. Die 800000-Pixel-Aufl&ouml;sung
liefert dennoch insgesamt gute Fotoergebnisse. Ordentliche Fotos f&uuml;r
kleines Geld. Auch als Webcam einsetzbar. </p>

<p><img src="st_wolfinfo2e.jpg" width=100 heigth=62 hspace=6 align=left
alt="Kodak EZ 200">
Kodak EZ 200 ("http://www.kodak.de") Handbuch lesen und losknipsen. Mit den
wenigen Funktionen kommt jeder klar. Kein Monitor. Liefert Fotos,
Serienbilder und kleine Videoclips. Blitz und Zoom: Fehlanzeige. Keine
Erweiterung des 4-MB-Speichers m&ouml;glich. Die 300000 Pixel an der
kleinen Kodak liefern nat&uuml;rlich nur wenige Bilddetails. Erstaunlich
gut ist dagegen die Farbwiedergabe. F&uuml;r Schnappsch&uuml;sse und als
Webcam durchaus empfehlenswert. </p>

<p>Quelle: <a href="http://www.tomorrow.de/"> www.tomorrow.de </a></p>

<p>Gehe zum <a href="#top" align=left> Anfang </a>
<hr></p>

<p align=center><a name="a2">
<b><font color="800000" size="5"> Entenschreck </font></b></a></p>

<p>Es gibt so viele sch&ouml;ne Seiten im Netz, aber auch Katastrophen.
Diese geh&ouml;rt entschieden zu dieser Kategorie. Auf der Suche nach
originellen Javascripts, von denen man etwas lernen k&ouml;nnte,
stie&szlig; ich auf die Website namens www.entenschreck.de und dachte
gleich an etwas Lustiges oder etwas Persiflagenm&auml;&szlig;iges. Weit
gefehlt. Nicht nur dass das Javasript auf einer Unternehmerseite
gespeichert ist und von dort abgerufen wird um die Werbebanner zu steuern,
diese Seite will tats&auml;chlich eine ernsthafte Seite sein. </p>

<blockquote><i><font color="#006000">
&Uuml;ber  die Jagd selber gibt es im Internet nur wenige Anbieterseiten,
ich m&ouml;chte hier keine Verherrlichung der Jagd betreiben vielmehr
m&ouml;chte ich aufzeigen, wie sich ein "waidgerechter" J&auml;ger in der
heutigen Zeit auf der Jagd verh&auml;lt. Ich m&ouml;chte auf dieser
Homepage meine Erfahrungen &uuml;ber die Jagd, jedem Interessenten
zug&auml;nglich machen. <br>Ich biete auf &uuml;ber 100 Seiten
Jagderlebnisse, Tipps zum Sch&uuml;sseltreiben, Verhalten auf und
w&auml;hrend der Jagd und vieles mehr.<br>In meinen Berichten &uuml;ber
meine Jagderlebnisse, werden Personen genannt, f&uuml;r die ich mich
verb&uuml;rge, denn es sind waidgerechte J&auml;ger. (siehe auch Anmerkung
zur Waidgerechtigkeit)
</font></i>
</blockquote>

<p>Dann kommt besagter Artikel &uuml;ber die Waidgerechtigkeit und ein
Pfeil, der auf die Folgeseite verweist. Dies ist der Index zu allen
Artikeln in Unterseiten. Gesteuert wird alles &uuml;ber Schaltfl&auml;chen
und kleine Bilder. <br>
<img src="st_wolfinfo3b.jpg" width=200 heigth=150 hspace=6 align=left
alt="Entenseite mit Namen">
<center>
<img src="st_wolfinfo3.gif" width=334 heigth=94 alt="Titelbild"><br>
<font size=-1>Das ist der Titel in 50% Verkleinerung </font><br></center>
So wie links sieht ein Ausschnitt des zweiten Bildschirms aus, wenn die
Seite komplett geladen ist.........
<br clear=all></p>

<p><img src="st_wolfinfo3a.jpg" width=200 heigth=150 hspace=6 align=left
alt="Entenseite ohne Namen">
und so, wenn beim Laden auf das Anzeigen von Bilder und Images verzichtet
wird. Das ist das typische Ergebnis, wenn man eine Website mittels
"Microsoft Publisher 2000" aufbaut und wenig Ahnung vom konkreten Handling
des Programmes hat. Aus diesem Grunde sollte man nie den Klarnamen unter
der Bezeichnung &raquo;ALT=&quot;Name des Bildes&quot;&laquo; vergessen.
<br clear=all></p>

<p>Dies ist wieder einmal ein feines Beispiel, wie man es wirklich nicht
machen sollte. Erstens sind die Ladezeiten katastrophal lang (42 Bilder
f&uuml;r eine Seite) und zweitens hatte ich &uuml;berhaupt keine Lust mehr,
nur wenigstens eine Schaltfl&auml;che zu bet&auml;tigen, um noch tiefer
einzusteigen. Gem&auml;&szlig; der Schaltfl&auml;chen geht es zu
Jagderlebnissen, J&auml;gerlateinsammlungen, J&auml;gerlieder,
wahrscheinlich auch zu vielen Fotos von Jagdbeuten und -strecken. Was das
mit dem Titel der Homepage zu tun hat? Wer schlau ist, meidet diese
Website. </p>

<p>Quelle: <a href="http://www.entenschreck.de/"> www.entenschreck.de </a></p>

<p>Gehe zum <a href="#top" align=left> Anfang </a>
<hr></p>

<p align=center><a name="a3">
<b><font color="800000" size="5"> Mediennachrichten</font></b></a></p>

<p><b>Compuserve schlie&szlig;t alle Foren in Deutschland </b><br>

<b>AOL</b> will allen deutschen Compuserve-Forenbetreibern bis zum 30.
April dieses Jahres k&uuml;ndigen. Bereits Anfang 2000 wurden von den 50
deutschen Compuserve-Themen-Foren alle bis auf zw&ouml;lf geschlossen. Dies
sollte den Traffic in den zw&ouml;lf verbleibenden steigern.
Schlie&szlig;lich wurden im Sommer 2000 die Foren der Allgemeinheit
ge&ouml;ffnet, so dass schlie&szlig;lich jeder dort mitschreiben konnte.
Der erhoffte Erfolg blieb in Deutschland dennoch aus. Compuserve war einst
eine jener Providerfirmen, die der Allgemeinheit den Weg ins Netz
&ouml;ffnete. Daf&uuml;r verlangte das Unternehmen stolze Preise, die ab
1995 aufgrund der zunehmenden Konkurrenz sanken. </p>

<p><b>Das gro&szlig;e Sterben der B2B-Marktpl&auml;tze</b><br>

Die meisten Business-to-Business (B2B)-Internetmarktpl&auml;tze haben nur
eine geringe &Uuml;berlebenschance. W&auml;hrend es bis 2003 zu weit mehr
Neugr&uuml;ndungen als Konkursen kommt, wird die Zahl der
B2B-Marktpl&auml;tze ab 2005 drastisch sinken. &quot;Die prognostizierten
milliardenschweren Ums&auml;tze im Internethandel hat einer
Gr&uuml;nderwelle von B2B-Marktpl&auml;tzen ausgel&ouml;st. Die Folge ist
eine nicht tragf&auml;hige Anbieterdichte&quot;, so die Aussage eines
Insiders. Die Gr&uuml;nde f&uuml;r das sich abzeichnende Debakel: eine
&Uuml;bers&auml;ttigung des Marktes, zu wenig Kapital auf Anbieterseite,
mangelnder Kundenservice, schlechte Ausnutzung der technischen
M&ouml;glichkeiten und zu geringe Kenntnisse &uuml;ber den Zielmarkt. </p>

<p>Quelle: <a href="http://www.gerline2000.de/"> GerLine Multimedia GmbH </a></p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a4"><font color="800000" size="5">
<b>Feedback </font></b></a></p>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir <b>nur
einmal</b>, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul> Aus NoCover
<li><b>Hell Squad </b> von Kilian Servais</li>
<li><b>Mas Player </b> von Sascha van Wahnem</li>
<li><b>Morin </b> von Thomas Weber</li>
<li><b>Schillernde Scheiben </b> von Cord Hagen</li>
<li><b>Webplug 3+4 </b> von Martin Voepel </li>
</ul>
<ul> Aus Amiga Aktuell
<li><b>Abschlie&szlig;end </b> von Carsten Schr&ouml;der</li>
<li><b>Amiga OS3.9</b> von Achim Stegemann</li>
<li><b>Geoworld </b> von Dietmar Bertelsbeck</li>
<li><b>Installationstipps </b> von Thomas Graf</li>
<li><b>Kleine Helfer </b> von Christian Aichinger</li>
</ul>

<hr size=4>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
