<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>OS 3.9 - Der Nachtrag</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">OS 3.9 - Der Nachtrag</font></center></h1></P>

<p>In der NC82 hatte ich so eine Art Testbericht &#252;ber OS 3.9 geschrieben. Da ich damals aber erst seit einigen Wochen mit OS 3.9 gearbeitet hatte, konnte ich nur recht rudiment&#228;re Praxiserfahrungen in den Test einflie&#223;en lassen. Mit diesem Nachtrag m&#246;chte ich gerne nochmal das Thema OS 3.9 aufgreifen - wenn auch nur ganz kurz, denn alles wichtige, hatte ich ja bereits in dem Testbericht gesagt!</P>

<p>Eines vorweg: Nachdem ich OS 3.9 nun seit der Messe in K&#246;ln einsetze (also ca. 3 Monate), kann ich nur zu dem Resultat kommen, da&#223; sich der Kauf gelohnt hat. Mein Amiga System mit Picasso96 Software ist mitlerweile derma&#223;en stabil, da&#223; Abst&#252;rze bei der t&#228;glichen Arbeit &#252;berhaupt nicht mehr zu verzeichnen sind - und das ohne auf Patches und den daraus resultierenden Komfort zu verzichten. MCP verrichtet seine Arbeit nach wie vor ganz hervorragend und arbeitet super mit OS 3.9 zusammen. Auch bei anderen Tools sind mir bisher keine Inkompatibilit&#228;ten aufgefallen, wobei das nat&#252;rlich auch f&#252;r so ziemlich jede Anwendung gilt, die man so installiert hat. Auch bei &#252;berlappenden Anwendungen - bei mir l&#228;uft z.B. recht h&#228;ufig der WWW Browser (offline) zusammen mit diversen Editoren, Textverarbeitung, Song Player und diversen anderen Dingen. Diese St&#228;rke des AmigaOS ist nat&#252;rlich auch bei OS 3.9 noch dabei.</P>

<p>Aber nicht nur die Stabilit&#228;t ist gestiegen, auch der Komfort: So m&#246;chte ich tats&#228;chlich das &quot;Ami Dock&quot; nicht mehr missen - vielleicht, weil es so einfach zu bedienen ist, vielleicht, weil es so speicherschonend ist oder vielleicht auch weil es auf der WB optisch einiges hermacht. F&#252;r das Ami Dock lassen sich z.B. eigene Texturen benutzen, wenngleich die mitgelieferten auch nicht schlecht sind. Verschiedene Texturen f&#252;r veschiedene Dock`s sind nat&#252;rlich auch realisierbar. Aprospos Optik: Wenn man das eigene OS 3.9 mit Birdie, MCP &amp; Visual Prefs ein wenig aufm&#246;belt, sollte man es ruhig auch mal 
einigen PC Usern pr&#228;sentieren. Die sind teilweise echt erstaunt, um wie viel besser so ein Amiga mit OS 3.9 im Vergleich zu einem Standard Windows PC aussieht. Versucht es ruhig mal: Es lohnt sich!</P>

<p>N&#228;chster Punkt: Die beigeleget Software! In vielen Foren sowie in der letzten AmigaAktuell wurde das AmigaOS 3.9 zu einer Sharewaresammlung degradiert - das muss man de facto verneinen, da auch intern einiges ver&#228;ndert wurde, wenngleich es H&amp;P nat&#252;rlich nicht schaffen konnten, mal eben das ganze OS 
in einem so kurzen Zeitraum zu &#252;berarbeiten. Die internen Ver&#228;nderrungen sind auf jeden Fall ok und tragen nicht zuletzt zur h&#246;heren Stabilit&#228;t bei. Und die mitgelieferte Software - wie z.B. AWeb 3.3, Mp3 Player, Action (MooVid) - ist ja beileibe auch nicht schlecht und geh&#246;rt auf jedes System, selbst wenn man schon einen anderen Browser installiert hat. Da sich AWeb recht genau an die HTML Vorgaben h&#228;lt und zudem Java Script beherrscht (Gru&#223; an Wolf, der damit in der letzten Ausgabe einen tollen Tip gegeben hat!), benutze ich ihn immer, um meine Homepage zu testen - f&#252;r alles andere muss immer noch die IBrowse SE Version 1.2 herhalten. Das tolle an Amiga Programmen ist doch nach wie vor, da&#223; man verschiedene Dinge f&#252;r die selbe Aufgabe gleichzeitig benutzen kann und diese nicht so viel Speicherplatz fressen wie adequate vergleichbare Windows Software.</P>

<p>Auch wenn mitlerweile mit &quot;Boing Bag 2&quot; ein Update f&#252;r OS 3.5 erschienen ist, so bin ich doch recht froh dar&#252;ber, OS 3.9 gekauft zu haben. Ich kann jedem Amiga User nur empfehlen, da&#223; gleiche zu tun - immerhin unterst&#252;tzt ihr damit aktiv die Amiga Zukunft und werdet mit h&#246;herem Komfort und einem &#228;u&#223;erst stabilem System belohnt. Was wollt ihr denn mehr?</P>

<p>Ach ja: An einem Boing Bag f&#252;r OS 3.9 wird nat&#252;rlich auch noch gearbeitet - und wenn die WB erstmal komplett Multitasking-f&#228;hig ist, wird jeder PC User wohl vor Neid erblassen und sofort einen Amiga haben wollen. Abschlie&#223;en m&#246;chte ich mit der Feststellung, da&#223; ich mit meinem AmigaOS und der installierten Software wesentlich schneller, effektiver und unkomplizierter arbeiten kann, als mit dem PC. Das f&#228;ngt bei simplen HTML Klamotten an (an der HP bastel ich nur an meinem Amiga rum!), geht &#252;ber Texte schreiben (ja, ich nutze daf&#252;r den OS 3.9 beigelegten Editor &quot;Edit Pad&quot; - kompakt &amp; flink) und endet schlie&#223;lich in aufwendigen &#220;besetzungsarbeiten &amp; mathematischen Problemen f&#252;r die Schule. Only Amiga Makes It Possible...</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
