<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Martin Voepel">
<TITLE>Workshop ScreenShots</TITLE>
</HEAD>
<BODY BACKGROUND="bp_ring.png" BGCOLOR="#FAEBD7" TEXT="#000000" LINK="#000000" ALINK="#000000" VLINK="#000000">
<!-- ScreenShot -->
    <TABLE WIDTH="100%">
      <TR>
        <TD WIDTH="50"></TD>
        <TD>
    <H1>Kleiner Workshop, wie erstelle ich ScreenShot's</H1>
    <BR>
    <HR>
    Vorweg: Mir ist aufgefallen, dass sich wohl einige mit ScreenShot's recht schwer tun und nun m&ouml;chte ich kurz erkl&auml;ren wie <B>ich</B> es mache!<BR>
    Es gibt sicher noch andere m&ouml;glichkeiten, aber dieser Weg den ich gleich aufzeige hat sich als recht gut heraus gestellt.<BR>
    <BR>
    <HR>
    ScreenShot's zu erstellen ist nicht ganz so einfach wie sich das manche vorstellen, es kommt sehr darauf an was eigentlich gezeigt werden soll.<BR>
    <UL>
    <LI>Kompletter ScreenShot; also alles was auf dem heimischen Bildschirm zu sehen ist, oder
    <LI>"nur" ein Ausschnitt
    </UL>
    <BR>
    Ein Kompletter ScreenShot ist meistens nicht n&ouml;tig und auch nur in ausnamefellen zu benutzen, zumidest in einer gr&ouml;sse die 1:1 ist. Also genauso gross wie der Bildschirm. Bei solchen Grafiken ist immer die (Datei)-Gr&ouml;sse zu beachten. Wenn eine Grafik eine Aufl&ouml;sung von z.B. 1024x768 Pixel gross ist und auch noch &uuml;ber mehr als 256 Farben besteht, besteht die Grosse Gefahr, dass beim betrachter nach kurzer Zeit grosser frust aufsteigt und Bild, Bild seingelassen wird und der Ladevorgang abgebrochen wird. Den der Ladevorgang ist recht lang und der Bildschirm wom&ouml;glich kleiner, die eingestelte Farbenzahl nur 256 und sowieter wird der Betrachter grosse Schwierigkeiten haben vern&uuml;nftig mit dieser Grafik umzugehen.<BR>
    <BR>
    <H2>Was also tun?</H2>
    <BR>
    Es ist mit einem Bildbearbeitungs-Programm m&ouml;glich die Farbzahl zu verringern und auch die Grafik zu verklienern. Oder aber einen Ausschnitt vom Screen zu machen. Der genau dass Anzeigt was ich eigentlich darstellen m&ouml;chte und nicht noch alles m&ouml;gliche "drumherrum".<BR>
    <BR>
    <H2>Ein Ausschnitt ist also keine schlechte Idee.</H2>
    <BR>
    Es gibt auf dem Amiga verschiedene Programme mit denen ich nun ScreenShot's erstellen kann. Um exemplarisch zwei verschiedene Wege aufzuzeigen nun die von mir benutzten Programme: Da ist zum einen das Bildbearbeitungs-Programm Personat Paint (PPaint) zu nennen (es ist z.B. auf der Amiga Plus CD-Rom 3/97 zu finden) und das Programm ScreenMugShot (es ist z.B. auf der Amiga Plus CD-Rom 5/97 zu finden). OK, beide nicht mehr ganz "Taufrisch" aber trotzdem gut zu gebrauchen.<BR>
    <BR>
    <H2>Zuerst zu PPaint</H2>
    <IMG SRC="ws_screenshot_1.png" WIDTH="370" HEIGHT="120" HSPACE="0" VSPACE="0" ALIGN="RIGHT">
    <BR>
    Es ist m&ouml;glich &uuml;ber den Men&uuml; Punkt <I>Bildschirm laden...</I> sich den Bildschirm (ScreenShot) zu laden den man braucht. Beim aufrufen von <I>Bildschirm laden...</I> erscheint eine Liste aus der man sich den Bildschirm aussuchen kann den man braucht. Und nun ist es ein leichtes aus diesem ScreenShot einen Ausschnitt auszuw&auml;hlen (Pinsel). Mit PPaint gibt es dann eigentlich nur eine M&ouml;glichkeit f&uuml;r HTML-Seiten so einen Ausschnitt zu Speichern. N&auml;mlich <I>Pinsel Speichern... F6</I>...<FONT COLOR="#1C0AFF">bild.png</FONT><BR>
    <BR>
    <H2>Aber Vorsicht!</H2>
    <IMG SRC="ws_screenshot_2.png" WIDTH="370" HEIGHT="120" HSPACE="0" VSPACE="0" ALIGN="RIGHT">
    <BR>
    Es ist immer im Vormat <FONT COLOR="#1C0AFF">PNG</FONT> zu speichern und f&uuml;r die Hintergrundfarbe (die Farbe 1) ist (immer) eine andere Farbe zu verwenden, sonst wird alles was der Hintergrundfarbe entspricht Durchsichtig dargestellt.<BR>
    Vergleiche beide Bilder!!!<BR>
    <BR>
    <TABLE WIDTH="100%">
  <TR>
<TD WIDTH="2%" BGCOLOR="#FF0000"></TD>
    <TD><FONT COLOR="#FF0000"><I>Anerkung zu AWeb:</I></FONT> AWeb kennt leider keine "Durchsichtigen" - Farben, wer sich also die beiden Bilder mit AWeb anschaut wird einen Grauen-Rand (Hintergrund) statt eines Durchsichtigen sehen! Dass ist eigentlich ein "Fehler" von AWeb.<BR>
</TD>
<TD WIDTH="2%" BGCOLOR="#FF0000"></TD>
  </TR>
</TABLE>
    <BR>
    <H2>JPEG oder GIF, welches die anderen Vormarte f&uuml;r HTML-Seiten sind, k&auml;nnt PPint leider nicht!</H2>
    <BR>
    <H2>Nun zu ScreenMugShot</H2>
    <BR>
    ScreenMugShot ist ein kleines Programm mit dem es m&ouml;glich ist direkt Teile des Bildschirms zu Speichern, in dem man &uuml;ber zum Beispiel einen Ordner die Maus schiebt und &uuml;ber eine Tasterturbelegung diesen Ausschnitt in die Ram (Zwischen)-Speichert. Aber auch hier muss ich leider noch nacharbeiten. Den es wird, wie auf dem Amiga &uuml;blich, im IFF-Vormat gespeichert und damit kann man nun gar nichts anfangen. Also muss ich ein anderes Programm Bem&uuml;hen. Zum Beispiel wieder PPaint (siehe oben) oder ich kann auch fxSCAN 3 (<A HREF="tt_fxscan.html">siehe meine Vorstellung des Programmes in dieser NC</A>) verwenden.<BR>
    <BR>
    Ich finde diesen "Weg" besser, man hat als Zwischenergebnis nicht so grosse Dateien und ScreenMugShot kann im Hintergrund weiter laufen. Aber es ist Geschmackssache!<BR>
    <HR>
    <CENTER><A HREF="mitglieder/voepel.html"><IMG SRC="mv_p.png" WIDTH="315" HEIGHT="47" BORDER="0"></A></CENTER>
    </TD>
      </TR>
    </TABLE>
</BODY>
</HTML>