<HTML>
<HEAD>
<TITLE>REFLECTOR 043</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
EDITORIAL</H1></CENTER>

<HR SIZE=5><P>

<CENTER><B>REFLECTOR 043</B><P>

Hi Folks !!<P>

Seid Willkommen zur <B>Ausgabe 43</B> eines wieder mal gelungenen (...Staub...Qualm...) Exemplar큦 Eures <B>REFLECTOR-Magazins!</B>.<P>

<B>Aus Duisburg und Gelsenkirchen kommen wir her;...und wir sagen Euch: Hier MonZoomt es sehr!</B></CENTER><P>

Wahrscheinlich nicht nur bei uns, sondern bei vielen Club-Mitgliedern rechnet nun emsig ein Progr&auml;mmchen mit Namen <B>MonZoom</B>! Aus und vorbei sind die gl&uuml;cklichen Tage von <B>Reflections</B>! Aus und vorbei? <B>NEIN!!</B> Wir wissen,
nur der Name hat sich ge&auml;ndert;...von der Programm-Seele her ist es immer noch <B>unser Reflections!</B> Ganz egal was hinter
dem Vorwand der Internationalisierung stecken mag;...und erst recht egal, wer diesen seltsamen Namen erfunden hat, denn eigentlich
wissen wir ja das wir so큡 bischen im Regen stehen! Doch: Absaufen tuen wir deshalb noch lange nicht, oder?<P>

<CENTER>Wie hei&szlig;t doch ein Sprichwort?:<P>

<B>Gottes M&uuml;hlen mahlen langsam;...die bei Oberland noch langsamer!?</B></CENTER><P>

Dennoch: Wir sehen aber auch das sich was tut, im <B>Oberl&auml;ndle!</B> Neue Programm-Features wie <B>Volumen-Licht</B>, <B>Mehrfach-Textur</B>, <B>Mehrfach-Kameras</B>, <B>Multi-Threading unter Windows NT</B>, <B>..neue Partikel-Funktionen, ...und...und...und..</B>zeugen vom emsigen treiben des Fuchses mit Vornamen Carsten!<P>

Ver&auml;nderungen hat es also gegeben;...Ver&auml;nderungen wird es in Zukunft auch bei <B>Reflector</B> geben! Zahlreiche Anregungen von Club-Mitgliedern haben uns zur Erstellung eines neuen Design-Konzept큦 bewegt, das sich Euch demn&auml;chst vorstellen wird ! Wie genau das ganze aussehen wird steht noch nicht 100%ig fest. &Uuml;berlegungen gehen in Richtung HTML-Frames,
Anim-Einbindungen o.&auml;.! Test큦 mit diversen Browsern , auf AMIGA sowie auf PC , m&uuml;ssen noch intensiv durchgef&uuml;hrt
werden;..zwingend notwendig, wenn wir nicht verschiedene Ausgaben f&uuml;r verschiedene Browser erstellen wollen!<P>

Eines wird sich mit Sicherheit nicht &auml;ndern;...der Name <B>Reflections-Club!</B> Man h&ouml;re sich nur den Namen an, wenn
man uns pl&ouml;tzlich <B>MonZoom-Club</B> schimpfen w&uuml;rde! Igitt...N&ouml;...Undenkbar!<P>

Wie wir bereits schon mal erw&auml;hnten, wird in unserem Cl&uuml;bchen seit kurzem auch mal &uuml;ber den eigenen Monitor
geschielt;...n&auml;hmlich zu anderer Software auf anderen Bildschirmen! Viele Mitglieder arbeiten,soweit uns bekannt, auch gerne
mit anderen Tracern! Sei es nun Cinema4D, 3D Studio Max, Imagine, TrueSpace, Soft F/X, LightWave oder sonst was: Uns interessieren
nicht nur die Ergebnisse die Ihr damit erzielt, sondern auch die Software selbst!<BR>
Also: Schreibt uns doch mal was &uuml;ber das Programm mit dem Ihr arbeitet;...stellt es auch anderen Mitgliedern vor! Der Anfang hierzu
wurde ja bereits schon von einem Club-Mitglied gemacht: Andreas Weyrauch stellte uns <B>Tornado 3D</B> vor!<P>



Was beinhaltet unsere neue <B>REFELCTOR</B>-Ausgabe diesmal?: Tolle Bilder in der <A HREF="../GALERIE.HTM">ArtGalerie</A>..total abgefahrene <A HREF="../OBJEKTE.HTM"> Objekte</A> unserer Mitglieder (...etwas f&uuml;r Star Trek-Freaks & M&ouml;chtegern-K&auml;ptn큦, lechz...sabber...) und nat&uuml;rlich wieder ein tolles<A HREF="../TOOLS.HTM"> Tool</A>;...diesmal f&uuml;r good old Amiga! Ein paar hei&szlig;e Tip큦 f&uuml;r <A HREF="../Texte/3D.HTM">Leseratten</A> fehlen
genau sowenig wie aktuelle Info큦 zu <A HREF="../Texte/COM98.HTM">Messen</A> und <A HREF="../Texte/EVENT.HTM">Veranstaltungen</A>! Die Rubrik <A HREF="../Texte/LESERBRI.HTM">Leserbriefe</A> ist nat&uuml;rlich auch wieder vertreten;...im <B>neuen Design !!</B>
<P>
So ! Wir &uuml;berlassen Euch nun Eurem Schicksal...<B>&auml;h</B> Eurer aktuellen <B>REFLECTOR</B>-Ausgabe und w&uuml;nschen euch wenig Guru큦 & Post-Mortem Error큦;...oder was es sonst noch so gibt!!<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>
<HR><P>

<DL>
<DT>Unsere Adressen:<DD><P>

<B>Uwe Sauder<BR>
Aakerf&auml;hrstr. 104<BR>
47058 Duisburg<BR>
Tel.: 0203-338557<P>

Olaf Gr&ouml;ning<BR>
Beckeradstr. 111<BR>
45897 Gelsenkirchen<P>

Werner Prass<BR>
Am Feldbusch 40<BR>
45889 Gelsenkirchen<BR>
Tel.: 0209-812029</B><P>
</DL>

<DL>
<DT>Bankverbindung:<DD><P>

<B>Volksbank Gelsenkirchen-Buer, Bankleitzahl: 42260001, Konto: 130 141 100</B><P>
</DL>

<DL>
<DT>Die REFLECTIONS-Mailboxen:<DD><P>

<B>O U Z O N I X - B B S<BR>
offline:  0.00-0.06 + 3.30-4.30 h<BR>
Sysop:  Ioannis Chatziandreou<P>

Fido Line #1 2:2448/1460.0 - Tel. Nr. 0234-9351320 (US-Robotic-DS 1200-36600 Baud)<BR>
Fido Line #2 2:2448/1461.0 - Tel. Nr. 0234-9351321 (ZyXEL U1496EG+ 1200-19200 Baud)<BR>
Fido Line #3 2:2448/1462.0 - Tel. Nr. 0234-9351318 (ISDN)<BR>
UUCP: ouzonix.ruhr.de<P>

D A R K S T A R - B B S<BR>
Sysop: Scarabeus (Andreas Stevens)<P>

Port #0: Tel. Nr. 02451-66999  (Active V.34 + ISDN)<BR>
Port #1: Tel. Nr. 02451- 7918  (ZyXEL V.34 + FAX)<BR>
eMail: Scarabeus@DarkStar.tng.oche.de</B><P>
</DL><P>

Downloads aus den <B>REFLECTIONS</B>-Areas der Mailboxen sind frei !!<P>
<HR> <P>

<H3><B>WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG</H3></B> <P>
 Die Archive (bzw. die Disketten) d&#252;rfen nur UNVER&#196;NDERT weitergegeben werden !
 Mailboxen, die sich mit dem Verbreiten von NAZI - Parolen und Hetze gegen
 Ausl&#228;nder und anderen Minderheiten hervortun, ist die Benutzung  von
 <B>REFLECTOR</B>-Disketten (egal ob zum Up- oder Downloaden) im ganzen oder teilweise
 (z. B. einzelne Bilder etc.) bei Strafandrohung (auch gegen User dieser Boxen)
 untersagt. Alle <B>REFLECTOR</B>-Ausgaben und Sonderdisks sind zwar im weitesten Sinne
 PublicDomain-Disks, aber kein Werbetr&#228;ger f&#252;r braune Schei&#223;e. Wir hoffen, das
 war klar und deutlich. Gleiches gilt nat&#252;rlich auch f&#252;r Mailboxen die sich mit
 dem Verbreiten linksradikal ausgerichteter Propaganda hervortun. Bei Fragen zu
 der <B>REFLECTOR</B>-PD-Serie oder zum <B>REFLECTIONS-Club</B> wendet Euch an die weiter oben
 genannten Adressen.<P>

 <B>Copyrights</B><P>
 sind nicht ganz unwichtige Sachen. Die Bilder, Animationen, Fonts, Objekte
 und Tools usw. auf dem <B>REFLECTOR</B>-Magazin und dessen Sonderausgaben, wie der
 <B>FontBox</B>-, der <B>REFLECTUR</B>- oder <B>REFLECTOR-Objektbibliothek</B> unterliegen zum
 gro&#223;en Teil diesem Copyright. Das hei&#223;t, da&#223; keine Beitr&#228;ge ohne die
 Einwilligung des Autors f&#252;r andere Zwecke, wie z. B. Ver&#246;ffentlichung auf
 anderen PD-Serien, Verkauf oder &#228;hnliches, benutzt werden d&#252;rfen. Vom
 Copyright ausgenommen sind Beitr&#228;ge, bei denen der Autor auf sein Copyright
 verzichtet, bzw. sein Beitrag als PublicDomain, Free- oder Shareware
 deklariert hat. Entsprechende Hinweise sind in den Info-Texten zu finden.
 Das gleiche gilt selbstverst&#228;ndlich auch f&#252;r die auf <B>REFLECTOR</B> und seinen
 Sonderausgaben benutzten Programme. Die Rechte der Programme liegen beim
 jeweiligen Autor. Wenn ein Beitrag vom Autor als Shareware, Giftware oder
 anderes deklariert ist, dann ist, entsprechend den Nutzungsbedingungen des
 Autors, das gew&#252;nschte Entgeld, Geschenk oder &#228;hnliches zu entrichten.<P>
 Wir k&#246;nnen aus eigener Erfahrung sagen,da&#223; jeder Autor, der uns f&#252;r das
 <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben Beitr&#228;ge zur Verf&#252;gung gestellt
 hat, dazu gerne bereit war. Bei Interesse an einer weiteren Verwendung dieser
 Beitr&#228;ge schreibt an den jeweiligen Autor. Schlie&#223;lich freut sich wohl jeder
 &#252;ber Post (wenn큦 denn keine Rechnungen sind).<P>
 &#252;brigens gibt es f&#252;r das <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben ebenfalls
 ein Copyright. Wir behalten uns n&#228;mlich das Recht vor, da&#223; <B>REFLECTOR</B> und seine
 Sonderausgaben nur in unver&#228;nderter Form weitergegeben werden d&#252;rfen.<P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
