<HTML>
<HEAD>
<TITLE>REFLECTOR 043</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Leserbriefe</H1></CENTER>
<HR SIZE=5><P>

Dem<B> REFLECTOR-Team</B> liegt viel an Eurer Meinung zu unserem Magazin, zu<B> REFLECTIONS</B> und jeden
anderen Thema. In der Abteilung Leserbriefe kann der Leser des<B> REFLECTOR</B>-Magazins sein
Statement zur Diskussion stellen.<P>

<B>Bevor es nun losgeht, etwas in eigener Sache: Wir bitten Euch uns Eure Zusendungen bzw.
Leserbriefe als ASCII - Text auf Disk zukommen zu lassen. Es ist eine &auml;u&szlig;erst undankbare
Aufgabe, seitenlange Briefe abzutippen. Hinzu kommt, da&szlig; diese meistens sowieso auf einem
Rechner geschrieben und anschlie&szlig;end ausgedruckt wurden. In Zukunft werden wir Leserbriefe,
die nicht  als ASCII-File vorliegen zwar zur Kenntnis nehmen, aber nicht ver&ouml;ffentlichen.</B><P>
<HR><P>
<TABLE width=100%><TR><TD bgcolor=#FFFFCC>
<A NAME="Markus Kuhnen"></A>
<B>Markus Kuhnen</B> macht heute den Anfang:<P>

<B>Hi,<P>

anbei schicke ich Dir nochmal die Mathetexturen vom REFTools!-Team, diesmal auch die
PC-Versionen. Die sind sicher auch f&uuml;r alle anderen REFLECTORianer interessant,
z. B. auf der n&auml;xhsten REFLECTOR-Ausgabe. Au&szlig;erdem habe ich mal wieder ein kleines
Statement f&uuml;r Dr. Reflectus abzugeben:<P>

Hallo Dr. Reflectus,<P>

ich habe die Tage mal wieder in die REFLECTOR-CD 2 reingeguckt und dabei ist mir die
gelungene Aufmachung der dortigen Leserbriefseiten aufgefallen. Die Unterlegung von
Leserbriefen und Antworten mit unterschiedlichen Farben erh&ouml;ht die &Uuml;bersichtlichkeit
so sehr, da&szlig; ich mir das auch f&uuml;r die "normalen" Disketten-Ausgaben von REFLECTOR
w&uuml;nschen w&uuml;rde. Zumindest m&ouml;chte ich diese Anregung mal f&uuml;r alle Mitglieder zur
Diskussion stellen.<P></B>

</TR><TR><TD BGCOLOR=#CCFFFF>
Dr. Reflectus: Wir haben Deinen Vorschlag in die Tat umgesetzt. Wie gef&auml;llt Euch das neue Outfit ?<P>
</TR><TR><TD BGCOLOR=#FFFFCC>
<B>Das zweite, was mir aufgefallen ist, hat nur etwas mit CPN zu tun:<P>

Lieber Claus-Peter, Du hast ja nun die Ver&ouml;ffentlichung Deiner Objekte und Bilder
auf der CD verboten. Ich unterstelle einfach mal, da&szlig; Du daf&uuml;r Deine Gr&uuml;nde gehabt
hast (auch wenn mir keine einleuchtenden einfallen...), auf alle F&auml;lle aber hast
Du damit uns anderen Clubmitgliedern einen B&auml;rendienst erwiesen! F&uuml;r mich hat die
CD in erster Linie den Zweck, da&szlig; ich darauf die auf REFLECTOR ver&ouml;ffentlichten
Objekte in gesammelter Form zur Verf&uuml;gung habe, und zwar dergestalt, da&szlig; ich sie
nicht lange zu suchen brauche, wenn ich sie brauche. Nun wollte ich neulich Deine
Vario-B&auml;ume in einer Szene einsetzen. Da Deine Objekte aber
nunmal nicht auf der CD sind, mu&szlig;te ich zu diesem Zweck herausfinden, in welcher
Ausgabe die B&auml;ume ver&ouml;ffentlicht wurden und diese Ausgabe anschlie&szlig;end wieder auf
meine Platte installieren, um an die B&auml;ume ranzukommen. Aus Platzgr&uuml;nden hatte ich
n&auml;mlich alle Ausgaben, deren Inhalt auf der CD ist, von der Platte gel&ouml;scht.<P>

Ich m&ouml;chte Dich daher bitten, f&uuml;r die (hoffentlich) noch folgenden CDs Deine
Erlaubnis zur Ver&ouml;ffentlichung Deiner Objekte wieder zu geben, da dies im
Interesse aller Clubmitglieder ist.<P>

Ciao<P>

Markus<P></B>
</TR></TD>
<P>
<TR><TD bgcolor=#FFFFCC>
<A NAME="CPN"></A>
<B>Claus Peter Nandelstaedt</B> folgt dem ersten Brief:<P>

<DIV ALIGN=RIGHT><B>Mitte September 98<P></DIV>

Hallo TEAM .<P>

Zur Zeit fliege ich eigentlich mit dem Microsoft-Flugsimulator in einem Hubschrauber durch die Gegend. Macht viel Laune.
Als ich auf der Festplatte eine Datei suchte, stiess ich auf Reflection.
Hoppla,da war doch mal was? Alzheimer l&auml;sst gr&uuml;ssen.
Also, Freudenkn&uuml;ppel  vergessen und mal wieder Reflection strapaziert.
(Nein,nein, nicht DER Freudenkn&uuml;ppel, den Steuerkn&uuml;ppel, und Reflection ist auch nicht meine Frau, sondern ein Programm)
Es sollte ein sch&ouml;nes,ein pr&auml;chtiges, ein grosses, ein tolles Raumschiff werden.
Ich begann mit einer Antennenanlage, hatte mich aber irgendwie im Raum verloren und dachte nur noch Schiff.
Reflection hat  dieses wohl bemerkt und aus der Antennenanlage  ein Schaufelrad mit einem Schiff daran gemacht.
Na ja, dachte ich,Schiff ist Schiff und Raum braucht ja nun mein Schiff auch. :-))
Also doch ein Raumschiff.
Gestern wusste ich noch nicht wie man Kabid&auml;n  (kommt wohl von Kabine ?)
schreibt und Heut bin ich einer und schiffe wohin ich will.
Sag noch Jemand was gegen Reflection.Reflection ist tot.Es lebe Reflection.
Nun flieg ich erstmal weiter<P>

so lang<P>  

C P N<P></B>

</TR><TR><TD BGCOLOR=#CCFFFF>
Dr. Reflectus: Tja, dem ist eigentlich nichts hinzu zu f&uuml;gen. Das Schiff ist auf dieser
Ausgabe und eine m&auml;chtige Bedankung f&uuml;r dieses super <A HREF="O-CPN.HTM"> Objekt.</A> Wie 
w&auml;re es, wenn Du beim n&auml;chsten mal ein Glas Wein weniger trinken w&uuml;rdest. Denn Reflection
hei&szlig;t Reflection<B>s</B> !! Paletti Kabid&auml;n ??<P>
</TR></TD>
<P>

<TR><TD bgcolor=#FFFFCC>
<A NAME="Karl-Heinz Fichtl"></A> 
<B>Karl-Heinz Fichtl</B> mit einem kurzen Brief:<P>

<B>Hallo Uwe<P>
  
Nach langer Zeit Mal wieder ein Objekt und ein paar Bilder von mir.
Habe jetzt mehr Zeit um Objekte und Bilder zu produzieren. (z.B.das Bild Back,das Objekt
ist bald fertig) .   Tsch&uuml;&szlig;

PS.Macht weiter so mit dem REFCLUP.<P>
 
Viele Gr&uuml;&szlig;e aus Diessen am/Ammersee<P>

von Karl Heinz<P></B>
</TR></TD>
<P></TABLE>
<HR>
Damit w&auml;ren wir am Ende der Leserbriefe angelangt. Nat&uuml;rlich harren wir
der weiteren Post, die da auf uns zukommen wird. Also ran an die Tasten
und her mit Euren Statements.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
