<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,konzertbericht,helloween,blaze,labyrinth,zeche">
<title>Konzertbericht</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><center><h1><font color="yellow">Konzertbericht: Helloween, Blaze &amp; Labyrinth</Font></center></h1></P>

<p>Nachdem die geplante Helloween Tour im Februar wegen einer Verletzung von Drummer Uli Kusch leider geplatzt war, wurden die Deutschland Dates Anfang April wiederholt - f&#252;r Helloween war das ganze die erste Headlinertour nach &#252;ber 4 Jahren und nicht wenige freuten sich darauf, die K&#252;rbisk&#246;pfe mal wieder live zu erleben.</P>

<p>Bevor es allerdings dazu kam, konnten die beiden Vorbands noch zeigen, was sie drauf hatten. Den Anfang machten die Melodic Power / Prog. Metaller von Labyrinth, die aufgrund der Versp&#228;tung des Konzertbeginns zun&#228;chst vor einer fast komplett leeren Halle loslegen mussten. Das st&#246;rte freilich auch nicht weiter, denn Live kommt das Material des letzten Longplayers &quot;Sons Of Thunder&quot; genauso unspektakul&#228;r r&#252;ber, wie auf Platte. Somit sind Songs wie &quot;Chapter I&quot;, &quot;Kathryn&quot; oder &quot;Sons Of Thunder&quot; auch live keine wirklichen Bringer und das merkte auch ein Gro&#223;teil des Publikums - &#228;ltere Songs wie etwa &quot;Moonlight&quot; oder &quot;Thunder&quot; wurden dementsprechend wesentlich enthusiastischer abgefeiert und sind auch in meinen Augen die st&#228;rkeren St&#252;cke. Der Band an sich konnte man allerdings auch nur m&#228;&#223;igen Unterhaltungswert berscheinigen, so da&#223; ich einfach mal vermute, da&#223; Labyrinth seinerzeit mit &quot;Return To Heaven Denied&quot; ihren kreativen H&#246;hepunkt erreicht haben und sich mitlerweile auf dem absteigenden Ast befinden - nicht anders kann ich mir einen Totalausfall wie das Album &quot;Sons Of Thunder&quot; erkl&#228;ren...</P>

<p>Genau umgekehrt verh&#228;lt es sich in Sachen Blaze Bayley: Bei Iron Maiden hatte der gute Blaze immer einen schweren Stand und konnte niemals gegen das &#252;bergro&#223;e Image von Bruce Dickinson anstinken. Mit seiner eigenen Band namens Blaze sieht es da schon ganz anders aus: Wie von einer zentnerschweren Last befreit, lief Blaze Bayley permanent &#252;ber die B&#252;hne, animierte das Publikum zum mitsingen und verspr&#252;hte viel Charisma. So engagiert hat man ihn bei seiner ganzen Zeit bei Iron Maiden wohl niemals gesehen. Auch die Setlist lie&#223; sich sehen: Mit dem fuminanten Doppel Opener &quot;The Launch&quot; und &quot;Futureal&quot; (von Iron Maiden) hatte die sympathische Combo die Fans schnell auf ihrer Seite, die dementsprechend gut mitgingen. Keine Frage: Als Anheizer machte sich das Quartett wirklich spitze und auch die eigenen Kompositionen wie &quot;The Brave&quot; oder &quot;Silicon Messiah&quot; kamen ziemlich geil daher. Unbeschreiblicher H&#246;hepunkt war aber wohl das zweite Iron Maiden St&#252;ck &quot;Man On The Edge&quot;, bei dem die komplette Zeche ausrastete. Bleibt unterm Strich eine wirklich astreine Leistung von Blaze &#252;brig, an der es aber auch wirklich gar nix zu n&#246;rgeln gibt - und am wenigsten am Frontman Blaze Bayley, der seine Sache einfach nur perfekt machte. Heimlicher H&#246;hepunkt des Abends!!</P>

Tja, und dann war auch schon &quot;Happy, happy Helloween&quot; Time. Irgendwie hatte ich vor dem Konzert ein etwas mulmiges Gef&#252;hl in der Magengegend, denn die letzten Releases der K&#252;rbisk&#246;pfe (&quot;Better Than Raw&quot;, &quot;Metal Jukebox&quot; , das aktuelle Album &quot;The Dark Ride&quot; sowie diverse Soloeskapaden, wobei  man hier Roland Grapow ausklammern muss) waren doch bestenfalls fader Durchschnitt und keine wirklich runde Sache. Somit war ich ziemlich gespannt, was die Hanseaten an diesem Abend so auf die Reihe kriegen w&#252;rden und schon beim Opener &quot;Power&quot; war ich doch erstaunt, da&#223; man ausgerechnet diesen Gassenhauer vom &quot;Time Of The Oath&quot; Album an Nr.1 gesetzt hatte. Tja, bei Helloween ist man halt nie vor &#220;berraschungen sicher! Was folgte, war ein Querschnitt &#252;ber die Anfangstage von Helloween und dem neuen Material, wobei man die Alben &quot;Pink Bubles Go Ape&quot;, &quot;Chameleon&quot; und &quot;Master Of The Rings&quot; erwartungsgem&#228;&#223; au&#223;en vor lie&#223;. Ich pers&#246;nlich fand die alten Gassenhauer - mit denen Frontman Andi Deris zugegebenerma&#223;en leichte Probleme hatte - der Marke &quot;Future World&quot;, &quot;Eagle Fly Free&quot;, &quot;Dr.Stein&quot;, &quot;How Many Tears&quot; oder auch &quot;I Want Out&quot; (mit dem wohl kaum einer gerechnet hatte) immer noch am geilsten, aber die Zeiten sind lange vorbei. Das neue Material ist ja auch recht aktzeptabel und enthielt mit &quot;Escalation 666&quot;, &quot;The Departed&quot;, &quot;The Dark Ride&quot;, &quot;Revelation&quot; (vom &quot;Better Than Raw&quot; Album) oder auch &quot;Steel Tormentor&quot; (vom &quot;Time Of The Oath&quot; Longplayer) auch noch viele weitere Highlights. Was den ansonsten positiven Gesamteindruck etwas st&#246;rte war zum einen das &#252;berfl&#252;sssige &quot;Mr.Torture&quot; (nach wie vor der bl&#246;deste Opener den Helloween je geschrieben haben) und zum anderen das absolut beschissene Ges&#252;lze von Gittarero Michael Weikath. Wer schon einmal in den &quot;Genuss&quot; von seinen Statements und seiner Haltung auf der B&#252;hne gekommen ist (wenn es einen Coolness &amp; Arroganz Preis geben w&#252;rde, w&#252;rde er ihn gewinnen)
, wei&#223; wohl was ich meine. Kann es sein, da&#223; dieser Mann einen an der Klatsche hat? Statements wie: &quot;Ich komme gleich wieder, ich muss mal eben pissen&quot; zeugen einfach nicht von Intelligenz sondern von absoluter Bl&#246;dheit. Da frage ich mich nur, wie es dieser Mann geschafft hat, Jahrhundertklassikeralben wie &quot;Walls Of Jericho&quot; oder &quot;Keeper Of The Seven Keys&quot; mitzukomponieren. Ach ja: S&#228;nger Andi Deris gl&#228;nzte an diesem Abend auch mit verbalem Schwachfug und steuert direkt auf Weikath Niveau zu. Die einzigst normalen Leute in der Band scheinen ohnehin nur noch Drummer Uli Kusch sowie Gitarrist Roland Grapow zu sein, dessen Kompositionen das einzigste sind, was Helloween 2001 in Sachen Albumrelease vor dem Totalabsturz bewahrt hat. Nichtdestotrotz war es eigentlich ein gelungener Gig, der trotz fehlender Special Effects f&#252;r Spa&#223; sorgte und Helloween in spielerischer Sicht nochmal von ihrer etwas besseren Seite zeigte. Aber Jungs, tut mir einen Gefallen: Verklebt Michael Weikath bei den n&#228;chsten Konzerten den Mund. Vielen Dank auch...</P>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
