<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Netzwerkgrundlagen 1/3</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Netzwerkgrundlagen 1/3:<br>Die Hardware</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P>F&uuml;r diesen Kurs sind drei Teile geplant:</P>

<ol><b>
<li>Hardware</li>
<li>Protokolle (Genesis, MiamiDx)</li>
<li>Netzprogramme (Apache, Samba,...).</li>
</ol></b>

<h3>Unzufriedenheit</h3>

<P>Gr&uuml;nde, sich ein Netzwerk zuzulegen, gibt es viele: Der popul&auml;rste und
aus Amiga-Sicht unbefriedigendste, ist die bessere Unterst&uuml;tzung moderner
Hardware auf den gemeinen PCs. Gibt es manche Dinge noch mit
amigakompatiblen Anschl&uuml;ssen, z.B. SCSI, ist dann meistens beim
Softwaretreiber Schlu&szlig;. Irgendwann rechnet sich sogar ein halbwegs
moderner Billig-PC, wenn man kein Geld mehr f&uuml;r Shareware und kommerzielle
Amigal&ouml;sungen ausgeben mu&szlig;, sondern die sch&ouml;ne neue Technik ganz bequem
&uuml;ber ein Netzwerk auch auf dem Amiga mitbenutzen kann. Vom unkomplizierten
Datenaustausch ganz zu schweigen.</P>

<h3>Schichtweise</h3>

<P>Das Netzwerkmodell ist in mehrere Schichten oder Ebenen aufgeteilt. Grob
gesagt, existiert eine unterste Hardwareschicht, die die Rechner physisch
verbindet, eine Treiberebene f&uuml;r die Hardware, dar&uuml;ber eine
Netzwerksoftware mit Protokollebene und Anwenderprogrammebene, und
letztlich den Programmen, die auf Netzfunktionen zugreifen wollen.
Verwirrt? Das gibt sich mit der Zeit. Fangen wir mit der untersten Ebene,
der Hardware, an.</P>

<h3>Die Hardwareebene</h3>

<P>Grunds&auml;tzlich ist es vollkommen egal, wie sie Ihre Rechner vernetzen, sie
m&uuml;ssen nur darauf achten, da&szlig; alle beteiligten Ger&auml;te untereinander
kompatible Anschl&uuml;sse haben. F&uuml;r wirklich anspruchsvolle und erweiterbare
Netze wird Ihnen jedoch keine andere Wahl als Ethernet bleiben.</P>

<h3>Seriell</h3>

<P>Die einfachste und zugleich auch langsamste Verbindung zweier Rechner
geschieht &uuml;ber die serielle Schnittstelle mit einem sogenannten
Nullmodemkabel. Dieses ist billig und mit geringen L&ouml;tkenntnissen auch
selbst einfach herzustellen, hat jedoch den Nachteil, da&szlig; mit zunehmender
L&auml;nge immer mehr St&ouml;rungen von au&szlig;en die Verbindung verschlechtern und
deshalb die Schnittstellengeschwindigkeit immer niedriger eingestellt
werden mu&szlig;. Man h&ouml;rt von erfolgreichen Versuchen, nachdem &uuml;ber 100 Meter
Strecke zwischen zwei Rechnern so &uuml;berbr&uuml;ckt wurden - bei maximal 240
Bytes/Sekunde...</P>

<P>Nicht umsonst habe ich auch immer von ZWEI Rechnern gesprochen. Die
serielle Schnittstelle ist eine Punkt-zu-Punkt-Verbindung, man kann das
Kabel nicht abzweigen. Ein dritter Rechner findet keinen Anschlu&szlig;, au&szlig;er
&uuml;ber eine weitere Schnittstelle.</P>

<P>Der Vorteil ist, da&szlig; jeder ernstzunehmende Rechner eine serielle
Schnittstelle hat, die zu jedem anderen Rechner kompatibel ist.</P>

<h3>Parallel</h3>

<P>Normalerweise ist dies der Druckerport. Hierf&uuml;r gibt es zwei L&ouml;sungen:
Eine &quot;Laplink&quot;-Vernetzung, urspr&uuml;nglich zum Datenaustausch zwischen Laptop
und PC gedacht, daher der Name. Au&szlig;erdem der echte bidirektionale
Datenaustausch mittels PLIP (Parallel Line Interface Protocol). Die
Methoden ben&ouml;tigen unterschiedliche Kabel, sind aber beide wesentlich
schneller, als eine serielle Vernetzung, circa um den Faktor f&uuml;nf. Ein
wesentlicher Nachteil ist, da&szlig; damit nur etwa 5 Meter &uuml;berbr&uuml;ckt werden
k&ouml;nnen, ganz Mutige schaffen vielleicht auch 10 Meter, aber da will ich
dann nicht Datenpaket sein.</P>

<P>Laplink hat wieder den Nachteil, da&szlig; jeder Rechner sein eigenes S&uuml;ppchen
kocht. Zum Gl&uuml;ck bringen Amiga-Programme ihre eigenen PC-Treiber mit, wie
z.B. PC2Amiga (Aminet: comm/net). Nachteil ist die Client/Server-Struktur:
Der Amiga hat zwar vollen Zugriff auf den PC, aber der PC hat keine Ahnung,
da&szlig; ein Amiga daranh&auml;ngt.</P>

<P>PLIP hingegen ist ein standardisiertes Netzwerkprotokoll, mit Treibern f&uuml;r
alle Rechnertypen. Der Nachteil ist wieder: Jeder Rechner hat normalerweise
nur einen Parallelport, und der ist meistens durch den Drucker belegt. Man
braucht also ein spezielles Kabel mit Umschaltung zwischen Drucker und
Netzbetrieb. Trotzdem funktioniert immer nur eines, einen Drucker, der
&uuml;bers Netzwerk ansprechbar ist, bekommt man erst mit einer zus&auml;tzlichen
freien Schnittstelle auf einem der Rechner.</P>

<P>Ein dritter Rechner am selben Port ist genausowenig m&ouml;glich, wie bei der
seriellen Schnittstelle.</P>

<h3>Floppy-Netz</h3>

<P>Nicht das klassische Floppynet (Datenaustausch mittels Disketten) ist
gemeint, sondern tats&auml;chlich die Vernetzung &uuml;ber den Amiga-Diskettenport.
Offensichtlicher Nachteil ist die Beschr&auml;nkung auf den Amiga - PC-
Floppyports sind nicht kompatibel. Immerhin kann der Amiga 4
Floppylaufwerke verwalten, also ist noch Platz f&uuml;r maximal drei
zus&auml;tzliche Amigas. Nachteil auch hier: Die sehr kurzen Leitungswege von
maximal 50 cm zwischen den Rechnern. Nebenbei ist die Datenpumpe des Amiga
auch nicht gerade &uuml;berragend: 50 KByte/sec ist das theoretische Maximum,
20 KByte d&uuml;rften realistisch sein.</P>

<h3>ISDN</h3>

<P>Auch ISDN ist ein Netzanschlu&szlig;. Man mu&szlig; sich nicht einmal selbst anrufen,
um die Methode zu nutzen, der interne S0-Bus kann auch ohne Geb&uuml;hren
benutzt werden. Voraussetzung ist nat&uuml;rlich, da&szlig; alle Rechner eine ISDN-
Karte besitzen. Insgesamt k&ouml;nnen sich drei Rechner mit 8 KByte/Sekunde
oder zwei mit 16 KB/sec unterhalten. Nur Anrufe kommen dann weder herein,
noch k&ouml;nnen Sie selbst telefonieren. Und Treiber bekommen Sie daf&uuml;r auch
nur schwer, bzw. teuer.</P>

<h3>SCSI</h3>

<P>Auch das geht. Das Siamese-System ist ja hinreichend bekannt, die
Verbindung sogar ordentlich schnell (FastSCSI schafft 10 MB/sec auf 3
Metern Kabell&auml;nge, da&szlig; schl&auml;gt sogar 100MBit Ethernet-Karten, allerdings
nicht in der L&auml;nge).</P>

<P>Probleme gibt es bei der ordentlichen Verkabelung. Die Versorgungsleitung
der Terminierung darf nur auf einer Seite eingespeist werden, sonst
krachts und zwar heftig. Der unbestreitbare Vorteil ist aber auch die
gemeinsame Nutzung der Ger&auml;te auf dem SCSI-Bus von allen Rechnern aus.
Hat man einen WideSCSI Hostadapter, kann man sogar bis 15 Ger&auml;te oder
eben 15 Rechner zus&auml;tzlich anschlie&szlig;en. Nachteil ist wiederum die L&auml;nge:
Maximal 6 Meter bei SCSI-2, nur 3 Meter bei FastSCSI-2. Au&szlig;erdem gibt es
f&uuml;r PCs keine Treiber, man ist auf Siamese angewiesen.</P>

<h3>Ethernet</h3>

<P>Sinnvoll f&uuml;r professionellen Einsatz mit mehr als zwei Rechnern. Es gibt
auf jedem System eine Unzahl von Netzkarten und am wenigsten Probleme. Zur
Zeit beherrscht der Amiga nur 10 MBit-Ethernet, das mit realen
Geschwindigkeiten bis 400 KByte/sec protzt. Hat man einen guten Tag und
optimale Netzkarten erwischt, sind auch schon mal 700 KByte Spitze drin.</P>

<P>Ethernet ist auf der PC-Seite ungeschlagen g&uuml;nstig (ab 25 DM pro Karte!),
nur auf dem Amiga ist es nat&uuml;rlich wieder wesentlich teurer (ab ca.
200 DM). Daf&uuml;r k&ouml;nnen Sie sich in jedes bestehende Ethernet einklinken,
vorausgesetzt, es spricht ein Netzwerkprotokoll, das auch der Amiga kennt,
sonst versteht er nichts.</P>

<P>Ethernet erlaubt eine Gesamtl&auml;nge von 185 Metern und bis zu 30 Anschl&uuml;sse.
Eine spezielle, auch vom Amiga unterst&uuml;tzte Variante (10BaseT) erlaubt
sogar unbegrenzt viele Rechner auf einer Strecke von 100 Metern, ben&ouml;tigt
daf&uuml;r aber einen/mehrere Repeater (auch Hub genannt), die wieder extra
kosten.</P>

<h3>Sinnvoll</h3>

<P>Wie k&ouml;nnen Sie nun die Anforderungen an Ihr pers&ouml;nliches Netz herausfinden?
Zuerst m&uuml;ssen Sie sich klar werden, wie viele und welche Rechner
angeschlossen werden sollen. Sind es mehr als zwei, sollten Sie SCSI oder
besser Ethernet in Betracht ziehen. Sind es nur Amigas, reicht auch ein
Floppyport-Netzwerk.</P>

<P>Haben Sie ein hohes Datenaufkommen, das &uuml;ber die Rechner ausgetauscht
werden soll, mu&szlig; es ein schnelles Netz sein, also SCSI oder Ethernet.
Wollen Sie dagegen nur mal so reinschnuppern, in die Welt der Netze,
reicht ein serielles Nullmodemkabel vollauf.</P>

<P>Am ausbauf&auml;higsten und problemlosesten ist auf jeden Fall ein Netz mittels
Ethernetkarten. Nur m&uuml;ssen Sie u.U. eine gr&ouml;&szlig;ere Summe investieren, wenn
Sie mehrere Amigas vernetzen wollen. Ein gemischtes Netz mit einem Amiga,
PCs und Macs bekommen Sie ohne nervenaufreibende T&uuml;ftelei sowieso nur &uuml;ber
Ethernet hin.</P>

<P>Planen Sie au&szlig;erdem noch einen Internetzugang f&uuml;r alle Netzrechner, dann
ist es am sinnvollsten, einen Rechner zum Gateway zu machen. Nur dieser
hat dann Zugriff aufs Internet, alle anderen Rechner greifen &uuml;ber diesen
einen darauf zu. Der gro&szlig;e Vorteil: Ein ausgedienter 486er mit 50 MHz und
PC-ISDN-Karte oder Modem reicht als Gateway, so etwas bekommen Sie heute
gebraucht f&uuml;r unter 100 DM. Dazu das freie Linux als Betriebssystem und
eine billige Ethernetkarte, fertig ist der Internetzugang f&uuml;r alle
Netzrechner!</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903prov.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../mmx/9903mmx.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


