<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Providerwahl</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Providerwahl</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<H3 ALIGN=CENTER>Ist Ihr Provider der Richtige?</H3>

<h3>Dumme Frage</h3>

<P>Noch vor drei Jahren h&auml;tte man die Frage ganz leicht beantworten k&ouml;nnen.
Da gab es noch keinen entfesselten Telekommunikationsmarkt. Wenige und
&uuml;berschaubare Tarife beherrschten die Szene, und wenn man etwas l&auml;ndlicher
wohnte, war sowieso der Ortstarif das einzige Kriterium.</P>

<P>Heute gibt es eine Unzahl von Telefondienstanbietern und noch mehr
Internetprovider. Und um die Verwirrung komplett zu machen, arbeiten
manche davon auch noch zusammen. Das Resultat ist ein Tarifdschungel,
der es dem Internetanschlu&szlig;suchenden unglaublich schwer macht, den
pers&ouml;nlich g&uuml;nstigsten Provider zu finden. Denn den einen G&uuml;nstigen,
der f&uuml;r alle g&uuml;nstig ist, den gibt es nicht.</P>

<P>Genau deshalb erhalten Sie mit diesem Artikel auch keine Empfehlung f&uuml;r
einen bestimmten Provider. Die Tarife &auml;ndern sich so schnell, da&szlig; eine
Berechnung von heute morgen schon wieder falsch w&auml;re. Der richtige
Provider ist immer eine individuelle Entscheidung - f&uuml;r die Qualit&auml;t,
die eingesparten Kosten oder die sinnvolle Mischung beider Punkte.</P>

<h3>Mit System</h3>

<P>Wenn Sie heute einen Provider suchen, sollten Sie sich vorher ganz genaue
Vorstellungen davon machen, was Sie brauchen und was nicht. Je genauer Sie
Ihre W&uuml;nsche kennen, umso weniger Geld werden Sie in den Sand setzen.
Dieser Artikel soll Ihnen helfen, einen &Uuml;berblick &uuml;ber Ihre pers&ouml;nlichen
Anforderungen zu bekommen, damit Sie eine Vorstellung davon haben, was Sie
bei der Providersuche beachten m&uuml;ssen.</P>

<P>Zuerst einmal brauchen Sie eine &Uuml;bersicht, welche Provider es eigentlich
gibt. Am besten kaufen Sie sich hierzu eine der einschl&auml;gigen PC-
Zeitschriften, die alle ziemlich regelm&auml;&szlig;ig gro&szlig;e Tests durchf&uuml;hren.
Schlagen Sie das Heft vor dem Kauf ruhig einmal auf und sehen Sie nach,
ob auch alle Eigenschaften der Zug&auml;nge aufgef&uuml;hrt werden, wie angebotene
EMail-Protokolle, Einwahlknoten, etc.. Dann k&ouml;nnen Sie damit auch etwas
anfangen.</P>

<P>Dann &uuml;berlegen Sie sich, mit welchem Computer Sie das Internet benutzen
wollen. Einige Amigabesitzer haben auch einen PC, der entweder zus&auml;tzlich
oder sogar allein als Internetrechner dienen soll. Mit dem PC stehen Ihnen
grunds&auml;tzlich alle Anbieter offen, auch jene, die keine allgemeinen
Standards f&uuml;r ihren Zugang nutzen. Dies ist haupts&auml;chlich bei AOL der
Fall, aber auch bei einigen kleineren Anbietern. Sobald Sie f&uuml;r den Zugang
vom Anbieter eine besondere Software ben&ouml;tigen, ist f&uuml;r den Amiga Schlu&szlig;,
denn diese Programme sind in keinem Fall f&uuml;r den Amiga erh&auml;ltlich. </P>

<P>Damit sind noch viele Bewerber im Rennen. Streichen Sie jetzt alle, die
nicht zum Ortstarif erreichbar sind, bzw. die Ihre Onlinekosten nicht
pauschal &uuml;bernehmen. Damit w&auml;re die Liste, falls Sie nicht grade in einer
Gro&szlig;stadt wohnen, deutlich k&uuml;rzer. H&ouml;ren Sie sich auch um, ob eine
Telefongesellschaft vielleicht Probleme mit der Erreichbarkeit hat. Ein
billiger Zugang n&uuml;tzt Ihnen nichts, wenn immer besetzt ist oder st&auml;ndig
die Verbindung abbricht.</P>

<h3>Was ihr wollt</h3>

<P>Jetzt kommt der schwierige Teil: Sie m&uuml;ssen festlegen, was Sie wollen.
Schreiben Sie ganz detailliert auf, ob Sie eine EMailadresse brauchen,
oder vielleicht einen &ouml;ffentlichen EMaildienst im Netz benutzen wollen.
Brauchen Sie einen FTP-Zugang f&uuml;r's Aminet? Haben Sie vor, mittels IRC
mit anderen &ouml;fter mal ein Schw&auml;tzchen zu halten? Wollen Sie Platz f&uuml;r
eine eigene Homepage oder reichen Ihnen die kostenlosen Webangebote wie
&quot;GeoCities&quot; daf&uuml;r v&ouml;llig aus? Legen Sie vielleicht Wert auf eine eigene
Domain? Streichen Sie wieder alle Provider, die Ihre Anforderungen nicht
erf&uuml;llen.</P>

<P>Legen Sie Wert auf einen schnellen Zugang? Auch ein g&uuml;nstiges Angebot wird
schnell teuer, wenn Sie auf Webseiten ewig warten m&uuml;ssen. Streichen Sie
also auch die Anbieter, deren Geschwindigkeit deutlich zu w&uuml;nschen &uuml;brig
l&auml;&szlig;t. Passen Sie dabei aber auf, da&szlig; Sie die Zugangsmethode ber&uuml;cksichtigen:
56K-Modems und ISDN-Zug&auml;nge sind nun einmal schneller, als &quot;konventionelle&quot;
Modems... Suchen Sie sich hier auch gleich die Provider aus, die m&ouml;glichst
alle Standards unterst&uuml;tzen - falls Sie sp&auml;ter zu ISDN wechseln oder
irgendwann vielleicht ein Kabelmodem einsetzen wollen.</P>

<h3>Nichts ist umsonst</h3>

<P>Das ist der Teil, bei dem Sie wirklich knallhart rechnen m&uuml;ssen.
Onlinekosten sind eine Wissenschaft f&uuml;r sich, die nicht leicht zu
durchschauen ist. Am besten funktioniert es, wenn Sie schon irgendwo
online sind und Ihre festen Gewohnheiten haben. Ansonsten versuchen Sie
abzusch&auml;tzen, wie lange Sie im Monat online sind, und zu welchen Zeiten.
Nicht immer ist n&auml;mlich die billigste Tageszeit auch die lohnendste. Ist
das Netz voll, tr&ouml;pfeln die Daten trotz HiSpeed-Modem und Eliteprovider
nur sp&auml;rlich, besonders bei &Uuml;berseeverbindungen. Zur Absch&auml;tzung: Mit
ISDN-Anschlu&szlig; und guten 20 Stunden Onlinezeit im Monat zahlte ich bei der
Telekom etwa 200 DM. Die Hauptonlinezeit ist dabei das Wochenende mit dem
City-Weekend Tarif. Samstag und Sonntag vormittag pennen die Kids noch,
m&uuml;de von der Techno-Disko, das Netz ist frei...</P>

<P>Eine Falle sollten Sie auch noch beachten: Die Zeiten f&uuml;r die
Vertragsbindung. Sollten Sie feststellen, da&szlig; ein Zugang nicht das h&auml;lt,
was er verspricht, ist eine schnelle K&uuml;ndigung viel Geld wert. Auch wenn
Sie ein noch g&uuml;nstigeres Schn&auml;ppchen ausfindig machen, spart eine kurze
K&uuml;ndigungszeit vielleicht viel Geld.</P>

<P>Seien Sie auch vorsichtig mit Kontingenten. Wenn Sie eine festgelegte
Maximal&uuml;bertragungsmenge haben, rei&szlig;t jede &Uuml;berschreitung verheerende
L&ouml;cher in den Geldbeutel. Auch kann es Ihnen passieren, da&szlig; der Zugang
einfach gek&uuml;ndigt wird, weil Sie mal zu lange online waren. Auf solche
Bedingungen im Vertrag m&uuml;ssen Sie immer acht geben, ganz besonders, wenn
das Angebot sehr g&uuml;nstig aussieht.</P>

<h3>Welche Kosten entstehen</h3>

<P>Die billigsten Provider verlangen f&uuml;r den Zugang gar kein kein Geld,
sondern blenden einfach Werbung ein. Nach ein paar angesurften Seiten
taucht eine Werbeseite auf, nach der man wieder weitersurfen kann.
Meistens hat man auch schwerwiegende Einschr&auml;nkungen, wie z.B. Zugriffe
auf Auslandsserver nur zu bestimmten Zeiten, keine EMailadresse, kein
FTP-Zugang, ... Zum Antesten und um die eigenen Gewohnheiten
herauszufinden, mag das aber gen&uuml;gen.</P>

<P>Normalerweise entstehen vielerlei Kosten: Eine einmalige Anmeldegeb&uuml;hr,
eine monatliche Grundgeb&uuml;hr, Onlinekosten pro Sekunde oder Minute und die
normalen Telefonkosten.</P>

<P>Die Anmeldegeb&uuml;hr ist futsch. Wenn Sie den Provider gleich wieder wechseln,
war das dann ein teurer Spa&szlig;. Am besten fahren Sie dann mit einem Anbieter,
der keine Anmeldegeb&uuml;hr verlangt.</P>

<P>Die monatliche Grundgeb&uuml;hr sollte gering sein, wenn Sie wenig online sind.
So zahlen Sie vielleicht mehr f&uuml;r die Stunde, aber die geringe Stundenzahl
wiegt den Mehrpreis einer h&ouml;heren Grundgeb&uuml;hr u.U. wieder auf.</P>

<P>Die Onlinekosten sollten niedrig sein, wenn Sie viel online sind. Eine
h&ouml;here Grundgeb&uuml;hr schl&auml;gt dann nicht so zu, wie ein kr&auml;ftiger Minutenpreis.</P>

<P>Die Telefonkosten sind abh&auml;ngig vom Provider. Die meisten haben den
Telekomtarif und man profitiert hier automatisch von Preissenkungen. Ein
paar Anbieter &uuml;bernehmen auch die Telefonkosten und rechnen die in die
Onlinekosten mit ein. Hier mu&szlig; man besonders aufmerksam vergleichen und
versuchen, die Kosten f&uuml;r seinen ganz speziellen Fall getrennt
herauszurechnen, um objektiv vergleichen zu k&ouml;nnen.</P>

<h3>Der Fall am Beispiel</h3>

<P>Ein (nicht ganz) fiktives Beispiel, ohne Anmeldegeb&uuml;hr, da die sich mit
der Zeit verd&uuml;nnisiert.</P>

<P>Telefongeb&uuml;hr immer zum g&uuml;nstigsten Telefon-, bzw. Onlinetarif:</P>

<UL>
<LI><B>Provider 1:</B> Alles kostet<BR>
8,-  DM     Grundgeb&uuml;hr  <BR>
0,05 DM/Min Onlinegeb&uuml;hr <BR>
1,80 DM/Std Telefongeb&uuml;hr<BR>
2 Freistunden</LI>
<LI><B>Provider 2:</B> Keine Onlinegeb&uuml;hren<BR>
29,- DM      Grundgeb&uuml;hr <BR>
0,00 DM/Min Onlinegeb&uuml;hr <BR>
1,80 DM/Std Telefongeb&uuml;hr<BR>
0 Freistunden</LI>
<LI><B>Provider 3:</B> Keine Telefongeb&uuml;hren<BR>
19,90 DM     Grundgeb&uuml;hr<BR>
0,05 DM/Min Onlinegeb&uuml;hr<BR>
0,00 DM/Std Telefongeb&uuml;hr<BR>
3 Freistunden
</LI></UL>


<center>
<img src="../amz0399/images/provider.gif" border=0 alt="Illustration" width=446 heigth=258>
</center>

<P><B>Sind Sie ein Wenigsurfer mit 5 Stunden pro Monat, zahlen Sie bei:</B></P>

<TABLE BORDER=0>
<TR>
	<TH>Provider 1:</TH>
    <TD>8 DM + 3h * 60min * 0,05 DM + 5h * 1,80 DM</TD>
    <TD>= 26,00 DM</TD>
</TR>
<TR>
	<TH>Provider 2:</TH>
    <TD>29 DM + 0 + 5h * 1,80 DM</TD>
    <TD>= 38,00 DM</TD>
</TR>
<TR>
	<TH>Provider 3:</TH>
    <TD>19,90 DM + 2h * 60min * 0,05 DM  + 0</TD>
    <TD>= 25,90 DM</TD>
</TR>
</TABLE>

<P><B>Sind Sie ein Normalsurfer mit 15 Stunden pro Monat, zahlen Sie bei:</B></P>

<TABLE BORDER=0>
<TR>
	<TH>Provider 1:</TH>
	<TD>8 DM + 13h * 60min * 0,05 DM + 15h * 1,80 DM</TD>
	<TD>= 74,00 DM</TD>
</TR>
<TR>
	<TH>Provider 2:</TH>
	<TD>29 DM + 0 + 15h * 1,80 DM</TD>
	<TD>= 56,00 DM</TD>
</TR>
<TR>
	<TH>Provider 3:</TH>
	<TD>19,90 DM + 12h * 60min * 0,05 DM  + 0</TD>
	<TD>= 55,90 DM</TD>
</TR>
</TABLE>

<P>Somit w&auml;re der teuerste Provider bei 5 Stunden/Monat jetzt schon fast
der billigste! Und einer der billigen entpuppt sich als der teuerste!</P>

<p><b>Sind Sie ein Vielsurfer mit 30 Stunden pro Monat, zahlen Sie bei:</b></p>

<TABLE>
<TR>
<TH>Provider 1:</TH>
<TD>8 DM + 28h * 60min * 0,05 DM + 30h * 1,80 DM</TD>
<TD>= 146,00 DM</TD>
</TR>
<TR>
<TH>Provider 2:</TH>
<TD>29 DM + 0 + 30h * 1,80 DM</TD>
<TD>=  83,00 DM</TD>
</TR>
<TR>
<TH>Provider 3:</TH>
<TD>19,90 DM + 27h * 60min * 0,05 DM  + 0</TD>
<TD>= 100,90 DM</TD>
</TR>
</TABLE>

<P>So richtig kompliziert wird das Ganze, wenn noch die Abrechnungstakte
unterschiedlich sind, z.B. sekundengenau und minutengenau. Sehr leicht
schleichen sich dann Rechenfehler ein.</P>

<P>Wenn Sie die Rechnungen f&uuml;r jeden Provider, der &uuml;briggeblieben ist,
durchf&uuml;hren und in ein Schaubild &uuml;bertragen, k&ouml;nnen Sie ablesen, wann
ein Anbieter sich f&uuml;r Ihre Anforderungen lohnt. Im vorliegenden Beispiel
ist Provider 1 bis 5 Onlinestunden/Monat am g&uuml;nstigsten, Provider 3 ab 5
bis 15 Onlinestunden/Monat und Provider 2 ab 15 Onlinestunden/Monat.</P>

<h3>Fazit</h3>

<P>Vergleichen Sie sehr genau und rechnen Sie immer Ihr eigenes Beispiel
durch. Irgendwelche Pauschalaussagen, wie &quot;g&uuml;nstigster Onlinetarif&quot;, sind
vielleicht an sich nicht falsch, aber f&uuml;r Ihren Anwendungsfall mit gr&ouml;&szlig;ter
Wahrscheinlichkeit schon. Pr&uuml;fen Sie auch nach Vertragsabschlu&szlig; immer
wieder die Tarife und, viel wichtiger, Ihre Anspr&uuml;che an den Zugang. Diese
werden sich mit Sicherheit auch &auml;ndern. Bleiben Sie nicht aus Gewohnheit
bei einem Provider, spielen Sie sie gegeneinander aus. Die machen das mit
Ihnen genauso. Aber verfangen Sie sich dabei nicht in den Geb&uuml;hrenfallen!</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903in2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903nw.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


