<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - YAM 2.0 Beta 4</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>YAM 2.0 Beta 4 - Test</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>
<P>
Das eMail-Programm YAM d&uuml;rfte f&uuml;r jeden Amiga-Anwender ein Begriff sein,
der je eine eMail geschrieben hat, vor allem da es <B>Freeware</B> ist, also
nichts kostet.</P><P>
Seit geraumer Zeit gibt es nun eine &ouml;ffentliche <B>Beta</B> der Version 2.0
(inzwischen schon die Vierte), die den Funktionsumfang und das Outfit
von YAM erheblich erweitert. Mit dieser zuletzt ver&ouml;ffentlichten Version
ist YAM 2.0 nun auch auf meinem Rechner benutzbar geworden, so da&szlig; ich
den ersten Eindruck beschreiben kann.</P><P>
Die <B>Installation</B> ist unproblematisch und nat&uuml;rlich, wie es sich geh&ouml;rt,
mit dem Installer zu erledigen. Auch ein Update von YAM 1.3x auf 2.0 ist
unproblematisch, alle Konfigurationsdaten bleiben erhalten.</P><P>
Schon beim <B>Start</B> f&auml;llt auf, da&szlig; es nun l&auml;nger dauert, bis YAM geladen
ist. Dies liegt vor allem daran, da&szlig; man YAM jetzt bereits beim Start die
Postf&auml;cher einlesen lassen kann. Im Gegensatz zur vorherigen Version 1.3
geschieht das aber wesentlich schneller, da mu&szlig;te man bei einem
umfangreichen Postfach schon mal einige Zeit warten.</P><P>
Besonders positiv f&auml;llt auch auf, da&szlig; die <B>Bedienoberfl&auml;che</B> nicht mehr so
hausbacken aussieht, sondern durch ein Toolbar eine effektive Arbeit
erm&ouml;glicht. Alle wichtigen Funktionen sind so sofort zu erreichen.
Dank MUI kann man nun auch wirklich jeden Aspekt der YAM-Oberfl&auml;che
konfigurieren, sogar bis hin zu den angezeigten Spalten und deren Breite.</P><P>
&Uuml;berhaupt sind die <B>Konfigurationsm&ouml;glichkeiten</B> geradezu &uuml;berw&auml;ltigend,
am besten, man &uuml;bernimmt die alte Konfiguration von YAM 1.3x und
erweitert dann nach und nach.</P><P>
Viele der Einstellungen sind au&szlig;erdem im MUI-Einsteller f&uuml;r YAM
verborgen, z.B. die Konfiguration des internen Texteditors, der Toolbars,
und einiges mehr. Diese zu suchen und zu finden, kann schon zu einem
Abenteuer ausarten. Mit der sehr guten und umfangreichen Online-Hilfe
d&uuml;rfte aber auch ein Einsteiger eine Konfiguration ohne gro&szlig;e Probleme
hinbekommen.</P><P>
Ich empfehle unbedingt die <B>Hilfe</B> zu lesen, erstens als gutes Beispiel
einer Anleitung, zweitens um einen &Uuml;berblick &uuml;ber die vielf&auml;ltigen
M&ouml;glichkeiten des Programms zu bekommen. Die Hilfe ist &uuml;brigens
kontextsensitiv, das hei&szlig;t, man braucht nur in der aktuellen
Einstellerseite die HELP-Taste zu dr&uuml;cken, schon erscheint eine
AmigaGuide-Hilfe zu dem betreffenden Thema.</P><P>
Das <B>Adressbuch</B> pr&auml;sentiert sich jetzt als eine richtige Adress-Datenbank,
mit optionalem Portrait, Geburtstags-Check beim Start und mehr. Anlagen
zur eMail lassen sich per externem Packer (z.B. Lha) automatisch zu einem
Archiv einpacken. Auch eine PGP-Einbindung ist vorhanden. Die Postf&auml;cher
k&ouml;nnen au&szlig;erdem mit den XPK-Libraries komprimiert/verschl&uuml;sselt werden.
</P><P>F&uuml;r die ausstattungss&uuml;chtige Spielernatur kann man selbstverst&auml;ndlich
auch farbigen Text erzeugen, ARexx-Makros f&uuml;r alle erdenklichen
Situationen einbinden und beliebige Signaturen und Cookies unter
die EMail setzen.</P><P>
Ein wichtiges Feature f&uuml;r Amigas mit mehreren Benutzern ist die Verwaltung
von mehreren <B>eMail-Konten</B>. Damit kann man eMails verwalten, ohne da&szlig; jeder
Nutzer die Mail des anderen zu Gesicht bekommt. Auch ein anonymisieren der
eMail &uuml;ber einen solchen Dienst im Netz ist m&ouml;glich, wenn man so etwas
&uuml;berhaupt nutzen will.</P><P>
Es stehen insgesamt 48 m&ouml;gliche Postf&auml;cher zur Verf&uuml;gung, die User sind
auf maximal 16 beschr&auml;nkt, was f&uuml;r eine Familie oder WG durchaus reicht,
allerdings beim B&uuml;roeinsatz schnell an seine Grenzen
st&ouml;&szlig;t.</P><P>
Diese <B>Featuritis</B> hat nat&uuml;rlich ihren Preis: Ein MC68020 und mindestens
2 MB freies (!) RAM mu&szlig; es schon sein. Nat&uuml;rlich auch Kickstart/Workbench
3.0 und MUI 3.8. Au&szlig;erdem ben&ouml;tigt man einen eMail-Account und die n&ouml;tige
Zugangssoftware, z.B. einen Internetprovider und Miami, um eMails versenden
zu k&ouml;nnen. Wenn man diese Voraussetzungen aber erf&uuml;llt, macht eMail auch so
richtig Spa&szlig;, vor allem bei dem Preis.</P><P>
Was <B>nicht integriert</B> ist, und laut Autor auch nie integriert werden wird,
ist eine Newsreaderfunktion. F&uuml;r einige User ist dies ein Kriterium, YAM
nicht zu benutzen, genauso wie die Verwendung von MUI. Aber da begebe ich
mich schon auf das Terrain von Glaubenskriegen...</P><P>
Zum Schlu&szlig; noch einmal ausdr&uuml;cklich der Hinweis, da&szlig; die derzeitige
Version noch nicht die endg&uuml;ltige ist. Aber sie ist schon so stabil und
ausgereift, da&szlig; ein Test auf dem eigenen Rechner nicht schaden kann.
Nutzen Sie die M&ouml;glichkeit und unterst&uuml;tzen Sie engagierte Amiga-
Entwickler!</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>YAM</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="mailto:mbeck@access.ch">Marcel Beck</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>eMail-Programm</TD>
    <TD><B>Version:</B></TD>
    <TD>2.0 Beta 4</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>Freeware</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.yam.ch">YAM-Homepage</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>
<BR>
Die Betaversion ist nur erh&auml;ltlich auf Marcel Becks YAM-Homepage,
die Vollversion wird wohl alle Vertriebswege nehmen (Aminet, diverse
PD-Sampler und Diskettenserien).

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz0698/woa98.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806year.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
