<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - Das Jahr 2000 - ein Computerproblem?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Das Jahr 2000 - ein Computerproblem?</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>
<P>
Jede Woche h&ouml;rt man davon, vom Jahr 2000 und vor allem in
Verbindung mit dem Computer. Probleme seien zu erwarten, h&ouml;rt man;
falsche Zinsberechnungen, ungerechtfertigte Mahnungen und ein
Milliardenaufwand, um all dies nicht Wirklichkeit werden zu lassen.
</P>
<H2>Der PC</H2>
Wo liegt das Problem?

<P>Der normale PC, also die Nachkommen von IBMs AT-Rechner, speichern ihr
Datum mit jeweils zwei Stellen f&uuml;r Tag, Monat und Jahr. Bis zum 31.
Dezember 1999, 23 Uhr, 59 Minuten und 59 Sekunden ist die Welt noch in
Ordnung, in der n&auml;chsten Sekunde beginnt der Weltuntergang f&uuml;r einige
Firmen, deren Rechner nicht rechtzeitig f&uuml;rs Jahr 2000 tauglich gemacht
wurden. Nach einigen Nachrichtenagenturen steht Deutschland hier mit
v&ouml;llig unvorbereiteten Beh&ouml;rden als unr&uuml;hmliches Schlu&szlig;licht da. Das
Problem sei bekannt, aber kein Budget vorhanden, so die Begr&uuml;ndung.</P>
<P>Was wird passieren?</P>
<P>Einige &auml;ltere Rechner, und dazu geh&ouml;ren durchaus auch ein paar schnelle
486er-Boards, die noch in Gebrauch sind, schalten dann die Jahreszahl
auf &quot;00&quot; um. Ist eine Software nicht intelligent genug, um festzustellen,
da&szlig; das Jahr 1900 vor dem eigenen Herstellungsdatum liegt und deswegen
das Jahr 2000 das richtige sein mu&szlig;, kommen alle Berechnungen
durcheinander, die mit dem Datum zu tun haben.</P><P>
Je nachdem, wo ein Rechner eingesetzt wird, hat man pl&ouml;tzlich 99 Jahre
lang zuviel Mitgliedsbeitr&auml;ge an den Verein gezahlt, steht auf dem neuen
Ausweis pl&ouml;tzlich ein Alter von MINUS 77 Jahren, oder verlangt das
Finanzamt eine Steuernachzahlung &uuml;ber 98 Jahre...</P><P>
Aber zwischen Programm und Hardware steht ja noch das Betriebssystem.
Ist dieses clever genug, k&ouml;nnen auch alte Programme durchaus noch
funktionieren. Wenn die Programme denn auch das Datum vom Betriebssystem
beziehen; wenn sie die Hardware direkt auslesen, ist wieder nichts
gewonnen.</P><P>
Dummerweise hat Microsoft vor kurzem zugeben m&uuml;ssen, da&szlig; alle seine
Betriebssysteme einschlie&szlig;lich Windows 95 und NT, nicht ganz f&uuml;rs Jahr
2000 taugen. Diese Ank&uuml;ndigung kommt gerade recht zur Markteinf&uuml;hrung
von Windows 98, was wieder die besondere Marketingstrategie von Microsoft
betont: Wenn ihr nicht updaten wollt, dann geben wir euch eben einen guten
Grund.</P>
<H2>Der Amiga</H2>
<P>Bei soviel Verunsicherung in der Wintel-Welt fragt man sich als Amiganer
doch, ob es auch f&uuml;r unsereins gef&auml;hrlich werden kann. Zuerst einmal ist
beruhigend, da&szlig; keine Beh&ouml;rde und keine Firma Amigas im B&uuml;ro einsetzt,
einfach mangels B&uuml;rosoftware. Die Firmen, die doch auf dem Amiga
B&uuml;rosoftware betreiben, kann man an einem Finger abz&auml;hlen. Es steht also
schon von der Infrastruktur her nicht zu erwarten, da&szlig; ein Amiga f&uuml;r eine
Fehlberechnung verantwortlich sein wird.</P>
<P>Zudem speichert der Amiga sein Datum v&ouml;llig anders. Alles l&auml;uft &uuml;ber
Sekunden ab, die vom 1.1.1978, 00:00:00 Uhr an hochgez&auml;hlt werden. Damit
ist eine Zeitspanne m&ouml;glich, die minimal 68 Jahre abdeckt. Genau in der
Nacht zum 19. Januar 2046 wird die Systemzeit dann negativ, denn so wird
sie vom System geliefert - als Zahl mit Vorzeichen. Uns wird das Problem,
das der Amiga dann vielleicht bekommt, aber bestimmt nicht mehr
interessieren.</P><P>
Besorgt man sich als Programmierer das Datum vom System, dann erh&auml;lt man
tats&auml;chlich eine vierstellige Jahreszahl. Allerdings nur, wenn man die
richtige Funktion benutzt. Das bekannte &quot;Date&quot;-Kommando kennt z.B. nur
zwei Stellen f&uuml;r das Jahr, es wird also sp&auml;testens beim &Uuml;bergang ins Jahr
2078 versagen, da dann das Jahr nicht mehr korrekt in die Sekunden
umgerechnet wird, es kann ja nicht zwischen 1978 und 2078 unterscheiden.
Auch das wird unsereins nicht mehr interessieren.</P><P>
Trotzdem ist das alles halb so schlimm. Kein Amiganer wird sich blind auf
seine Systemuhr verlassen, zum einen, weil er vielleicht gar keine hat
(A500, A1200 ohne Aufr&uuml;stung), oder weil er aus Erfahrung wei&szlig;, da&szlig; sich
das Ding sowieso immer nach Lust und Laune verstellt. So &auml;rgerlich diese
Sache immer war, jetzt, kurz vor dem Jahrtausendwechsel, ist der Amiga-
User dadurch der am wenigsten gef&auml;hrdete.</P><P>
F&uuml;r den Programmierer ist au&szlig;erdem die Datumsverwaltung &uuml;ber Sekunden
so bequem, da&szlig; niemand auf die Idee kommt, das Datum als Zeichenkette
abzuspeichern, au&szlig;er vielleicht eine portierte Software.</P><P>
Der gro&szlig;e Vorteil der Sekunden besteht darin, da&szlig; man nur zwei Zahlen
vergleichen braucht und schon wei&szlig; man, welches das neuere Datum ist.
Kein umst&auml;ndliches Konvertieren von Zeichenketten zu Zahlen und umgekehrt.
Der Nachteil ist allerdings, da&szlig; das System negative Werte zur&uuml;ckliefern
kann, was sich bei nachl&auml;ssig programmierter Software fatal auswirken
kann.</P>
<H2>Fazit</H2>
<P>Beim Jahr-2000-Problem ist Panik v&ouml;llig fehl am Platz. Selbst mit dem PC
werden die allerwenigsten Heimanwender &uuml;berhaupt damit in Kontakt kommen.
Nur Firmen und Beh&ouml;rden, die auf ein korrektes Datum angewiesen sind,
m&uuml;ssen sich rechtzeitig um ein sicheres System k&uuml;mmern. Aber darauf hat
man als Privatmensch keinen Einflu&szlig;; man kann sich erst wehren, wenn die
Mahnung &uuml;ber hundert Jahre Zahlungsverzug auf dem Tisch liegt.</P>
<P>Ein kleines <B>Bonbon</B> zum Schlu&szlig;:</P>
<P>Das mit dieser Ausgabe mitgelieferte <A HREF="../amz0698/bin.lha">Programm</A>
&quot;y2k&quot; zeigt die verschiedenen Datumsausgaben an. Mit dem Date-Kommando, oder
dem Uhrzeit-Voreinsteller der Workbench kann sich jeder selbst davon &uuml;berzeugen, was
zu welcher Zeit im System geschieht. Das Programm kann &uuml;ber Workbench
oder Shell gestartet werden.</P>

Beispielausgabe des Programms:
<PRE>
   Shell> y2k
   Systemsekunden: 641565669
   DOS-Datum:      Freitag, 01-Mai-98  - 12:41:09
   Utility-Datum:  Freitag, 01.05.1998 - 12:41:09

   Shell> y2k
   Systemsekunden: -2081612466
   DOS-Datum:      Donnerstag, 20-Feb-48  - 12:47:10
   Utility-Datum:  Donnerstag, 20.02.2048 - 12:47:10
</PRE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806yam.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806fo.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
