<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - Genetic Species</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Genetic Species</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Genetic Species von Vulcan Software wurde von dem d&auml;nischen Team &quot;Marble
Eyes&quot; entwickelt und ist ein weiterer Vertreter der D**M-Klones. Und es
will nicht irgendeiner dieser sein, sondern DAS Spiel, welches neue
Standards setzen kann.</P><P>
Die minimalen <B>Voraussetzungen</B> sind AGA, Festplatte, 2-fach CD-ROM-
Laufwerk, sowie 8 MByte Speicher. Unterst&uuml;tzt werden schnelle CPU`s
ebenso, wie Grafikkarten (CyberGfx und Picasso96) und Soundkarten (!)
per AHI-Treibersystem.</P><P>
Streifen wir kurz den <B>Hintergrund</B>: Im Jahre 2208 haben sich diverse
Firmenimperien gebildet, die ihre Machtk&auml;mpfe und kriegerischen Konflikte
auch im All austragen.  Die entmachteten Nationen der Erde versuchen mit
einer Spezialeinheit dagegenzuhalten und haben ihre neueste Geheimwaffe,
einen sogenannten <B>K&ouml;rperwechsler</B> in eine feindliche Basis auf einem
Asteroiden eingeschleust.</P><P>
Der hat nun bestimmte <B>Missionen</B> zu erf&uuml;llen und kann dabei und das ist
durchaus eine originelle Idee im Genre, andere K&ouml;rper &uuml;bernehmen, w&auml;hrend
man den alten saft- und kraftlos zusammensacken sieht. Ja, manchmal wird
es sogar zur Notwendigkeit, denn zum Beispiel lassen sich manche T&uuml;ren nur
durch spezielle Personen &ouml;ffnen, die eine Berechtigung dazu haben.</P><P>
Doch zuerst kommt nat&uuml;rlich der <B>Vorspann</B> und der ist von L&auml;nge und
Qualit&auml;t sicher mit das Beste, was einem bisher auf dem Amiga angeboten
wurde. In einer langen gerenderten Animation darf man hei&szlig;e Raumk&auml;mpfe
bewundern, nach denen der K&ouml;rperwechsler schlie&szlig;lich sicher an seinen
Bestimmungsort gebracht wird.</P><P>
Dann startet man eingeloggt in einem der Terminals, die hier und da in
den R&auml;umlichkeiten anzufinden sind. Das hei&szlig;t man ist also praktisch im
Hauptmen&uuml;, von dem aus einem die <B>Optionen</B> offenstehen. Und derer sind
viele.</P><P>
Hier kann man unter anderem <B>Levelcodes</B> eingeben oder ein gespeichertes
Spiel laden. Speichern kann man nur, wenn man w&auml;hrend des Spielverlaufs
eines der hell leuchtenden Symbole einsammelt, die man an gew&uuml;nschter
Stelle aktiviert. Von hier aus kann dann also zuk&uuml;nftig gestartet werden.</P><P>
Unter <B>CONFIG SETTINGS</B> stehen in weiteren Untermen&uuml;s zahlreiche
Einstellm&ouml;glichkeiten bereit, u.a. die Helligkeit, ob das Multitasking
w&auml;hrend des Spiels aktiviert bleiben soll, die Sprache und der
Schwierigkeitsgrad.</P><P>
Bei <B>ENGINE SETTINGS</B> gibt es zuerst das Untermen&uuml; <B>GAME SETTINGS</B>. Hier ist
die Fenstergr&ouml;&szlig;e zwischen 128x100 und 320x250 einstellbar, die Verwendung
von Texturen und der Grafikmodus (AGA oder Grafikkarten).</P><P>
Bei <B>AUDIO SETTINGS</B> ist die M&ouml;glichkeit, bis zu 16 Stimmen verwenden zu
k&ouml;nnen, erw&auml;hnenswert. Bei <B>PLAYER CONTROL</B> k&ouml;nnen alle Tastenbelegungen
ver&auml;ndert und bei <B>CONTROL SETUP</B> kann die Maus konfiguriert werden.</P><P>
Spielbar ist also nicht nur mit Tastatur, sondern auch mit der Maus.</P><P>
Die <B>Installation</B> erscheint relativ problemlos, denn normalerweise gibt es
nicht viel zu installieren. Es wurde ein UseCDlibs-Skript mitgeliefert,
das f&uuml;r einen problemlosen Start direkt von der CD sorgen soll. Falls
es zu Problemen kommt, mu&szlig; man das RTG- und das AHI-System auf der
Festplatte installieren.</P><P>
Bei einigen CD-Exemplaren der ersten Pressung sind laut Vulcan einige
CD-Audio-Tracks durch St&ouml;rger&auml;usche beeintr&auml;chtigt - so auch mein
Testexemplar. Das ist aber abgestellt und w&uuml;rde auch sicher ausgetauscht
werden. Somit ging das nicht in die Wertung ein.</P><P>
<B>Nun aber zum eigentlichen Spiel:</B></P><P>
Und hier mu&szlig; man in altgewohnter Manier in der Ich-Perspektive mit der
Waffe in der Hand durch die Gegend streifen, um bestimmte Missionsziele
zu erf&uuml;llen. Dabei kommen einem nat&uuml;rlich die unterschiedlichsten
Kreaturen, wie Wachleute, Roboter und Zombies in die Quere, die nichts
Gutes im Sinn haben und die man bek&auml;mpfen mu&szlig;. Dazu hat man diverse
Schu&szlig;waffen zur Verf&uuml;gung, die man im Verlauf des Spiels durch
schlagkr&auml;ftigere ersetzen kann, wenn man sie denn findet.</P><P>
Allerdings kann man nur drei Gegenst&auml;nde gleichzeitig bei sich tragen,
zwischen denen man mit F1-F3 wechseln kann. Wichtig ist auch gen&uuml;gend
Munition einzusammeln, um sich wehren zu k&ouml;nnen. Hier und da liegen
Schl&uuml;ssel, die man ben&ouml;tigt, um weiterzukommen oder Schalter m&uuml;ssen
bet&auml;tigt werden.</P><P>
<B>Hilfreich</B> ist eine transparente Karte, die man sich in sein Sichtfeld
einblenden und stufenlos vergr&ouml;&szlig;ern und verkleinern kann. Ein, neben
dem erw&auml;hnten, f&uuml;r den Spielverlauf wichtigen K&ouml;rperwechseln, weiteres
originelles Merkmal von Genetic Species ist, da&szlig; man ein <B>drittes Auge</B>
besitzt. Das bedeutet, da&szlig; es m&ouml;glich ist einige Sekunden in die Zukunft
zu schauen, bzw. mit der DEL- und den Cursor-Tasten und einer etwas
invertierten Sicht, bereits zu sehen, was einen erwarten w&uuml;rde, wenn
man jetzt in diese Richtung l&auml;uft.</P><P>
<B>Das Ganze</B> macht einen stimmigen Eindruck, gute Soundeffekte und eine
wirklich sch&ouml;ne CD-Musik sorgen f&uuml;r den wichtigen Klanghintergrund,
w&auml;hrend auf der visuellen Seite eine Grafikengine f&uuml;r Furore sorgt,
die ihre Vorl&auml;ufer alt aussehen l&auml;&szlig;t und als erste in einigen
Aspekten mit wichtigen PC-Pendants mithalten kann.</P><P>
Auf einem A 4000-030 mit AGA ist 192x150 gerade noch gut spielbar
und bietet dabei ansprechende Grafik mit sch&ouml;nen Texturen und vielen
Lichteffekten. Wichtig ist auch die Darstellung der Gegner. Sie
machen einen recht &quot;lebendigen&quot; Eindruck und wirken nicht so
&quot;Schaufensterpuppenhaft&quot;, wie bei einigen Konkurrenzprodukten.</P><P>
Die <B>Lichteffekte</B> spielen eine gro&szlig;e Rolle f&uuml;r die Atmosph&auml;re. Die
D&uuml;sterkeit wird unterstrichen, wenn die Lichter flackern, man durch den
Schein einer Neonr&ouml;hre tritt, oder der Schu&szlig; einer Energiewaffe einen
dunklen Korridor ausleuchtet. Noch viele weitere Details sorgen f&uuml;r
Stimmung: Sirrende Laserbarrieren, Dampfschwaden aus sich drehenden
Ventilatoren oder transparente, flie&szlig;ende Fl&uuml;ssigkeiten und Tropfen
von der Decke sollen nur eine Auswahl darstellen.</P><P>
Die <B>Steuerung</B> geht auch in Ordnung, au&szlig;er da&szlig; es keine M&ouml;glichkeit gibt,
den Blickwinkel kurzzeitig nach oben oder unten zu ver&auml;ndern. Schade auch,
da&szlig; es nur an den Computerterminals, auf die man gelegentlich trifft,
m&ouml;glich ist, die Optionen zu &auml;ndern.</P><P>
Die Anleitung ist auf der CD in vielen Sprachen verf&uuml;gbar, so auch in
Deutsch. Im Spiel selbst sind die Men&uuml;s in meiner Version noch Englisch,
die Zwischentexte schon Deutsch, das l&auml;&szlig;t sich aber per kostenlosem
Update korrigieren. Die Zeit hatte wohl bei der ersten Produktion nicht
mehr ausgereicht.</P><P>
Es handelt sich bei Genetic Species um ein rundum gelungenes Spiel,
welches sich durch gute Pr&auml;sentation, gute Spielbarkeit, gute Hardware-
Unterst&uuml;tzung, guten Sound und gute Grafik auszeichnet. Tats&auml;chlich
ist es im Moment das Beste seiner Art auf dem Amiga.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Genetic Species</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.vulcan.co.uk">Vulcan Software</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>D**M-Klone</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ca. 90 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>1</TH></TR>
</TABLE></P><BR>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806fo.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9806hw.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
