<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - Final Odyssey</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Final Odyssey</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P>Der volle Titel dieses Spiels lautet &uuml;brigens: &quot;Peter Spinaze`s FINAL
ODYSSEY - Theseus Versus The Minotaur&quot;. Soviel Zeit mu&szlig; sein. :)</P><P>
Als erstes wie immer zu den <B>Voraussetzungen</B>: Final Odyssey l&auml;uft auf
allen Amigas mit Festplatte und 2 MByte RAM (davon 1 MByte ChipRAM),
sowie einem 2fach CD-Rom-Laufwerk. Schnellere Laufwerke werden
unterst&uuml;tzt. Das gilt auch f&uuml;r AGA, mehr Speicher und schnellere
Prozessoren. F&uuml;r 020er aufw&auml;rts steht ein neukompiliertes Programmfile
zum Starten bereit.</P><P>
Es geht, um kurz den <B>Hintergrund</B> zu streifen, um den lieben Theseus,
der sich aufmacht, ein paar holde Maiden zu befreien, die von dem b&ouml;sen
Minotaurus in seinem riesigen Labyrinth gefangengehalten werden.</P><P>
Wenn ihm das gelungen ist, wird er nat&uuml;rlich auch den Minotaurus
fertigmachen. Allerdings, ich habe es schon erw&auml;hnt, steht dem noch
etwas entgegen: das Labyrinth. Und das hat es in sich.</P><P>
Dieses macht einem ein <B>Intro</B> mit einigen Rendersequenzen klar, die
leider teilweise ein wenig mittelm&auml;&szlig;ig wirken. Die Spielgrafik selbst
hat damit aber gl&uuml;cklicherweise nichts zu tun.</P><P>
<B>Theseus</B> ist ein kleiner, etwas pummelig wirkender und gut animierter
Krieger in griechischer R&uuml;stung, der mit wehendem Umhang und am Anfang
mit einer Armbrust ausger&uuml;stet, durch die pseudo-dreidimensionale
Gegend stapft.</P><P>
Zahllose G&auml;nge gilt es zu durchschreiten, T&uuml;ren mit zuvor gefundenen
Schl&uuml;sseln zu &ouml;ffnen, Schalter zu bet&auml;tigen, Beamer (zwei Standorte
sind immer miteinander verbunden) zu benutzen und R&auml;tsel zu l&ouml;sen.</P><P>
Nicht nur Selbstschu&szlig;anlagen versuchen ihn daran zu hindern - nein,
die Waffe will ja schlie&szlig;lich auch eingesetzt sein - auch diverse
W&auml;chter wollen ihm ans Leder seiner atmungsaktiven Sandalen. Es gibt
drei verschiedene, von den `normalen` Rittern, die sich nach dem
&quot;Aus dem Weg r&auml;umen&quot; immer wieder reproduzieren, &uuml;ber die sich
verfl&uuml;ssigenden Kreaturen (die in diesem Zustand nicht angreifbar
sind), bis zu den aus Wandverstecken hervorbrechenden Monstern.</P><P>
Daf&uuml;r bleibt Theseus aber nicht nur die, mit unendlicher Munition
best&uuml;ckte Armbrust, sondern u.a. auch Plasma- und Maschinengewehr,
sowie Zeitbomben r&uuml;sten ihn standesgem&auml;&szlig; auf. Er ist halt
zukunftsorientiert. Netter Effekt sind &uuml;brigens die in der
&quot;Einrichtung&quot; steckenbleibenden Pfeile der Armbrust.</P><P>
Hier und dort kann er Geld einsammeln und findet ab und zu Schriftrollen,
deren Inhalt in einer Laufschrift in lupenreinem Deutsch (wie das ganze
Spiel) erscheint. Hierbei handelt es sich meist um Tips, die f&uuml;r den
Spielverlauf wichtig sein k&ouml;nnen.</P><P>
Hier und da tun sich Wege in die Katakomben auf, in denen sich so
manches holen l&auml;&szlig;t und die recht geschickt dargestellt werden.</P><p>
Gelegentlich trifft unser Held auch auf andere Charakt&auml;re, mit denen
man &uuml;ber ein einfaches Interface eine ebenso einfache Unterhaltung
f&uuml;hren kann. Sie geben Tips oder auch Gegenst&auml;nde.</P><P>
Was das Spiel wirklich ausmacht, ist nat&uuml;rlich das <B>Labyrinth</B>.
Bodenplatten, die beim Ber&uuml;hren jeweils den Zustand eines entfernt
liegenden Hindernisses ver&auml;ndern; Schalter, die mit Bet&auml;tigen den
Zustand des gegenw&auml;rtig sichtbaren teilweise &quot;umschalten&quot;; versteckte
T&uuml;ren und zahllose R&auml;tsel, bergen Stoff f&uuml;r lange R&auml;tselstunden.
</P><P>Das ganze ist etwas gew&uuml;rzt mit ein wenig <B>Action</B> (Peng, Peng!) und
recht stimmigen Soundeffekten plus einer ansehnlichen, liebevoll
gestalten Grafik, die neben netten Effekten, wie `funktionierenden`
Spiegeln, die man auch zerschiessen kann, auch zweckm&auml;&szlig;ig ist.</P><P>
Im ganzen Spiel gibt es allerdings keine <B>Musik</B>. Daf&uuml;r kann man sich
von der CD einen Titelsong aufrufen (kein CD-Audio), w&auml;hrend dessen
Abspielen sich langsam ein Bild des Minotaurus aufbaut. Und bei der
Musik handelt es sich um einen erstaunlich gut klingenden Pop-Song.
Trotzdem dr&uuml;ckt es leicht auf die Wertung.</P><P>
Nat&uuml;rlich kann man Spielst&auml;nde sichern und laden. Die <B>Dokumentation</B>
wird von der CD mit einem eigenen Programm angezeigt, nicht genormt,
aber an der &Uuml;bersetzung in sieben Sprachen und an der deutschen
Version erst recht, l&auml;&szlig;t sich nichts aussetzen.
</P><P>Die <B>Steuerung</B> ist in Ordnung, auch wenn Theseus nicht mit einem
&quot;Jump`N`Run-Helden&quot; konkurrieren kann, was Flinkheit betrifft, aber
das ist ja auch nicht gewollt.</P><P>
<B>Fazit</B>: F&uuml;r alle Fans von Puzzler&auml;tseln sehr zu empfehlen, aber nicht
nur. Final Odyssey ist ein qualitativ sehr gutes Spiel, nicht f&uuml;r
eine Runde mal eben so, das ein Probespiel auf jeden Fall verdient.
</P>
<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Final Odyssey</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.vulcan.co.uk">Vulcan Software</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Puzzle-Adventure</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ca. 90 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>2</TH></TR>
</TABLE></P><BR>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806yam.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806gs.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
