<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="&gt;&gt;"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Neues zum AmigaNG</H1>
<H2>1. AmigaDE Player 1.0 f&uuml;r Windows und Linux erschienen</H2>
<P><B>AMIGA, Inc. (<A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>) informiert:</B></P>
<P><B>&raquo;AMIGA gibt Erstver&ouml;ffentlichung seines AmigaDE Players bekannt</B></P>
<P>
24.Oktober 2001 - Snoqualmie, WA - AMIGA gab heute bekannt, dass es den
AmigaDE Player 1.0 sowohl f&uuml;r Microsoft Windows(r) als auch f&uuml;r Linux
freigegeben hat.
</P>
<P>
Mit dem Player f&uuml;r Amiga Digital Environment ist der erste Schritt getan in
Richtung der Verwirklichung der Vision des &quot;Digital HabitatTM&quot; und er ist
der Kern zur Begr&uuml;ndung bin&auml;rer Portabilit&auml;t und f&uuml;r die &Uuml;bergabe von
Programm-Inhalten an verschiedene Plattformen und Produkte.
</P>
<P>
Der AmigaDE Player entstand in Partnerschaft mit der Tao-Group in Reading,
England, und verwendet als Grundlage das intent(r) Media-System.
</P>
<P>
Durch Verwendung dieser Technologie ist AMIGA in der Lage, den Benutzern
von normalen Desktop-Computern die Zugangsm&ouml;glichkeit zu Anwendungen zu
bieten, die f&uuml;r das Amiga Digital Environment geschrieben wurden, in
n&auml;chster Zukunft aber auch f&uuml;r andere Ger&auml;te, wie zum Beispiel der Compaq
iPaq, der Casio Cassiopeia, der Sharp Zaurus oder das Psion NetBook.
</P>
<P>
Die erste Ausgabe ist f&uuml;r die Plattformen Microsoft Windows und Linux
vorgesehen, die in Entwicklung befindlichen AmigaDE Player f&uuml;r PocketPC,
EPOC, Palm, WinCE und andere Systeme werden in den kommenden Monaten
freigegeben werden.
</P>
<P>
Aktuelle Anwendungsprogramme, die f&uuml;r das Amiga Digital Environment
geschrieben sind, sind gedacht f&uuml;r Handger&auml;te, sie laufen aber auch auf
Desktop-Computern. Die entwickelten Programme sind bin&auml;r &uuml;bertragbar. Die
zur Zeit verf&uuml;gbaren und entwickelten Programme werden auf Set-Top-Boxen,
Informationseinrichtungen, Hand-Computern, Handys und digitalen Fernsehern
laufen.
</P>
<P>
&quot;Wir sehen das als den Beginn einer digitalen Revolution an, wo die
Computer-Erfahrung die Anwendung sehr vereinfacht und die Entwickler sich
mehr auf die Schaffung gro&szlig;er Programminhalte konzentrieren k&ouml;nnen als
darauf, Programme f&uuml;r bestimmte Ger&auml;te zu schreiben&quot;, stellt Bill McEwen,
Pr&auml;sident und CEO von AMIGA Inc. fest. &quot;Anwender k&ouml;nnen Amiga-Inhalte sehen
und verwenden in Autos, Flugzeugen, zu Hause und im B&uuml;ro. Wir stehen erst
am Anfang.&quot;
</P>
<P>
Zusammen mit der Ver&ouml;ffentlichung des AmigaDE Players wurden auch f&uuml;nf
Programme ausgeliefert, um in der neuen Umgebung zu laufen (bitte beachten
Sie die beigef&uuml;gte Pressemitteilung). Amiga hat &uuml;ber 3000 Entwickler, die
Anwendungen f&uuml;r das neue AmigaDE schaffen.
</P>
<P>
Der AmigaDE Player kann im AmigaDE-Shop auf der Website <A HREF="http://de.amiga.com" TARGET="_top">http://de.amiga.com</A>
erworben werden.
</P>
<P><B>&Uuml;ber AMIGA</B></P>
<P>
AMIGA Inc. stellt Entwicklern die Technologie zur Verf&uuml;gung, um Programme
f&uuml;r ein neues Hardware-unabh&auml;ngiges Multi-Media-Betriebssystem zu
schreiben. AmigaDE ist eine Gemeinschaftsentwicklung der Tao Group in
Reading, England und AMIGA Incorporated. Anwendungen, die auf AmigaDE
aufbauen, k&ouml;nnen unver&auml;ndert auf Prozessoren der Typen x86, PowerPC, M
Core, ARM, StrongARM, MIPS R3000, R4000, R5000, SH 3, SH4 und NEC V850
laufen. Das AmigaDE kann aufgesetzt auf Linux, Embedded Linux, Windows 95,
98, 2000, NT, CE und QNX4 laufen. AMIGA hat seinen Stammsitz in Snoqualmie,
Washington, 28 Meile &ouml;stlich von Seattle und unterh&auml;lt B&uuml;ros in der ganzen
Welt. Sie k&ouml;nnen AMIGA &uuml;ber (425) 396-5660 erreichen, oder besuchen Sie uns
im Internet bei <A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A>.
</P>
<P>
Warenzeichen Amiga ist Warenzeichen der AMIGA Inc., intent(TM) ist ein
Warenzeichen der Tao Group Ltd., Digital Habitat ist Warenzeichen von AMIGA
Inc. Linux(R) ist eingetragenes Warenzeichen von Linus Torvalds.
Windows(R), WinCE, PocketPC sind eingetragene Warenzeichen der Microsoft
Corporation, Palm ist Warenzeichen der Palm Inc., EPOC ist Warenzeichen von
Symbian&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
