<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="&gt;&gt;"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(14.10.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Vollversion!</B></P>
<P>
In Zusammenarbeit mit Christoph Kirsch, erm&ouml;glicht die Amiga Arena die
Vollversion von MUIVideo in der Version 2.40!
Mit MUIVideo lassen sich Videosammlungen sehr komfortabel verwalten.
MUIVideo stellt dabei ein Datenbanksystem zur Verf&uuml;gung,welches zahlreiche
Eintr&auml;ge pro Datensatz erlaubt.
</P>
<P>
So sind neben der Angabe von Filmtitel, Original-Titel, Darstellerliste
usw. auch Bewertungen der Filme m&ouml;glich.
</P>
<P>
MUIVideo verf&uuml;gt &uuml;ber hervorragende Druckeigenschaften und eine leicht zu
bedienende Benutzeroberfl&auml;che.&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(17.10.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Interview Aktion!</B></P>
<P>
Mit XBaze in der Version 7 ist eine sehr flexible Datenbank mit einem
einfachen Feld- und Anzeige Editor vor kurzem erschienen!
Die Amiga Arena sprach mit Rafal Kaczmarczyk dem Entwickler von XBaze!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(23.10.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Interview Aktion!</B></P>
<P>
Aus Schweden kommt die GUI &quot;mp3Play&quot;, Carl Svensson der Entwickler stellte
sich im Interview, den Fragen der Amiga Arena!
Die Amiga Arena unterst&uuml;zt den Free und Sharwaremarkt und Ich kann immer
wieder nur an Euch appelieren, unterst&uuml;zt die Entwickler mit Feedback!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(26.10.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Interview Aktion!</B></P>
<P>
Es gibt wohl z. Zeit nur ein Kommerzielles AMIGA Spiel was so &quot;gepflegt&quot;
wird wie PAYBACK von James Daniels!
Leider spiegelt sich die arbeit von James, sich nicht in den Verkaufszahlen
wieder.
</P>
<P>
Aufgrund der hohen Downloads (Updates) die im Vergleich zu den
Verkaufszahlen weit auseinder gehen,    muss man hier wieder davon ausgehen
das eine Grosse Menge von Raupkopien dazuf&uuml;hrt,das die    weiterentwicklung
von PAYBACK sehr gef&auml;hrdet ist!
Im Interview mit der Amiga Arena erz&auml;hlte mir James was das Update 6 noch
mit sich bringen wird!
Sollten sich die Verkaufszahlen nicht positiv ver&auml;ndern, werden wir wohl in
Zukunft auf einen sehr talentierten &quot;Nachwuchs&quot; Entwickler f&uuml;r den Amiga
verzichten m&uuml;ssen!
</P>
<P>
Besonderen Dank an Christian B. der es erm&ouml;glicht das die Interviews in
Deutsch sowie English online sind!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(27.10.2001)</H3><BR>
</P>
<P><B>Amiga Arena - &quot;Uropa&sup2; HD&quot; Vollversion!</B></P>
<P>
Mit der Genehmigung von Stephen Smith (Austex Software) erm&ouml;glicht die
Amiga Arena die Vollversion von Uropa2 (Shareware Version 2.0)
Uropa&sup2; ist ein auf isometrischer 3D-Grafik und Lightsource Verktorgrafik
basierendes Spiel. Der Handlungsschauplatz ist der Mond von Uropa. Bek&auml;mpfe
die b&ouml;sen Kapones und finde ihren f&uuml;hrenden Kopf, der f&uuml;r ihre Handlungen
verantwortlich ist!
Zum Download liegt die Aminet Version von Uropa&sup2; sowie das Amiga Arena
Archiv mit dem Keyfile,Deutschem Guide und Katalog Dateien bereit!
Hinweis: Exklusiv befindet sich die Final Uropa&sup2; CD Version 3.0 von Vulcan
Software vertrieben, als Vollversion auf der <A HREF="http://www.amigafuture.de" TARGET="_top">http://www.amigafuture.de</A>
Amiga Future Leser CD 33
Exklusiv II:
F&uuml;r alle Besitzer der Orginal CD befinden sich alle Final Updates f&uuml;r
Uropa&sup2; ebenfalls zum Download bereit!
I/nklusive einem neuen Installer f&uuml;r die CD Version von Stephen S.!!/
Besonderen Dank an  Stephen Smith f&uuml;r die Unterst&uuml;zung sowie Gerd F. der
die Shareware Version zur Verf&uuml;gung gestellt hat!
Viel Spass mit einer weiteren Kommerziellen Vollversion w&uuml;nscht Ihnen die
Amiga Arena!
</P>
<P>
Neben Uropa2 befinden sich weitere Kommerzielle Spiele wie Burnout,Blade
und The Prophet zum freien Legalen Download bereit!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(28.10.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Interview Aktion!</B></P>
<P>
Mit EvenMore existiert f&uuml;r den Amiga ein guter Freeware Textanzeiger der in
der aktuellen Version jetzt auch &uuml;ber Plugin Module f&uuml;r MsWord,AmigaGuide
u.a.) verf&uuml;gt.
</P>
<P>
Die Amiga Arena sprach mit Chris Perver,dem Entwickler &uuml;ber die Zukunft von
EvenMore, warum UAE so wichtig f&uuml;r Ihn ist und weitere Interesante aussagen
zum Amiga!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(01.11.2001)</H3><BR>
</P>
<P><B>Amiga Arena - Sonderpreis Aktion mit VisualPrefs!</B></P>
<P>
In zusammenarbeit mit Massimo Tantignone erm&ouml;glicht die Amiga Arena einen
Sonderpreis f&uuml;r VisualPrefs!
Mit Visual Prefs k&ouml;nnen Sie individuell die Oberfl&auml;che jedes Bildschirms,
der von Ihren Anwendungen ge&ouml;ffnet wurde, konfigurieren.
Ebenso wie das globale Aussehen der Oberfl&auml;che.
Amiga Arena in eigener Sache:
Die Shareware Geb&uuml;hr ist so gering das ich hoffe,das User die Vprefs nutzen
es aber noch nicht Registriert haben dies mit dieser Aktion nachholen!
Mit VPrefs steht uns das m&auml;chtigste Tool zur Verf&uuml;gung um unsere WB so
individuell wie m&ouml;glich zu gestalten!
</P>
<P><B>Amiga Arena - Interview Aktion!</B></P>
<P>
Nachdem VisualPrefs in der Version 41.29 vorliegt sprach die Amiga Arena
mit Massimo Tantignone &uuml;ber seine Arbeiten f&uuml;r AmigaOS 3.9 und die Zukunft
f&uuml;r OS 4.0!&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
