<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="&gt;&gt;"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn Ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<H2>1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren</H2>
<P>
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>
</P>
<P><B>Die Frage des letzten Monats lautete:</B></P>
<P>
&raquo;Hat deiner Meinung nach der PowerPC-Prozessor angesichts der j&uuml;ngsten
Entwicklungen im Amiga-Bereich noch eine Chance?&laquo;
</P>
<BR>
<P>
Florian Hitzler ist skeptisch: &raquo;Der Power-PC hatte nie eine Chance, aus
seiner Nische herauszukommen, weil er nicht kompatibel mit Intel ist. Der
Athlon zeigt, dass das eine wichtige Voraussetzung ist, wenn man im
Massenmarkt Erfolg haben will.
</P>
<P>
F&uuml;r den Prozessor eines zuk&uuml;nftigen Amiga gilt das nat&uuml;rlich nur bedingt,
weil er wie der Apple-Computer ein Nischenprodukt ist. Jedoch mu&szlig; ein
Nischenprodukt gegen&uuml;ber dem Massenmarkt einen Vorteil bieten. Dies ist
(leider?) nicht der Fall, der PowerPC war nur bei seiner Einf&uuml;hrung vom
Preis/Leistungsverh&auml;ltnis her besser als ein Intel&amp;Co-Prozessor. Somit
w&uuml;rde es sich nur aus rein marketing-psychologischen Gr&uuml;nden anbieten,
einen PowerPC zu verwenden.
</P>
<P>
Durch die Verbreitung des UAE-Emulators d&uuml;rfte sich dieser Vorteil aber
schon bald ins Gegenteil verkehren. Die Geschwindigkeitsvergleiche d&uuml;rften
auch jeden AMIGA-Nostalgiker/Intel-Hasser &uuml;berzeugen. Es mu&szlig; ab jetzt
n&auml;mlich fairerweise ein f&uuml;r PowerPC kompiliertes Programm mit einem f&uuml;r den
Pentium kompilierten Programm verglichen werden...vergi&szlig; es, PowerPC, und
wenn Du G5 o.&auml;. hei&szlig;t.&laquo;
</P>
<P>
Harald Knoop ist anderer Meinung: &raquo;Die Frage, ob der PowerPC noch eine
Chance hat, beantworte ich mit einem klaren &quot;Ja&quot;. Die Intel-Prozessoren
sind ja bekanntlich nicht v&ouml;llig fehlerfrei. Gerade der Amiga ist eine
wichtige Chance, die Bildung eines Intel-Monopols zu verhindern!
Au&szlig;erdem muss man bedenken, dass ja auch der PowerMac den PowerPC G3
einsetzt. Insofern ist dieser Prozessor auch wichtig, damit der Amiga mit -
Hilfe von Emulatoren - auch weiterhin weitgehend Mac-kompatibel ist
(Updates zu iFusion kann man &uuml;brigens bei <A HREF="http://www.blittersoft.com" TARGET="_top">http://www.blittersoft.com</A>
herunterladen). Ich bin der Meinung, dass der Amiga zusammen mit dem iMac
bessere Chancen h&auml;tte als unter Intel und Windows. Denn Microsoft und Intel
werden Ihre Millionen bestimmt nicht in die Entwicklung von Amiga-Produkten
investieren! Den &quot;Intel-Amiga&quot; sehe ich h&ouml;chstens als letzte Chance, wenn
alle Stricke rei&szlig;en.
</P>
<P>
Ich bef&uuml;rworte zwar die Entwicklung von Alternativen, damit der Amiga von
PC-Usern wiederentdeckt werden kann; Amiga Inc. sollte sich aber weiterhin
haupts&auml;chlich auf den PowerPC konzentrieren.&laquo;
</P>
<P>
Thomas Nosutta schreibt dazu: &raquo;Der PPC hat genau die Chance, die AMIGA ihm
bietet. Sollten der AmigaONE und AmigaOS 4.0 mit nativer PPC-Unterst&uuml;tzung
erscheinen, so wird dies hoffentlich dem Amiga neuen Schwung und neue Kraft
geben, um die Zeit bis AmigaDE (so es erscheint) zu &uuml;berbr&uuml;cken.
Der PPC als AddOn f&uuml;r 68k-Rechner ist gestorben. Niemand wird heute noch
&uuml;ber 1000,- DM f&uuml;r eine Turbokarte ausgeben, um seinen 68k-Rechner
aufzur&uuml;sten. Die (nahe) Zukunft des Amiga liegt in neuen Prozessoren und
neuer Hardware. x86 ist keine Gefahr, da es nur AmigaOS bis v3.9
unterst&uuml;tzt.&laquo;
</P>
<P>
Julian Harnath meint: &raquo;Ich denke, dass die PowerPC-Prozessorfamillie ganz
unabh&auml;ngig von den Entwicklungen im Amiga-Markt eine Chance hat. Es gibt
schlie&szlig;lich auch noch Apple, und bPlan will mit dem Pegasos ein PPC-
Mainboard anbieten, das auch v&ouml;llig unabh&auml;ngig vom Amiga funktioniert (z.B.
mit Linux).&laquo;
</P>
<BR>
<P>
Nun zur aktuellen Frage des Monats. Sie befasst sich wiederum mit der
Amiga-Zukunft:
</P>
<P>
&raquo;Was meinst du, ist eher die x86- oder die PowerPC-Plattform (bzw. keine
von beiden) dazu in der Lage, die Situation des Classic-AmigaOS zu
verbessern?&laquo;
</P>
<P><B>Schickt eure Beitr&auml;ge bitte an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
