<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="&gt;&gt;"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Leserbrief zur Informationsflut im Internet (von Stephan Karnasch)</H2>
<P>
Die letzten AMIGA-aktuell-Specials haben mal wieder gezeigt, wie schwierig
es ist, verl&auml;ssliche Nachrichten im Internet zu erhalten. Ich sage nicht,
dass das generell so ist und dass andere Medien eine Ausnahme bilden. Nur
dass im Internet der Informationsfluss um einiges schneller ist und es
schnell zu voreiligen, &uuml;bertriebenen oder einfach falschen Infos kommen
kann.
</P>
<P>
Der Umstand, dass es einige gibt, die Gift in den Nachrichtenfluss kippen,
indem sie in Nachrichtensysteme einbrechen (wie vermutet) oder Hoaxes
verbreiten, trifft entweder auf offene Ohren und damit auf die gew&uuml;nschte
Reaktion/Manipulation oder bewirkt, dass das Vertrauen in die News
schwinden. Deshalb Dank an Carsten und das Team f&uuml;r den Kommentar und die
schnelle &Uuml;berpr&uuml;fung der Quelle.
</P>
<P>
Ich sage das alles, weil ich die negativen Auswirkungen der ach so tollen
&quot;Informationsflut&quot; gerade im Amiga-Bereich kenne. &Uuml;bertrieben emotional auf
irgendwelche Nachrichten zu reagieren, schadet nur mir selbst.
Wenn ich schon angemessen reagiere, dann auf die Art, dass ich mich vom
Informationsfluss abkehre, mich auf die Suche nach der Quelle mache und mit
einem Fingerhut sch&ouml;pfe (f&uuml;r die meisten zu m&uuml;hselig und manchmal
Zeitverschwendung).
</P>
<P>
Also wenn ich mich mal wieder &uuml;ber eine Nachricht aufregen sollte, denke
ich daran, wieviel Arbeit ich mir machen m&uuml;sste, um die &quot;Wahrheit&quot; zu
finden, was mich auf der Stelle ruhig werden l&auml;sst - denn dazu hab ich
&uuml;berhaupt keinen Nerv.
</P>
<P>
Also nochmals Dank an alle vom AMIGA-aktuell-Team, die diese Arbeit f&uuml;r
mich &uuml;bernehmen und Nachrichten berichten, ohne Nachrichten zu machen.
</P>
<P>
So jetzt aber genug &quot;gepredigt&quot;, sonst werd' ich zuuu ernst.
</P>
<P><B>Stephan Karnasch &lt;<A HREF="mailto:Sourcerer@GMX.de">Sourcerer@GMX.de</A>&gt;</B></P>
<P>
[Anm. d. leit. Red.: Das von Stephan angesprochene Ereignis f&uuml;hrte zu einer
diffizilen Situation, die die Frage aufwarf, ob die Meldung vom R&uuml;ckzug
Haage &amp; Partners ein AMIGA-aktuell-Special n&ouml;tig macht oder nicht. Hierzu
vollzog ich folgende Abw&auml;gung:
Entsteht unseren Lesern mehr Schaden, wenn die - vermeintlich von einem
seri&ouml;sen Newsdienst ver&ouml;ffentlichte, also verifizierte - Meldung zutrifft
(was aufgrund der derzeitigen Amiga-Lage durchaus h&auml;tte der Fall sein
k&ouml;nnen), und die Leser erst wesentlich sp&auml;ter als andere Amiga-User davon
erfahren?
Oder ist der Schaden f&uuml;r sie dann gr&ouml;&szlig;er, wenn wir die Meldung sofort
versenden - und zwar mit einem deutlichen Hinweis auf deren Fragw&uuml;rdigkeit -
und unsere Leser danach &uuml;ber den Stand der Dinge und m&ouml;gliche Dementis
auf dem Laufenden halten?
Und da war und bin ich der Ansicht, dass letzteres - gerade in
Verantwortung vor den Usern - eindeutig die bessere Alternative ist und
habe dementsprechend gehandelt.]
</P>
<P ALIGN="RIGHT">
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
