<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Messebericht</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Tests7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Messebericht
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="&gt;&gt;"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Messebericht</H1>
<H2>1. Vorabinformationen zur &raquo;Amiga 2001&laquo; in K&ouml;ln</H2>
<P>
Die folgenden Informationen zur diesj&auml;hrigen K&ouml;lner Amiga-Messe wurden der
offiziellen Messe-Homepage (<A HREF="http://www.amiga-messe.de" TARGET="_top">http://www.amiga-messe.de</A>) entnommen:
</P>
<P>
&raquo;AMIGA und K&ouml;ln - diese Kombination bedeutet Tradition und Fortschritt
zugleich. Seit Beginn der 90er Jahre ist K&ouml;ln allj&auml;hrlich der Standort f&uuml;r
die bedeutendste AMIGA-Messe weltweit. Neben dem Synonym f&uuml;r die Tradition
des AMIGA ist die AMIGA-Messe aber seit jeher auch die zukunftsweisende
Kraft f&uuml;r den AMIGA-Markt - auch und gerade im Jahr 2001!
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Wann?&nbsp;</TD><TD VALIGN="TOP">17. - 18. November 2001&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Sa. 10-18 Uhr, So. 10-17 Uhr&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Wo?&nbsp;</TD><TD VALIGN="TOP">MediaPark 6, K&ouml;ln&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>AMIGA 2001 wird von falkemedia und AMIGAplus veranstaltet.&laquo;</B></P>
<P><B>&raquo;Highlights</B></P>
<P>
Auf der AMIGA 2001 begegnen sich in einem architektonisch einmaligen
Geb&auml;ude im Herzen von K&ouml;ln Kreativit&auml;t und Dynamik - ein geeigneter Ort
f&uuml;r Innovationen und Kooperationen. Auf rund 400 Quadratmetern werden die
Besucher viele neue Produkte und Highlights live erleben und erwerben, an
Vortr&auml;gen und Workshops teilnehmen und Pers&ouml;nlichkeiten aus der
Amiga-Gemeinde kennenlernen k&ouml;nnen. Wir erwarten die wichtigsten Hardware-
und Software-Hersteller, Distributoren, H&auml;ndler und Presse-Mitglieder aus
Europa und Nord-Amerika.
</P>
<P>
Eines der Messe-Highlights d&uuml;rfte zweifelsfrei das Emulator-Paket Amiga OS
XL for QNX und Amithlon sein, das im Vertrieb von Haage &amp; Partner
erscheint. Diese neue Emulator-Distribution verspricht ein Vielfaches der
Geschwindigkeit herk&ouml;mmlicher Amigas. Ein ausf&uuml;hrliches Preview dieser
Distribution finden Sie in der AMIGAplus 09/2001 und 11/2001. Daneben
pr&auml;sentiert Haage &amp; Partner die komplette Software- und
Hardware-Produktpalette.
</P>
<P>
Sicherlich gew&auml;hren uns Amiga Inc., bplan GmbH und Merlancia Industries
Eindr&uuml;cke von der neuen Amiga-Generation. Das Pegasos Mainboard von bplan
und damit auch das Tsunami-System von Merlancia steht kurz vor der
Serienreife. Mit etwas Gl&uuml;ck l&auml;sst sich bereits ein serienreifes
Pegasos-Modell auf der Messe bestaunen. Auch neue Software f&uuml;r MorphOS von
e.p.i.c. interactive und Titan Computer steht in den Startl&ouml;chern.
</P>
<P>
Von Amiga Inc. wird, neben den bereits bekannten Produkten wie Amiga SDK
oder Amiga Party Pack, in jedem Fall der AmigaDE Player f&uuml;r Windows und
Linux und das eigentliche AmigaDE auf dem Sharp Zaurus zu sehen sein.
</P>
<P>
Einen bedeutenden H&ouml;hepunkt bilden die angek&uuml;ndigten und bereits
existierenden PCI-Busboards: Mediator von Elbox Computer, G-REX von DCE
Computer und Prometheus von Matay. Alle drei Hersteller werden Ihnen diese
Hardware-L&ouml;sungen in Verbindung mit neuen PCI-Erweiterungskarten vor Ort
vorstellen k&ouml;nnen. Lassen Sie sich von neuen Treibern und v&ouml;llig neuen
M&ouml;glichkeiten des Amigas im Zusammenspiel mit TV-Tuner-, Grafik-, Sound-
und eventuell sogar schon USB-Karten &uuml;berraschen!
</P>
<P>
Neu vorgestellt wird auch der Auto-Routenplaner AmiATLAS in der Version 6
mit vielen neuen Features. Einen Vorbericht finden Sie in der AMIGAplus
11/2001.
</P>
<P>
&Uuml;berzeugen Sie sich selbst, welche der beiden neuen Soundkarten Ihren
Bed&uuml;rfnissen am ehesten entspricht: individual Computers wird neben
weiteren Produkten wie CatWeasel, Lyra oder VarIO voraussichtlich auch die
neue Soundkarte delfina flipper edition zeigen, w&auml;hrend Alien Design mit
der Soundkarte Repulse aufwarten kann.
</P>
<P>
Wenn Sie haupts&auml;chlich an Spielen interessiert sind, werden Sie auf der
Messe definitiv bei einem der anwesenden H&auml;ndler oder direkt beim
entsprechenden Hersteller f&uuml;ndig werden: Neben Klassikern und Evergreens
stehen nat&uuml;rlich auch die j&uuml;ngeren Titel wie Shogo oder Payback oder Earth
2140 zum Verkauf.
</P>
<P>
Nat&uuml;rlich werden wir f&uuml;r Sie auch ein Rahmenprogramm, beispielsweise
Seminare oder Podiumsdiskussionen, anbieten. Weitere Informationen dazu
und zu den Messe-Ausstellern finden Sie stets auf dieser Website im
News-Bereich.
</P>
<P>
Im Anschluss an den Messe-Samstag findet eine interne Konferenz f&uuml;r
Hersteller und H&auml;ndler statt - wenn Sie Interesse an einer Teilnahme
haben, wenden Sie sich bitte an Herrn Nico Barbat oder an Herrn Ali
Goukassian.&laquo;
</P>
<P><B>&raquo;Aussteller</B></P>
<P>
Zum gegenw&auml;rtigen Zeitpunkt sind folgende Unternehmen auf der AMIGA 2001
mit einem Messestand vertreten. Mit weiteren Unternehmen f&uuml;hren wir
derzeit noch Gespr&auml;che. Wenn Sie einen Stand buchen m&ouml;chten, kontaktieren
Sie uns bitte.
</P>
<P><B>AMIGA 2001</B></P>
<UL>
<LI> Airbrush Paradise Tingler
</LI>
<BR><LI> AMIGAplus
</LI>
<BR><LI> Amiga Club Deutschland
</LI>
<BR><LI> Amiga Future / APC &amp; TCP
</LI>
<BR><LI> amiga-news.de
</LI>
<BR><LI> bplan GmbH
</LI>
<BR><LI> Cloanto
</LI>
<BR><LI> COOLbits
</LI>
<BR><LI> DCE Computer
</LI>
<BR><LI> e.p.i.c. interactive
</LI>
<BR><LI> Elbox Computer
</LI>
<BR><LI> falkemedia
</LI>
<BR><LI> Fun Time World
</LI>
<BR><LI> GTI / Schatztruhe
</LI>
<BR><LI> Haage &amp; Partner GmbH
</LI>
<BR><LI> Hyperion Entertainment
</LI>
<BR><LI> individual Computer
</LI>
<BR><LI> KDH Datentechnik
</LI>
<BR><LI> Titan Computer
</LI>
<BR><LI> Vesalia
</LI>
</UL>
<BR>
<P><B>Atari Park</B></P>
<UL>
<LI> falkemedia (UMAX-Rechner, STEmulator 2.0)
</LI>
<BR><LI> st-computer (Magazin)
</LI>
<BR><LI> Frontier Systems (Deesse, Eclipse)
</LI>
<BR><LI> Elmar Hilgart (YAMI, Ethernet f. ROM-Port)
</LI>
<BR><LI> woller systeme (GEM-TV, N.AES 3.0)
</LI>
<BR><LI> R.O.M. logicware (papyrus 9)
</LI>
<BR><LI> atos Magazin
</LI>
<BR><LI> RGF Software (Luna, Arthur)
</LI>
<BR><LI> Matthias Jaap (HP Penguin)
</LI>
<BR><LI> Patrick Eickhoff (FunMedia, Legends Of Espen)
</LI>
<BR><LI> a4 Computer- &amp; Informationssysteme (Acorn)
</LI>
<BR><LI> NICE Entertainment (Nuon)&laquo;
</LI>
</UL>
<P><B>&raquo;Kartenkauf</B></P>
<P>
Eine Tageskarte zur AMIGA 2001 kostet regul&auml;r 20.- DM, erm&auml;&szlig;igt f&uuml;r
Studenten, Sch&uuml;ler und Auszubildende mit entsprechendem Nachweis 18.- DM.
Kinder bis sechs Jahren haben in Begleitung der Eltern freien Eintritt.
</P>
<P>
Sie k&ouml;nnen Ihre Eintrittskarte vor Ort erwerben oder zum erm&auml;&szlig;igten Preis
bis einschlie&szlig;lich 5. November 2001 vorbestellen:
</P>
<UL>
<LI> Vorverkauf online auf shop.falkemedia.de
</LI>
<BR><LI> Vorverkauf per Telefon (0431 / 200 766-0)
</LI>
<BR><LI> Vorverkauf per Telefax (0431 / 209 903-5)&laquo;
</LI>
</UL>
<P><B>&raquo;Anreise</B></P>
<P>
KOMED, der Veranstaltungsort der AMIGA 2001, liegt im Herzen von K&ouml;ln.
Sowohl die Anreise per Auto als auch per Bahn oder Flugzeug ist v&ouml;llig
problemlos m&ouml;glich.
</P>
<P><B>Auto:</B></P>
<P>
Die Anreise per Auto ist bequem und sicher. Parkpl&auml;tze sind zahlreich
vorhanden. Von ausw&auml;rts kommend fahren Sie die A1 (von
Dortmund/Hamburg/Berlin), die A3 (von Frankfurt/M&uuml;nchen), die A4 (von
Aachen/Benelux), die A59 (von D&uuml;sseldorf/Oberhausen) oder die A555 (von
Bonn/Stuttgart). Fahren Sie am besten die A57 Richtung K&ouml;ln-Zentrum, dann
Richtung MediaPark. Die Einfahrt zur unterirdischen Umgehungsstra&szlig;e
befindet sich direkt hinter der Eisenbahnbr&uuml;cke. Sie fahren von dort aus
entweder direkt vor dem Haus vor oder in die Tiefgarage MediaPark. Am
&quot;Cinedom&quot; gabelt sich die Einfahrt zum Parkhaus ebenfalls in
Tiefgaragenzufahrt und Tunnelumfahrt. Folgen Sie den Schildern &quot;PZ&quot;.
MediaPark 6 befindet sich oberhalb des gelben und orangenen Bereiches.
Parken k&ouml;nnen Sie auch in der Tiefgarage Kaiser-Wilhelm-Ring.
</P>
<P><B>&Ouml;ffentliches Verkehrsnetz:</B></P>
<P>
Sie erreichen die AMIGA 2001 per Bahn &uuml;ber das gut ausgebaute &ouml;ffentliche
Verkehrsnetz des Verkehrsverbund Rhein-Sieg (VRS) und der K&ouml;lner
Verkehrsbetriebe (KVB).
</P>
<P>
Ab Hauptbahnhof nutzen Sie die S-Bahn-Linien S6 Richtung K&ouml;ln-Nippes, S11
Richtung D&uuml;sseldorf oder S12 Richtung Hansaring. Die Haltestelle ist
Hansaring.
</P>
<P>
Oder nutzen Sie die U-Bahn Linie 5 ab Hauptbahnhof Richtung Ossendorf und
steigen Sie am Friesenplatz in die Linie 6, 15, 17 oder 19 Richtung
Ebertplatz um. Die Haltestelle ist Christophstra&szlig;e/MediaPark.
</P>
<P><B>Flugzeug:</B></P>
<P>
Sie k&ouml;nnen nat&uuml;rlich auch per Flugzeug anreisen. Der Flughafen K&ouml;ln/Bonn
hat einen Airport-Transfer zum Hauptbahnhof K&ouml;ln, der alle 15 Minuten
verkehrt.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Tests7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
