<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Abschlie&szlig;end
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="&gt;&gt;"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<b>AmigaXL und Amithlon - mehr als nur Emulatoren? (von Carsten Schr&ouml;der)</b>
</P>
<P>
Bei den in der &Uuml;berschrift genannten Produkten, die vor wenigen Wochen
erschienen sind, handelt es sich bekanntlich um Amiga-Emulatoren f&uuml;r x86-
Rechner. So werden sie von den allermeisten Amiga-Anwendern auch bewertet -
aber ist das &uuml;berhaupt gerechtfertigt?
Denn Theorie und Praxis sprechen selten eine gemeinsame Sprache, wie
folgendes Beispiel demonstriert: Relativ betrachtet ist das Amiga-
Betriebssystem ein sehr schnelles OS. Dadurch, dass andere Betriebssysteme,
wie etwa die Windows-Produkte, aber auf aktueller PC-Hardware lauff&auml;hig
sind, die eine drastisch h&ouml;here Leistungsf&auml;higkeit bietet als die
veralteten 68k/PowerPC-Amigas, sieht die Wirklichkeit allerdings vollkommen
anders aus - trotz der Effizienz des AmigaOS gen&uuml;gt dessen Praxisleistung
schon lange kaum noch jemandem.
</P>
<P>
Die nach meiner Sch&auml;tzung weltweit etwa 20.000 verbliebenen aktiven Amiga-
Besitzer - damit meine ich diejenigen, die ihre &quot;Freundin&quot; nicht nur
sporadisch als Zweitrechner benutzen, sondern sich auch f&uuml;r die Amiga-
Situation und eine m&ouml;gliche -Zukunft interessieren - stellen quasi die
&quot;Stamm-Amiganer&quot; dar, also die treuesten und letzten Fans, die gr&ouml;&szlig;tenteils
auch noch weitere f&uuml;nf Jahre aushalten w&uuml;rden, wenn ihnen bis dahin immer
noch eine glorreiche Classic-Amiga-Zukunft auf PowerPC-Basis versprochen
wird. Wie realistisch solche Zusagen sind, dar&uuml;ber will ich an dieser
Stelle nicht allzu viele Worte verlieren - ich habe es in der j&uuml;ngeren
Vergangenheit, konkret: seit AMIGA, Inc. im Fr&uuml;hjahr das AmigaOS 4.0
angek&uuml;ndigt hat, oft genug getan.
</P>
<P>
Nur soviel: Vor wenigen Tagen hat Eyetech bekanntgegeben, dass sich f&uuml;r den
AmigaOne 1200 auch der wenige Wochen zuvor angek&uuml;ndigte Erscheinungstermin
November nicht einhalten l&auml;sst. Meiner Ansicht nach sind die Aussagen
dieser Firma mittlerweile so glaubw&uuml;rdig wie die eines Mick Tinker, dessen
Rechnerentwicklung BoXeR t&auml;glich erscheinen sollte - und das schon seit
Jahren. Aber das ist Geschichte, der gute Mann hat vor wenigen Wochen
seinen R&uuml;ckzug aus dem Amiga-Markt angek&uuml;ndigt. Ob das ein Verlust ist,
lasse ich an dieser Stelle einfach mal offen.
</P>
<P>
Etwas Gutes hatte die j&uuml;ngste Eyetech-Presseerkl&auml;rung allerdings doch: Nun
ist endlich bekannt, wer die Entwicklung des AmigaOS 4.0 leitet - Hyperion
Entertainment. Das ist durchaus konsequent, denn der Spiele-Portierer ist
der einzige bekanntere Amiga-Softwarehersteller, der dieses Projekt
vehement unterst&uuml;tzt. Nun hat es das Unternehmen also selbst in der Hand,
OS 4.0 auf den Markt zu bringen. Ich bin gespannt, ob - und wenn ja in
welcher Form - es gelingt.
</P>
<P>
Noch mal zur&uuml;ck zur Hardware: Scheinbar besser als bei Eyetech sieht es bei
bplan und dessen PowerPC-Mainboard Pegasos aus, von dem bereits lauff&auml;hige
Prototypen existieren - doch das hat nicht viel zu bedeuten. Entscheidend
ist allein die Serienproduktion, und deren Start kann selbst in letzter
Minute noch durch verschiedenste Ereignisse bzw. Gr&uuml;nde verhindert werden.
Auf der anderen Seite sagt jedoch ein Produktionsstart noch nichts &uuml;ber den
Erfolg des Produkts aus. Hier sind vielmehr Preis und Leistung
entscheidend, und ich bin wirklich sehr neugierig darauf zu erfahren, wie
bplan es schaffen will, in diesen Kriterien zumindest ann&auml;hernd
konkurrenzf&auml;hig zu den aktuellen x86-Mainboards zu sein. Meiner Ansicht
nach ist das kaum realisierbar, aber ich lasse mich gern vom Gegenteil
&uuml;berzeugen - allerdings nur in Form von Taten, nicht jedoch mit blo&szlig;en
Worten.
</P>
<P>
Nach diesem Streifzug durch die Welt der &uuml;brigen potenziellen Amiga-
Weiterentwicklungen bzw. -Nachfolger m&ouml;chte ich mich nun endlich den
Projekten zuwenden, denen ich als einzige Chancen einr&auml;ume, die Classic-
Amiga-Anwenderbasis mittelfristig wieder zu vergr&ouml;&szlig;ern: Amithlon und
AmigaXL.
</P>
<P>
Denn diese verwenden vern&uuml;nftigerweise preisg&uuml;nstige und leistungsf&auml;hige
x86-Standardhardware, die nahezu jeder Computer-Anwender besitzt, anstatt
aus gr&ouml;&szlig;tenteils ideologischen Motiven auf eine Prozessorreihe zu setzen,
die es von Jahr zu Jahr schwerer am Markt hat (und das hat seine Gr&uuml;nde).
</P>
<P>
Wie pr&auml;sentieren sich die beiden x86-Emulatoren denn nun in der Praxis?
W&auml;hrend AmigaXL eindeutig Emulationscharakter besitzt, da es das
Betriebssystem QNX als Basis verwendet, erweckt Amithlon beinahe den
Eindruck eines x86-nativen AmigaOS. Denn Host-Grundlage ist hier ein
minimales Linux-System, von dem der Anwender lediglich beim Booten des
Rechners Notiz nimmt.
</P>
<P>
Was also spricht dagegen, Amithlon als erste x86-Version des AmigaOS
anzusehen? M&ouml;glicherweise dessen Geschwindigkeit. Zwar ist die Emulation
vergleichsweise schnell, und die heutige, sehr leistungsf&auml;hige x86-Hardware
tut ihr &Uuml;briges, um den allermeisten Amiga-Programmen zu nie dagewesener
Geschwindigkeit zu verhelfen - dies allerdings im Vergleich zu Original-
Amigas. Denn echte x86-Software eines beliebigen Betriebssystems,
beispielsweise QNX, ist - da hierbei keine Emulation zum Einsatz kommt -
nochmals deutlich schneller, so dass mit Amithlon (und genauso AmigaXL) der
Performance-Abstand zur heutigen Computerwelt zwar verringert, aber noch
l&auml;ngst nicht wettgemacht wird.
</P>
<P>
Doch die Kunst besteht bekanntlich darin, aus der Not eine Tugend zu
machen. Und genau dazu scheinen Amithlon und AmigaXL in der Lage: Sie
k&ouml;nnen n&auml;mlich auch x86-native Programme nutzen, die ohne Emulation und
damit in voller x86-Geschwindigkeit verarbeitet werden. Und dies bezieht
sich nicht zwangsl&auml;ufig nur auf Applikationen und Spiele, sondern schlie&szlig;t
die Betriebssystemkomponenten des AmigaOS mit ein.
</P>
<P>
Kurzum: Es w&auml;re durchaus m&ouml;glich, das 68k-AmigaOS (zumindest aber besonders
Geschwindigkeits-kritische Bestandteile) nach und nach in echten x86-Code
umzuschreiben. Dies h&auml;tte nicht nur eine erhebliche Beschleunigung der
jeweiligen Komponente zur Folge, sondern mit der Zeit w&uuml;rde auf diese Weise
sogar eine echte x86-Version des AmigaOS geschaffen werden. Parallel dazu
m&uuml;ssten jedoch umfassende Verbesserungen und Erweiterungen am AmigaOS
vorgenommen werden, um auch den technologischen R&uuml;ckstand zu anderen
Betriebssystemen aufzuholen - denn Geschwindigkeit ist nun mal nicht alles.
</P>
<P>
Wenn dies beides tats&auml;chlich erfolgt, dann sehe ich mittelfristig durchaus
eine Chance, das Classic-AmigaOS vor dem Untergang zu bewahren (auch wenn
ich nach wie vor eine v&ouml;llige OS-Neuentwicklung eindeutig vorziehe). Zwar
ist von Seiten Haage &amp; Partners bzw. der AmigaOS-XL-Programmierer bislang
noch keine Rede von einem solchen Unterfangen, aber es sollte mich wundern,
wenn man sich dort nicht der Chance bewusst ist, die sich dadurch bietet.
Jedenfalls kann ich mir gut vorstellen, dass im Hintergrund bereits
entsprechende Verhandlungen mit AMIGA, Inc. aufgenommen wurden und die
Unternehmen auf einen passenden Zeitpunkt warten, um der Amiga-Welt die
Neuigkeit von einer x86-Version des AmigaOS mitzuteilen. Die in zwei Wochen
stattfindende K&ouml;lner Messe Amiga 2001 w&uuml;rde sich hierf&uuml;r besonders anbieten -
lassen wir uns also &uuml;berraschen...
</P>
<P><B>Damit bis zur n&auml;chsten Ausgabe,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
