<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Vorwort
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="&gt;&gt;"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Vorwort</H1>
<P>
+++ x86-Emulatoren AmigaXL und Amithlon erschienen +++ AmigaDE Player 1.0
ver&ouml;ffentlicht +++ AmigaOne und AmigaOS 4.0 nun erst f&uuml;r 2002 angek&uuml;ndigt
+++
</P>
<P>
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Haage &amp; Partner hat es geschafft: Mitte Oktober erschien das Amiga-
Emulator-Paket AmigaOS XL und damit der erste neue Ansatz zur
&raquo;Wiederbelebung&laquo; des Classic-AmigaOS auf leistungsf&auml;higer Computer-
Hardware.
</P>
<P>
Dieser &raquo;Punktsieg&laquo; f&uuml;r Haage &amp; Partner wird noch bedeutsamer vor dem
Hintergrund, dass die Konkurrenzentwicklung AmigaOne &amp; AmigaOS 4.0 - wenn
&uuml;berhaupt - erst im n&auml;chsten Jahr fertiggestellt sein wird.
</P>
<P><B>Zwei wenig erfreuliche Dinge in eigener Sache:</B></P>
<UL>
<LI> Mit dieser Ausgabe m&uuml;ssen wir uns von Malte Mende, einem der beiden
  Leiter des AMIGA-aktuell-Spieleteils, verabschieden, der diese Aufgabe
  leider aus Zeitgr&uuml;nden nicht mehr wahrnehmen kann.
<P>
  Malte, im Namen der gesamten AMIGA-aktuell-Redaktion w&uuml;nsche ich dir f&uuml;r
  die Zukunft alles Gute und hoffe, dass du dich tats&auml;chlich ab und zu als
  freier Mitarbeiter an AMIGA aktuell beteiligen wirst.
</P>
</LI>
<BR><LI> Da wir im Oktober erneut keine Einsendungen zur FD-Hitparade erhalten
  haben, erw&auml;gen wir, die Rubrik einzustellen. Solltet ihr noch Interesse
  an der FD-Hitparade haben, so beteiligt euch bitte, andernfalls wird sie
  gestrichen.
</LI>
</UL>
<BR>
<P><B>Zu den regelm&auml;&szlig;igen Aufrufen:</B></P>
<UL>
<LI> An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber
  an AMIGA aktuell (<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>).
</LI>
<BR><LI> Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich
  an <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A> oder <A HREF="mailto:christian@aakt.de">christian@aakt.de</A> wenden.
</LI>
</UL>
<P><B>Viel Spa&szlig; jetzt bei dieser Ausgabe,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
