<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Game Review: Payback</TITLE>
</HEAD>
<BODY TEXT=white background="ktest.gif" link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Payback</font></center></h1></P>
<p>Auch wenn es einige offensichtliche Amiga Gegner bzw. PC Fans nicht wahrhaben wollen: Der Amiga Spielemarkt - so klein er auch in den letzten Wochen und Monaten geworden sein mag - lebt immer noch und verf&#252;gt immer noch &#252;ber gen&#252;gend Potential sowohl was Eigenentwicklungen als auch Portierungen betrifft. Das haben die letzten Monate mit Krachern wie <b>Earth 2140, Simon II</B> (siehe dazu Test in dieser Ausgabe) oder auch <b>Hell Squad</B> eindrucksvoll bewiesen. Mit dem GTA Clone Payback erscheint nun eine komplexe Eigenentwicklung aus dem Hause Apex Design. Mal sehen, ob Payback dem gro&#223;en Vorbild &#252;berlegen ist...</P>

<p><h2><center><font color="yellow">Die obligatorischen Worte vorweg</font></center></h2></P>
<p>Payback kommt in einem normalen Jewelcase daher, welches immerhin ein professionell gestaltetes Booklett enth&#228;lt, in dem sich eine kurze, aber ausreichende Anleitung zum Spiel in insgesamt 10 Sprachen befindet. Zudem befindet sich hier der ben&#246;tigte Registrierungscode, um das Spiel erfolgreich zu starten - ob das die Raubkopierer abhalten wird, ist zwar fraglich, aber zu hoffen w&#228;re es allemal. Im Booklett befindet sich zudem noch das Inhaltsverzeichniss des 15 Tracks umfassenden Soundtracks, der als normale Audio Datei vorliegt. &#220;ber Geschmack der vorhandenen Tracks (&#220;ber Rap, Hip Hop bis hin zu Pop) l&#228;sst sich mal wieder streiten, aber f&#252;r den Otto Normal Spieler werden diese Tracks die perfekte musikalische Untermalung  darstellen. Ich pers&#246;nlich habe allerdings festgestellt, da&#223; sich einige Manowar Songs (&quot;Return Of The Warlord&quot;) ebenfalls bestens als Hintergrundmusik eignen.</P> 

<p>Bevor es an die Installation des Spiels geht, sollte man sich noch schnell die mitlerweile erschienenen drei Updates aus dem Netz der Netze (z.B. Aminet) laden, die das Spiel nochmal nachhaltig aufwerten (bessere Grafik, bessere Framrate, h&#246;here Stabilit&#228;t etc.). Ist das geschehen, kann man sich an 
die Erstinstallation waagen, f&#252;r die erneut Installer in allen m&#246;glichen verschiedenen Sprachen zur Verf&#252;gung stehen. Die Installation, die minimal 15 MB auf der Platte in Anspruch nimmt, verl&#228;uft erwartungsgem&#228;&#223; (wie halt bei Amiga Software gewohnt) ohne Probleme - lediglich auf dem UAE gestaltet sich die Installation mal wieder mit einigen Problemen, was aber am UAE / PC liegt. Entscheiden kann man sich noch dar&#252;ber, ob das gut gemachte Intro mit installiert werden soll oder nicht. Und bevor ich zum eigentlichen Spiel komme, m&#246;chte ich noch schnell einige Worte &#252;ber die Hardwareanforderrungen verlieren:</P>

<p><u>Minimum:</U><br><ul>
<li>68020</LI><br>
<li>16 MB Ram</LI><br>
<li>AGA</LI></P></Ul>

<p><u>Empfohlen:</U><br><ul>
<li>68040</LI><br>
<li>mehr Speicher</LI><br>
<li>GraKa</LI></P></Ul>

<p>Dies sind die offiziellen Werte - ich gehe einfach mal davon aus, da&#223; Payback unter einem 68040 keinen Sinn mach. Diese CPU sollte also am besten in Kombination mit gen&#252;gend Speicher (64 MB) vorhanden sein, um Payback wirklich fl&#252;ssig zu spielen. Auf einem 68060 sollte Payback eigentlich absolut ruckelfrei laufen, aber selbst ein 68040 sollte heutzutage eigentlich Standard sein. Der PPC wird bisher &#252;brigens noch nicht unterst&#252;tzt, allerdings soll es im Sommer einen kostenlosen (!) PPC Port von Payback geben und - ohne schon alzu viel vorwegzunehmen - k&#246;nnte das ein wirkliches Argument f&#252;r eine PPC CPU sein!</P>

<p><h2><center><font color="blue">Gangster &amp; Co.</font></center></h2></P>
<p>Es gibt bestimmt einige User, die das Vorbild GTA nicht kennen. Deswegen m&#246;chte ich kurz das Spielprinzip erkl&#228;ren: Man spielt einen Typen, der mit dem Gesetz, &#228;h, weniger am Hut hat und seinen Lebensunterhalt eher mit kriminellen Machenschaften, denn mit ehrlicher Arbeit verdient. Wenn man alleine spielt, ist das Ziel das Sammeln von einer vorgegebenen Punktzahl, um in der Unterwelt aufzusteigen. Und das sammeln von Punkten ist wirklich recht einfach: Jede illegale Aktion bringt Punkte, will hei&#223;en: Wer einen Waagen klaut, Leute umf&#228;hrt (yup!), andere Autos demoliert oder gar komplett zerst&#246;rt oder Polizisten t&#246;tet, erh&#228;lt daf&#252;r Punkte. Die so gesammelten Punkte reichen aber kaum daf&#252;r aus, da&#223; Spielziel zu erreichen. Deswegen werden an diversen M&#252;nztelefonen in der Stadt Missionen angeboten, f&#252;r die man wirklich massig Punkte bekommt. Die Auftr&#228;ge, die man in den verschiedenen Levels erh&#228;lt, sind dabei sehr abwechselunsgreich 
und total unterschiedlich gehalten, was sich positiv auf die Langzeitmotivation auswirkt. So gibt es z.B. simplere Auftr&#228;ge wie das Steuern eines Fluchtfahrzeuges, das Fahren auf Zeit oder den Drogenschmuggel. Daneben gibt es auch wirklich komplexe Auftr&#228;ge, die insbesondere ab der zweiten Statd auf den Spieler warten. So muss dort z.B. eine Person gekidnappt werden und anschlie&#223;end an eine andere Partei ausgeliefert werden. Recht am&#252;sant fand ich die Tatsache, da&#223; es sogar ein Autorennen in bester Super Cars / Skidmarks Manier in das fertige Spiel geschafft hat. F&#252;r viele Missionen braucht man allerdings auch Waffen, von denen ebenfalls alles, was das Spielerherz begehrt, vorhanden ist: Pistolen, Gewehre, Handgranten, Flammenwqerfer und sogar Bazookas warten nur darauf, vom Spieler benutzt zu werden.</P> 

<p>H&#246;rt sich simpel an meint ihr? Okay, dann probiert das Spiel aus und behauptet das in der dritten Stadt nochmal! Warum? Unsere Gegner, die liebe Polizei, ist nat&#252;rlich auch in Payback pr&#228;sent und versucht uns das Leben schwer zu machen. Je nach Verbrechen wird man dann mehr oder weniger intensiv verfolgt. Wenn man also nur kr&#228;ftig aufs Gaspedal getreten hat und zuf&#228;llig das eine oder andere Auto dabei touchiert hat, passiert nicht viel mehr, als das man verfolgt wird. Hat man allerdings ein Polizeitauto nebst Polizisten in die Luft gejagt und evtl. noch ein paar auf der Stra&#223;e rumlaufende Personen &#252;berfahren, werden die Ordnungsh&#252;ter recht schnell b&#246;se und verfolgen einen nicht nur, sondern bauen auch Stra&#223;ensperren auf, die man zugegebenerma&#223;en auch durchfahren kann. Und hat man es sich einmal alzu sehr mit den Leuten in Blau verscherzt, werden diese auch noch schie&#223;w&#252;tig und schie&#223;en auf den Spieler -egal, ob er gerade ein Auto 
f&#228;hrt oder zu Fu&#223; unterwegs ist. Insbesondere bei den Missionen, die i.d.R. illegal sind, k&#246;nnen die Polizisten schnell nervig werden und erh&#246;hen durch ihre permanente Pr&#228;senz den Schwierigkeitsgrad. Allerdings sei noch gesagt, da&#223; sich die Polizisten auch wieder beruhigen, wenn man sich eine Zeitlang ruhig verhalten hat, was auch nicht unbedingt einfach ist. Zu erkennen ist der Status immer an den Sternen am oberen Bildschirmrand - je mehr Sterne dort aufleuchten, desto brenzliger wird die Lage. Ab vier Sternen kann es da schon recht brisant auf dem heimischen Schirm zur Sache gehen und in sp&#228;teren Levels werden die &quot;Bullen&quot; ohnehin viel eher aktiv als im ersten, sehr
harmlosen Level...</P>
<center><p><img src="pay1.jpg"></P></center><br>
<p>Wie schon angesprochen, l&#228;uft ohne Autos bei Payback eigentlich nichts: Die Entwickler haben sich die M&#252;he gemacht und eine Vielzahl an verschiedenen Fahrzeugen in das Spiel zu implementieren, die allesamt nicht nur anders aussehen, sondern auch &#252;ber verschiedenes Fahrverhalten verf&#252;gen. So d&#252;rfte es sich wohl von selbst verstehen, da&#223; ein handlicher, kleiner Sportwagen schneller beschleunigt und wendiger ist, als ein fetter Bus. Nat&#252;rlich hat aber auch jeder Wagen seine Vor- und Nachteile und es kommt immer auf die Situation an, in der man sich befindet: So ist der kleine Sportwagen zwar schneller und handlicher, geht daf&#252;r aber auch leichter kaputt und vertr&#228;gt nicht so viel. Wenn man also massiv von der Polizei verfolgt wird und diese auch noch auf einen schie&#223;en, ist vom Sportwagen nicht mehr viel &#252;brig - ein sch&#246;ner Bus vertr&#228;gt da schon wesentlich mehr und eignet sich insbesondere 
f&#252;r Schlachten mit der Polizei und um diesen zu entkommen. Ihr werdet sehr schnell merken, da&#223; der Bus ein verdammt praktisches Fahrzeug ist (&quot;Da vorne ist eine Stra&#223;enbarriere der Polizei? Egal, mit Vollgas durch!&quot;)... Aber nat&#252;rlich kann man sich auch ein Polizeiauto aneignen, aber dies ist immer mit h&#246;herem Risiko verbunden, zumal es einem die Polizei echt &#252;bel nimmt, wenn man andauernd ihre Autos klaut. Daf&#252;r sind diese PKW`s aber auch am schnellsten und man kann zudem per Knopf auf den Feuerknopf noch das Blaulicht aktivieren! Als kleines Schmankerl hat man noch einige Zusatzobjekte in dem Spiel versteckt, die man teilweise nur durch versteckte Missionen zu Gesicht bekommt. Ein Panzer, den man bei einer
Milit&#228;rbasis klaut, macht dabei genauso viel Laune wie ein Helikopter. Nur darf man bei letzterem nicht vergessen, vorher zu landen, bevor man aussteigt (ist mir schon passiert... peinlich, peinlich!) - ansonsten hat man eines seiner Leben (maximal 5) ausgehaucht.</P>

<p><h2><center><font color="red">Die Technik, die dahinter steckt!</font></center></h2></P>
<p>Ein gutes Spielprinzip ist die eine Sache, eine gute technische Umsetzung die andere. Und an der Umsetzung hat es auf dem Amiga Spielemarkt - auch bedingt durch fehlende Hardware Power - nicht selten gemangelt. Payback geh&#246;rt aber gl&#252;cklicherweise nicht dazu, denn die Programmierer haben auch hier ganze Arbeit geleistet. &#196;hnlich wie bei GTA schaut man von oben auf das Spielfeld, in das - je nachdem ob man schnell f&#228;hrt oder nur langsam durch die Gegend l&#228;uft - hinein- bzw. hinausgescrollt wird. Wichtigstes Merkmal f&#252;r ein gelungenes Spiel ist heutzutage sicherlich auch die Grafik und die hat es bei Payback sicherlich in sich: Die Texturen schauen einfach nur hervorragebd aus und auch die H&#228;user, Menschen und Autos, die im Spiel auftauchen, wurden mit viel Liebe zum Detail gezeichnet. Das ganze sieht auf jeden Fall - insbesondere nat&#252;rlich bei h&#246;heren Aufl&#246;sungen - absolut realistisch aus, wozu auch die zahlreichen Spezialeffekte beitragen: Zahlreiche 
Lichteffekte, Bremsspuren auf der Stra&#223;e, in Echtzeit berechneter Schatten, Lensflares oder auch feiner Regen sind nur einige wenige Effekte, &#252;ber die sich der Spieler freuen darf. Ein kleines Beipsiel f&#252;r die hohe Detailverliebtheit ist z.B. die Tatsache, da&#223; feiner schwarzer Rauch aus dem Wagen aufsteigt, wenn er sich dem Ende n&#228;hert - halt wie im echten Leben. Und ich muss ganz ehrlich gestehen: Selten habe ich ein reines 68K Amiga Spiel gesehen, das grafisch so perfekt umgesetzt wurde und dabei immer noch angenehm fl&#252;ssig lief.</P>
<p><center><img src="pay2.jpg"></center></P><br>
<p>Der Sound ist ein weiterer Aspekt, der das Spiel gelungen abrundet: Neben dem bereits oben erw&#228;hntem Soundtrack gibt es noch zahlreiche weitere Soundeffekte im Spiel, die f&#252;r ein akkustisches H&#246;rerlebniss par excellence sorgen. Nicht nur der Stra&#223;enl&#228;rm und das quietschen der Reifen machen das Spiel megarealistisch, sondern auch die unterschiedlichen Ger&#228;usche, wenn sich die Spielfigur auf verschiedenen Untergr&#252;nden bewegt, tragen dazu bei. Im Spiel gibt es tats&#228;chlich jede Menge Soundeffekte, die man an dieser Stelle einfach nicht aufz&#228;hlen kann - man muss es einfach mal erlebt haben.</P>

<p>Aber wer glaubt, da&#223; es das schon war, sieht sich get&#228;uscht: Payback kann man auch im Mehrspielermodus spielen. Das Ziel im Mehrspielermodus ist ganz einfach: Wer am schnellsten eine bestimmte Anzahl an Polizisten get&#246;tet hat, hat gewonnen. Einfacher ist es nat&#252;rlich einfach dem Mitspieler in eine andere Welt zu bef&#246;rdern. Allerdings sei an dieser Stelle auch nicht verschwiegen, da&#223; man f&#252;r den Mehrspielermodus nochmal ein wenig die Hardwareanforderrungen hochschrauben sollte - ansonsten d&#252;rfte es keinen Spa&#223; machen. Und f&#252;r diesen Modus kann man sogar eigene Karten mit dem mitgelieferten Map Editor erstellen - der Kreativit&#228;t sind also keine Grenzen gesetzt.</P>

<p>Eines muss man allerdings noch betonen: In Payback wird eindeutig Gewalt verherrlicht und zart besaitete Personen werden aufgrund des massiven Blutstr&#246;mens sicherlich andere Spiele bevorzugen. Bullenkillerboni, Kraftausdr&#252;cke in den Missionen sowie ein lautes &quot;Platsch&quot; wenn man eine Person &#252;berf&#228;hrt tragen auf jeden Fall nicht dazu bei, da&#223; Spiel 5-j&#228;hrigen zug&#228;nglich zu machen. Allerdings gehe ich mal nicht davon aus, da&#223; Payback jemanden anstifften wird, auf die Stra&#223;e zu rennen und gleich mit geklauten Autos Amock zu fahren; daf&#252;r ist das ganze einfach zu &#252;bertrieben.</P>

<p><h1><center><font color="orange">Fazit</font></center></h1></P>
<p>Tja, ich pers&#246;nlich finde Payback absolut geil und liege damit wohl auf einer Wellenl&#228;nge mit allen anderen, die dieses Kn&#252;llerspiel bisher gesehen oder gespielt haben. Hier stimmt einfach alles: Gameplay, Grafik, Sound und Suchtfaktor. F&#252; mich ist Payback schon zum jetztigen Zeitpunkt ein hei&#223;er Anw&#228;rter auf das &quot;Spiel des Jahres&quot; und ich bin davon &#252;berzeugt, da&#223; Payback alle Amiganer wochenlang vor dem heimischen Monitor fesseln wird. Lediglich der etwas &#252;berh&#246;hte Preis von 119 DM mag abschreckend wirken, aber es muss auch klipp und klar gesagt werden, da&#223; Payback jeden Pfennig wert ist. Wer also mal wieder ein richtig geiles Game sucht, der muss hier einfach zuschlagen. So, und ich zocke jetzt noch eine Runde! Was ich spiele? Na was wohl...?</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
