<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Game Review: Simon The Sorcerer II</TITLE>
</HEAD>
<BODY TEXT=white background="ktest.gif" link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Simon The Sorcerer II</font></center></h1></P>
<p>Auch wenn wir in der NC schon einen Testbericht zu Simon The Sorcerer - II hatten , kann ein zweiter Bericht ja auch nicht schaden und da der Andreas so nett war, mir ein Testmuster dieses Adevntures zu &#252;berlassen, mache auch ich mich jetzt daran das Spiel durchzuspielen und zu testen. Ob mir das ganze Spa&#223; gemacht hat oder ob ich mich lieber in einen Biergarten h&#228;tte setzen sollen, wird dieser Bericht zeigen.</P>

<p><h2><center><font color="yellow">Der &#252;bliche Kram...</font></center></h2></P>
<p>Im Gegensatz zu anderen Amiga Spielen neueren Datums kommt Simon II in einer professionell aufgemachten DVD H&#252;lle - also Hochglanzcover und der andere &#252;bliche Schnickschnack - mit gedruckter Anleitung daher. Die Anleitung ist dabei nicht so trocken geraten wie andere Anleitungen, sondern wei&#223;t diverse Sp&#228;&#223;e auf, so da&#223; man sich ein schmunzeln manchmal nicht verkneifen kann. Wer das Spiel sein eigen nennt, wird wohl wissen, was ich meine. Da es sich um eine Konvertierung handelt, k&#246;nnte man meinen, da&#223; die Hardwareanforderrungen auch hoch sein werden. Dem ist nicht so, denn auf dem PC erblickte Simon II schon im Jahre 1994 das Licht der Welt. Dementsprechend sehen auch die Anforderrungen f&#252;r unseren geliebten Amiga aus:</P><ul>

<p><li>AGA</LI><br>
<li>68030</LI><br>
<li>16 MB Ram</LI><br>
<li>installiertes AHI</LI><br>
<li>CD Laufwerk</LI></P></UL>

<p>Wie &#252;blich kann bessere Hardware nicht schaden und auf meiner Picaso IV verrichtete das Spiel ebenfalls tadellos seinen Dienst.</P>

<p>&#196;hnlich wie bei Payback (Test in dieser Ausgabe), sollte man sich vor der Erstinstallation von Simon II allerdings auch die bisher erschienenen Updates aus dem Internet besorgen, da es ansonsten zu diversen Problemen (u.a. mit dem Abspeichern von Spielständen) kommen kann. Wer also unter OS 3.9 nicht abspeichern kann, der sollte schnell sein Modem anstellen und sich die Updates besorgen. Die Installation gestaltet sich Amiga typisch absolut fehlerfrei und nachdem man diesen Teil hinter sich gebracht hat, kann man sich auch gleich in das Spielgeschehen werfen.</P>

<p><h2><center><font color="blue">Das Spiel</font></center></h2></P>
<p>Simon II kn&#252;pft storytechnisch genau da an, wo Simon I seinerzeit aufgeh&#246;rt hat: Sordid, der b&#246;se Zauberer, den Simon im ersten Teil eigentlich den Gar ausgemacht hatte, will Rache &#252;ben und will &#252;ber seinen Lehrling Runt Simon in seine Welt holen. Das klappt auch ganz gut, nur landet Simon nicht im Schloss des b&#246;sen Zauberers, sondern vor Calypsos Laden. Zu Erinerrung: Simon hatte Calypso im ersten Teil das Leben gerettet. Calypso erkl&#228;rt Simon also wie er in seine eigene Welt zur&#252;ckkehrt und was er dazu braucht. Unterdessen hat Sordid bereits seine Monster losgeschickt, um Simon zu fangen.....</P>

<p>Soviel also zur Story - kommen wir nun zum Gameplay: Wie bereits im ersten Teil und anhand der Screenshots zu erkennen, ist der Bildschirm in zwei Teile unterteilt wie man es auch von den ganzen Lucasfilm Adventures a la Monkey Island, Zak McKracken oder Indiana Jones her kennt. Im oberen Teil befindet sich das eigentliche Spielfeld, in dem die Handlung verl&#228;uft. Im unteren Teil befinden sich s&#228;mtliche Befehle wieder, die der Spieler Simon geben kann, die durch h&#252;bsche Piktogramme dargestellt werden (Mund zum sprechen etc.). Zudem befindet sich im unteren Teil auch das Inventar wieder, in dem alle Sachen, die Simon auf seiner Reise so findet, dargestellt werden.</P>

<p>Was man nun machen muss? Ganz einfach: Die R&#228;tsel, die einem gestellt werden, m&#252;ssen gel&#246;st werden. H&#246;rt sich einfach an? Na ja, je nachdem wie gut man in Adventures ist, ist es das auch. Um die R&#228;tsel zu l&#246;sen, muss man h&#228;ufig bestimmte Gegenst&#228;nde ausfindig machen, diese geschickt anwenden oder auch mit anderen Charakteren sprechen bzw. zusammenarbeiten. Fairerweise muss gesagt werden, da&#223; der Schwierigkeitsgrad sich im Rahmen des ertr&#228;glichen bewegt und bei weitem nicht so &#252;bedreht ist, wie es seinerzeit bei Zak McKracken (kennt irgendwer dieses Game noch?) der Fall war, wo es ohne Komplettl&#246;sung fast unm&#246;glich war durchzukommen. Durch diesen vergleichsweise recht fairen Schwierigkeitsgrad kommt soetwas wie Langzeitmotivation auf - sicherlich gibt es einige R&#228;tsel im Spiel f&#252;r die man l&#228;nger braucht, aber gerade das - und die Tatsache, da&#223; man wei&#223;, da&#223; man es schaffen kann - sorgt f&#252;r Dauermotivation 
pur. Hinzu kommt zus&#228;tzlich noch die geh&#246;rige Portion Humor im Spiel selber, der die ganze Atmosph&#228;re 
wieder auflockert und f&#252;r den einen oder anderen Lacher sorgt. Last but not least sei erw&#228;hnt, da&#223; das Spiel von den Locations her relativ umfangreich ausgefallen ist, die nat&#252;rlich f&#252;r zus&#228;tzliche Abwechselung sorgen!</P><p><center><img src="simon1.jpg"></center></P><br>

<p>Vom Spielprinzip ist also wohl alles klar. Was bleibt ist der technische Aspekt &#252;ber den man noch sprechen muss. Wie oben bereits erw&#228;hnt stammt Simon II aus dem Jahr 1994 und das sieht man dem ohne Frage guten Spiel auch teilweise an. So kann die Grafik f&#252;r sich genommen zwar &#252;berzeugen (hier wurde tats&#228;chlich mit viel Liebe zum Detail gearbeitet), aber die sehr niedrige Aufl&#246;sung von 320 X 200 Pixeln vermindert diesen positiven Eindruck wieder - wer also aktuelle Games wie Earth 2140, Payback oder auch das etwas angestaubte Napalm mit wesentlich h&#246;heren Aufl&#246;sungen gewohnt ist, der wird bei Simon II wieder in anderen Dimensionen denken m&#252;ssen. Als kleines Trostpflaster haben die Programmierer die M&#246;glichkeit implementiert, da&#223; Spiel in einem Fenster auf der WB zu spielen. Ist aber wohl eher Geschmackssache, ob man Simon II auf der WB spielen m&#246;chte, denn es ist garantiert kein Game, das man mal eben nebenbei spielen kann.<BR>
Thema Sound: Tja, wer die PC Version kennt, der kann sich in etwa denken, was einen erwartet. Die Sprachausgabe - die &#252;brigens ein installiertes AHI vorraussetzt - ist nat&#252;rlich auch in der Amiga Version vorhanden. Leider gilt das nur f&#252;r die Englische Fassung, da die Rechte an der deutschen Version
bei einem anderen Herrsteller lagen. Diese Einschr&#228;nkung ist zwar recht &#228;rgerlich, aber &#228;ndern kann man es leider auch nicht. Stattdessen sollte man sich an der qualitativ hochwertigen englischen Version erfreuen und wer kein Englisch kann, darf sich &#252;ber entsprechende deutsche Untertitel freuen. </P>

<p><h1><center><font color="orange">Fazit</font></center></h1></P>
<p>Tja, mal abgesehen von der fehlenden deutschen Sprachausgabe und der etwas antiquierten Grafik (wof&#252;r aber die Jungs, die die Amiga Portierung geschrieben haben, nix k&#246;nnen!) ist Simon II ein absoluter Kn&#252;ller - trotz seines Alters. Die beiden oben genannten Kritikpunkte werden durch das gute Gameplay, welches Langzeitmotivation garantiert, allemal wieder wett gemacht. Somit ist Simon II ein Spiel geworden, welches sich Adventure Fans sowie insbesondere Fans des ersten Teils einfach nicht entgehen lassen d&#252;rfen. Und mal ehrlich: Welches moderne Adventure strahlt heute noch auch nur ann&#228;hernd 
soviel Flair aus, wie die alten Klassiker an die auch Simon II streckenweise erinnert? Klare Kaufempfehlung!</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
