<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=red alink=red>
<table width=95%>
<p><center><h1><font color="green">Leserbrief von Kilian "The Bruce" Servais</font></center></h1></P><ul>
<li><a href="#alle.html">An Yonder</A><BR></LI>
<li><a href="#wolf.html">An Wolf Zimmer</A><BR></LI>
<li><a href="#rene.html">An Martin Voepel</A><BR></LI>
<li><a href="#top.html">Top 5</A></UL></LI></P>
<hr>
<a name="alle.html">
<p><b>Hi Yonder!</B><br>
Och, sei mal nicht so pessimistisch. Es gibt f&#252;r den Amiga nach wie vor gute Software und ich glaube auch, da&#223; es dieses Jahr ein Cubtreffen gibt. Klar, der momentane Zustand der NoCover sowie des Amigas im allgemeinen ist zwar nicht wirklich prickelnd, aber deswegen sollten wir uns doch nicht unter kriegen lassen.</P>

<p>Was die HMG betrifft: Das mit den ganzen Reviews w&#228;re mir wirklich zu stressig geworden und f&#252;r die paar Nasen, die die HMG lesen, lohnt sich der Aufwand nun wirklich nicht. Ich hatte ja auch schon angefangen alles nach HTML zu portieren, aber auch das hat sehr viel Zeit gekostet und ich habe es einfach nicht geschafft, es zu vollenden. Mag wohl auch daran liegen, da&#223; ich 1997 / 1998, als die erste Version der HMG erschienen ist, wesentlich mehr Zeit hatte, als heutzutage. Was mich allerdings wundert ist die Tatsache, da&#223; die HMG 3.5 nicht mehr im Aminet ist. Sollte ich vielleicht nochmal hochladen.... Als quasi Ersatz gibt es ja immer noch die Metal Corner sowie die abgespeckte HMG, von der es irgendwann auch nochmal eine neue Version geben wird.</P> 

<p>Klar kann ich Dir mal eine Radiosendung auf CD zukommen lassen. Ich br&#228;uchte dann nur einen Rohling, auf den ich das ganze brennen k&#246;nnte. Wenn Du noch irgendwelche Musik auf Tape brauchst, kannst Du nat&#252;rlich auch gerne ein Tape mitschicken - vielleicht habe ich ja hier noch etwas, was Dich interessieren k&#246;nnte. Sch&#246;n, da&#223; Dir die HP gef&#228;llt. Wenn Du allerdings Verbesserungsvorschl&#228;ge hast, z&#246;gere nicht und teile mir diese mit.</P> 

<p>Andere Gruppen, die nach Nightwish klingen? Mmmhhhh, wenn du jetzt auf den weiblichen Operngesang anspielst, muss ich leider passen. Edenbridge kennst Du ja bereits, aber viel mehr gibt es in dem Bereich nicht. Rein musikalisch gesehen m&#252;sstest Du mal Stratovarius (Am besten das `97er Werk &quot;Visions&quot;) oder Sonata Artica (&quot;Ecliptica&quot;) antesten. Wie gesagt: Ist nicht ganz das gleiche, sollte Dir aber trotzdem zusagen. Ach ja, noch ein Tip: Von Nightwish gibt es noch eine Scheibe namens &quot;Angels Fall First&quot;. Kaufe Dir diese bitte nicht blind, da es sich um das stark Gothic-lastige und ziemlich schwach produzierte Debutalbum handelt, welches mit den nachfolgenden Meisterwerken nicht mehr mithalten kann. Oceanborn ist &#252;brigens auch mein ganz pers&#246;nliches Lieblingsalbum von Nightwish.</P> 

<p>Emulierst Du eigentlich Deinen Amiga per PC oder hast Du Dein Original Teil noch zu Hause stehen? W&#252;rde mich mal so pro forma interessieren....</P>


<p>See ya!</P>
<hr>
<a name="wolf.html">
<p><b>Hi Wolf!</B><br>
Auch wenn wir uns per E-Mail schon ab und an geschrieben haben, wollte ich Dir auch per NC noch einige Zeilen zukommen lassen. Immerhin ist die NC dann nicht ganz so leer und ich kann noch auf Deinen letzten Brief eingehen.</P>

<p>Schade, da&#223; Du mit Deinen Java Script Spielereien aufh&#246;rst - war ein Aspekt, der die NC wieder etwas aufgewertet hatte. Allerdings gehe ich mal schwer davon aus, da&#223; heutzutage jeder einen aktuellen Browser auf seiner Platte rumfliegen hat und sei es nur AWeb 3.3 aus dem OS 3.9 Paket, der ja auch &#252;ber grundlegende Java Script F&#228;higkeiten verf&#252;gt. Kann aber Deinen Frust gut verstehen: F&#252;r 10 Nasen, die das maximal lesen, lohnt sich der ganze Aufwand wirklich nicht.</P>

<p>Die Aminet CD`s werde ich wohl nur weitertesten, wenn der Andreas mir diese zukommen l&#228;sst. Ich selber hole mir alle 8 Monate nur die Set`s, was f&#252;r mich v&#246;llig ausreicht, kann ich mir doch mitlerweile aus dem Netz die neuesten Updates etc. besorgen. Meine pers&#246;nliche Meinung werde ich allerdings nach wie vor in die Tests einbringen und auch die Tatsache, da&#223; ich nach wie vor an den Classic Amiga glaube, wird sich in den Berichten wiederspiegeln.</P>


<p>Das soll es auch f&#252;r`s erste wieder gewesen sein. Ciau!</P
<hr>
<a name="martin.html">
<p><b>Hi Martin!</B><br>
Du hattest um Resonanz in Bezug auf Dein Wissensquiz gebeten. Okay, here we go:
Ersteinmal mein Kompliment zu diesem Quiz - du scheinst Dir wirklich viel M&#252;he gegeben haben und ich fand die Idee wirklich cool. Und da die NC momentan ohnehin nicht aus allen N&#228;ten platzt, ist der Umfang schon okay. Was die Fragen angeht ist das sicherlich Geschmackssache. Evtl. machst Du mal ein 
reines Amiga Quiz mit Amiga spezifischen Fragen? Oder ein Spiel mit Fragen, die nur das Allgemeinwissen wiederspiegeln. So ist die Frage &quot;F&#252;r welche Lokomotiven steht bei der Deutschen-Eisenbahn AG (DB) die Ordnungsnummer 99?&quot; f&#252;r meinen Geschmack viel zu speziell ausgefallen - wohl nur die wenigsten werden darauf die passende Antwort gewusst haben. Aber trotzdem: Ich rechne Dir Deine Bem&#252;hungen im Bezug auf die NC hoch an und mach weiter damit. Bis dann mal!
<hr>
<a name="top.html">
<p><h1><center><font color="green">Top 5</font></center></h1></P>

<p>1.WWV von Martin Voepel (Arbeit pur!)<br>
2. Earth 2140 von Andreas Guldner<br>
3. Online Artikel von Wolf<br>
4. Euro von Wolf<br>
5. Land Of Genesis von Andreas</P>

<p>Wenn sich mit der NC nicht bald etwas tut, geht es mit ihr bald zu Ende. Ich muss dem Editorial von Andreas einfach nur zustimmen, denn das er langsam keine Lust mehr hat, kann ich gut verstehen. Immerhin hat er mit der NC auch sehr viel Arbeit - da geht Zeit verloren, die er besser &amp; sinnvoller in die Amiga Future oder den Vertrieb von Programmen stecken k&#246;nnte. Ich hoffe nur, da&#223; sich bald einige passive Members wieder aufraffen, denn ansonsten war es das wohl mit der NC. Stellt Euch einfach mal folgendes Szenario vor: Wolf hat mal einen Monat keine Zeit und schreibt nix. Nehmt mal die letzte NC und zieht alle Artikel von Wolf ab - viel bleibt da nicht mehr &#252;brig. Denkt mal dr&#252;ber nach...</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
