<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#808080">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Sexual-Riechstoffe</b></font></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>              
<p><table border=0 align=left><tr><td bgcolor="#ff0000"><center>
<b>Sexuallockstoffe</b><br>
<font size="-1">Attracktiv durch PHEROMONE</font><br>
<font size="-2">Hotline t&auml;glich 9-24h 02234-899994</font><br>
<b><font size="-1">www.deborah.de</font></b></td></tr></table>
Dieser Tage stolperte ich &uuml;ber nebenstehende kleine Anzeige und war auf dem
zweiten Blick dann doch etwas neugierig. So klickte ich die angegebene
Homepage <b><u><font color="#0000ff">www.deborah.de </font></u></b> an,
um mich schlauer zu machen. Aber da ist noch nicht viel - eine &Uuml;berschrift
- vier Links, von denen nur zwei erst belegt sind, und der Hinweis, dass
diese Website sich im Aufbau befindet (mit copyright 2000). </p>

<p><img src="onl_riechen1a.gif" width=320 heigth=70 align=left hspace=6>Das
ist nun der Kopf der Einstiegsseite, das Logo und vier Schaltfl&auml;chen, wovon
nur Nr.1 und Nr. 3 erst belegt sind. Interessiert h&auml;tte mich schon ein
Blick auf die Produktpalette, aber es scheint erst ein Produkt zu geben.
Unter dem Logo kommt nun der Hinweis, dass sich alles noch im Aufbau
befindet. Und weil nicht viel zu sehen ist, wollte ich mal feststellen,
dass au&szlig;er einer Orderung (den Preis habe ich mir aber nicht angeschaut)
noch zwei Texte vorhanden sind. <br clear=all>

<img src="onl_riechen1b.jpg" width=320 heigth=260 align=left
hspace=6>Nebenstehendes Bild wird unter InfoCenter aufgezeigt und von hier
kann nur zu zwei Texten verzweigt werden. Einmal eine Aussage &uuml;ber das
Produkt und zum zweiten ein Artikel aus der Illustrierten "STERN". </p>

<p><b>Entdeckung der Pheromone</b><br>
                    
Die Entdeckung der menschlichen Pheromone und ihres Ziels, das
Vomero-nasal-organ (VNO) ist ein Wissenschaftskrimi voller Zuf&auml;lle,
gl&uuml;cklicher F&uuml;gungen und beharrlicher Detek-tivarbeit.<br>

Sie beginnt 1960. Damals hatte sich David Berliner als junger Professor der
Anatomie in den Kopf gesetzt herauszufinden, welche Chemikalien in der Haut
steckten. An der Universit&auml;t von Salt Lake City kratzte er Hautzellen
aus den abgelegten Gipsverb&auml;nden der Skifahrer, die sich an den
steilen Bergen, rings um die Mormonenstadt, die Knochen gebrochen hatten.
Er laugte die Zellen mit L&ouml;semittel aus und lie&szlig; den Extrakt in
offenen Flaschen im Labor stehen. &quot;Ich dachte ja nicht im Traum daran,
dass das Zeug fl&uuml;chtig sein k&ouml;nnte!&quot; erz&auml;hlt
Berliner.<br>

Zur allgemeinen Verbl&uuml;ffung machte sich in dem normalerweise von Hader
und Hektik erf&uuml;llten Labor urpl&ouml;tzlich Ruhe und Frieden breit.
Die vorher undenkbare Harmonie ging sogar soweit, dass die Forscher nach
dem gemeinsamen Lunch Bridge spielten. Als Berliner die Flaschen mit dem
Hautextrakt verschloss, war die Kollegialit&auml;t wie weggeblasen.
&quot;Von stund an redete niemand mehr &uuml;ber Bridge. </p>

<p><b>Pheromone Botenstoffe der Liebe</b><br>
Neue Erkenntnisse &uuml;ber die Verf&uuml;hrung durch die Nase</p>

<p>Bei den Tieren kennt man sie schon l&auml;nger jetzt wei&szlig; man, dass
auch das Verhalten des Menschen von kaum wahrnehmbaren Substanzen gesteuert
wird. Wissenschaftler finden immer neue Beweise, dass diese in der Haut
produzierten, meist geruchlosen Pheromone &uuml;ber Lust und Liebe,
Sympathie und Sex entscheiden.<br>

von Gerd Schuster<br>
</p>

<p>Napoleon Bonaparte fasste sich kurz. &lt;Ne te lave pas, je reviens&gt;,
schrieb er in einer Depesche aus dem Feldlager an Kaiserin Josephine,
&quot;Wasch Dich nicht mehr, ich komme bald zur&uuml;ck.&quot;</p>

<p>Der geniale Schlachtlenker besa&szlig; offenbar ein untr&uuml;gliches
Gesp&uuml;r daf&uuml;r, dass bei Liebe und Sex die Nase eine
Schl&uuml;sselrolle spielt. Jetzt, 200 Jahre sp&auml;ter, k&ouml;nnen
Forscher das Verhalten des kleinen Korsen wissenschaftlich erkl&auml;ren.
Das Richorgan erschn&uuml;ffelt nicht nur bet&ouml;rendes Parf&uuml;m oder
absto&szlig;ender K&ouml;rpermief, es kann auch geheimnisvolle Lock- und
Botenstoffe orten, die Pheromone.</p>

<p>Sie steuern beim Menschen viele Emotionen, sexuelle Anziehung wie
Partnerwahl. Obwohl sie meist geruchlos sind und nur in winzigen Spuren
durch die Luft schweben, bestimmen sie, wer unsympathisch ist und wer
nicht. Und sie stecken wie ein unsichtbarer Kuppler hinter der Liebe auf
den ersten Blick, die strenggenommen &quot;Liebe auf den ersten
Riecher&quot; hei&szlig;en m&uuml;sste.</p>

<p>Auch an den sprichw&ouml;rtlichen Fr&uuml;hlingsgef&uuml;hlen sind die erst
in den letzten Jahren entdeckten Botenstoffe beteiligt. Wenn der Winter
vorbei ist, Mantel und M&uuml;tze eingemottet sind und kein Schnupfen mehr
die Nase verstopft, kommt ihre gro&szlig;e Zeit. Ungehindert k&ouml;nnen
die geheimen Verf&uuml;hrer jetzt aus Dekollet&eacute;s entweichen. Ihre
volle Wirkung entfalten sie, wenn sie in eine &quot;fremde&quot; Nase wehen
und dort auf das &quot;Vomeronasalorgan&quot; treffen. Das nur ein
Zentimeter lange und streichholzd&uuml;nne Sinneswerkzeug, das ein
holl&auml;ndischer Millit&auml;rarzt bereits Anfang des 18. Jahrhunderts
beschrieb, haben die Forscher erst vor kurzem wiederentdeckt.</p>

<p>Professor Werner Langthaler, Psychologe an der Universit&auml;t
M&uuml;nster:&quot;Es ist eine Sensation, dass wir jetzt, schon fast im
Jahr 2000, einen neuen menschlichen Sinn aufsp&uuml;ren&quot;.</p>

<p>Ohne das VON, so die g&auml;ngige Abk&uuml;rzung f&uuml;r den
Zungenbrecher, l&auml;uft auch im Tierreich nichts. Seiden&auml;ffchen und
Graskarpfen, Blaukrabben und Ameisen verst&ouml;men Pheromone zur
Markierung von Reviergrenzen, zur Warnung vor Feinden, als chemische
Erkennungsmarke, als Liebesverlockung, Rangabzeichen und f&uuml;r viele
Zwecke mehr. Bienenk&ouml;niginnen hemmen mit Pheromonen die
Geschlechtsreife der Arbeiterinnen und bringen die Drohnen zum
Schw&auml;rmen. W&auml;hrend sich ganze Forscherbrigaden mit Tierpheromonen
besch&auml;ftigen, ist &uuml;ber menschliche Lockstoffe bis heute wenig
bekannt. Man wei&szlig; noch nicht einmal wie sie produziert werden. Viel
spricht jedoch daf&uuml;r, dass es in der Haut geschieht, dem
gr&ouml;&szlig;ten und komplexesten Organ des menschlichen K&ouml;rpers,
das den Wissenschaftlern noch viele R&auml;tsel aufgibt.</p>

<p>Auf einem einzigen Quadratzentimeter dr&auml;ngen sich im Durchschnitt
sechs Millionen Zellen, 5000 Sinnesk&ouml;rper, 100 Schwei&szlig;- und 15
Talgdr&uuml;sen, dazu 200 Schmerzpunkte, 10 bis 25 Druckpunkte, 12
K&auml;lte- und 2 W&auml;rmepunkte . Vier Meter Nervenfaser und ein Meter
Blutgef&auml;&szlig;e stellen Vernetzung und Versorgung sicher.</p>

<p>Die wichtigsten Pheromonfabriken sind die Achselh&ouml;hlen. Ihre
Schwei&szlig;dr&uuml;sen mischen eine Reihe von Lockstoffen an. Die
Substanzen werden beim Transpirieren ausgeschieden und auf der erhitzten
Haut verdampft. Was aber ist daran blo&szlig; so attraktiv ? Und was hat
das mit Liebe und Sex zu tun ?</p>

<p>Schwei&szlig;dr&uuml;sen in der Achselgegend sind nur in der Zeit
t&auml;tig, in denen der Mensch vermehrungf&auml;hig ist. Sie nehmen ihre
Arbeit erst in der Pupert&auml;t auf und stellen sie in den Wechseljahren
wieder ein. Und nicht umsonst liegt beim &quot;Kuscheln&quot; der Kopf und
damit die Nase der Frau meist in unmittelbarer N&auml;he der
m&auml;nnlichen Achselh&ouml;hle.</p>

<p>&quot;K&ouml;rperlicher Kontakt ist f&uuml;r die &Uuml;bertragung von
Pheromonen unerl&auml;&szlig;lich&quot; sagt der Anatomie-Professor Charles
Wysocki, renomierter Lockstoff-Forscher der Univerasit&auml;t
Philadelphia. &quot;Die Riech- und Reichweite der Pheromone betr&auml;gt
h&ouml;chstens ein paar Zentimeter.&quot; Dicke Kleidung blockiert also die
fl&uuml;chtigen Liebesboten, die als feiner Dunstschleier auf unserer Haut
liegen wie Fr&uuml;hlingsnebel &uuml;ber einer Blumenwiese. H&auml;ufiges
Waschen d&uuml;nnt die Pheromone aus oder vertreibt sie ganz.</p>

<p>Genau das wollte Napoleon verhindern. Randvoll mit Pheromonen, so der
Neurophysiologe Luis Monti-Bloch von der Universit&auml;t of Utah in Salt
Lake City, ist die vom Au&szlig;enrand der Nasenfl&uuml;gel zu den
Mundwinkeln verlaufenden Nasolabialfurche. Und genau in sie sto&szlig;en
beim K&uuml;ssen die Nasenspitzen der Schmuser hinein. Professor
Monti-Bloch :&quot; Warscheinlich ist der Ku&szlig; ein Ritual, das vor
allem dem Erschn&uuml;ffeln von Pheromonen dient.&quot; Beim galanten
Handku&szlig; ist das ganz offensichtlich.</p>

<p>Der Liebesakt ist f&uuml;r die Psychologin Winnifred Cutler aus Haverford
bei Philadelphia ein regelrechtes Pheromon-Bad. Die Forscherin hat
festgestellt, das Frauen, die mindestens einmal pro Woche mit einem Mann
schlafen, eine regelm&auml;&szlig;igere Periode haben als enthaltsame
Geschlechtsgenossinnen. F&uuml;r diesen Effekt sind aber offenbar weder
Mann noch Sex verantwortlich, sondern alleine die m&auml;nnliche Duftaura:
Frauen, denen Cutler mehrere Wochen lang t&auml;glich einen alkoholischen
Auszug aus m&auml;nnlichen Achselschwei&szlig; unter die Nase tupfte,
bekamen auch ohne Herrenbesuch und Z&auml;rtlichkeiten einen
regelm&auml;&szlig;igen Zyklus.</p>

<p>Ganz spezielle Lockstoffe scheinen den Geschlechtsorganen zu
entstr&ouml;men. &quot;Die Spitze des Rattenpenis produziert ein eigenes
Pheromon&quot;, sagte Clive Jennings-White von der Universit&auml;t von
Utah in Salt Lake City, &quot;warum sollte das beim Menschen anders
sein?&quot; Bisher habe man bei Ratten 35 verschieden Pheromone entdeckt.
&quot;Ich glaube kaum, das wir Menschen weniger besitzen.&quot;</p>

<p>In f&uuml;nfj&auml;hriger Detektivarbeit entdeckte der Forscher 25
verschieden Botenstoffe des Homo sapiens und entschl&uuml;sselte ihre
Chemie. Auch Substanzen, die den Geschlechtstrieb anregen, waren dabei.
&quot;Aber dar&uuml;ber reden wir nicht !&quot; sagte David Berliner. Der
66j&auml;hrige, fr&uuml;her Anatomie-Professor an der Universit&auml;t von
Utah, leitet die Pheromon-Firmen &quot;Pherin&quot; und &quot;Realm&quot;
in Kalifornien. Bei &quot;Pherin&quot; forschen auch die Experten
Jennings-White und Monti-Bloch. &quot;Was wir entdeckten&quot;, sagte
Berliner, &quot;werden wir nur als Medikament vermarkten, etwa gegen
Impotenz oder St&ouml;rungen des Geschlechtstriebes - auf keinen Fall aber
als Aufputschmittel.&quot; Ohnehin sei nicht zu erwarten, dass Menschen
unter dem Einflu&szlig; der Substanzen &uuml;bereinander herfielen wie
m&auml;nnliche Motten &uuml;ber ein mit weiblichen Lockstoffen
getr&auml;nktes St&uuml;ck L&ouml;schpapier.</p> 

<p>Zumal die Pheromonpalette au&szlig;er Aphrodisiaka auch Substanzen
umfa&szlig;t, die unsympathisch machen. Wenn man jemanden &quot;nicht
riechen&quot; kann, dann sind Absto&szlig;ungspheromone und ein
nat&uuml;rlicher Schutzmechanismus schuld. Deutsche wie amerikanische
Forscher wiesen nach, dass man Menschen instinktiv ablehnt, wenn deren
Immun-Gene den eigenen sehr &auml;hnlich sind. Die Natur will damit nicht
nur Inzest verhindern, sondern auch ausschlie&szlig;en, dass Nachkommen
entstehen, deren Immunschutz gef&auml;hrliche L&uuml;cken aufweist.</p>

<p>Dieser Mechanismus wirkt unfehlbar, den obwohl die Pheromon-Produktion von
Stimmung, Gesundheitszustand und Alter abh&auml;ngig ist, besitzt jeder
Mensch eine eigene, unverwechselbare Pheromon-Aura. Dieser &quot;chemische
Ausweis&quot; machen sich offenbar Suchhunde beim Aufsp&uuml;ren von
Vermi&szlig;ten ebenso zunutze wie S&auml;uglinge bei der Suche nach der
Brustwarze ihrer Mutter. Schon am zweiten Lebenstag k&ouml;nnen sie die
richtige Milchquelle an ihrem Geruch beziehungswei&szlig;e an ihren
Pheromonen erkennen.</p>

<p>Bereits Spuren von Pheromonen f&uuml;hren das Baby gesteuert vom
Vomeronasalorgan dabei zum Ziel. Das menschliche VNO ist nach Meinung von
Luis Monti-Bloch &auml;hnlich Leistungf&auml;hig wie das von Hund und
Katze. Der Professor :&quot;Unser VNO ist rund tausendmal
leistungsf&auml;higer als unser Geruchssinn. Die Lockstoffe wirken, so
Monti-Bloch, &uuml;ber das VNO auf den Hypothalamus. Das ist ein Teil des
Zwischenhirns, der die wichtigsten Vorg&auml;nge im Organismus regelt
K&ouml;rperw&auml;rme, Geschlechtstrieb, Fettstoffwechsel, Schlaf,
Blutdruck und Atmung. Im Test haben die Substanzen bisher 20 verschieden
Stoffwechselvorg&auml;nge beeinflu&szlig;t binnen Sekundenbruchteilen. Die
Entdeckung der menschlichen Pheromone und ihres Zielorgans ist ein
Wissenschafts-Krimi voller Zuf&auml;lle, gl&uuml;cklicher F&uuml;gungen und
beharrlicher Detektivarbeit. Es beginnt im Jahre 1960. Damals hatte sich
David Berliner als junger Anatomie-Professor in den Kopf
gesetzt herauszufinden, welche Chemikalien in der
Haut steckten. In der Universit&auml;tsklinik von Salt Lake City kratzte er
Hautzellen aus abgelegten Gipsverb&auml;nden verungl&uuml;ckter Skifahrer,
die sich an den steilen Bergen rings um die Mormonenstadt die Knochen
gebrochen hatten.</p>

<p>Berliner :&quot;Wir sto&szlig;en rund 1000 Zellen pro Quadratzentimeter
Haut und Stunde ab. In den Gipsbeinen war viel zu finden&quot;. Er laugte
die Zellen mit L&ouml;semitteln aus. Den Extrakt lie&szlig; er in offenen
Flaschen im Labor stehen. &quot;Ich dachte ja nicht im Traum daran, dass
das Zeug fl&uuml;chtig sein k&ouml;nnte&quot;.</p>

<p>Zur allgemeinen Verbl&uuml;ffung machte sich in dem normalerweise von
Hektik und Hader erf&uuml;llten Labor urpl&ouml;tzlich Ruhe und Frieden
breit. Die vorher undenkbare Harmonie ging sogar so weit, dass die Forscher
nach dem gemeinsamen Lunch Bridge spielten. Als Berliner jedoch die Flasche
mit dem Hautextrakt verschlo&szlig;, war die Kollegialit&auml;t wie
weggeblasen. &quot;Von Stund&acute;an redete niemand mehr &uuml;ber
Bridge&quot;.</p>

<p>Die Vermutung, die unbekannte Chemikalienmischung habe etwas mit dem
Stimmungsumschwung zu tun, erschien Berliner damals v&ouml;llig abwegig.
Menschliche Pheromone waren noch nicht bekannt, und er selbst brachte
seinen Studenten bei, Erwachsene bes&auml;&szlig;en kein VNO. Der Forscher
packte seine Extrakte mit den Hautzellen in die K&auml;ltetruhe und
konzentrierte sich aufs Geldverdienen. Mitte der 80ger Jahre entdeckte der
Elektronenmikroskopist David Moran von der University of Colorado in Denver
sein Interesse an der Feinstruktur des Nasengewebes. Der Chef der
Hals- Nasen- Ohren- Abteilung, Professor Bruce Jafek, mit dem er
zusammenarbeitete, erz&auml;hlte ihm ganz nebenbei, dass sich einer seiner
Studenten mit dem VNO beim F&ouml;tus besch&auml;ftigte. Moran und Jafek
fragten sich, ob sich das Organ tats&auml;chlich zur&uuml;ckbilde, wie es
bis heute miserabel belegt in den meisten Lehrb&uuml;chern steht.
Kurzentschlossen machten sie die Probe aufs Exempel, suchten mit Mikroskop
und viel Licht und fanden bei jedem ihrer mehr als 200 Patienten das
VNO.</p>

<p>Die Gr&ouml;&szlig;e seines Eingangs in der Nasenschleimhaut schwankt
zwischen 2 Millimetern und mit blo&szlig;em Auge nicht mehr sichtbaren 0,2
Millimetern. Von dem Gr&uuml;bchen f&uuml;hrt ein wenige Millimeter langer
Gang voller Rezeptorzellen in das Organ, das konischwie eine Eist&uuml;te
ist.</p>

<p>Anfang 1990 erinnerte sich Berliner an seinen seit einem viertel
Jahrhundert eingefrorenen Hautzellenextrakt. Er hatte alle
Ver&ouml;ffentlichungen &uuml;ber VNO und Pheromone aufmerksam verfolgt,
und wollte nun wissen, ob seine Substanzen auf dieses Organ wirkten und
wandte sich an Monti-Bloch. Der war zun&auml;chst &uuml;beraus skeptisch,
entwickelte aber ein Ger&auml;t, das im VNO durch Reize erzeugte
elektrische Impulse messen und per Computer als eine Art VNO-EKG
aufzeichnen sollte. Eine haarfeine Silbernadel f&uuml;hrte direkt in die
&Ouml;ffnung des VNO. Umgeben ist sie von einem Mantel, durch den eine
Pheromon-Luft-Mischung in das Organ geleitet werden kann. Monti-Bloch
testete das Ger&auml;t an der Richschleimhaut, die in der Nase rund 5
Zentimeter &uuml;ber dem VNO sitzt. W&uuml;rzte er den Luftstrom mit
Duftstoffen, gab es einen Ausschlag. Das VNO machte auch bei den
st&auml;rksten D&uuml;ften keinen elektronischen Mucks. Erst Berliners
Hautextrakt erweckte es zum Leben. Seit 9 Jahren l&auml;uft nun die
Forschung der von Berliner gegr&uuml;ndeten Firmen in Kalifornien auf
Hochtouren. Besonders wenn sie die Wirkung neu entdeckter Botenstoffe
testen, erleben die Forscher &Uuml;berraschungen. Anstatt bei einer
Substanz liebestoll zu werden wie Kater, die eine rollige Katze wittern,
machte sich bei einer Gruppe von Versuchspersonen tiefe Entspannung
breit.</p>

<p>Verwundert registrierte Monti-Bloch dass sich Herzschlag und Atmung der
Probanden verlangsamte und sich ihre Muskeln lockerten. &quot;Pheromone
haben bei uns Menschen eben auch andere Aufgaben als zum Sex zu
stimulieren&quot;,sagte Berliner. &quot;Soziale Pheromone&quot;, die
zwischenmenschliche Beziehungen verbessern, seien doch &quot;ein Geschenk
des Himmels&quot;.</p>

<p>Clive Jennings-White hat bereits mehr als 100 k&uuml;nstliche Pheromone
hergestellt. Er nennt sie Vomerophine. Sie wirken oft st&auml;rker als die
nat&uuml;rlichen Stoffe. Der Chemiker :&quot;Das Potential ist Gigantisch !
Deshalb lassen wir wie verr&uuml;ckt patentieren.&quot;</p>

<p>Berliner :&quot;Ich bin sicher, dass unsere Forschung unglaubliche
M&ouml;glichkeiten zur Behandlung von Krankheiten er&ouml;ffnet.
K&uuml;nstliche Pheromone k&ouml;nnen als Appetitz&uuml;gler,
Verh&uuml;tungsmittel und Angsl&ouml;ser eingesetzt werden. Als erstes
werde man jedoch ein Mittel gegen Prostatakrebs entwickeln. Grundlage sein
ein Vomerophin, das die Testosteron-Produktion im K&ouml;rper des Kranken
stoppe. Sinkt die Menge des Geschlechtshormones im Blut, schrumpft der
Krebs. Nebenwirkungen seien nicht zu erwarten, da der Patient nicht mit
Drogen oder Hormonen vollgepumpt werden m&uuml;sse, sondern lediglich am
Medikament &quot;rieche&quot; !</p>

<p>Berliner hat bisher 5 Millionen Dollar in die Forschung gesteckt. Das
n&ouml;tige Kleingeld verdient er mit seiner Parf&uuml;mkreation
&quot;Realm&quot;. Das mit zwei synthetischen Pheromonen versetzte
Duftwasser soll beim Tr&auml;ger eine milde Euphorie erzeugen und so ein
Anbandeln mit dem anderen Geschlecht ohne Nervosit&auml;t und Stress
erm&ouml;glichen. Die Essenz, als Herren- und Damenversion im Handel,
scheint zu wirken, denn sie verkauft sich bestens. Das
&quot;WallStreetJournal&quot; meldete Ende 1995, Realm sei in der
Kaufhauskette Bloomingdales zum &quot;&Uuml;berraschungshit&quot;
avanciert. Dem runden Dutzend Konkurenten auf dem internationalen Markt
f&uuml;r Pheromonparf&uuml;ms wirft der Pherin-Bo&szlig; vor, zu
verh&ouml;kern. Und er hat recht: die meisten W&auml;sserchen sind laut
Deklaration mit Androstenon verquirlt, einem Eber-Pheromon. Und genau das
wirkt beim Menschen nicht.</p> </p>

<p>DS PRESSE
<br>
Textdokumentation</p>

<p>Quelle : STE Stern Datum: 25.04.96 SE: 16</p>
                    
</p>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
