<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Online-Splitter</b></font></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>
<p><b><font color="#006000" size="+1">Sein Name ist COM,</font>
<font color="#ff0000" size="+1">DOTCOM </font></b><br>
Sein Vorname: Tomer. Sein neuer Nachname: Dotcom, geschrieben
&quot;<b>.com</b>&quot;. Mit diesem Einfall d&uuml;rfte sich der
25-j&auml;hrige Israeli Tomer einen weltweit einmaligen Namen gegeben
haben. Und seine Homepage hei&szlig;t genauso. Tomer hofft nun, dass er auf
diesem Wege &quot;eine Traumfrau&quot; findet. <br>
<b><font color="#0000ff" size="-1">http://tomer.com</font></b>
<hr width=80%></p>

<p><b><font color="#006000" size="+1">Web-Tipps f&uuml;r 33 St&auml;dte</font></b><br>
St&auml;dtereisen liegen im Trend. Ob Hamburg oder M&uuml;nchen, Berlin
oder K&ouml;ln -diese St&auml;dte laden zum Urlaub ein. Nur: Nicht zu jeder
Metropole liegt ein Reisef&uuml;hrer mit den wichtigsten Informationen
parat. Abhilfe schafft <u><font color="#0000ff">www.locality.de</font></u>.
Dort finden Reisewillige alles, was sie brauchen. Der Online -
St&auml;dtef&uuml;hrer bietet ausf&uuml;hrliche und reich bebilderte Infos
zu 33 deutschen St&auml;dten. Artikel &uuml;ber die sch&ouml;nsten Museen
gibt es ebenso wie Restaurant- und Hoteltipps. Die Aktualit&auml;t ist von
Journalisten vor Ort gew&auml;hrleistet. <br>
<b><font color="#0000ff" size="-1">www.locality.de</font></b>
<hr width=80%></p>

<p><b><font color="#006000" size="+1">Sch&uuml;ler unterweisen Lehrer</font></b><br>
Verkehrte Welt an der Comenius-Schule im hessischen Eppstein. Der Rektor
und ein Teil seines Kollegiums m&uuml;ssen nachsitzen. Ein 17-J&auml;hriger
(Oberstufe am benachbarten Gymnasium) bringt den Grundschulp&auml;dagogen
das Einmaleins der Informationstechnologie bei: Bedienung der Maus oder
recherchieren im Internet. <br>
Im hessischen Main-Taunus-Kreis hat der dortige Landrat das Projekt
&raquo;Teach your teacher&laquo; gestartet. Sechs Sch&uuml;ler machen etwa
60 Lehrer am PC fit, und die Kommune bezahlt sie daf&uuml;r. Rund 60.000
Mark stehen f&uuml;r etwa 3000 Schulungsstunden zur Verf&uuml;gung. Die
Sch&uuml;ler haben 630-Mark-Vertr&auml;ge und bekommen einen Stundenlohn
von 20 Mark. <br>
<b><font color="#0000ff" size="-1">www.comeniusschule-eppstein.de.gs</font></b>
<hr width=80%></p>

<p><b><font color="#006000" size="+1">"Dr. Sommer" f&uuml;r die Jugend</font></b><br>
Seit Mitte April kl&auml;rt &quot;Dr. Sommer&quot; die Jugend auch online
auf. In der Rubrik &quot;Body&quot; etwa werden die k&ouml;rperlichen
Entwicklungsstadien von Jungen und M&auml;dchen gezeigt und erkl&auml;rt.
Die Netz-Bravo <b> <font color="#0000ff">www.bravo.de</font></b> bietet
alles, was Teeni-Herzen wollen: News, Tipps zu Musik, Kino oder Handy.
Weiter im Angebot: Soiele, Freemail, Webradio. Mit dieser Themenvielfalt
ist das Portal konkurrenzlos - die Rivalen <b><font color="#0000ff">
www.funonline.de &nbsp; www.yam.de &nbsp; www.giga.de &nbsp;
www.mtvhome</font></b>, die um die Gunst der jugentlichen Surfer buhlen,
konzentrieren sich auf deutlich weniger Inhalte. <br>
<b><font color="#0000ff" size="-1">www.bravo.de</font></b>
<hr width=80%></p>

<p><b><font color="#006000" size="+1">XY im Netz</font></b><br>
Das Portal <b>e110</b> bietet popul&auml;r aufbereitete Informationen,
Tipps und Ratschl&auml;ge aus dem Bereich
Kriminalit&auml;tspr&auml;vention. Betreut wird dieses Service-Angebot vom
ehemaligen TV-Ermittler Eduard Zimmermann. Motto: Je mehr die Leute wissen,
umso weniger laufen sie Gefahr, selbst Opfer zu werden. <br>
<b><font color="#0000ff" size="-1">www.e110.de</font></b>
<hr width=80%></p>

<p><b><font color="#006000" size="+1">"Pig Brother"</font></b><br>
<b>Reality-Show aus dem Schweinestall</b>. Sie sind nackt, buhlen um die
Gunst der dicksten Sau, suhlen sich im Schlamm und grunzen fr&ouml;hlich
vor sich hin. Ihre Namen sind Fred, Oskar, Juri, Lulu und Xanophela. Zu
bestaunen sind die Schweine auf der Homepage der &Ouml;szterreichischen
Jungbauernschaft unter dem Stichwort &quot;Pig Brother&quot;. Dabei werden
die Paarhufer rund um die Uhr von Webcams beobachtet. Doch das Ganze stellt
nicht nur eine Parodie auf den Wahnsinn der Reality-Soaps wie &quot;Big
Brother&quot; dar. Die Bauern wollen auch zeigen, dass es sehr wohl auch
eine skandalfreie Tierhaltung gibt. Das sattsam bekannte
&quot;Girlscamp&quot; wird mit Bildern aus einem Kuhstall bedacht. <br>
<b><font color="#0000ff" size="-1">www.open-bauernhof.at</font></b>
<hr width=80%></p>

<p><b><font color="#006000" size="+1">S&uuml;ddeutscher Verlag kauft
WEKA-Zeitschriften</font></b><br> R&uuml;ckwirkend zum 1. Januar 2001 hat
der <b>S&uuml;ddeutsche Verlag</b> die Fachzeitschriften der <b>WEKA
Firmengruppe</b> &uuml;bernommen. Wie der Verlag bekannt gab, erwirbt er
damit unter anderem die Zeitschriften <i>PC Magazin</i>, <i>PC go</i>,
<i>Markt und Technik</i> sowie <i>Funkschau</i>. Durch die &Uuml;bernahme
werde der Umsatz im laufenden Gesch&auml;ftsjahr auf &uuml;ber 800 Mio.
Mark steigen. Die Computer-Titel sind bisher im Kissinger WEKA
Computerzeitschriften-Verlag, im WEKA Fachzeitschriften-Verlag sowie im
Franzis Buch- und Software Verlag erschienen. Dar&uuml;ber hinaus hat der
S&uuml;ddeutsche Verlag von WEKA die 50-prozentige-Beteiligung an der
CMP-WEKA Verlagsgesellschaft erworben, die unter anderem die Zeitschrift
Computer Reseller News sowie die InformationWeek ver&ouml;ffentlicht. <br>
<b><font color="#0000ff" size="-1">www.gerline.de</font></b>
<hr width=80%></p>

<p><b><font color="#006000" size="+1">EMI und Bertelsmann beenden
Fusionsgespr&auml;che</b></font><br> Die <b>EMI Group plc</b> und die
<b>Bertelsmann AG</b> haben ihre Gespr&auml;che &uuml;ber eine Fusion ihrer
Musikgesch&auml;fte abgebrochen. Die kartellrechtlichen Anforderungen aus
Br&uuml;ssel und Washington f&uuml;r eine Fusion lie&szlig;en nach
&uuml;bereinstimmender Einsch&auml;tzung beider Unternehmen einen
langwierigen Genehmigungsprozess und hohe Auflagen erwarten, teilte
Bertelsmann mit. Das voraussichtliche Kartellverfahren habe die
Wirtschaftlichkeit des Vorhabens in Frage gestellt. <br>
<b><font color="#0000ff" size="-1">www.gerline.de</font></b>
<hr width=80%></p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
