<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Martin Voepel">
<META NAME="DESCRIPTION" CONTENT="R&auml;tsel">
<TITLE>R&auml;tsel</TITLE>

<!-- author JavaScript = "Wolf Zimmer"   -->
 <script language="JavaScript"><!--

  if (navigator.appVersion.indexOf("2.") != -1){
         check = false;
         }
  if ((navigator.appVersion.indexOf("3.") != -1) && (navigator.appName.indexOf("Explorer") != -1)){
         check = false;
         }
  else {
         check = true;
         }
  if (check == true){
         image1 = new Image();
         image1.src = "st_r_windy1.png";
         image1on = new Image();
         image1on.src = "st_r_windy2.png";
         image1stay = new Image();
         image1stay.src = "st_r_windy1.png";
  }

  imageStay = ""

  function imageon(name){
         if (imageStay != name){
                 document[name].src = eval(name + "on.src");
         }
  }

  function imageoff(name){
         if (imageStay != name){
                 document[name].src = eval(name + ".src");
         }
  }

  function on(name){
         if (check == true){
                 imageon(name);
         }
  }

  function off(name){
         if (check == true){
                 imageoff(name);
         }
  }

  function stay(name){
         if (check == true){
         document[name].src = eval(name + "stay.src");
         if (imageStay != name){

                 if (imageStay != ""){
                          document[imageStay].src = eval(imageStay + ".src");
                 }
         }
         imageStay = name
         }
  }
// -->
  </script>
</HEAD>
<BODY BACKGROUND="mv_bp_ring.gif" BGCOLOR="#FAEBD7" TEXT="#000000" LINK="#000000" ALINK="#000000" VLINK="#000000">
    <TABLE WIDTH="95%">
      <TR>
            <TD WIDTH="50"></TD>
            <TD>
    <BR>
    <H1>Fernsehen, die kleine Verf&uuml;gung</H1>
    <HR>
    <BR>
    Als ich eines Nachts so durch das Programm zappte und malwieder nichts auch nur halbwegs vern&uuml;nftiges fand, landete ich bei einem dieser Verkaufssender. Da sprach eine Barbara Sowieso &uuml;ber kleine Silberne, Goldene und Bunte Wunderdinge. Ich blieb dran, erfuhr das sie ihren Ursprung in den USA haben. In einer kleinen Fabrik in dem S&auml;dtchen Bredford PA hergestellt werden. Sie 1932 auf den Amerikanischen Markt kamen und 1.95$ kosteten. Sie im Zweitem - Weltkrieg von fast jedem US - Soldaten besessen wurdem, aber auch heute noch von fielen gebraucht werden. Es sich nur in ganz wenigen Punkten bis heute ver&auml;ndert hat und so weiter. <BR>
    <BR>
    Ich hatte das alles geh&ouml;rt, nat&uuml;rlich auch die Angebote die mir diese Barbara Sowieso bereitete aber ich hatte kein Telefon...<BR>
    <BR>
    <!-- <IMG SRC="st_r_windy1.png" ALT="Windy" BORDER="0" WIDTH="188" HEIGHT="326" HSPACE="10" ALIGN="LEFT"> -->
    Ich erinnerte mich aber darann im Conrad - Katalog auch irgendwo so ein Wunderding gesehen zu haben. Also den Katalog rausgekramt und nachgeschaut. Da lass ich die Anzeige und auch dass es ein Buch dazu gibt. Ein paar Tage darauf, ich musste ohnehin was bestellen, habe ich die Nummern notiert und ab damit zur Post. Eine Woche danach bekam ich von Conrad ein kleines Paket mit allerlei Bauteilen, dem Buch und dem Wunderding. Ich habe es gleich ausprobiert, aber es kam keine Flamme, nun gut, Benzin eingef&uuml;llt, aber nun...<BR>
    <BR>
<A HREF="st_Raetzel_2.html"
     onmouseover="on('image1');window.status=''; return true;"
     onmouseout="off('image1');window.status=''; return true;"
     onclick="stay('image1');">
    <img name="image1" IMG SRC="st_r_windy1.png" WIDTH="188" HEIGHT="326" border="0" HSPACE="10" ALIGN="LEFT">
    <alt="Windy1 / Windy2 / Ort" align=left></a>
    Im Buch lass ich die ganze Geschichte &uuml;ber dieses Wunderding, es ist von Georg G. Blaisdell "<I>erfunden</I>" worden. Hat nach einer l&auml;ngeren <I>Durststr&auml;cke</I> erst die USA erobert und dann den Rest der Welt. Es gab erst nur eine Ausf&uuml;rung, nach einpaar Jahren die zweite dann auch eine Ausf&uuml;hrung mit Werbung f&uuml;r eine Oil - Company in einer Auflage von 500 St&uuml;ck und so weiter.<BR>
    <BR>
    Inzwischen gibt es jedes Jahr ungef&auml;hr 2000 neu Modelle. Es wiegt ca. 60 Gramm. Es ist Sturmsicher, ist ganz im Inneren mit Watte gef&uuml;llt, nach aussen kann es sich immer in unterschiedlichen Designs darstellen und ist immer doch wieder gleich und unverwchselbar. <BR>
    <BR>
    Es ist im oberen bereich aufklappbar und gibt dann seine eigentliche Funktion preis. Es hat auf der einen Seite ein Reibrad und in der Mitte einen Blechk&auml;fig, dann kommt ein recht robustes Schanier. Es gibt noch einen Docht und einen Feurestein.<BR>
    <BR>
    Etwas, was bei der Firma ganz besonderes ist, ist die Lebenslange Garantie. Die Firma hat inzwischen weit &uuml;ber 300 Millionen St&uuml;ck davon verkauft.<BR>
    Sie wird n&auml;chstes Jahr 70, ich habe inzwischen nicht nur dieses eine, benutze es jeden Tag mehrfach.<BR>
    <BR>
    <CENTER>
    <TABLE>
      <TR>
        <TD WIDTH="50"><IMG SRC="st_r_fz.png" ALT="?" BORDER="0" WIDTH="47" HEIGHT="64"></TD>
        <TD> <FONT COLOR="#8A2BE2" SIZE="+6">Aber wie heisst es...?</FONT><BR>
        Es hat f&uuml;nf Buchstaben und die Firma die es herst&auml;llt hat auch diesen Namen!</TD>
        <TD WIDTH="50"><IMG SRC="st_r_fz.png" ALT="?" BORDER="0" WIDTH="47" HEIGHT="64"></TD>
      </TR>
    </TABLE>
    </CENTER>
    <BR>
    <BR>
    <CENTER>
    <TABLE BGCOLOR="#EED5B7" BORDER="10" CELLPADDING="5" CELLSPACING="5" WIDTH="100%">
      <TR>
        <TH><FONT COLOR="#FF0000"><H1 ALIGN="CENTER">Sachdienliche hinweise bitte bis zur NoCover 88 einsänden!</H1></FONT></TH>
      </TR>
      <TR>
        <TD>
    <CENTER>
    <TABLE BORDER="5" CELLPADDING="5" CELLSPACING="5" WIDTH="80%">
      <TR>
        <TD><CENTER>In der Rubrik:</CENTER></TD>
        <TD><CENTER><B>LeserBriefe</B></CENTER></TD>
      </TR>
    </TABLE>
    </CENTER>
    </TD>
      </TR>
      <TR>
        <TD><H2 ALIGN="CENTER">Teiln&auml;hmen k&ouml;nnen nur Mitglieder des APC & TCP Computer Clubs <FONT COLOR="#FF0000">(Mitgliederliste!!!)</FONT>.</H2></TD>
      </TR>
      <TR>
        <TD BGCOLOR="#EE9900"><H3 ALIGN="CENTER">Unter allen Richtigen Einsendern Verlose ich etwas!?</H3></TD>
      </TR>
    </TABLE>
    </CENTER>
    <BR>
    <HR>
    <CENTER>
    <A HREF="mitglieder/voepel.html"><IMG SRC="mv_p.png" ALT="Martin Voepel" BORDER="0" WIDTH="315" HEIGHT="47"></A>
    </CENTER>
    </TD>
      </TR>
    </TABLE>
</BODY>
</HTML>