<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>WISIA</b></font></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>

<p><img src="st_wisia1.gif" width="320" height="240" alt="" align=left
hspace=8>Artenschutzdatenbank des <b><font color="#0000ff">Bundesamt
f&uuml;r Naturschutz</font></b> in Bonn.<br>

Grundlage der hier verf&uuml;gbaren Daten ist das Wissenschaftliche
Informationssystem zum Internationalen Artenschutz (WISIA) des Bundesamtes
f&uuml;r Naturschutz. In WISIA-online sind Informationen zum Schutzstatus von
international und national gesch&uuml;tzten Arten abrufbar. Es handelt sich
hierbei um Arten, die nach dem Bundesnaturschutzgesetz als besonders oder
streng gesch&uuml;tzt eingestuft sind. Damit unterliegen diese Arten
gesetzlichen Regelungen und k&ouml;nnen nicht ohne weiteres gehandelt oder in
Besitz genommen werden. <br clear=all></p>
        
<p><b><font size="+1"> Hintergrund </font></b><br>

Mit WISIA-online wird zum ersten Mal eine Datenbank der nach
dem Bundesnaturschutzgesetz (BNatSchG) und der Bundesartenschutzverordnung (BArtSchV)
besonders gesch&uuml;tzten und streng gesch&uuml;tzten Tier- und Pflanzenarten
im Internet zug&auml;nglich gemacht. <br>
Es handelt sich dabei um alle Taxa, die in internationalen oder EG-rechtlichen
Artenschutzregelungen aufgef&uuml;hrt sind, soweit diese durch das BNatSchG
als besonders oder streng gesch&uuml;tzt ausgewiesen sind, sowie um die durch
die BArtSchV unter besonderen oder strengen Schutz gestellten Arten (vergleiche
im Einzelnen &sect; 20a Abs. 1 Nr. 7 und 8 BNatSchG).<br>
Viele dieser &Uuml;bereinkommen, Richtlinien und Verordnungen (im Folgenden:
Artenschutzregelungen) listen in ihren Anh&auml;ngen nicht nur einzelne Arten
auf, sondern h&auml;ufig werden Organismengruppen (Gattungen, Familien, Ordnungen,
Klassen) in ihrer Gesamtheit unter Schutz gestellt, so dass die Zuordnung einer
Art in die entsprechende Schutzkategorie f&uuml;r den Nicht-Spezialisten schwierig
ist. <br>
Um den Vollzugsorganen des Bundes, der L&auml;nder und Kommunen, aber auch dem
interessierten B&uuml;rger die Orientierung im Rahmen bestehender Artenschutzregelungen
zu erleichtern, hat der Gesetzgeber die Ver&ouml;ffentlichung der gesch&uuml;tzten
Arten in &sect; 20a Abs. 5 BNatSchG vorgeschrieben. Dieser Auftrag wurde mit
der Ver&ouml;ffentlichung alphabetischer Listen im Bundesanzeiger erf&uuml;llt.
<br>
Das im Bundesamt f&uuml;r Naturschutz (BfN) in den letzten Jahren aufgebaute
Wissenschaftliche Informationssystem zum Internationalen Artenschutz (WISIA)
stellt die Grundlage f&uuml;r WISIA-online dar. Es enth&auml;lt alle relevanten Daten
zu Nomenklatur, Schutz- und Verbreitung der Tier- und Pflanzentaxa. Die Datenbank
in ihrer jetzigen Form wurde auf Grundlage des Datenbank-Management-Systems
ORACLE 8i, Version 8.1.5.0.2 entwickelt.<br>
Entsprechend ihrem Zweck liefert WISIA-online nur Informationen zum Schutz jeder
Art. Im Einzelnen f&uuml;hrt eine Anfrage in WISIA-online zu einer Trefferanzeige
mit folgenden Angaben:
<dl>
<table width="90%" border="0">
<tr>
<td width="3%">(1) </td>
<td width="97%">Wissenschaftlicher Art- bzw. Gattungsname,</td>
</tr>
<tr>
<td width="3%">(2) </td>
<td width="97%">deutsche Bezeichnung,</td>
</tr>
<tr>
<td width="3%">(3) </td>
<td width="97%">Status: besonders gesch&uuml;tzt oder streng
gesch&uuml;tzt,</td>
</tr>
<tr>
<td valign="top" width="3%">(4) </td>
<td width="97%">Zugeh&ouml;rigkeit zu den in &sect; 20a
Abs.1 Nr.7 und 8 BNatSchG genannten Artenschutzregelungen (EG-Verordnung
Nr. 338/97, EG-Vogelschutzrichtlinie, FFH-Richtlinie, Bundesartenschutzverordnung).</td>
</tr>
</table>
<dt><br>
WISIA-online dient als Hilfsmittel zur Ermittlung des vom Gesetzgeber festgelegten
Schutzumfangs; verbindlich sind im Zweifelsfall die betreffenden Gesetzestexte
und ihre Anh&auml;nge.</dt>
</dl></p>

<p><b><font size="+1">Wissenschaftliche Bezeichnung </font><br>
1. Aufschl&uuml;sselung gesch&uuml;tzter h&ouml;herer Taxa in Arten</b><br>
Sowohl das <b>WA</b> als auch die <b>BArtSchV</b> stellen zum Teil gesamte
Familien oder auch Ordnungen unter Schutz. Grunds&auml;tzlich wurden diese
h&ouml;heren Taxa in WISIA-online bis zur Artebene
aufgeschl&uuml;sselt.<br> Von der grunds&auml;tzlichen Aufschl&uuml;sselung
der gesch&uuml;tzten h&ouml;heren Taxa in ihre Arten wurde in folgenden
F&auml;llen abgewichen:<br> Tiere. Bei den <i>Scleractinia</i>
(Steinkorallen) konnten mangels einer allgemein anerkannten Artenliste vier
Gattungen nicht auf Artniveau aufgeschl&uuml;sselt werden.<br>
Pflanzen. Bei den Pflanzen wurde wegen der Vielzahl der gesch&uuml;tzten Arten
anders vorgegangen: </p>
<table width="90%" border="0" cellspacing="0" cellpadding="0">
<tr>
<td width="5%" valign="top">(a)</td>
<td width="95%" valign="top">Bei
einer Reihe artenreicher h&ouml;herer Taxa wurden vollst&auml;ndig gesch&uuml;tzte
Gattungen nicht in ihre Arten aufgeschl&uuml;sselt ; es bleibt in der Regel
bei der Eintragung &quot;[Gattungsname] spp.&quot;. Eine weitere Aufschl&uuml;sselung
w&uuml;rde keine zus&auml;tzliche Information zum Schutz bringen. Dies betrifft
die folgenden Pflanzengruppen: : <i>Aloe</i>, <i>Crocus</i>,<i> Fritillaria</i>,<i>
Iris</i>, <i>Lilium</i>, <i>Nepenthes, Scilla, Tulipa, Cactaceae, Cyathea</i>,
<i>Dicksonia</i> und <i>Orchidaceae</i>.</td>
</tr>
<tr>
<td width="5%" valign="top">&nbsp;</td>
<td width="95%" valign="top">&nbsp;</td>
</tr>
<tr>
<td width="5%" valign="top">(b)</td>
<td width="95%" valign="top">In Arten aufgeschl&uuml;sselt
wurde eine gesch&uuml;tzte Gattung immer dann, wenn der Schutzumfang durch
Textzus&auml;tze eingeschr&auml;nkt wird. Beispiele hierf&uuml;r finden
sich vor allem in der BArtSchV, wo der Schutz vieler Gattungen durch den
Zusatz &quot;alle heimischen Arten&quot; oder &quot;alle europ&auml;ischen
Arten&quot; eingeschr&auml;nkt wird. In diesen F&auml;llen werden alle Arten
einzeln genannt, die unter diese Bedingung fallen. Ein weiterer wichtiger
Fall findet sich in der EG-Verordnung Nr. 338/97: Der Schutz von <i>Euphorbia</i>
spp. bezieht sich nur auf die sukkulenten Arten. Alle als sukkulent angesehenen
Arten der Gattung werden deshalb einzeln aufgef&uuml;hrt (<font color="#0000ff">CARTER
&amp; EGGLI 1997</font>). </td>
</tr>
<tr>
<td height="24" width="5%" valign="top">&nbsp;</td>
<td height="24" width="95%" valign="top">&nbsp;</td>
</tr>
<tr>
<td height="24" width="5%" valign="top">(c)</td>
<td height="24" width="95%" valign="top">Auf jeden Fall werden
diejenigen Gattungen in Arten aufgeschl&uuml;sselt, die streng gesch&uuml;tzt
sind (Beispiele: <i>Paphiopedilum</i> spp., <i>Phragmipedium</i> spp., <i>Turbinicarpus</i>
spp.). <br>
In allen F&auml;llen, in denen eine Gattung (auch im Rahmen einer Unterschutzstellung
ganzer Familien oder Ordnungen) vollst&auml;ndig gesch&uuml;tzt ist, wurde
am Ende der in der Trefferliste aufgef&uuml;hrten Arten die Eintragung &quot;[Gattungsname]
(spp.)&quot; aufgenommen. Dies soll deutlich machen, dass auch neu beschriebene
Arten, ungebr&auml;uchliche Synonyme und Phantasienamen in dieser Gattung
von der gesetzlichen Regelung erfasst sind (siehe auch Status &quot;<b>besonders
gesch&uuml;tzt</b>&quot; und &quot;<b>streng gesch&uuml;tzt</b>&quot;).
</td>
</tr>
</table>
<table width="90%" border="0">
<tr><td>&nbsp;</td></tr>
</table>
<table width="90%" border="0">
<tr>
<td colspan="2"><b>Nicht genannt</b> werden dagegen solche
Gattungen, </td>
</tr>
<tr>
<td width="5%">&nbsp;</td>
<td width="95%">&nbsp;</td>
</tr>
<tr valign="top">
<td width="5%">(a)</td>
<td width="95%">deren heimische Arten ausschlie&szlig;lich
vom Bundesjagdgesetz (BJagdG) bzw. von der Bundeswildschutzverordnung (BWildSchV)
erfasst werden (Beispiel: <i>Meles</i>) </td>
</tr>
<tr>
<td width="5%">&nbsp;</td>
<td width="95%">und/oder </td>
</tr>
<tr valign="top">
<td width="5%">(b)</td>
<td width="95%">die nur solche Arten beinhalten, welche im
Einzelnen in der BArtSchV Anlage 1 aufgef&uuml;hrt und von den Regelungen
des &sect; 20a Abs. 1 Nr.7 und 8 BNatSchG ausgenommen sind (Beispiel: <i>Rattus</i>).
</td>
</tr>
</table>

<p><b> 2. Taxonomie </b><br>
Grundlage f&uuml;r die Artaufschl&uuml;sselung der in den Artenschutzregelungen
  enthaltenen h&ouml;heren Taxa und f&uuml;r die Bezeichnung der wissenschaftlichen
  Artnamen sind die international und national festgelegten <b>taxonomischen
  Referenzwerke</b>. In WISIA-online wurden keine Synonyme (nicht anerkannte wissenschaftliche
  Namen) aufgenommen.</p>

<p><b> 3. Deutsche Namen </font></b><br>
Deutsche Namen sind nicht zu jedem Art- bzw. Gattungsnamen
bekannt oder gebr&auml;uchlich. Auf jeden Fall wurden diejenigen deutschen Bezeichnungen
in WISIA-online aufgenommen, die in den Artenschutzregelungen aufgef&uuml;hrt
sind. In einigen F&auml;llen waren hierbei Korrekturen erforderlich. Zus&auml;tzlich
sind weitere in WISIA vorhandene deutsche Bezeichnungen angegeben. Eine vollst&auml;ndige
Aufnahme aller verf&uuml;gbaren deutschen Namen wurde nicht angestrebt.<br>
Die deutschen Namen sind lediglich als zus&auml;tzliche Orientierungshilfe zu
verstehen, da sie nicht immer eindeutig sind und keine wissenschaftliche oder
gesetzliche Verbindlichkeit besitzen. So kann z.B. die deutsche Bezeichnung
&quot;Hornvogel&quot; f&uuml;r drei verschiedene Taxa verwendet werden. Ausschlaggebend
f&uuml;r den Schutz ist in jedem Fall die wissenschaftliche Bezeichnung eines
Taxons.</p>

<p><b><font size="+1"> Erl&auml;uterungen zu den Schutzangaben</font><br>
1. Status &quot;besonders gesch&uuml;tzt&quot; und &quot;streng
gesch&uuml;tzt&quot;</b><br>
In dieser Spalte ist der Schutzstatus eines Taxons (b = besonders
gesch&uuml;tzt; s = streng gesch&uuml;tzt) gem&auml;&szlig; &sect; 20a Abs.1
Nr.7 und 8 BNatSchG angegeben. <br>
Falls von einer in Abschnitt <a href="#1.2.1">1.2.1</a> erl&auml;uterten Gattungs-Eintragung
sowohl Arten mit besonderem als auch mit strengem Schutzstatus betroffen sind,
ist folgendes zu beachten: Ein in WISIA-online nicht aufgef&uuml;hrter Artname,
der einer derartigen Gattung zugeordnet werden kann, muss zun&auml;chst (eventuell
durch einen Spezialisten) eindeutig als Synonym oder als neuer Name identifziert
werden, bevor er einer der beiden Schutzkategorien zugewiesen werden kann. Diese
Gattungs-Eintragungen wurden bei der Datenausgabe mit einem Ausrufungszeichen
(!) kenntlich gemacht.</p>

<p><b> 2. Artenschutzregelungen </b><br>
WISIA-online enth&auml;lt f&uuml;r alle Taxa zus&auml;tzlich
Informationen dar&uuml;ber, durch welche Eintragung in einer Artenschutzregelung
der besondere oder strenge Schutz begr&uuml;ndet ist. Die Anh&auml;nge oder
Anlagen dieser Artenschutzregelungen werden genannt, einschlie&szlig;lich m&ouml;glicher
Fu&szlig;notenangaben oder Erl&auml;uterungen, die Aussagen zum Schutzumfang
machen. Wenn eine Art von mehreren Artenschutzregelungen erfasst wird, erfolgt
in allen entsprechenden Spalten eine Eintragung. Die Angabe des Status nach
2.1 richtet sich allein nach der h&ouml;chsten Kategorie gem&auml;&szlig; &sect;
20a Abs.1 Nr.7 und 8 BNatSchG.</p>

<p><b> 2.1 Bundesartenschutzverordnung</b><br>
Auf Grundlage von &sect; 20e BNatSchG wurden f&uuml;r eine
Reihe heimischer Arten besondere Schutzbestimmungen auf nationaler Ebene erlassen.
Die betreffenden Arten sind in Anlage 1 der Bundesartenschutzverordnung enthalten
und dort als besonders oder als streng gesch&uuml;tzt gekennzeichnet. Die Anlagen
5 und 6 der BArtSchV, in denen ebenfalls Arten aufgelistet sind, begr&uuml;nden
keinen besonderen oder strengen Schutz und werden deshalb in WISIA-online nicht
angezeigt.</p>

<p><b> 2.2 EG-Verordnung Nr. 338/97</b><br>
Die EG-Verordnung Nr. 338/97 (EG-VO) setzt das WA unmittelbar
in deutsches Recht um. Von den vier Anh&auml;ngen A bis D der Verordnung sind
in WISIA-online lediglich die Anh&auml;nge A und B erfasst, da nur sie einen
besonderen oder strengen Schutz begr&uuml;nden.</p>

<p><b> 2.3 EG-Vogelschutzrichtlinie</b><br>
Alle europ&auml;ischen Vogelarten im Sinne von Art.1 Abs.1
der Vogelschutzrichtlinie sind grunds&auml;tzlich besonders gesch&uuml;tzte
Arten im Sinne des BNatSchG. In WISIA-online sind sie in der Spalte &quot;VSR&quot;
mit einem &quot;X&quot; gekennzeichnet.<br>
Als &quot;europ&auml;isch&quot; im Sinne von Art. 1 Abs. 1 der Vogelschutzrichtlinie
(englischsprachige Version) gelten alle Arten, die im Gebiet der Mitgliedstaaten
nat&uuml;rlicherweise wild lebend vorkommen. Eine Referenzliste dieser Arten
wurde von der EU-Kommission im Juni 1999 unter der Adresse:<center>
<font color="#0000ff">http://europa.eu.int/comm/environment/nature/directive/birdshome_en.htm</font></center>
im Internet ver&ouml;ffentlicht. F&uuml;r WISIA-online wurde die Version verwendet,
die auf die Taxonomie nach SIBLEY &amp; MONROE (1990, 1993) Bezug nimmt (Adresse: <center>
<font color="#0000ff">http://europa.eu.int/comm/environment/nature/directive/birdspage2_en.htm</font>,</center>
Stand 27.10.2000).<br>

Vom naturschutzrechtlichen Schutz als europ&auml;ische Arten sind diejenigen
Vogelarten ausgenommen, die nach &sect; 2 Abs.1 BJagdG dem Jagdrecht unterliegen
[vgl. &sect; 20a Abs.1 Nr.7b) bb) BNatSchG]. Die Zugeh&ouml;rigkeit einer Art
zu den im BJagdG pauschal aufgef&uuml;hrten Gruppen (Wildtauben, Wildg&auml;nse,
Wildenten, M&ouml;wen, Greife und Falken) richtet sich danach, ob diese in Anlage
1 BWildSchV aufgef&uuml;hrt sind. Die nicht in Anlage 1 BWildSchV aufgef&uuml;hrten
Federwildarten des &sect; 2 Abs. 1 BJagdG, n&auml;mlich Greife und Falken sowie
Kn&auml;k- und Moorente sind in den Anh&auml;ngen A oder B der EG-VO 338/97
aufgef&uuml;hrt und damit besonders bzw. streng gesch&uuml;tzt (&sect; 20a Abs.
1 Nr. 7a) und Nr. 8 BNatSchG).</p>

<p><b> 2.4 EG-Richtlinie Flora-Fauna-Habitat (FFH-Richtlinie)</b><br>
Nur die in Anhang IV aufgef&uuml;hrten Arten der FFH-Richtlinie
werden nach &sect; 20 a Abs.1 Nr.7 b) aa) BNatSchG besonders und nach &sect;
20 a Abs.1 Nr.8 b) BNatSchG streng gesch&uuml;tzt. Lediglich dieser Anhang ist
deshalb in WISIA-online vorhanden. F&uuml;r Pflanzen schlie&szlig;t Anhang IV
den Anhang IIb mit ein.</p>

<p><b> 3. Fu&szlig;noten und Textzus&auml;tze</b><br>
Sowohl die BArtSchV als auch die EG-VO schr&auml;nken in vielen
F&auml;llen den Schutzumfang von Arten oder Gattungen durch Fu&szlig;noten und
Textzus&auml;tze ein. Diese wurden in WISIA-online aufgenommen und aus Gr&uuml;nden
der &Uuml;bersichtlichkeit mit einer eigenen Nummer versehen.</p>

<p><b><font size="+1"> Taxonomische Referenzwerke</font></b><br>
Folgende Publikationen wurden international (durch CITES-Resolutionen;
ORNIS-Ausschuss der EU-Kommission) und national (in Anlage 2 der BArtSchV) verbindlich
als taxonomische und geographische Referenzwerke festgelegt, von denen nur in
wenigen Einzelf&auml;llen abgewichen wurde: </p>

<p><b> 1. Fauna</b>

<table width="90%" border="0" cellspacing="0" cellpadding="2">
<tr>
<td valign="top">Allgemein</td>
<td>
<ul>
<li>BINOT, M., BLESS, R., BOYE, P., GRUTTKE, H. &amp;
PRETSCHER, P. (Bearb.) (1998): Rote Liste gef&auml;hrdeter Tiere Deutschlands.-
Schriftenreihe f&uuml;r Landschaftspflege und Naturschutz 55: 1-434,
Bonn (Bundesamt f&uuml;r Naturschutz).</li>
</ul>
</td>
</tr>
<tr>
<td valign="top">S&auml;ugetiere</td>
<td>
<ul>
<li>WILSON, D.E. &amp; D.M. REEDER (Eds.)(1993): Mammal
Species of the World. 2nd edition - Washington, London (Smithsonian
Institution Press), 1206 pp.</li>
</ul>
</td>
</tr>
<tr>
<td valign="top">V&ouml;gel</td>
<td>
<ul>
<li>SIBLEY, C.G. &amp; B.L. MONROE JR (1990): Distribution
and Taxonomy of Birds of the World. - New Haven, London (Yale University
Press), 1111 pp.<br>
SIBLEY C.G. &amp; B.L. MONROE JR (1993): A supplement to Distribution
and Taxonomy of Birds of the World. - New Haven, London (Yale University
Press), 108 pp.</li>
<li> MORONY, J.J., BOCK, W.J. &amp; J. FARRAND JR (1975):
A Reference List of the Birds of the World. - New York (American Museum
of Natural History), 207 pp.</li>
<li> EUROPEAN COMMISSION (1999): List of Birds of the
European Union - June 1999. - http://europa.eu.int/comm/environment/nature/directive/
birdspage2_en.htm, Stand: 27. Oktober 2000</li>
</ul>
</td>
</tr>
<tr>
<td valign="top">Reptilien</td>
<td>
<ul>
<li>GASC, J.-P., CABELA, A., CRNOBRNJA-ISAILOVIC, J.,
DOLMEN, D., GROSSENBACHER, K., HAFFNER, P., LESCURE, J., MARTENS, H.,
MARTINEZ RICA, J.P., MAURIN, H., OLIVEIRA, M.E., SOFIANIDOU, T.S., VEITH,
M. &amp; ZUIDERWIJK, A. (Eds.) (1997): Atlas of the Amphibians and Reptiles
in Europe.- Paris (Societas Europaea Herpetologica).</li>
<li> CEI, J.M. (1994): Reptiles del noroeste, nordeste
y este de la Argentina. Herpetofauna de las selvas subtropicales, Puna
y Pampas. - Torino (Museo Regionale di Scienze Naturali), 949 pp. </li>
<li> MCDIARMID, R.W., CAMPBELL, J.A. &amp; TOURE, T.A.
(1999): Snake Species of the World. A taxonomic and geographic reference.
Vol.1. - Washington (The Herpetologists' League), xi+511 pp.</li>
<li>KLAVER, C.J.J. & W. B&Ouml;HME (1997): Chamaeleonidae. In: WERMUTH, H.
& M. FISCHER (Eds.): Das Tierreich 112.- Berlin, New York (Walter de
Gruyter), xv+85 pp. </li>
<li>WERMUTH, H. & R. MERTENS (1996): Schildkr&ouml;ten, Krokodile, Br&uuml;ckenechsen.
Reprint of 1996. - Jena (Fischer Verlag), xxvi+506 pp." </li>
</ul>
</td>
</tr>
<tr>
<td valign="top">Amphibien</td>
<td>
<ul>
<li>FROST, D.R. (Ed.) (1985): Amphibian Species of the
World: A Taxonomic and Geographic Reference. - Lawrence (Allen Press
and The Association of Systematics Collections), 732 pp.</li>
<li> DUELLMANN, W.E. (1993): Amphibian Species of the
World: Additions and corrections. - Lawrence (University of Kansas),
372 pp.</li>
</ul>
</td>
</tr>
<tr>
<td valign="top">Wirbellose</td>
<td>
<ul>
<li>FREUDE, H., HARDE, K.W. &amp; LOHSE, G.A. (Hrsg.)
(1964-1983): Die K&auml;fer Mitteleuropas 2-11, Krefeld.</li>
<li> LOHSE, G.A. &amp; LUCHT, W.H. (Hrsg.) (1989-1994):
Die K&auml;fer Mitteleuropas 1. 3. Supplementband mit Katalogteil.-
Krefeld.</li>
<li> TURIN, H., CASALE, A., KRYZHANOVSKI, O.L., MAKAROV,
K.V. &amp; PENEV, L.D. (1993): Checklist and Atlas of the Genus Carabus
Linnaeus in Europe (Coleoptera, Carabidae).- Leiden.</li>
</ul>
</td>
</tr>
</table>
<p> <br>
</p>
<p><b> 2 Flora</b>
<table width="90%" border="0" cellspacing="0" cellpadding="2">
<tr>
<td valign="top" width="14%">Allgemein</td>
<td width="86%">
<ul>
<li>BUNDESAMT F&Uuml;R NATURSCHUTZ (1996): Rote Liste
gef&auml;hrdeter Pflanzen Deutschlands.- Schriftenreihe f&uuml;r Vegetationskunde
28: 1-744, Bonn (Bundesamt f&uuml;r Naturschutz).</li>
<li>WILLIS, J. (1973) A Dictionary of the Flowering Plants
and Ferns. - Cambridge (Cambridge University Press), xxii+1245+lxvi
pp.</li>
<li>DAVIS, A.P., MCGOUGH, H.N., MATHEW, B. &amp; C. GREY-WILSON
(1999): CITES bulb checklist. For the genera: Cyclamen, Galanthus and
Sternbergia. Kew (Royal Botanic Gardens Kew), 134 pp.<br>
MABBERLEY, D.J. (1997): The plant-book. 2nd edition. - Cambridge (Cambridge
University Press), xvi+858 pp.</li>
<li>STEVENSON, D.W., R. OSBORNE &amp; K.D. HILL (1995):
The world list of cycads. In: VOSTER, P. (Ed.): Proceedings of the Third
International Conference on Cycad Biology - pp. 55-64, Stellenbosch
(Cycad Society of South Africa).</li>
</ul>
</td>
</tr>
<tr>
<td valign="top" width="14%">Orchideen</td>
<td width="86%">
<ul>
<li>ROBERTS, J.A., L.R. ALLMAN, C.R. BEALE, R.W. BUTTER,
K.R. CROOK &amp; H.N. MCGOUGH, Eds. (1995): CITES orchid checklist 1.
For the genera Cattleya, Cypripedium, Laelia, Paphiopedilum, Phalaenopsis,
Phragmipedium, Pleione and Sophronitis including accounts of Constantia,
Paraphalaenopsis and Sophronitella. - Kew (Royal Botanic Gardens Kew),
136 pp.</li>
<li>OBERTS, J.A., L.R. ALLMAN, C.R. BEALE, R.W. BUTTER,
K.R. CROOK &amp; H.N. MCGOUGH, Eds. (1997): CITES orchid checklist 2.
For the genera Cymbidium, Dendrobium (selected sections only), Disa,
Dracula and Encyclia. - Kew (Royal Botanic Gardens Kew), 300</li>
</ul>
</td>
</tr>
<tr>
<td valign="top" width="14%">Sukkulenten</td>
<td width="86%">
<ul>
<li><a name="carter_eggli"></a>CARTER, S. &amp; U. EGGLI
(1997): The CITES checklist of succulent Euphorbia taxa. - Bonn (Federal
Agency for Nature Conservation), xix+70 pp. </li>
<li> HUNT, D. (1999): CITES Cactaceae Checklist. 2nd edition.
- Kew (Royal Botanic Gardens Kew &amp; International Organization for
Succulent Plant Study), 315 pp.</li>
</ul>
</td>
</tr>
</table>
<p><br>
</p>

<p><b><font size="+1">Abk&uuml;rzungen </font></b>
<table width="90%" border="0" cellspacing="0" cellpadding="2">
<tr>
<th>
<div align="left">Abk.</div>
</th>
<th>
<div align="left">Text</div>
</th>
</tr>
<tr>
<td valign="top"><a name="!"></a>! </td>
<td>Ein nicht aufgef&uuml;hrter Artname dieser Gattung muss
zun&auml;chst (eventuell durch einen Spezialisten) eindeutig als Synonym
oder als neuer Name identifiziert werden. Erst dann kann entschieden werden,
ob ein besonderer oder strenger Schutz vorliegt. <br>
Achtung: Im Falle eines neuen g&uuml;ltigen Namens ist bei monotypischen
Gattungen (= Gattungen, die nur eine Art umfassen; z.B. Gorilla) zu pr&uuml;fen,
ob das neue Taxon von der bekannten, streng gesch&uuml;tzten Art abgespalten
wurde. Falls ja, gilt f&uuml;r die neue Art - entgegen dem Gattungseintrag
- ebenfalls die h&ouml;here Schutzkategorie. </td>
</tr>
<tr>
<td valign="top"><a name="b"></a>b </td>
<td>besonders gesch&uuml;tzt</td>
</tr>
<tr>
<td valign="top"><a name="s"></a>s </td>
<td>streng gesch&uuml;tzt</td>
</tr>
<tr>
<td valign="top"><a name="spp"></a>spp.</td>
<td> Alle Arten einer Gattung sind betroffen. </td>
</tr>
<tr>
<td valign="top"><a name="spp1"></a>(spp.) </td>
<td>Alle Arten einer Gattung sind betroffen, soweit sie nicht
im Einzelnen aufgef&uuml;hrt sind.</td>
</tr>
<tr>
<td valign="top"><a name="subsp"></a>subsp. </td>
<td>Unterart</td>
</tr>
<tr>
<td valign="top"><a name="egvo_ab"></a>A, B</td>
<td>Art ist in Anhang A (B) der EG-VO enthalten</td>
</tr>
<tr>
<td valign="top"><a name="bartschv1"></a>1 </td>
<td>Art ist in Anlage 1 der BArtSchV enthalten </td>
</tr>
<tr>
<td valign="top"><a name="iv"></a>IV </td>
<td>Art ist in Anhang IV der FFH-Richtlinie enthalten</td>
</tr>
<tr>
<td valign="top"><a name="i"></a>X </td>
<td>Art ist durch Art.1 Abs.1 der Vogelschutzrichtlinie gesch&uuml;tzt</td>
</tr>
<tr>
<td valign="top"><a name="bartschv"></a>BArtSchV</td>
<td>
<p>Verordnung zum Schutz wild lebender Tier- und Pflanzenarten
vom 14. Oktober 1999 (BGBl. I S. 1955) zuletzt ge&auml;ndert durch Verordnung
vom 21.12.1999. (BGBl. I S. 2843) (Bundesartenschutzverordnung)</p>
<p></p>
</td>
</tr>
<tr>
<td valign="top"><a name="egvo"></a>EG-VO </td>
<td>Verordnung
(EG) Nr. 338/97 des Rates vom 9. Dezember 1996 &uuml;ber den Schutz von
Exemplaren wildlebender Tier- und Pflanzenarten durch &Uuml;berwachung
des Handels (ABl. EG Nr. L 61 S. 1 vom 3.3.1997) zuletzt ge&auml;ndert durch
VO (EG) Nr. 2724/2000 vom 30.11.2000 (ABl. EG Nr. L 320/1 vom 18.12.2000)</td>
</tr>
<tr>
<td valign="top"><a name="ffh"></a>FFH </td>
<td>Richtlinie 92/43/EWG des Rates vom 21. Mai 1992 zur Erhaltung
der nat&uuml;rlichen Lebensr&auml;ume sowie der wild lebenden Tiere und
Pflanzen (ABl. EG Nr. L 206/7 vom 22.7.1992) zuletzt ge&auml;ndert durch
Richtlinie 97/62/EG des Rates vom 27.10.1997 (ABl. EG Nr. L 305/42,
Fauna-Flora-Habitat-Richtlinie)</td>
</tr>
<tr>
<td valign="top"><a name="vsr"></a>VSR </td>
<td>Richtlinie 79/409/EWG des Rates vom 2. April 1979 &uuml;ber
die Erhaltung der wild lebenden Vogelarten (ABl. EG Nr. L 103 vom 25.4.1979
S. 1 zuletzt ge&auml;ndert durch Richtlinie 97/49/EG der Kommission vom
29.7.1997, ABl. EG Nr. L 223 vom 13.8.1997 S. 9, Vogelschutzrichtlinie)</td>
</tr>
<tr>
<td valign="top">WISIA</td>
<td>Wissenschaftliches Informationssystem zum Internationalen
Artenschutz, Bundesamt f&uuml;r Naturschutz</td>
</tr>
</table>
</p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
