<html>
<head>
<!-- author = "Wolf Zimmer"   -->
 
<title>Die neue Wolf-INFO ist da!</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5" width=100%>
<tr><td width=110>
<a href="mitglieder/zimmer.html">
<img src="wolf1a.jpg" width=95 height=95 border=0
alt="mein Logo" align=left></a></td>
<td valign=top><ul><font color=blue><b>I N H A L T </font></b>
<li> <a href="#a6"> Mail aus Schweden</a></li>
<li> <a href="#a1"> Internet-Misthaufen</a></li>
<li> <a href="#a2"> Internet-Warnsystem</a></li>
<li> <a href="#a3"> Internet-Sicherheitsl&uuml;cke</a></li>
<li> <a href="#a5"> Internet-Millionen</a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td>
<td valign=top align=right>
<img src="wolf1c.jpg" width=95 height=95 border=0
alt="mein Ort"></td>
</tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>
<p align=center><a name="a6"></a>
<b><font color="800000" size="5">&raquo;Eine Mail aus Schweden&laquo;
</font></b></p>

Am (05.05.01) bekam ich eine Mail aus Schweden. Vielleicht erinnert sich
noch mancher an die Mitteilung in der NC-80 in Online-Splitter, dass Oliver
Vogel zu Fu&szlig; zum Nordpol geht und als Rucksack einen K&uuml;hlschrank
benutzt. Oliver Vogel hat durch Zufall meine Mitteilung gelesen und wie
eingangs erw&auml;hnt eine Mail geschickt. Er teilte mir darin auch mit,
dass sein Tagebuch in Englisch geschrieben wird und nur die Eingangsseite
in Schwedisch gestaltet ist und er schon ein Drittel der schwedischen
Communen durchlaufen hat. <b>www.spray.se/northpole/dagbok</b>. </p>

<p>In einer Antwortmail teilte ich mit, dass ich seine Mail in der NoCover
erw&auml;hnen werde. Darauf mailte er viele Gr&uuml;&szlig;e an alle
NC-Leser. </p>
<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a1"></a> <b><font color="800000"
size="5">&raquo;Das Internet ist ein gro&szlig;er Misthaufen&laquo;
</font></b></p>

<p><b>Einer der Erfinder des Internets hat heute nicht mehr viel Lob
f&uuml;r das weltweite Datennetz &uuml;brig: &raquo;Das Internet ist ein
gro&szlig;er Misthaufen&laquo;, sagt Joseph Weizenbaum.</b> </p>

<p>Der Wissenschaftler am renommierten US-Forschungsinstitut Massachusetts
Institute of Technology (MIT) schr&auml;nkt seine Kritik bei einem
Fachseminar in Hamburg jedoch etwas ein: &raquo;Allerdings kann man darin
auch kleine Sch&auml;tze und Perlen finden.&laquo;</p>

<p>Das Internet sei dem Fernsehen sehr &auml;hnlich geworden. Die
Proportionen von sinnvollen, interessanten Sendungen und der riesigen Menge
blanken Unsinns seien in beiden Medien vergleichbar. Weizenbaum arbeitete
Ende der 60er Jahre an der Entwicklung des Arpanet mit, dem
milit&auml;rischen Vorl&auml;ufer des heutigen Internet. (dpa) </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a2">
<b><font color="800000" size="5"> BITKOM unterst&uuml;tzt
Internet-Warnsystem </font></b></a></p>

<p><b>Der Branchenverband BITKOM hat die Pl&auml;ne der Bundesregierung
f&uuml;r ein nationales Fr&uuml;hwarnsystem gegen Hacker-Angriffe aus dem
Internet begr&uuml;&szlig;t.</b></p>

<p>Die Initiative sei sinnvoll und l&auml;ngst &uuml;berf&auml;llig, sagte
der Gesch&auml;ftsf&uuml;hrer des Verbandes, Bernhard Rohleder, am
Donnerstag (03.05.01) im InfoRadio Berlin-Brandenburg. Die Informations-
und Kommunikationssicherheit m&uuml;sse als integraler Bestandteil der
inneren und &auml;u&szlig;eren Sicherheit des Staates und der Gesellschaft
begriffen werden.<br>&nbsp;<br>Die rund f&uuml;nf Prozent der
&ouml;ffentlichen Aufwendungen f&uuml;r die Verbesserung der Sicherheit im
Internet seien zu wenig, so Rohleder. (dpa) </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a3">
<b><font color="800000" size="5"> Microsoft warnt vor Sicherheitsl&uuml;cke
</font></b></a></p>

<p><b>Eine Sicherheitsl&uuml;cke in Windows 2000 f&uuml;r Server
&ouml;ffnet Hackern T&uuml;r und Tor in fremde Systeme - Microsoft warnt
vor einer gro&szlig;en Gefahr. </b></p>

<p>Das Sicherheitsloch erm&ouml;gliche Hackern, von au&szlig;erhalb die
Kontrolle &uuml;ber ein internes Computernetzwerk zu gewinnen, sagte am
Mittwoch Microsoft-Sprecher Thomas Baumg&auml;rtner in M&uuml;nchen.
Microsoft habe den Fehler inzwischen behoben. Kunden sollten daher ein so
genanntes Patch (Korrektur-Programm) in ihr System einspielen, das auf der
Website von Microsoft unter <u><b><font color="#0000ff">www.microsoft.com
</font></b></u> zum Download bereitsteht. </p>

<p>Der Fehler betrifft Systeme mit einer beliebigen Version von Windows
2000 f&uuml;r Server, die gleichzeitig das Programm Internet Information
Server (IIS) 5.0 einsetzen. Die Software IIS wird zusammen mit Windows 2000
ausgeliefert, ist allerdings nicht bei jedem System aktiviert. &raquo;Es
handelt sich um eine ernsthaft Sicherheitsl&uuml;cke. Wir wollen sicher
stellen, dass alle Kunden verstehen, wie wichtig es ist, unseren Patch auf
ihr System aufzuspielen&laquo;, sagte Scott Culp, ein
Sicherheits-Programm-Manager der Microsoft-Zentrale in Redmond
(US-Bundesstaat Washington).<br>&nbsp;<br>Hacker k&ouml;nnen &uuml;ber eine
Schnittstelle in das Windows-System eindringen, die f&uuml;r das Ausdrucken
von Dokumenten &uuml;ber das Internet bestimmt ist (Internet Service
Application Programming Interface). Wenn mit einem technischen Trick ein
Speicher&uuml;berlauf erzeugt wird, gibt die Drucker-Schnittstelle
pl&ouml;tzlich die Kontrolle &uuml;ber das gesamte Netzwerk frei. </p>

<p>Marc Maiffret, der als so genannter &raquo;Chief Hacking Officer&laquo;
f&uuml;r die Computer-Sicherheitsfirma eEye Digital Security arbeitet,
bewertete die Gefahr f&uuml;r die betroffenen Firmen und Organisationen als
sehr hoch: &raquo;Es gibt im Internet mindestens eine Million Web- Server,
bei denen man sich innerhalb weniger Minuten Zugriff auf System-Ebene
verschaffen kann&laquo;, sagte Maiffret dem Web- Informationsdienst CNET.
Das kalifornische Unternehmen eEye hatte den Fehler vor einigen Wochen
entdeckt und an Microsoft gemeldet. (dpa) </p>
                 
<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a5">
<b><font color="800000" size="5"> Fast 25 Millionen Deutsche gehen online
</font></b></a></p>

<p><b>Immer mehr Deutsche entdecken das Netz: Fast 25 Millionen
Bundesb&uuml;rger nutzen das weltweite Datennetz - damit gehen 45 Prozent
mehr Deutsche online als noch vor einem Jahr.</b> <br>

<p>Das geht aus einem von der Bundesregierung in Auftrag gegebenen Bericht
&uuml;ber die Informationswirtschaft hervor, den der Staatssekret&auml;r im
Bundeswirtschaftsministerium, Alfred Tacke, am Mittwoch (02.05.01) in
Berlin vorstellte. </p>

<p>Demnach haben vor allem die Menschen aus Ostdeutschland aufgeholt: Die
Zuwachsraten seien dort fast dreimal so hoch wie in Westdeutschland. In den
alten Bundesl&auml;ndern nutzten 39,9 Prozent der Bev&ouml;lkerung
&uuml;ber 14 Jahren das Internet. In den neuen L&auml;ndern gehen dem
Bericht zufolge 34,8 Prozent online. </p>

<p>Im elektronischen Handel (E-Commerce) ist Deutschland mit einem
Umsatzanteil von 27,1 Prozent Marktf&uuml;hrer in Westeuropa. Weltweit
liegt der deutsche Anteil bei 3,2 Prozent. Die IT-Branche gewinne zunehmend
an Bedeutung, hie&szlig; es. Mit einem Umsatzziel von 5,3 Prozent am
Bruttoinlandsprodukt liege sie in Deutschland nach
Stra&szlig;enfahrzeugbau, Maschinenbau und Elektrotechnik auf Platz vier.
(dpa) </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a4"><font color="800000" size="5">
<b>Feedback </font></b></a></p>
<p>Ein Feedback zu schreiben ist doch ein Witz, das gebt ihr mir
hoffentlich unumwunden zu. Dass wir f&uuml;nf uns noch gegenseitig auf die
Schulter klopfen er&uuml;brigt sich wohl.

<hr size=4>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
