<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat noch etwas gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#808080">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Website</b></font></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>

<p>Das Magazin <b>"TOMORROW"</b> brauche ich wohl wirklich nicht mehr vorstellen. In
letzter Zeit engagiert sich die Redaktion sehr f&uuml;r die Computerneulinge, die Sch&uuml;ler in den
Schulen. Hintergrund: Hier wird jetzt verst&auml;rkt begonnen, vielen Schulklassen die
M&ouml;glichkeit der Nutzung des Internets zu verwirklichen. </p>

<font size="5"><b>Fit im Netz</b></font><hr noshade>
<font size="4"><b>Gro&szlig;e Posteraktion und Homepage-Wettbewerb</b></font>

<p><img src="work_website1.jpg" width="335" height="191" align=left alt="Poster 1"
hspace=6><b>Schulen ans Netz!</b><br>
dieser Forderung will TOMORROW gerecht werden und zeigt, wie das Web
funktioniert: mit riesigen Farbpostern, die einfach das Internet erkl&auml;ren
sowie einem Wettbewerb f&uuml;r die beste Homepage einer Schulklasse. </p>

<p>Industrie, Politik und Initiativen haben l&auml;ngst erkannt, dass ein
Informationsdefizit an Schulen besteht, was den Umgang mit PC und Internet
betrifft. Sie pl&auml;dieren f&uuml;r den fr&uuml;hen Umgang der Kinder mit Computern,
damit sie f&uuml;r sp&auml;tere Herausforderungen ger&uuml;stet sind. Edelgard Buhlmahn,
Bundesbildungsministerin, etwa fordert: Laptops m&uuml;ssen f&uuml;r Sch&uuml;ler
billiger werden. Der Anschaffungspreis m&uuml;sste hier unter 1000 Mark liegen.
Und auch Guido Westerwelle, designierter FDP-Chef, ist der Meinung, dass
die Vertrautheit mit dem Computer schon fr&uuml;h einsetzen sollte. Doch ohne
die daf&uuml;r ausgebildeten Lehrer und die n&ouml;tigen finanziellen Mittel, lassen
sich solch hehre Vorstellungen nicht in die Tat umsetzen. Deshalb pl&auml;diert
auch Willi Lemke, Bildungssenator in Bremen, daf&uuml;r, dass die
Lehrerfortbildung am PC z&uuml;gig durchgef&uuml;hrt werden m&uuml;sse. Sonst hat man am
Ende wunderbar ausgestattete Schulen, aber keine Lehrer, die mit dem
Computer umgehen k&ouml;nnen. Obwohl inzwischen 98 Prozent aller Schulen,
insgesamt etwa 41.000, mit einem Internet-Zugang ausgestattet sind,
wissen viele Sch&uuml;ler und Lehrer nicht, wie ein PC funktioniert und was man
via Internet alles erforschen, erfahren und erreichen kann. </p>

<p>Vorbildcharakter hat in dieser Beziehung die modernste PC-Schule
Deutschlands in G&uuml;tersloh: Das Evangelisch-Stiftische-Gymnasium hat bereits
acht Schulklassen, in denen jeder Sch&uuml;ler einen Laptop besitzt. In einem
Multimedia-Lernzentrum stehen 20 Internet-Arbeitspl&auml;tze zur Verf&uuml;gung, zwei
Rechnerr&auml;ume mit 40 weiteren Computern und ein Video-Studio, in dem Filme
selbst geschnitten und analysiert werden k&ouml;nnen. Und immer mehr
Schulklassen bauen sich per Internet ein kleines Unternehmertum auf. Die
Deutsche Kinder- und Jugendstiftung (DKS) sponsert derzeit 50
Sch&uuml;lergruppen beim Aufbau eines Start-ups per Internet und Homepage. Unter
<font color=#0000ff><u><b>www.schuelerfirmen.de</font></b></u> sind bereits 150
Sch&uuml;ler-Gr&uuml;ndungen aufgelistet. </p>

<center><table border=1 width=96% cellspacing=1 cellpadding=4><tr><td>
<p>&nbsp;<br>
<b>Gro&szlig;e Posteraktion und Homepage-Wettbewerb</b><br>

Um auch Ihre Schule auf den richtigen Weg zu bringen, k&ouml;nnen Sie jetzt drei
Poster <b>kostenlos</b> bestellen, die Ihnen erkl&auml;ren, wie das Internet
funktioniert, wie eine Suchmaschine sucht und wie eine Homepage schnell
gebaut ist. <br>
Au&szlig;erdem kann sich Ihre Klasse mit dem bereits
existierenden oder neu erlernten Know-how an unserem gro&szlig;en Wettbewerb
beteiligen. Wir suchen die beste Homepage einer Schulklasse und verlosen
eine Reise nach New York und Praktika in gro&szlig;en deutschen Internet-Firmen.
Also los, auf in den &quot;Klassen-Kampf&quot;. <br>&nbsp;</p>
</td></tr></table></center>

<p>Folgender Text ist vollst&auml;ndig (aber wenige Bilder) &uuml;bernommen und
richtet sich demgem&auml;&szlig; an die Window-Nutzer, denn andere Plattformen gibt es
in den Schulen nicht. </p>

<font size="5"><b>Posteraktion</b></font><hr noshade>
<font size="4"><b>So einfach kann Internet sein!</b></font>

<p>"Alle deutschen Schulen ans Netz!", fordert Bundesbildungsministerin
Edelgard Bulmahn f&uuml;r Ende 2001. Technisch ist das Ziel fast erreicht: 98
Prozent der Schulen haben mittlerweile die richtige Ausstattung und einen
Zugang zum Internet. Doch damit ist es nicht getan: Es fehlen die Lehrer,
die ihren Sch&uuml;lern beibringen, wie Internet, E-Mail und Co. funktionieren.
Aus diesem Grund hat TOMORROW unter der Schirmherrschaft des
Bundesministeriums f&uuml;r Bildung und Forschung sowie mit den Sponsoren AOL,
Altavista und Wissen.de eine gro&szlig;e Posteraktion gestartet, die dem
Internet-Unwissen Abhilfe schaffen soll. </p>

<p>Die TOMORROW-Redaktion hat drei leicht verst&auml;ndliche Poster zu den folgenden Themen
entwickelt: <ul>

<li> <b>So funktioniert das Internet</b> in der TOMORROW-Ausgabe 7 vom 15. M&auml;rz 2001</li>
<li> <b>So arbeitet eine Suchmaschine</b> in der TOMORROW-Ausgabe 8 vom 29. M&auml;rz 2001</li>
<li> <b>So bauen Sie eine Homepage</b> in der TOMORROW-Ausgabe 9 vom 12. April 2001
</li></ul>
Alle drei Poster k&ouml;nnen Sie im Paket <b>kostenlos</b> bei uns bestellen.
Beachten Sie bitte, dass die Lieferzeit einige Wochen dauert. </p>

<font size="5"><b>Homepage-Wettbewerb</b></font><hr noshade>
<font size="4"><b>Klassen-Kampf um die beste Homepage</b></font>

<p>Hat Ihre Klasse schon eine Visitenkarte f&uuml;rs Web? Sie basteln gerade
daran? Wollte Ihre Klasse schon lange mal machen? Alle Lehrer und Sch&uuml;ler,
die eine dieser Fragen mit &quot;Ja!&quot; beantworten k&ouml;nnen, sollten an unserem
Wettbewerb teilnehmen. </p>

<p><b>New York ruft: Eine Reise und Praktika zu gewinnen</b><br>

TOMORROW sucht die beste Homepage einer Schulklasse und verlost tolle
Preise. Eine Reise nach New York und Praktika, die den Sch&uuml;lern die
Gelegenheit geben, mal so richtig ins Internet-Business zu schnuppern.
Gro&szlig;e deutsche Internet-Sites wie texxas.de, clickfish.de oder unsere
Online-Redaktion geben den Nachwuchstalenten die Gelegenheit, direkt an der
Produktion der Websites mitzuarbeiten. Was Sie daf&uuml;r tun m&uuml;ssen? Ganz
einfach f&uuml;r die eigene Schule eine Homepage basteln (Tipps gibt's
<font color=#0000ff><u><b>hier</font></b></u>) oder
die bestehende versch&ouml;nern und &uuml;ber das <font color=#0000ff><u><b>
Anmeldeformular</font></b></u> f&uuml;r den Wettbewerb anmelden.</p>

<p>Eine inhaltliche Einschr&auml;nkung f&uuml;r den Aufbau einer Klassen-Homepage gibt
es nicht. Sie kann verschiedene Unterrichtsf&auml;cher vernetzen, die
Hausaufgabenbetreuung der Sch&uuml;ler organisieren, vom letzen Klassenausflug
berichten, oder, oder, oder... Eine Jury 
bewertet die Internet-Auftritte nach den Kriterien Design, Aufbau, Inhalt,
Aktualit&auml;t und Navigation. In der Jury sitzen PC- und Internet-Experten:
Bremens Schulsenator Willi Lemke, Verleger Florian Langenscheidt, Nicole
Ludwig, Chefin von Texxas.de, Per Dalheimer von clickfish.de und Willy
Loderhose, TOMORROW-Chefredakteur. Lust bekommen? Dann melden Sie sich am
besten bald an, sp&auml;tester Termin ist der 15. Mai 2001. </p>

<p><b>Und wen es noch nicht gepackt hat, hier noch einmal die Preise:</b> <ul>

<li> <b>1. Preis:</b> Eine Reise nach New York plus Hotel von travelclub.de im
Gesamtwert von 12.000 Mark f&uuml;r drei Sch&uuml;ler und eine Lehrkraft <br>

<img src="work_website3.jpg" width="150" height="36" alt="www.travelclub.de"
border="0"></li>

<li> <b>2. Preis:</b> Je 5 Praktikantenpl&auml;tze bei texxas.de in Berlin, bei
clickfish.de und der TOMORROW Internet AG, unter anderem in der
Online-Redaktion von TOMORROW in Hamburg</li>

<li> <b>3. Preis:</b> Ein Laptop im Wert von 5000 Mark</li>

<li> <b>weitere Preise:</b> 300 TOMORROW-Guides zu den Themen E-Mail,
Homepage-Bau und Internet. </li></ul></p>

<p><b>Teilnahmebedingungen:</b><ul>
<li> Alle Sch&uuml;ler, die mindestens 10 Jahre alt sind, und alle
Computerlehrer k&ouml;nnen an unserem Wettbewerb teilnehmen - egal, ob Haupt-,
Mittel-, Gewerbe-, Gesamt- oder Fachschule oder Gymnasium. </li>

<li> Die Sch&uuml;ler, die die Reise wahrnehmen, m&uuml;ssen mindestens 16 Jahre alt
sein. </li>

<li> Die Praktika dauern maximal vier Wochen und werden mit jeweils 500
Mark verg&uuml;tet. Der Termin wird vorher abgesprochen und soll in den
Sommerferien liegen. Verpflegung und Unterkunft werden nicht gestellt!
</li></ul></p>

<p>Anmeldeschluss f&uuml;r den Wettbewerb ist der 15. Mai 2001. Der Rechtsweg
ist ausgeschlossen. </p>

<font size="5"><b>Homepagebau</b><hr noshade></font>
<font size="4"><b>Das Eigenheim im Netz</b></font>

<p>Um heutzutage eine eigene Seite ins Internet zu stellen, sind weder
Kenntnisse in der Web-Sprache HTML noch viel Geld oder technischer Aufwand
n&ouml;tig. Praktisch alle erforderlichen Werkzeuge und der n&ouml;tige Speicherplatz
sind gratis im Web zu finden. </p>

<p>Wir zeigen Ihnen die Software, die Sie f&uuml;r den Bau einer 1A-Homepage
ben&ouml;tigen. Verraten Ihnen, wo Sie lernen, wie man einen guten
Internetauftritt gestaltet. Und erkl&auml;ren, wie Sie Ihre Site ins Netz
bringen und bekanntmachen. </p>

<font size=5><b>Software</b></font><hr noshade>
<font size=4><b>Das Werkzeug eines Seitenbauers </b></font>

<p>Eine Homepage baut sich nicht von allein - man muss aber kein
Programmierer sein, um sich im Web zu verewigen. Zahlreiche Programme
machen das Gestalten des eigenen Internet-Auftritts zum Kinderspiel. </p>

<p>Jeder User bekommt mit den aktuellen Browser-Paketen von Netscape und
Microsoft gute Programme zur Homepage-Erstellung frei Haus geliefert. Dem
Internet Explorer liegt <b>Frontpage Express</b> bei. Der Funktionsumfang
ist beachtlich, die Bedienung in kurzer Zeit erlernbar. Sie k&ouml;nnen auch das
Layout-Programm des Netscape Communicators benutzen: Es hei&szlig;t
<b>Composer</b> und unterscheidet sich von Frontpage Express nur in wenigen
Details. </p>

<p>Beide Programme eignen sich sehr gut, um ohne HTML-Kenntnisse Web-Seiten zu
erstellen. Auch mit einer Textverarbeitung wie <b>Word</b> ist es
mittlerweile m&ouml;glich, einfache Internet-Seiten zu basteln. So k&ouml;nnen Sie
beispielsweise Ihre Texte problemlos als HTML-Datei aus Word heraus
speichern und dann in die Homepage integrieren. Beinahe grenzenlos ist die
Zahl der Shareware-Programme, die es im Netz zu finden gibt. </p>

<p>Bei sehr komplexen Seiten sto&szlig;en diese Editoren allerdings an ihre
Grenzen. Professionelle Web-Layout-Programme erm&ouml;glichen auch die
Erstellung von Web-Seiten mit aufwendigen Multimedia-Effekten und erlauben
eine bequemere Verwaltung und Pflege der Seiten. </p>

<p>Ein gutes Produkt, welches jedoch ein wenig Einarbeitung erfordert, ist
<b>Dreamweaver</b> von Macromedia. Auch <b>GoLive</b> von Adobe bietet dem
ambitionierten Webdesigner alle M&ouml;glichkeiten. Beide Programme sind jedoch
nur Anwendern zu empfehlen, die sich bereits mit der HTML-Programmierung
auskennen.</p>

<font size="5"><b>Tools</b></font><hr noshade>
<font size="4"><b>Kleine Helferlein unterst&uuml;tzen Sie beim Homepage-Bau </b></font>

<p>
Buttons, Animated Gifs, Image Maps - zum Versch&ouml;nern und Verbessern einer
Website gibt es viele Mittel. Bevor Sie jedoch alle Gimmicks per Hand
erstellen, sollten Sie sich kleiner Hilfsprogramme bedienen. Die
beliebtesten Tools stellen wir Ihnen hier vor. </p>

<br>
Eines der wichtigsten Programme zur Erstellung von kleinen Animationen f&uuml;r
die Homepage ist der <b>Ulead GIF Animator</b>. F&uuml;r den privaten Gebrauch
reichen jedoch auch weniger umfangreiche Tools wie beispielsweise
<b>Animake</b> aus, das als Freeware obendrein kostenlos ist. </p>

<p>Sie wollen Ihre Homepage-Besucher mit sehenswerten Schaltfl&auml;chen
beeindrucken? Dann ist <b>ButtonMaker</b> ein sinnvolles Programm f&uuml;r Sie.
Schicke Texteffekte mittels <b>Font Twister</b> k&ouml;nnen den guten optischen
Eindruck nochmals verbessern. </p>

<p>Farben spielen bei der Gestaltung von Websites eine gro&szlig;e Rolle. Doch
es ist nicht immer einfach, f&uuml;r die gew&uuml;nschte Farbe den passenden
HTML-Code herauszufinden. Als n&uuml;tzlich erweisen sich da Hilfsprogramme wie
<b>ColorPicker</b>, <b>Get Color</b> und <b>RGB-Color Finder</b>. </p>

<p>Eine interessante Alternative zur &uuml;blichen Text-Navigation sind
Image-Maps. Diese per Hand zu erzeugen, erfordert jedoch oft sehr viel
Geduld. Schneller geht es beispielsweise mit dem Shareware-Programm
<b>Coffee Cup Image Mapper</b>. </p>

<p>Ist die Website einmal im Netz, soll sie auch von aller Welt gefunden
werden. Zu einer Erfolg versprechenden Anmeldung bei den Suchmaschinen
verhelfen unter anderem Freeware-Tools wie <b>Meta Magic</b> und <b>AnalogX
Cgi Search</b>. </p>

<font size="5"><b>Hilfe im Netz</b></font><hr noshade>
<font size="4"><b>Bei Fragen nicht verzagen - Antworten gibt's im Internet</b></font>

<p>Aller Anfang ist schwer - das gilt besonders f&uuml;r das Erschaffen von
HTML-Seiten. Doch gerade, wenn es um den Bau einer Website geht, ist das
Internet der richtige Ort, um nach Hilfe zu suchen. Viele erfahrene
Homepage-Bastler geben Ihr Wissen bereitwillig an Neulinge weiter. </p>

<p><img src="work_website2.jpg" align="left" width="200" height="141"
hspace=6 border="0">
Ein absoluter Klassiker ist SELFHTML von Stefan M&uuml;nz. Im Internet gibt es
wahrscheinlich keine umfangreichere, deutschsprachige Anleitung f&uuml;r die
Erstellung einer Homepage. Selbst erfahrene Webmaster nutzen SELFHTML
gelegentlich als Nachschlagewerk. Die gesamte Site steht auch als Zip-Datei
zum Download bereit und kann offline gelesen werden: Das spart eine Menge
Online-Kosten.<br>

<br> Auf der Suche nach hilfreichen Tipps ist der Besuch von Dietmar
Rabichs Homepage ebenfalls sehr empfehlenswert. Der Mathematiker stellt
gleicherma&szlig;en Anf&auml;ngern wie Profis wichtige Infos rund um HTML und Java
Script zur Verf&uuml;gung. Die Seite wird regelm&auml;&szlig;ig aktualisiert und wartet mit
den neuesten Tricks auf. </p>

<br> Eine verst&auml;ndliche Einf&uuml;hrung f&uuml;r Einsteiger bietet das HTML-Lexikon
von Marco Abrar. In einem kompakten Kurs werden die Grundtechniken der
HTML-Programmierung erkl&auml;rt. Der Minikurs kann auch komplett
heruntergeladen werden. </p>

<br> Weniger mit technischer Anleitung besch&auml;ftigt sich die tolle Site
Webwelten. Hier finden ambitionierte Webdesigner sehr gute Tipps zur
zeitgem&auml;&szlig;en Gestaltung einer Homepage. Wenn alle Seitenbastler sich an
diese Grundregeln hielten, w&auml;re das Web ein besserer und sch&ouml;nerer
Ort. </p>

<font size="5"><b>Eigene Domain</b></font><hr noshade>
<font size="4"><b>Machen Sie sich weltweit einen Namen</b></font>

<p>Wer sich die M&uuml;he macht, eine tolle Homepage zu entwerfen, sollte diese
leicht auffindbar im Internet platzieren. Am besten unter einem eigenen
Domain-Namen. Dabei ist jedoch Eile geboten, denn die einpr&auml;gsamen
Netzadressen werden auch im deutschen Cyberspace knapp. Mehr als zwei
Millionen so genannte Top-Level-Domains mit der Endung ".de" sind bereits
vergeben, t&auml;glich werden es mehr. Aber noch ist mit ein wenig Fantasie
einiges zu machen - teilweise sogar kostenlos. </p>

<p>Doch Vorsicht: Selbst wenn eine Domain-Adresse noch zu haben ist,
m&uuml;ssen Sie pr&uuml;fen, ob der Name frei von Rechten anderer ist. Nicht
verwenden sollten Sie daher Namen von eingetragenen Marken, Unternehmen
oder von Prominenten. Benutzen sie keine Titel von Zeitschriften, Filmen,
Software oder TV-Sendungen sowie keine St&auml;dtenamen, Kfz-Kennzeichen und
Bezeichnungen von staatlichen Einrichtungen. Prozessgef&auml;hrdet sind au&szlig;erdem
Tippfehler-Domains wie etwa "intell.de". </p>

<p>Die Duisburger Firma KON bietet die Einrichtung einer Domain-Adresse
zum Nulltarif an. Wer in den Internet-Browser Ihren neuen Domain-Namen
eingibt, wird einfach auf Ihre bestehende Homepage bei Ihrem Provider (AOL,
T-Online) umgeleitet. Nachteil: Wer Ihre Seite anklickt, bekommt ein
kleines Werbefenster zu sehen. </p>

<p>Der Trick mit der Umleitung, auch ohne Werbe-Einblendungen,
funktioniert ebenfalls bei anderen Domain-Anbietern. F&uuml;r eine monatliche
Grundgeb&uuml;hr und eine einmalige Einrichtungspauschale kommen Sie preiswert
zu Ihrer Wunsch-Domain. Zu h&ouml;heren Preisen k&ouml;nnen zum Teil gleichzeitig
Speicherplatz und Serviceleistungen in Anspruch genommen werden. Egal, bei
welcher Firma Sie eine Domain erwerben, achten Sie darauf, dass Sie als
Besitzer (Admin-C) registriert werden. Nur dann geh&ouml;rt Ihr guter Name
wirklich Ihnen. </p>


<font size="5"><b>Webspace</b></font><hr noshade>
<font size="4"><b>Ein Parkplatz an der Datenautobahn</b></font>

<p><img src="work_website4.jpg" align="left" width="200" height="146"
hspace=6 border="0">
Fast jeder Internet-Zugangsprovider reserviert heute f&uuml;r seine Kunden
geb&uuml;hrenfreien Webspace. Der zur Verf&uuml;gung gestellte Speicher f&uuml;r die
Homepage ist, je nach Anbieter, zwischen 2 und 20 Megabyte gro&szlig;, bietet
also in den meisten F&auml;llen mehr Platz als eigentlich ben&ouml;tigt wird. </p>

<p>Daf&uuml;r m&uuml;ssen h&auml;ufig andere Einschr&auml;nkungen beim eigenen
Internet-Auftritt hingenommen werden. So unterst&uuml;tzen nicht alle Anbieter
die technischen Raffinessen, die Sie vielleicht gerne auf Ihrer Homepage
verwenden w&uuml;rden. Wer etwa auf selbst programmierte CGI-Skripte oder
eingebundene Videostreams nicht verzichten m&ouml;chte, sollte sich informieren,
ob der Webspace-Provider die Unterbringung solcher Daten &uuml;berhaupt
erm&ouml;glicht. </p>

<p>Vorsicht geboten ist au&szlig;erdem bei neuen oder kleineren Zugangsprovidern.
Durch den derzeitigen Preiskampf k&ouml;nnen diese schnell wieder aus der
Netzwelt verschwinden. Homepage-Besitzer sind dann gezwungen, mit ihrer
kompletten Internet-Seite umzuziehen. Gleiches gilt &uuml;brigens auch dann,
wenn Sie Ihren Internet-Provider wechseln. </p>



<font size="5"><b>Virtual Communities</b></font><hr noshade>
<font size="4"><b>Nachbarn aus Bits und Bytes</b></font>

<p>Zu den ersten Errungenschaften im Internet geh&ouml;rten die so genannten
"Virtual Communities", also Cyber-Gemeinschaften. Hinter diesem nach
Science-Fiction klingenden Begriff verbirgt sich eine sch&ouml;ne Idee: Alle
Internet-Nutzer sollen die M&ouml;glichkeit haben, Ihr Haus im World Wide Web zu
bauen. Diese H&auml;user bilden Bezirke, welche wiederum zu einer Stadt
zusammengefasst werden. Zus&auml;tzlich laden Cafés zum Chatten, verschiedene
L&auml;den zum Einkaufen ein, im Rathaus k&ouml;nnen die pers&ouml;nlichen Daten verwaltet
und im Postamt E-Mails verschickt werden. </p>

<p>Von der Nachbarschafts-Romantik der Anfangstage ist aufgrund der
heutigen Massen an privaten Homepages nicht mehr viel &uuml;brig geblieben.
Trotzdem sind die Communities noch immer eine gute Anlaufstelle f&uuml;r alle,
die auf der Suche nach kostenlosem Webspace sind. Nicht nur die pers&ouml;nliche
Internet-Seite kann bei Anbietern wie Fortunecity, Tripod oder Geocities
untergebracht werden. Auch Websites &uuml;ber die eigenen Lieblingsstars,
ausgefallene Hobbys oder spezielle Themen sind willkommen. So sind aus den
Cyber-Gemeinschaften mittlerweile riesige Informations-Pools geworden. </p>

<p><b>Was sollten gute Communities ihren Mitgliedern bieten?</b><ul>

<li> Die Homepages sollten in Kategorien unterteilt werden, um f&uuml;r die
Internet-Surfer leicht auffindbar zu sein.

<li> Es sollten Software-Assistenten f&uuml;r Anf&auml;nger und Fortgeschrittene
verf&uuml;gbar sein, die beim Bau einer Website behilflich sind.

<li> Die Seiten sollten einerseits online erstellbar sein und andererseits
per FTP hochgeladen werden k&ouml;nnen.

<li> Die Daten auf den Community-Servern sollten regelm&auml;&szlig;ig gesichert
werden, damit ein eventuelles technisches Problem nicht zur L&ouml;schung Ihrer
Homepage f&uuml;hrt.

<li> Zus&auml;tzlich zu beachten: Der Platz im Netz ist zwar kostenfrei, daf&uuml;r
m&uuml;ssen sich die Besucher Ihrer Website in der Regel von eingeblendeten
Werbebotschaften ablenken lassen. Die Internet-Adressen sind zudem h&auml;ufig
sehr lang und daher sehr schlecht zu behalten. Abhilfe schafft hier ein
eigener Domain-Name.</li></ul>
 
<hr size="4" color="#800000">

<p><font size="5"><b>So bauen Sie sich ein WWW-Heim</b></font><br>

Sie h&auml;tten gern eine eigene Homepage, scheuen aber die Zeit, sich eine zu
basteln? Keine Angst! Sie brauchen weder einen ganzen Tag noch eine Stunde
dazu, sondern ganze 30 Minuten! Folgen Sie einfach den Schritten.<br>
Sie melden sich einfach bei einem Freespace-Anbieter an, z.B. Tripod, und
los geht's. </p>

<p><hr noshade><font size="4"><b>Die Vorbereitung: 8 Minuten</b></font><br>
<b>Schritt 1</b><br>
<b>1. Planung</b><br>
Planen Sie Ihre private Homepage, &uuml;berlegen Sie, welche Informationen Sie
bereitstellen m&ouml;chten. Das Familien-Fotoalbum, oder wollen Sie einfach nur
&uuml;ber sich selbst und Ihre Hobbies berichten?</p>

<p><b>2. Namensgebung</b><br> Suchen Sie sich einen einfachen und
pr&auml;gnanten Namen f&uuml;r Ihre Seite aus.</p>

<p><b>3. Grobstruktur</b><br> Skizzieren Sie den Aufbau der Website,
&uuml;berladen Sie die Startseite nicht mit Infos, denken Sie an
Unterseiten.</p>

<p><b>4. Ordner anlegen</b><br> &Uuml;berlegen Sie, welche Bilder und Texte Sie
bereitstellen m&ouml;chten. Legen Sie alle Dateien in einem neuen Ordner Ihres
PCs ab, dann k&ouml;nnen Sie beim Homepage-Bau leichter darauf zur&uuml;ckgreifen.
</p>

<p><hr noshade><font size="4"><b>Anmeldung beim Anbieter: 5 Minuten</b></font><br>

<b>Schritt 2</b><ul>
<li> <b>1. Anbieter aussuchen</b><br>
Wir w&auml;hlen www.tripod.de f&uuml;r den Bau der Homepage aus. Das Programm ist
einfach zu bedienen und setzt nur eine Registrierung voraus. Zum Baubeginn
m&uuml;ssen Sie nur "Gestalte Deine eigene Homepage" anklicken. </li>

<li> <b>2. Einsteigerprogramm</b><br>
"Leicht und schnell bauen" verspricht der Button auf der folgenden Seite.
Dahinter verbirgt sich die Bauanleitung f&uuml;r den Einsteiger. </li>

<li> <b>3. Registrierung</b><br>
Als n&auml;chstes m&uuml;ssen Sie sich registrieren lassen. </li>

<li> <b>4. Pers&ouml;nliche Daten</b><br>
Hier geben Sie einen Mitgliedsnamen sowie ein Kennwort ein. Sie werden nach
pers&ouml;nlichen Daten wie Ihrem Namen gefragt. </li>

<li> <b>5. Best&auml;tigung</b><br>
Bei ordnungsgem&auml;&szlig;er Anmeldung erhalten Sie die  Nachricht,  dass  Sie  eine
eigene Homepage erstellen k&ouml;nnen. Weiter geht's wie immer mit "Weiter"...
</li></ul></p>


<p><hr noshade><font size="4"><b>Homepage bauen: 10 Minuten</b></font><br>
<b>Schritt 3</b><ul>
<li> <b>1. Themenauswahl</b><br>
Nach der Registrierung gelangen Sie auf die Einsteigerseite, w&auml;hlen Sie
unter "Dein Thema" den Gestaltungsvorschlag "Das bin ich".</li>

<li> <b>2. Namen eingeben</b><br>
Geben Sie nun den Namen f&uuml;r Ihre neue Homepage ein.</li>

<li> <b>3. Selbstbeschreibung</b><br>
Geben Sie Infos zu Ihrer Person ein.</li>

<li> <b>4. Foto</b><br>
Im n&auml;chsten Schritt k&ouml;nnen Sie aus Ihrem Ordner Ihr Foto hochladen oder
Vorschl&auml;ge der Bilder-Bibliothek von Tripod nutzen.</li>

<li> <b>5. Familie & Co.</b><br>
Stellen Sie in den n&auml;chsten Schritten Ihre Familie und Freunde vor, stellen
Sie Links dazu. Teilen Sie der Welt Ihre Hobbies und Interessen mit.</li>

<li> <b>6. Linksammlung</b><br>
Ihre Linkliste enth&auml;lt alle Links auf die Seiten, die Ihnen gefallen.
Klicken Sie auf "Speichern", dann auf "Fertige Seite anschauen".
</li></ul></p>

<p><hr noshade><font size="4"><b>Ins Netz stellen: 1 Minute</b></font><br>
<b>Schritt 4</b><ul>
<li> <b>1. Fertigstellung</b><br>
Ihre Seite ist fertig! Dr&uuml;cken Sie auf "Weiter", um den Bau Ihrer Homepage zu beenden.</li>

<li> <b>2. &Uuml;bertragung</b><br>
Unsere Page wird auf dem Server von Tripod als Mitgliedsseite gespeichert.</li>

<li> <b>3. WWW-Welt</b><br>
"Das bin ich" hei&szlig;t es in Ihrer Adresszeile - und die ganze Welt kann Sie
nun anklicken. Sie sind ein Teil der WWW-Welt. </li></ul></p>


<p><hr noshade><font size="4"><b>Homepage bekannt machen: 6 Minuten</b></font><br>
<b>Schritt 5</b><ul>

<li> <b>1. Suchmaschinen</b><br>
Sie wollen auf Ihre Homepage aufmerksam machen? Lassen Sie sich in
Suchmaschinen mit Begriffen, die Ihre Homepage thematisch umrei&szlig;en,
registrieren. (www.webmasterplan.de)</li>

<li> <b>2. Bannertauschdienste</b><br>
f&ouml;rdern die Bekanntheit. Jedem Besucher Ihrer Seite wird das Banner einer
anderen Homepage angezeigt. Im Gegenzug wird von den Seiten anderer
Anbieter auf Ihre Seite verzweigt. (www.bannertausch.de)
</li></ul></p>

<p><hr noshade><font size="4"><b>So versch&ouml;nern Sie Ihre Site</b></font><br>
 
Hiermit haben Sie gelernt, eine schlichte Homepage zu bauen und ins
Netz zu stellen. Nun geht's darum, die virtuelle Visitenkarte interessanter
zu machen.</p>

<p>Das Wichtigste: Um Effekte und Multimedia zu bieten, m&uuml;ssen
Sie mit dem HTML-Code arbeiten. Aber keine Sorge, selbst programmieren
m&uuml;ssen Sie nicht, bei Tripod gibt es fertige Module.<ul>

<li> <b>1. Anmelden</b><br>
Melden Sie sich bei Tripod an, und w&auml;hlen Sie anschlie&szlig;end die Funktion
"Individuell & kreativ bauen" (f&uuml;r Profis).</li>

<li> <b>2. Dateimanager w&auml;hlen</b><br>
Sie landen im Tripod-Homepage-Studio, dem HTML-Tool f&uuml;r Fortgeschrittene.
Wechseln Sie in den Dateimanager: Hier sind Ihre HTML-Dateien
aufgef&uuml;hrt.</li>

<li> <b>3. Bearbeiten</b><br>
Aktivieren Sie das freie K&auml;stchen der Datei "Index.htm". Klicken Sie auf
der Rollleiste das Feld "Bearbeiten" an.</li>

<li> <b>4. Konvertieren</b><br>
Die Seite, die Sie im Einsteiger-Modus erstellt haben, muss in den
Profi-Modus konvertiert werden. W&auml;hlen Sie im sich &ouml;ffnenden Fenster
"Freeform-Editor".</li>

<li> <b>5. HTML-Code</b><br>
Nun sehen Sie, wie Ihre Homepage im HTML-Code aussieht. Suchen Sie im Text
die Stelle, an der Sie den Wunscheffekt einf&uuml;gen wollen.</li></ul></p>

<p>&Uuml;ber <b>Werkzeuge ausw&auml;hlen</b> k&ouml;nnen Sie nun ganz leicht verschiedene
Funktionen in Ihre Site einbauen: <ul>

<li> Mit dem <b>Zugriffsz&auml;hler</b> k&ouml;nnen Sie erkennen, wie viele G&auml;ste Ihre
Seite bislang angesurft haben</li><br>

<li> Im <b>G&auml;stebuch</b> k&ouml;nnen sich Besucher der Homepage verewigen. Die
Kommentare sind anschlie&szlig;end anderen Surfern zug&auml;nglich</li><br>

<li> Mit <b>Schlagzeilen</b> werden Besucher aktuell unterrichtet. Sie
erscheinen nicht mitten auf der Site, sondern in der Zeile am unteren
Bildschirmrand</li><br>

<li> Eine <b>Wetterkarte</b> zeigt mit einem Symbol und den
Barometer-Angaben die aktuelle Wetterlage einer von Ihnen ausgew&auml;hlten
Stadt an</li><br>

<li> Die <b>E-Mail-Adresse</b> ist ein unbedingtes Muss auf jeder Homepage.
Damit k&ouml;nnen G&auml;ste direkt mit Ihnen Kontakt aufnehmen. &Uuml;ber unseren Link
&ouml;ffnet sich automatisch ein Mail-Fenster mit Ihrer
Mail-Adresse</li></ul></p>


<p><hr noshade><font size="4"><b>So bauen Sie Effekte in Ihre Seite ein</b></font><br>

Bisher haben wir Ihnen gezeigt, wie Sie Ihre Homepage um einige
Raffinessen erweitern k&ouml;nnen. Jetzt bringen wir Ihnen verschiedene
Effekte n&auml;her, die Ihre virtuelle Visitenkarte zu einem ganz besonderen
Erlebnis werden lassen. </p>

<p><b>Musik</b><br>

Als erstes m&uuml;ssen Sie den HTML-Code Ihrer Homepage direkt hinter der
HEAD-Zeile (am Anfang) um folgende Zeile erweitern: &lt; bgsound
src="dateiname.mid"loop=infinite &gt; Ersetzen Sie sp&auml;ter "dateiname.mid" mit
der von Ihnen gew&auml;hlten Musikdatei. Mit "loop" legen Sie die Anzahl der
Wiederholungen fest und "infinite" spielt den Song unendlich oft
hintereinander ab. </p>

<p>Musik gibt es &uuml;brigens auch im Netz. Bei <u><b><font color="#0000ff">
www.flashsounds.de </font></b></u> oder <u><b><font
color="#0000ff">www.die-fundgrube.de </font></b></u> finden Sie bestimmt
den passenden Hintergrundsound. </p>

<p><b>Bildergalerie</b><br>

Rufen Sie bei Tripod den Effekt "Bildergalerie" auf. W&auml;hlen Sie eine
Grafik, die Sie einf&uuml;gen m&ouml;chten. Kopieren Sie das im unteren Teil des
Fensters angezeigte Textfragment, und f&uuml;gen Sie es an der Stelle in den
HTML-Code ein, an der das Bild sp&auml;ter dargestellt werden soll. Klicken Sie
auf "Speichern". </p>

<p><b>Hintergrund</b><br>

Um einen bestimmten Hintergrund einzuf&uuml;gen, rufen Sie den HTML-Code Ihrer
Website auf und geben Sie den Befehl < background="dateiname.tif" > ein.
Sie k&ouml;nnen Ihr Bild als TIF- oder JPEG-Format einf&uuml;gen. Hintergrundgrafiken
gibt es ebenfalls im Netz unter
<u><b><font color="#0000ff"> www.gograph.de </font></b></u> oder
<u><b><font color="#0000ff"> www.gifarchiv.de</font></b></u>. </p>

<p><b>Linkliste</b><br>

Klicken Sie in der Jscript-Bibliothek Tripods auf "Navigations-Pull-Down".
Kopieren Sie den HTML-Code. Klicken Sie sich zur&uuml;ck zu Ihrer Page und f&uuml;gen
Sie den Code ein. Vorsicht: der erste Teil des Scripts muss direkt hinter
der Zeile &lt;HEAD&gt; am Anfang des HTML-Codes stehen, der zweite Teil dort, wo
Sie Ihre Linkliste platzieren wollen. Wenn alles klappt, k&ouml;nnen Sie die
Links im Script durch Ihre eigenen Tipps ersetzen.
</p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
