<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<HTML>
    <HEAD>
        <TITLE>C64-Nostalgie mit Frodo</TITLE>
        <META NAME="generator" CONTENT="MetalWEB Designer 4.0 Prerelease 2, Multitaskers ©1997-1999">
    </HEAD>
    <BODY BGCOLOR=#E0FFFF TEXT=#000000 VLINK=#CC0000 LINK=#0000CC ALINK=#FFFF00>
        <FORM ACTION="" METHOD="GET">
            <BR>
            <BR>
            <P align=center><FONT COLOR=#FF0000><FONT SIZE="+3"><FONT SIZE="+3">Butcher&acute;s Emu Workshop </FONT></FONT></FONT></P>
            <BR>
            Leider hat sich meine Prozessorkarte verabschiedet hat, muss der Mac warten... <BR>
            Stattdessen nehme ich Heute mal einen Klassiker. <BR>
            <BR>
            <P align=center><FONT SIZE="+2"><FONT SIZE="+2"><FONT COLOR=#0000FF>FRODO</FONT></FONT></FONT> </P>
            <BR>
            <BR>
            <B><U>Technische Daten: </U></B><BR>
            <B>Programmname:</B> Frodo <BR>
            <B>Getestete Version:</B> 1.5 <BR>
            <B>Typ:</B> C 64 Emulator <BR>
            <B>Autor:</B> Christian Bauer <BR>
            <B>Status:</B> Freeware <BR>
            <BR>
            <B><U>Systemvorrausetzungen: </U></B><BR>
            - Amiga <BR>
            - OS 2.1 <BR>
            - 68020 CPU <BR>
            - 1 MB RAM <BR>
            <BR>
            <B><U>Empfohlene Konfig: </U></B><BR>
            - Amiga <BR>
            - OS 2.1 <BR>
            - 68040 CPU mit 40 Megahertz <BR>
            - Grafikkarte <BR>
            <BR>
            <B><U>Getestet auf folgender Konfig: </U></B><BR>
            - Amiga 1200 <BR>
            - OS 3.9 <BR>
            - 68030&#47;50 <BR>
            - 32 MB RAM + 2 MB Chip <BR>
            <BR>
            <BR>
            <B>Einleitung: </B><BR>
            Da unser erster Computer so ein "Brotkasten" war, und ich ihn auch noch gut in Erinnerung habe, hab ich mir den C 64 f&uuml;r den Amiga geholt. Jetzt ist es mir m&ouml;glich, meine guten alten C 64 Spiele-Klassiker auf den Amiga zu spielen. <BR>
            <BR>
            <B>Konfiguration:</B> <BR>
            Ersteinmal muss man sich die C 64 ROM&acute;s besorgen. Aus Copyrightgr&uuml;nden k&ouml;nnen sie nicht mitgeliefert werden (Es wird aber beschrieben, wie man daran kommen kann). <BR>
            Zur Info: Die ROM&acute;s hab ich von einer CD namens "C 64 Sensation". <BR>
            Nachdem die ROM&acute;s so installiert wurden, wie es ausf&uuml;hrlich in der Dokumentation des Programms steht, l&auml;sst sich der Emulator starten. Nachdem man einen Doppelklick getan hat, &ouml;ffnet sich ein Konfigurationsfenster. <BR>
            <BR>
            In den Fenster k&ouml;nnen folgende Dinge eingestellt werden: </P>
            <P align=center><IMG SRC="Frodo1.gif" ALT="Frodo Einstellungen" BORDER="0"> </P>
            <BR>
            Wie die Emulation angezeigt werden soll. (Die Zyklen habe ich auf die Standartwerte gelassen!) <BR>
            Wo der Joystick angeschlossen werden soll (Port 1 oder Port 2), ob eine SID-KArte vorhanden ist (ein Bauplan f&uuml;r eine SID-Karte ist dem Emulator beigelegt). Ob es eine Amerikanische Tastatur verwendet werden soll. <BR>
            Desweiteren kann man eine Spritekollision ei und auschalten. <BR>
            <BR>
            Der Emulator kann bis zu 4 Laufwerken verwalten. Sie k&ouml;nnen in Form von einem Floppydisk-Laufwerk verwendet werden, oder einfach als einer Schublade auf der Festplatte. <BR>
            Ich habe als erstes Laufwerk meine Ramdisk gew&auml;hlt und als zweites Laufwerk eine Schublade auf meiner Festplatte. <BR>
            <BR>
            Zum Schluss sollte man noch die Bildschirmaufl&ouml;sung w&auml;hlen. Ich empfehle hier LowRes NonInterlaced, das ansonsten das Bild zu klein wird... <BR>
            <BR>
            Es werden alle Funktionen ausf&uuml;hrlich in der zum Programm geh&ouml;renden AmigaGuide-Dokumentation beschrieben... <BR>
            <BR>
            Falls man alle Einstellungen vorgenommen hat, sollte man jetzt speichern. Danch kann man getrost auf OK klicken und den Emulator starten. </P>
            <P align=center><IMG SRC="Frodo2.gif" ALT="C64 Auf nen 17" VGA ;)" BORDER="0"> </P>
            <BR>
            Nach etwa 1 Sekunde Verz&ouml;gerrung &ouml;ffnet sich der altbekannte Screen des C 64. Mit den Befehl LOAD"$",8 kann man seine Programmschublade im C64 &ouml;ffnen. <BR>
            <BR>
            Die C64 Befehle sollten hier bekannt sein, ansonsten kann man diese in der FrodoGuide nachlesen. <BR>
            <BR>
            Die Spiele laufen zwar etwas langsamer als das Original (C64), aber daf&uuml;r sehr gut und auch der Sound kommt gut r&uuml;ber. <BR>
            <BR>
            <A HREF="mailto:Rstell@web.de">Ren&eacute; "TheButcher" Stelljes</A>   </P>
        </FORM>
    </BODY>
</HTML>
