<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. AMIGA, Inc. stellt weitere leitende Mitarbeiter ein

AMIGA, Inc. (http://www.amiga.com) informiert:

»Liz Barnick tritt als Direktorin, Business Development, bei AMIGA ein

02. Februar 2002, Snoqualmie, WA - Liz Barnick kommt zu AMIGA mit einer
&uuml;ber 15-j&auml;hrigen Erfahrung in der Verkaufs-, Vermarktungs- und
Gesch&auml;ftsentwicklung in der technologischen Industrie. Zuletzt war sie
Vizepr&auml;sidentin f&uuml;r Gesch&auml;ftsentwicklung bei RAVISENT Technologies Inc.,
wo sie verantwortlich f&uuml;r die Begr&uuml;ndung und Pflege kritischer Gesch&auml;fts-
Verbindungen war und mit gro&szlig;em Eifer Ziele der Auftragsbeschaffung
weltweit verfolgte. Davor hatte sie die Verkaufsverwaltung bei Seagate
Softwarenetwork & Systems Group, wo sie eine Verkaufsgruppe leitete,
die unternehmensweite L&ouml;sungen f&uuml;r das Fortune 1000 bereitstellte. Und
davor arbeitete sie bei Computer Associates als Leiterin des landesweiten
Verkaufs und war f&uuml;r die Hauptabrechnung zust&auml;ndig. Frl. Barnick war auch
viele Jahre in der CAD/CAM-Industrie t&auml;tig bei Gesellschaften wie
CalComp-Lockheed Company und Summagraphics. Frl. Barnick hat einen
Abschluss als Bachelor of Science der California Polytechnic Universit&auml;t,
Schwerpunkt Absatzpolitik.«


»David Brott tritt als Direktor, Business Development, bei AMIGA ein

02. Februar 2002, Snoqualmie, WA - Vor seinem Eintritt bei AMIGA war Herr
Brott Vizepr&auml;sident f&uuml;r Lizenzvergabe und Beurkundung bei InterActual
Technologies, wo er die weltweiten T&auml;tigkeiten zur Lizenzierung von
Technologien und Warenzeichen leitete. Seine Verantwortung schloss
InterActuals Best&auml;tigungsprozess ein, der die Pr&uuml;fung der API-Eignung
f&uuml;r eingebettete Webbrowser, MPEG-2 DVD Halbleiter und DVD-Set-Top-
Systeme f&uuml;r Endkunden enthielt. Herr Brott hatte auch die Stelle eines
Direktors f&uuml;r Gesch&auml;ftsentwicklung bei Ravisent Technologies mit
weltweiter Verantwortung f&uuml;r Technologie-Lizenzierung und Gesch&auml;fts-
Verbindungen. Beim Seal Team Three, United States Navy, war Herr Brott
verantwortlich f&uuml;r taktische Kommunikation und Einsatzplanung. Er erhielt
seinen BA [Bachelor of Arts] von der University of California in San Diego,
und hat die Fortgeschrittenenkurse der Wharton Executive Education und des
Center For Creative Leadership abgeschlossen.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
