<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Kommentar zur »AMIGA & Microsoft«-Thematik (von J&uuml;rgen Theiner)

Fr&uuml;her oder sp&auml;ter kriegen wir euch...

Kaum ein Thema hat die Amiganer in der letzten Woche mehr bewegt als die
Ank&uuml;ndigung, da&szlig; sich Microsoft f&uuml;r AmigaDE interessiert.
Nat&uuml;rlich kann auch ich bei so einer Sache nicht den Mund halten und mu&szlig;
meinen Senf dazu geben.

Als ich die Nachricht las, wu&szlig;te ich zuerst einmal wirklich nicht, was ich
davon halten soll. Deshalb fing ich erst einmal damit an, mir Gedanken &uuml;ber
die Beweggr&uuml;nde von AMIGA, Inc. zu machen. Und die scheinen ja auf der Hand
zu liegen: Geld. Nachdem man sich anscheinend mit Nokia einig ist, da&szlig; das
AmigaDE dort auf den neuen Handys l&auml;uft, ist mit Microsoft der n&auml;chste
gro&szlig;e "Partner" gefunden. Aus marktwirtschaftlicher Sicht ist es sicher
richtig, sich immer an den Ersten zu orientieren. Und dann sagten mir auch
einige Leute, da&szlig; sie stolz darauf seien, da&szlig; so ein Riese wie MS sich
&uuml;berhaupt mit dem kleinen Zwerg Amiga abgibt. Nun, wie gesagt, im VWL-
Unterricht w&uuml;rde ich sagen: gut gemacht!

Trotzdem blutete mir innerlich das Herz. Da habe ich seit &uuml;ber 10 Jahren
einen Rechner bei mir, den ich in m&uuml;hevoller Kleinarbeit (und unter Einsatz
betr&auml;chtlicher Geldmittel) hege und pflege, w&auml;hrend sich mein Bruder jedes
Jahr einen neuen Rechner kauft und die alten Teile einfach verscherbelt. Er
l&auml;uft mit einem Microsoft T-Shirt herum, w&auml;hrend ich stolz auf meine Amiga-
Socken und den Wintel-Outside-Aufkleber bin. Es tut halt gut, etwas
Besonderes zu sein!

Das Problem ist halt folgendes: Nat&uuml;rlich mu&szlig; AMIGA, Inc. Geld machen, um
wettbewerbsf&auml;hig zu sein. Und ich glaube, da&szlig; es noch nicht einmal die
Tatsache ist, da&szlig; sie auf dem Microsoft-Stand AmigaDE vorf&uuml;hren, sondern
eher die Frage: Ist das &uuml;berhaupt noch Amiga?

Wie definiert sich Amiga? Ist es Pflicht, da&szlig; es eines der "alten"
Motherboards sein mu&szlig; (eventuell halt mit Erweiterungen) oder ist die
Plattform komplett egal (eben auch x86 z.B.)? Oder soll es doch eine
komplett neue Hardware sein, die sich aber wie seinerseits der Classic-
Amiga durch spezifische Merkmale von der Masse abhebt? Oder ist selbst das
kein Amiga mehr?

Ich glaube, der Aufruhr geht nicht nur gegen Microsoft (obwohl das an und
f&uuml;r sich schon ein guter Grund ist) sondern ist einfach die Art der meisten
User, sich mit der Tatsache abzufinden, da&szlig; es "den Amiga" auf kurz oder
lang nicht mehr gibt. F&uuml;r mich pers&ouml;nlich ist es halt so, da&szlig; das
Motherboard, welches seit Jahren f&uuml;r mich den Dienst verrichtet, "mein
Amiga" ist. L&ouml;sungen wie Amithlon sind halt wirklich gut und helfen
wahrscheinlich auch, den Spirit noch ein paar Jahre in die Zukunft zu
bef&ouml;rdern, aber ich pers&ouml;nlich werde versuchen, den Tag, an dem ich meinem
Amiga den Saft abklemmen mu&szlig;, um irgendeinen neuen Computer (egal was da
kommt, egal mit welcher Software) in Betrieb zu nehmen, hinauszuz&ouml;gern.

Ja, ja, ich wei&szlig;. Diese Einstellung verhindert den Fortschritt. Man kann
nicht immer am Alten festhalten, man mu&szlig; auch schon mal loslassen, um neuen
Sachen den Einzug zu erm&ouml;glichen. So halten viele das OS 4 f&uuml;r absolut
&uuml;berfl&uuml;ssig, weil es keine Innovation darstellt, um neue Kunden zu gewinnen
oder gar alte Amiga-User wiederzuholen. Ich pers&ouml;nlich halte dies
allerdings f&uuml;r nicht ganz richtig. Ich freue mich auf das neue OS, um noch
einmal das letzte aus meinem alten Amiga herauszuholen. Wenn dann
irgendwann einmal dieses OS auf einer neuen Plattform l&auml;uft, wird mir der
&Uuml;bergang wesentlich leichter fallen. Aber zu diesem Thema gibt es
wahrscheinlich zig verschiedene Ansichten, deshalb w&uuml;rde ich mich freuen,
wenn ihr uns so viele Mails wie m&ouml;glich hierzu schickt (aakt@aakt.de)
Wie steht ihr zu dem Ganzen?

Lange Tage und angenehme N&auml;chte,

Euer

J&uuml;rgen Theiner &lt;juergen.Theiner@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
