<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Nokia wird offizieller Partner von AMIGA, Inc.

AMIGA, Inc. hat bekanntgegeben, dass die in Entwicklung befindliche
Betriebsumgebung AmigaDE auf dem Multimediager&auml;t "Mediaterminal" des
weltgr&ouml;&szlig;ten Mobiltelefonherstellers Nokia vorinstalliert sein wird.
Zun&auml;chst ist das Produkt, dessen genaue Spezifikationen auf der Website
http://www.nokia.com/multimedia/mediaterminal.html zu finden sind, f&uuml;r den
schwedischen Markt vorgesehen.


AMIGA, Inc. (http://www.amiga.com) informiert:

»AMIGA soll AmigaDE auf Infotainment Device [Informations- und
Unterhaltungsger&auml;t] f&uuml;r den Heimbereich bereitstellen

02. Februar 2002, Snoqualmie, Washington - AMIGA Inc, ein aufsteigender
F&uuml;hrer bei der Medien&uuml;bertragung, gab heute bekannt, dass Amiga auf
dem Nokia-Mediaterminal f&uuml;r den schwedischen Markt vorinstalliert sein
wird. Das k&uuml;rzlich in Schweden gestartete Nokia-Mediaterminal, ein
innovatives 'Infotainment' [Informations- und Unterhaltungs-] Ger&auml;t f&uuml;r
den Heimbereich, vereinigt digitalen Videorundfunk (DVB) [= Digital Video
Broadcast], Spielm&ouml;glichkeiten, Direktempfang und Herunterladen von
digitalen Medien, vollen Internet-Zugang und pers&ouml;nliche Videorecorder
(PVR) Technologie. Eine auf Linux basierende Version des AmigaDE wurde
im Nokia Mediaterminal eingesetzt.

"Die heutige Ank&uuml;ndigung ist ein weiterer klarer Schritt vorw&auml;rts zu
unserer Vision, dem Amiga-Anwender die M&ouml;glichkeit zu bieten, auf ihre
beliebtesten Anwendungen mit jedem Ger&auml;t und auf jeder Plattform
zugreifen zu k&ouml;nnen," sagte Bill McEwen, Pr&auml;sident/CEO von AMIGA Inc.
"Der Einsatz von Amiga auf dem Nokia Mediaterminal bietet den Verbrauchern
eine F&uuml;lle von Spiel- und Unterhaltungsm&ouml;glichkeiten &uuml;ber ein zentrales
Ger&auml;t, das an ihren Fernseher angeschlossen ist."

Durch die Verwendung des AmigaDE auf dem Nokia Mediaterminal k&ouml;nnen die
Anwender die neusten Spielm&ouml;glichkeiten, MP3, MPEG4 herunterladen und
speichern, an allgemeinen Chats teilnehmen und Video direkt empfangen.
Damit wird aus dem Familienfernseher ein multifunktionelles Zentrum
f&uuml;r die Unterhaltung.


&Uuml;ber AMIGA
AMIGA Inc. etablierte sich 1985 als der weltweit erste Anbieter f&uuml;r
Multimadiatechnologien. Heute f&uuml;hrt AMIGA immer noch auf dem Weg zu
Multimedia dadurch, dass es sprachunabh&auml;ngige Technologien den Entwicklern
zur Verf&uuml;gung stellt, um Anwendungen zu schreiben und zu portieren f&uuml;r
eine neue Multimediaplattform, die Hardware-unabh&auml;ngig ist. Deren AmigaDE,
betrieben mit intent(TM) der Tao Group erlaubt es, Anwendungen unver&auml;ndert
auf einem weiten  Bereich von Prozessoren laufen zu lassen, darunter ARM,
StrongARM, Intel X-Scale, MIPS, Intel x86, Motorola 68K und Hitachi SH.
Es kann aufgesetzt werden auf viele verschiedene Operationssysteme, wie
Linux, Embedded Linux, Windows 95, 98, 2000, NT, and Pocket PC. AmigaDE
Player und Anwendungen f&uuml;r die AmigaDE-Umgebung k&ouml;nnen gekauft werden bei
http://de.amiga.com. Die Zentrale von AMIGA ist in Snoqualmie, WA, USA und
hat weltweit Niederlassungen. Sie k&ouml;nnen AMIGA erreichen &uuml;ber (425) 396-
5660 oder AMIGA im Internet besuchen bei http://www.amiga.com.«


Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
