<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Neuigkeiten von Airsoft Softwair

Airsoft Softwair (http://www.airsoftsoftwair.de) informiert:

»Endlich ist es wieder soweit! Eine neue Version von Akiko, dem CD32
und CDTV Emulator f&uuml;r Microsoft(r) Windows(r) Systeme, steht zum
Download auf der Airsoft Softwair Homepage (http://www.airsoftsoftwair.de/)
bereit.
Bei dieser Version 1.2 handelt es sich um ein gro&szlig;es Update, so ist der
Emulator jetzt ungef&auml;hr 20 Prozent schneller, unterst&uuml;tzt die Emulation des
statischen Speicherblocks des CD32 inkl. einem NVRam-Editor, der es erlaubt
Spielst&auml;nde zu importieren und zu exportieren sowie zu modifizieren
(patchen). Beispiele daf&uuml;r gibt es in der Dokumentation. Au&szlig;erdem
bietet Akiko nun eine echte Joypad-Emulation, d.h. der Benutzer kann jedem
Knopf auf dem CD32-Joypad eine Taste bzw. einen PC-Joystickknopf zuweisen.
Au&szlig;erdem unterst&uuml;tzt Akiko jetzt auch die Sprachemulation vom CD32 & CDTV,
so dass viele Spiele jetzt einfach in der eingestellten Sprache erscheinen.
Schlie&szlig;lich gab es einige Fehlerbeseitigungen und es wurden auch einige
Patches verbessert sowie die Dokumentation ausgebaut. Wer sich noch immer
nicht f&uuml;r Akiko registriert hat (Kostenpunkt: Nur 15 Euro!!), dem noch ein
letzter Anreiz: In der aktuellen Demoversion ist jetzt auch Defender Of The
Crown 2 CDTV spielbar (nicht vergessen die Sprache in den Akiko
Settings auf deutsch zu stellen, um in den vollen Genuss zu kommen).
Akiko ben&ouml;tigt &uuml;brigens nicht die sogenannten Extended Roms von
CD32 und CDTV sondern gibt sich mit den Kickstarts 1.3 und 3.1 zufrieden.
Registrierte Benutzer k&ouml;nnen sich mit dem Betreff "subscribe" an
akiko@airsoftsoftwair.de wenden, um die aktuelle Vollversion
von Akiko zugeschickt zu bekommen (wer sich einmal anmeldet, erh&auml;lt
immer die neueste Version, sonst nix, auch keine Produkthinweise).
Wer sich noch nicht registriert hat, holt sich am besten schnell
die Demoversion von Akiko.«


»Auf der Airsoft Softwair Homepage (http://www.airsoftsoftwair.de/)
wurde soeben der Akiko 1.3 ver&ouml;ffentlicht.
Mit dieser neuen Version wird nun erstmals Unterst&uuml;tzung f&uuml;r die
sogenannten "extended roms" vom CD32 und CDTV geboten, d.h. im Klartext,
dass Akiko nun nicht nur die tollen Bootanimationen von beiden Konsolen
anzeigen kann, sondern auch dass die im ROM eingebauten Anwendungen
funktionieren, wie z.B. die Audio CD Spieler in beiden ROMs oder auch
der NVRam Editor vom CD32 bzw. das Einstellungsprogramm vom CDTV oder
das Sprachauswahlmen&uuml; vom CD32. Auf der Airsoft Softwair Homepage
stehen im Akiko-Produktbereich
(http://phobos.spaceports.com/~sfa/de/prod_akiko.html)
einige Screenshots von diesen ROM-spezifischen Funktionen bereit. Wer noch
kein ROM Image aber ein CD32 oder CDTV besitzt, kann mittels des ebenfalls
gerade bereitgestellten Werkzeugs RipROM diesen Speicherbereich des Amigas
als Datei sichern lassen, um diese Datei dann mit Akiko zu verwenden.
Au&szlig;erdem wurde in Akiko 1.3 die Emulation etwas verbessert.«


»Die Airsoft Softwair Homepage &lt;http://www.airsoftsoftwair.de/&gt; wurde
im Produktbereich stark erweitert. Es stehen nun ausf&uuml;hrliche Informationen
zu allen gr&ouml;&szlig;eren Programmen von Airsoft Softwair dort zur Verf&uuml;gung.
Au&szlig;erdem k&ouml;nnen jetzt alle Shareware-Programme von Airsoft Softwair
auch per Kreditkarte bestellt werden.«


»Auf der Airsoft Softwair Homepage &lt;http://www.airsoftsoftwair.de/&gt;
wurde soeben Version 1.4 des Windows CD32 & CDTV Emulators Akiko
ver&ouml;ffentlicht.
Diese Version kann jetzt erstmals alle CD32 & CDTV Spiele starten.
Akiko benutzt hierzu eine sehr generelle Prozedur, um beste Kompatibilit&auml;t
zu gew&auml;hrleisten. Im Praxistest liefen &uuml;ber 90 Prozent der getesteten
Spiele mit dieser Bootprozedur. Au&szlig;erdem wurden in dieser Version noch
einige von  Akiko-Benutzern gew&uuml;nschte Verbesserungen verwirklicht. Akiko
1.4 steht ab sofort auf der Airsoft Softwair Homepage
&lt;http://www.airsoftsoftwair.de/&gt; zum Download bereit.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
