<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke"
zusammengefasst.

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@aakt.de


1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren

Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an aakt@aakt.de


Die Frage des letzten Monats lautete:

»In welcher Verfassung wird sich deiner Einsch&auml;tzung nach der Amiga-
PowerPC-Markt in einem Jahr befinden?
Beschreibe beispielsweise, welche Art von Software in welcher Qualit&auml;t und
Menge (verglichen mit entsprechenden Windows-Programmen) deiner Meinung
nach zu dem Zeitpunkt existiert, wie stark Standard-Hardware mit Treibern
unterst&uuml;tzt wird, wie gro&szlig; die Anwenderzahl ist, etc.«


J&uuml;rgen Lange beschreibt seine - negativen - Erwartungen recht ausf&uuml;hrlich:

»Vorausschickend mu&szlig; ich sagen, da&szlig; ich weder ein Bef&uuml;rworter noch ein
Gegner einer PPC-L&ouml;sung f&uuml;r den Amiga bin.

Einer PPC-L&ouml;sung gebe ich trotzdem kaum eine Chance. Daf&uuml;r gibt es
verschiedene Gr&uuml;nde:

1. PPC hat sich schon in der Vergangenheit nicht durchgesetzt. H&auml;tten die
von Phase5 entwickelten Dual-Prozessor-Boards einen gr&ouml;&szlig;eren Kundenkreis
gefunden, w&auml;re auch mehr Software daf&uuml;r entwickelt worden (was mehr
Verk&auml;ufe initiiert h&auml;tte). Preis und Mehrwert dieser L&ouml;sung stand in zu
gro&szlig;em Gegensatz. Dies k&ouml;nnte sich jetzt zwar &auml;ndern, da keine 68k-CPU mehr
ben&ouml;tigt wird. Zudem fallen die Kontext-Switches weg, was dem einen oder
anderen Programmierer eine Hemmschwelle wegnehmen k&ouml;nnte.

2. Es werden zu wenige PPC-Rechner gefertigt werden. Die von der bplan GmbH
genannten 1500-2000 Rechner werden keineswegs f&uuml;r eine Software-Schwemme
sorgen. Daf&uuml;r ist die Zahl viel zu klein.

3. Das Fertigungs- und Vertriebskonzept stimmt nicht. Die Rechner von den
derzeit vorhandenen H&auml;ndlern fertigstellen zu lassen, halte ich f&uuml;r einen
gro&szlig;en Fehler. Dies wird, wie bei den Phase5-Produkten, zu Problemen beim
Support f&uuml;hren. Die bplan GmbH selbst scheint mir f&uuml;r das ganze Projekt als
zu klein und zu finanzschwach.

4. Der Normal-User (ich rede jetzt nicht vom Amiga-Masochisten) erwartet
schnelle Verf&uuml;gbarkeit von Bauteilen im Schadensfall.

5. Es werden Anwendungen ben&ouml;tigt, die auf Amiga laufen und zumindest einen
gro&szlig;en Teil der Funktionalit&auml;t der f&uuml;r Windows vorhandenen Programme
ebenfalls bieten.

6. Amiga mu&szlig; sich an der Konkurrenz messen lassen k&ouml;nnen! Was hilft es,
wenn der Port eines Spieles oder der Port einer Anwendung (z.B. Papyrus)
zwar auch unter PPC l&auml;uft, aber auf anderen Systemen kosteng&uuml;nstiger und
mit mehr Leistung zu haben ist.

Zusammenfassend sehe ich f&uuml;r den PPC-Amiga (oder PPC-MorphOS) keine gro&szlig;e
Zukunft, da Hardware in zu kleinen St&uuml;ckzahlen und zu zu hohem Preis zur
Verf&uuml;gung stehen wird, da&szlig; sie einen Softwareschub initiieren k&ouml;nnte, der
das Gesamtsystem &uuml;berlebensf&auml;hig macht.

Alle Argumente gegen einen schnellen Emulator auf x86-Basis oder gar ein
x86-AmigaOS gelten, von ein paar Freaks abgesehen, auch f&uuml;r die Zukunft
eines PPC-Amiga. Besagte Freaks werden sich den PPC-Amiga kaufen, koste es,
was es wolle. Aber ob das eine Basis ist?«


Stefan Kleinheinrich ist ebenfalls pessimistisch:

»Software: Etwa 50% der jetzt angek&uuml;ndigten Programme werden tats&auml;chlich
erscheinen, wobei der ein oder andere Hersteller sich nicht auf PPC-only
beschr&auml;nken wird (eine 68k-Variante f&uuml;r Amithlon/Classic-User ist relativ
leicht verdientes Geld).

Treiber: So lange es AmigaOS 4 gegen MorphOS und alle gegen Amithlon geht,
sehe ich schwarz.
Im Moment d&uuml;rfte Amithlon schon wegen der teilweisen Nutzung von Linux-
Treibern hier die Nase vorn haben. Auch denke ich, dass die Treiber f&uuml;r
HighWay/SubWay/Amithlon eher fertig sind als die von MorphOS oder AmigaOS
4, so dass auch hier fr&uuml;her mit der Anpassung an einzelne Ger&auml;te begonnen
werden kann.

Userzahl: Im gro&szlig;en und ganzen gleichbleibend, nur leider auf drei Systeme
zersplittert.«



Nun zur aktuellen Frage des Monats:

»Wie beurteilst du die Ann&auml;herung von AMIGA, Inc. und Microsoft
prinzipiell?«


Schickt eure Beitr&auml;ge bitte an aakt@aakt.de

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
