<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Einsch&auml;tzung zur Lage des Amiga (von G&uuml;nter Raab)

Eines ist wohl klar, der Amiga wird nie wieder zum marktbeherrschenden
Computer werden. Zu lange ist er schon von der internationalen Bildfl&auml;che
verschwunden. Die ehemaligen Amiganer, die auf einen PC umstiegen, sind
aber, so glaube ich, in einer Art Warteposition. Kommt was Neues, das
wirklich den gewaltigen R&uuml;ckstand zumindest aufholt, werden sie
zur&uuml;ckkommen.
Mit R&uuml;ckstand meine ich nicht nur die Hardware, auch die Software muss
endlich auf den neuesten Stand gebracht werden!

So gibt es noch immer keine M&ouml;glichkeit, Daten mit dem PC oder MAC 1:1
auszutauschen. AmigaWriter kann zwar bedingt Word-Dokumente laden, beim
Speichern ist aber Ebbe. Bei den Tabellenkalkulationen ist es da nicht viel
besser, wenigstens kann auch in ein Fremdformat umgewandelt werden. Nur bei
Grafikdaten gibt es keine Schwierigkeiten. Komisch, vor Jahren schrieb
&auml;hnliche Zeilen der Redakteur einer l&auml;ngst eingestellten Zeitschrift namens
Amiga Spezial...

Dann der seltsame Zustand bei den Web-Browsern. Da gibt es ganze DREI
St&uuml;ck, aber keiner davon ist auf dem letzten Stand in puncto Javacript!!
Unz&auml;hlige JavaScript-Fehler beim Surfen nerven langsam schon. Ein Office-
Paket, das in der Lage ist, Daten aus den unterschiedlichen Anwendungen
ohne Probleme auszutauschen, fehlt ebenfalls seit jeher. Die Final-xxx-
Serie, mit der ein Austausch nur &uuml;ber AREXX m&ouml;glich ist, wurde ja schon
lange eingestellt.

Bei der Hardware arbeiten alle &uuml;brig gebliebenen Firmen gegeneinander,
anstatt einen gemeinsamen Nenner zu finden. Pervers! PCI gut und sch&ouml;n,
aber da fehlt noch sehr viel, um weitere K&auml;ufer zu finden (Prozessor, DDR-
RAM).

Zusammenfassend meine ich, dass derzeit ein buntes Durcheinander herrscht,
so da&szlig; die User nun verunsichert sind, was sie nun eigentlich wirklich
kaufen sollen.

Daher kann f&uuml;r 2002 nur eines gelten: Bis allerh&ouml;chstens Ende des 2.
Quartals ist was Neues, Zeitgem&auml;&szlig;es zu kaufen, oder von den restlichen etwa
20.000 Amiganern bleiben wohl keine 1000 mehr &uuml;brig. Auch ich (43) habe die
leeren Versprechungen endg&uuml;ltig satt. Ein MAC (PeeZee - nein danke) ist
zwar kein Amiga, aber noch am ehesten als (seufz!) Ersatz des besten
Computersystems zu sehen.

Denn irgendwann wird auch der beste Amiga seinen Geist aufgeben. Derzeit
stehen die Zeichen eher auf Amiga-Emulation anstatt AmigaOne. Das ist eher
mit dem Untergang des Amiga zu vergleichen...

G&uuml;nter Raab &lt;guenter.raab@utanet.at&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
