<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Wer mit den W&ouml;lfen heult... (von Christian Aichinger)

So kurz der vergangene Monat auch war, so viele und in der Tat umwerfende
Neuigkeiten gab es schon lange nicht mehr. Neben der Pr&auml;sentation des
ersten lauff&auml;higen Prototypen des AmigaONE auf der alt-WOA in Huddersfield
[1], der L&uuml;ftung des Geheimnisses um den sagenumwobenen "Milliarden-
Dollar"-Partner AMIGAs - n&auml;mlich der haupts&auml;chlich unter Handybesitzern
bekannten Firma Nokia -, d&uuml;rfte vor allem eine Meldung f&uuml;r viele Amiga-User
ein Grund f&uuml;r kalte Schwei&szlig;ausbr&uuml;che, Atemnot, Angstattacken und nat&uuml;rlich
die obligatorischen Ger&uuml;chte und Spekulationen gewesen sein: Gary Peake
(bei AMIGA, Inc. als Direktor f&uuml;r Entwickler-Support angestellt) best&auml;tigte
in der &ouml;ffentlich zug&auml;nglichen Mailingliste "AMIGEN", da&szlig; der weltgr&ouml;&szlig;te
und auf Grund seiner Gesch&auml;ftspraktiken stark in der Kritik stehende
Softwarehersteller Microsoft, AMIGA Inc. gebeten hat, AmigaDE w&auml;hrend der
Embedded System Conference (ESC; [2]) auf ihrem Stand zu pr&auml;sentieren.

Nachdem zumindest ich den ersten Schreck mental verdaut hatte, stellt sich
mir nur eine Frage, die ich mir bis dato noch nicht befriedigend
beantworten konnte: Was will Microsoft mit AmigaDE?


Erkl&auml;rungsversuche

Da sich AMIGA, Inc. selbst als Content Provider f&uuml;r PDA und Handheld-
Computer bezeichnet, w&auml;re es nur logisch, da&szlig; Microsoft versucht, den
"Content", also das Softwareangebot, f&uuml;r ihr eigenes PDA-Betriebssystem
(genannt "PocketPC 2002" - der Nachfolger von WinCE), mit Produkten aus der
Software-Schmiede AMIGAs aufzubessern - zumal AMIGA Inc. selbst von Anfang
an auch WinCE als m&ouml;gliches Hostsystem f&uuml;r AmigaDE betrachtet hat. Schaut
man sich aber die aktuelle Softwarepalette AMIGAs an, kann dieses Argument
noch nicht so richtig &uuml;berzeugen. Denn f&uuml;r Desktop-Spiele á la Series Zero
kann Microsoft immer noch selbst mit Softwarepaketen aus dem eigenen
Sortiment sorgen. Falls es sich also um ein Produkt handelt, das Microsoft
interessiert und sogar dazu bewogen hat, AmigaDE auf dem eigenen Messestand
zu pr&auml;sentieren, k&ouml;nnte es sich dabei um ein bisher unver&ouml;ffentlichtes oder
allgemein v&ouml;llig untersch&auml;tztes Projekt handeln. Denn das Produkt eines
Fremdherstellers m&uuml;&szlig;te schon wesentliche Vorteile mit sich bringen, um
&uuml;berhaupt das Interesse Microsofts daran zu wecken - f&uuml;r Amiga-User ein
Grund zur Freude.


Paranoid?

Betrachtet man sich allerdings Microsofts Ambitionen, mit .NET eine eigene
hardwareunabh&auml;ngige Laufzeitumgebung zu etablieren, sollte jeder
informierte Amiga-Fan sofort mi&szlig;trauisch werden. Zur Erkl&auml;rung: Microsofts
.NET stellt eine Art virtuelle CPU dar, die mittels der Intermediate
Language (kurz IL; eine Art Assembler f&uuml;r diese virtuelle CPU) betrieben
wird. Microsoft stellt mehrere Compiler zur Verf&uuml;gung (das gesamte .NET-SDK
l&auml;&szlig;t sich sogar kostenlos von der Homepage Microsofts downloaden), die den
Quellcode eines jetzt schon existenten Programms in den neuen Bin&auml;rcode
(also IL) kompilieren k&ouml;nnen. &Auml;ltere Programme, die z.B. in C++ oder
VisualBasic verfa&szlig;t wurden, k&ouml;nnen nach Anpassung an die neue
Laufzeitumgebung und mit dem entsprechenden Compiler auf .NET portiert und
damit theoretisch auf s&auml;mtlichen Plattformen - sei es PC, PDA, Mikrowelle
oder Internet - lauff&auml;hig werden. Die Parallelen zu AmigaDE sind
offensichtlich, stellt doch Elate/AmigaDE ein vergleichbares Projekt dar.
Ergo stehen Microsoft und AMIGA in direkter Konkurrenz zueinander, und wer
der Anw&auml;rter mit den besseren Chancen f&uuml;r die Etablierung eines neuen
Standards darstellt, mu&szlig; nicht explizit erw&auml;hnt werden. Interessant wird
aber vor allem der Gesichtspunkt, da&szlig; auch Sun mit einem weiteren
vergleichbaren Projekt um den zuk&uuml;nftigen plattformunabh&auml;ngigen Standard
einer Laufzeitumgebung feilscht. SunONE (Sun Open Net Environment) &auml;hnelt
den beiden bereits genannten L&ouml;sungen, au&szlig;er, da&szlig; anstatt eines neuen
Zwischencodes das altbew&auml;hrte Java zum Einsatz kommen soll.
Da auch Sun schon in diversen Executive Updates von Bill McEwen Erw&auml;hnung
gefunden hat, k&ouml;nnte man meinen, da&szlig; AMIGA mit den W&ouml;lfen heult. Ob
allerdings genug Platz f&uuml;r einen Goldfisch im Haifischbecken ist, wird sich
erst in den kommenden Monaten (wenn nicht sogar erst Jahren) beantworten
lassen.


Der Glanz der Gro&szlig;en

Da&szlig; es zumindest im Moment kein Fehler von AMIGA sein kann, sich mit
Microsoft einzulassen, sollte andererseits auch klar sein. Sollte es
tats&auml;chlich gelingen, einen gewinnbringenden Vertrag mit Microsoft oder
einem ihrer Partner einzugehen, w&auml;ren AMIGAs Visionen wieder ein St&uuml;ck mehr
der Realit&auml;t n&auml;her gekommen. Denn die Aussichten auf neue Vertr&auml;ge und
allein schon die Referenz Microsofts k&ouml;nnte AmigaDE so manche T&uuml;r im
hartumk&auml;mpften Markt er&ouml;ffnen und damit den Finanzen AMIGAs nur zu Gute
kommen. Dass sogar AmigaOS 4 und seine Nachfolger von einer finanziell
gesunden Firma ausschlie&szlig;lich profitieren k&ouml;nnen, scheinen viele Amiga-User
aber zu vergessen (was auch kein Wunder nach diesen Schock sein d&uuml;rfte ;-))
und schreien schon jetzt "Boykott", drohen mit dem Wechsel des Systems oder
denunzieren AMIGA in aller &Ouml;ffentlichkeit. Sicher, einen bitteren
Beigeschmack hat diese Meldung, doch sollten vor allem die Vorteile einer
Zusammenarbeit gesehen werden: AMIGA k&ouml;nnte neue Gesch&auml;ftspartner gewinnen,
neue Vertr&auml;ge abschlie&szlig;en, dadurch ihre Finanzen restaurieren und einer
Verbreitung des AmigaDE w&uuml;rde dies letztendlich nur n&uuml;tzen. Ich finde, das
h&ouml;rt sich alles gar nicht so schlecht an und sollte Baldrian f&uuml;r die
Hitzk&ouml;pfe unter den Amiga-Usern sein.


Ger&uuml;chtek&uuml;che

Im den Disziplinen "Ger&uuml;chte streuen" und "Computerphilosophie" sind
Amiga-User die Gr&ouml;&szlig;ten. Eine gute Portion Fanatismus, Dickk&ouml;pfigkeit und
Tratsch-Tante steckt wohl in fast jedem Amiga-Fan (ich schlie&szlig;e mich
hierbei nicht aus ;-)). Dass eine alleinige Erw&auml;hnung der Firma Microsoft
von einem Mitarbeiter AMIGAs dieselben Folgen in der Community hat, wie ein
Fuchs im H&uuml;hnerstall, m&uuml;&szlig;te sogar AMIGA, Inc. inzwischen zu Ohren gekommen
sein. Womit ich mal wieder beim Feingef&uuml;hl der Informationsweitergabe
AMIGAs w&auml;re: Es kann einfach nicht sein, da&szlig; eine solche Information von
einem Mitarbeiter des Unternehmens, der zudem nichts mit der
&Ouml;ffentlichkeitsarbeit zu tun hat, kommentarlos in einem Internet-Forum
verbreitet wird. Dass die Pressearbeit bisher ein immenser Spagat f&uuml;r
AMIGA, Inc. war, wei&szlig; jeder, der sich schon einmal &uuml;ber den Sinngehalt
einiger Executive Updates gewundert hat. Zwischen Einhaltung der
Verschwiegenheit &uuml;ber firmeninterne Verhandlungen mit etwaigen
Vertragspartnern und der Befriedigung der Neugier der Amiga-Community gab
es bisher immer schwere Defizite, die - und das zum Teil mit Recht - mit
heftiger Kritik am Pressemanagement AMIGAs beantwortet wurden.

Dass aufgrund solch unqualifizierten Verhaltens Ger&uuml;chte und Halbwahrheiten
die Runde machen und sich auch nicht besonders gut auf das Image AMIGAs
auswirken, sollte den Herrschaften in Snoqualmie allm&auml;hlich auffallen. So
wurden sogar schon v&ouml;llig unbegr&uuml;ndete Ger&uuml;chte laut, da&szlig; AMIGA von
Microsoft &uuml;bernommen werden soll. Mit der h&ouml;chst interessanten Frage, wie
die Zusammenarbeit zwischen AMIGA und Microsoft aussehen k&ouml;nnte bzw. ob es
&uuml;berhaupt eine Zusammenarbeit gibt, l&auml;&szlig;t AMIGA die Community mal wieder im
Regen stehen und schadet sich damit selbst. Dass das Unternehmen unbedingt
an der eigenen &Ouml;ffentlichkeitsarbeit feilen mu&szlig;, wird an dieser Stelle mit
Sicherheit nicht zum letzten Mal erw&auml;hnt sein, obwohl ich die Hoffnung
nicht aufgebe ;-).


Summa summarum

Die n&auml;chsten Monate werden spannend. Sp&auml;testens am 16. M&auml;rz - denn das ist
der letzte Tag der diesj&auml;hrigen ESC - d&uuml;rfte sich das Geheimnis um die
Beziehung (inwieweit man &uuml;berhaupt davon sprechen kann, wird sich zeigen)
zwischen AMIGA, Inc. und Microsoft l&uuml;ften. Auch die neuen Amiga-Modelle und
das general&uuml;berholte AmigaOS stehen laut Aussage ihrer Hersteller kurz vor
der Ver&ouml;ffentlichung. Dieser Fr&uuml;hling wird hei&szlig; - f&uuml;r Amiga-User auf jeden
Fall.

[1] http://www.alt-woa.org
[2] http://www.esconline.com


Bis zum n&auml;chsten Mal,

Euer

Christian Aichinger &lt;christian@aakt.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
