<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6. Vorabbericht: Weltraumsimulation »Elite TNK«

---------------------------------------------------------------------------
Back to the *real* roots...
---------------------------------------------------------------------------

Die aktuelle PC-Fassung von Elite TNK wurde von C.J. Pinder aus den
Assembler-Sourcen f&uuml;r die Acorn-BBC-Micro-Urversion per Re-Engineering in C
entwickelt. Er verwendete dazu die Allegro-Bibliothek, die f&uuml;r die
verschiedensten Betriebssysteme in mehr oder weniger weit entwickelten
Fassungen vorliegt. Daraus ergab sich die Hoffnung, eine Umsetzung der
Allegro-Bibliothek auch f&uuml;r Amiga zu erhalten, was sich im weiteren Verlauf
als nicht besonders sinnvolles Unterfangen herausstellte. Dazu sp&auml;ter mehr.

Die momentan in der Entwicklung befindliche Fassung von Elite TNK f&uuml;r Amiga
wird von Michael Asse und Wolfgang Hosemann verwirklicht. Michael Asse
d&uuml;rfte einigen durch seinen Aufruf bez&uuml;glich FFE (Final Frontier Elite)
und der dazugeh&ouml;rigen Website bekannt sein, wie vor einiger Zeit auf
amiga-news.de zu lesen war. Wolfgang Hosemann hat bisher haupts&auml;chlich
Supportaufgaben wahrgenommen. F&uuml;r beide ist es das erste gr&ouml;&szlig;ere Projekt
in Sachen Portierung, daher auch der relativ gro&szlig;e Zeitrahmen, den sich
beide f&uuml;r die Ausf&uuml;hrung gesteckt haben.

Screenshot:
<IMG SRC="../extra/elitetnk1.png" ALT="Screenshot">

Ein Problem ist zur Zeit der Status der Quelltexte der PC-Version. Obwohl
frei zug&auml;nglich, sind die Quelltexte nicht Open Source, sondern unterliegen
dem Copyright von C.J. Pinder und der Ver&ouml;ffentlichungserlaubnis einer der
beiden Autoren der Originalversion. Daher ist auch noch nicht sicher, in
welcher Form die Quelltexte der Amiga-Version &ouml;ffentlich zug&auml;nglich gemacht
werden k&ouml;nnen, und ob der Autor der PC-Fassung seine Zustimmung dazu gibt.
Die entsprechende Erlaubnis f&uuml;r das ausf&uuml;hrbare Programm liegt bereits vor,
also sollten die Quelltexte dann sp&auml;ter auch kein Hindernis finden.

Als n&auml;chstes "Hindernis" stellte sich Allegro heraus: Laut Aussage eines
der Entwickler ist die Allegro-Bibliothek zwar portierbar, aber von den
Konzepten her schwer mit dem AmigaOS zu vereinbaren (Stichwort: Input
Polling). Man hat sich daher dazu entschlossen, eine reine AmigaOS-Version
zu erstellen, was, laut den Entwicklern, auch erstaunlich leicht fallen
soll, da der Aufbau von Elite TNK nicht besonders eng an Allegro gebunden
sei.

Dadurch sollen auch Features eingebaut werden k&ouml;nnen, die die PC-Version
nicht bietet. Das w&auml;ren z.B. Systemfreundlichkeit (verh&auml;ltnism&auml;&szlig;ig geringe
CPU-Last durch Verwendung von Wait() statt Polling, exakteres,
CPU-unabh&auml;ngiges Timing), die Erkennung von mehreren Tastendrucken
gleichzeitig etc.

Screenshot:
<IMG SRC="../extra/elitetnk2.png" ALT="Screenshot">

Kommen wir nun zu den "inneren Werten" des Spiels:

Man kann sich vorstellen, dass ein Spiel aus dem Jahre 1984 von der Grafik
her alles andere als auf der H&ouml;he der Zeit ist. Der Autor der PC-Fassung
dieses Remakes hat sich lange Gedanken dar&uuml;ber gemacht, ob er das Programm
mit 3D-Grafik vom Feinsten ausstatten soll oder nicht. Er hat es *nicht*
getan, und das war auch gut so ;).

Die Grafik des Spiels wird entweder in Form von ausgef&uuml;llter Vektorgrafik
(Solid Model) dargestellt, oder als Linien-Vektorgrafik (Hidden Line). Das
Ganze kann bis zu 256 Farben haben und wird auf der PC-Version in der
Aufl&ouml;sung des Acorn-BBC-Originals dargestellt (512 x 512 Pixel). Die
Amiga-Version wird hier etwas mehr Auswahl zur Verf&uuml;gung stellen und
zus&auml;tzlich einen Modus in halbierter Aufl&ouml;sung anbieten, um auch den etwas
schwachbr&uuml;stigen Rechnern zu diesem Spielvergn&uuml;gen zu verhelfen. Zus&auml;tzlich
zur Aufl&ouml;sung kann man nat&uuml;rlich auch die Art der Darstellung (Hidden
Line/Solid Model) frei w&auml;hlen, wobei f&uuml;r eine Maschine, die gerade die
Mindestvoraussetzungen erf&uuml;llt, Hidden Line in halbierter Aufl&ouml;sung wohl
das Ma&szlig; der Dinge sein wird.

Screenshot:
<IMG SRC="../extra/elitetnk3.png" ALT="Screenshot">

Angepeilt ist als Mindestvoraussetzung ein Amiga mit OCS-Chipsatz und 68030
CPU sowie Kickstart 3.1. Grafikkarte und eine schnellere CPU w&auml;ren nat&uuml;rlich
von Vorteil, wobei hier zus&auml;tzlich die rtgmaster.library installiert sein
sollte. Eine PPC-Version f&uuml;r das kommende Amiga OS 4.0 ist ebenfalls
geplant.

Soundunterst&uuml;tzung wird es sowohl f&uuml;r Paula als auch f&uuml;r AHI geben, man hat
hier die freie Wahl. Zum Sound ist zu sagen, dass auch dieser nicht das
Nonplusultra der Technik ist. Gr&ouml;&szlig;tenteils wurde der Original-Sound
gesampled und in der PC-Version sind diverse bekannte Melodien als MIDI-
Sound verf&uuml;gbar. Die Amiga-Version wird hier den MOD-Weg gehen, da die
vorhandenen Software-MIDI-Systeme doch arg strapazi&ouml;s f&uuml;r die CPU sind,
wenn sie ordentliche Klangqualit&auml;t bieten sollen.

Screenshot:
<IMG SRC="../extra/elitetnk4.png" ALT="Screenshot">

Die Steuerung erfolgt mittels Tastatur oder wahlweise Joystick.
Besonderheiten sind hier wohl eher nicht zu erwarten.

Ein abschlie&szlig;endes Wort noch zur "altbackenen" Grafik: Es tut dem
Spielvergn&uuml;gen wahrlich keinen Abbruch, dass hier keine Textur-Orgie
veranstaltet wird. Die "alte" Grafik l&auml;sst im Gegenteil noch einen
zus&auml;tzlichen Reiz aufkommen: Nostalgische Gef&uuml;hle. F&uuml;r einen
Retro-Klassiker nach meiner Meinung das wirklich Wichtige. Es sollte sich
spielen wie fr&uuml;her und es sollte aussehen wie fr&uuml;her.

Screenshot:
<IMG SRC="../extra/elitetnk5.png" ALT="Screenshot">

Wenn alles glatt geht, dann l&auml;uft der Betatest bereits Mitte M&auml;rz an. Es
kann also gar nicht mehr soooo lange dauern, bis man wieder durchs
All gondelt.

Oliver Tacke &lt;oliver@aakt.de&gt;
...vielen Dank an Wolfgang Hosemann f&uuml;r die ausf&uuml;hrlichen Informationen

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
