<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x09 - &quot;Mr. Aminet &Ouml;sterreich&quot;</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00BC.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00BB.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00BD.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=44 HEIGHT=25 SRC="../images/_etc_.gif" ALT="[Etc]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00BC.html">&quot;Mr. Aminet &Ouml;sterreich&quot;</A> | <A HREF="0x00BD.html">Mod Of The Month</A> | <A HREF="0x00BE.html">Letzte Seite</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00B1.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00B2.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00B3.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00B4.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00B5.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00B6.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00B8.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00B9.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00BA.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00BB.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00BC.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>&quot;Mr. Aminet &Ouml;sterreich&quot; - Interview</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Diesmal im Interview mit dem Amigascene ist Armin
Obersteiner, seines Zeichens Aminet Administrator der &ouml;sterreichischen
Aminet Site auf <A HREF="http://vienna.aminet.or.at/">http://vienna.aminet.or.at</A> bzw.
<A HREF="http://at.aminet.net/">http://at.aminet.net</A>.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>(AS = AmigaScene, AO = Armin Obersteiner)<BR>

<BR><B>AS:</B> Kommen wir gleich zur ersten Frage: Wie gro&szlig; ist die Site zur
Zeit?<BR>

<BR><B>AO:</B> Unsere Site hat eine Gr&ouml;&szlig;e von ca. 7.3GB, das bedeutet
wir sind nur ein Teilmirror.<BR>

<BR><B>AS:</B> Hm. &quot;Mirror&quot; hei&szlig;t Spiegel, da&szlig; bring ich mit
meinem Englisch noch. Aber was genau ist ein &quot;Teilmirror&quot;?<BR>

<BR><B>AO:</B> Teilmirror bedeutet, da&szlig; wir aus Platzmangel nicht alle
Dateien, die auf dem Aminet-Hauptserver vorhanden sind, lokal anbieten
k&ouml;nnen. Wir lassen also mehr oder weniger unwichtige Daten nach einer
gewi&szlig;en Zeit rausfallen.<BR>

<BR><B>AS:</B> Was bedeutet in diesem Zusammenhang &quot;unwichtig&quot;?<BR>

<BR><B>AO:</B> Ich lasse meist Teile aus dem &quot;demos&quot; oder
&quot;pix&quot; Verzeichnis wegfallen, immer die &auml;ltesten. Seit ein
paar Monaten sind auch die &quot;mods&quot; zum L&ouml;schen
freigegeben.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Es ist ja nicht nur das Aminet auf der Site zu finden, sondern noch
ein paar andere Amiga-spezifische Dinge. Um was handelt es sich dabei?<BR>

<BR><B>AO:</B> Von den 7.3 GB sind 300MB f&uuml;r andere Sachen reserviert: NetBSD
und Linux f&uuml;r Amiga. Bei beiden handelt es sich um Unix-Derivate.
Fr&uuml;her hatte ich auch das ADE online, das Amiga Developer Environment,
eine Sammlung von Entwicklerwerkzeugen, die zum Gro&szlig;teil aus der
Unix-Welt stammen, aber so auch unter AmigaOS verwendet werden
k&ouml;nnen.<BR>

<BR><B>AS:</B> Aha. Und wieso ist die ADE, die inzwischen &quot;Geek Gadgets&quot;
hei&szlig;t, nicht mehr drauf?<BR>

<BR><B>AO:</B> Es ist leider zu gro&szlig; geworden, ich m&uuml;sste nochmal 400MB
vom Aminet wegnehmen. Ich w&uuml;rde es tun, wenn es andere Leute
au&szlig;er mir auch interessieren w&uuml;rde, was ich aber nicht
glaube.<BR>

<BR><B>AS:</B> Man kann also sagen, da&szlig; Du ein kleines Platzproblem hast,
oder? Das hei&szlig;t, wenn sich jemand bei Dir melden w&uuml;rde und sagt
&quot;Ich sponser Dir eine x GB Festplatte&quot;, dann h&auml;ttest Du kein
Problem damit?<BR>

<BR><B>AO:</B> Prinzipiell h&auml;tte ich keine Probleme damit ;-) Allerdings
mu&szlig; es eine SCSI-Platte mit Geh&auml;use sein, um mit der anderen
Hardware zusammenzuarbeiten.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Soviel derweil zum derzeitigen Stand. Was mich jetzt interessieren
w&uuml;rde: Wie kam es zu dieser Site? Seit wann gibt es sie? War vorher
schon was &Auml;hnliches in &Ouml;sterreich?<BR>

<BR><B>AO:</B> Also, begonnen hat alles im Sommer 1994. Ich wollte eigentlich nur
f&uuml;r mich einen kleinen Mirror machen. Damit ich bei meinem
t&auml;glichen Download nicht so lange warten mu&szlig;. <I>(Anm.: Im Jahre
1994 waren Netzwerkverbindungen ins Ausland noch viel qu&auml;lend
langsamer als heute und es gab wesentlich weniger Mirrors.)</I><BR>

<BR>Irgendwie war mir schnell klar, da&szlig; der Mirror auch andere mit
den selben Problemen (langsame Leitung in die USA) helfen w&uuml;rde. Und
da war zumindest die Idee entstanden.<BR>

<BR>Ich hab mit 100-200 MB auf dem Server ftp.giga.or.at begonnen. Kurz
darauf hab ich meinen Amiga-H&auml;ndler (Merlin GraFX) gefragt, ob er
nicht eine kleine Platte spendet. Das hat er auch bereitwillig getan: 512
MB wurden in den Giga-Server eingebaut.<BR>

<BR>Zur gleichen Zeit hab ich Urban M&uuml;ller vom Aminet benachrichtigt
und der &quot;wilde&quot; Mirror wurde offiziell. Meines Wissens nach waren
wir die ersten in &Ouml;sterreich (und sind es auch noch). Das war Anfang
1995.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Zwischenfrage: Du hattest also eine Zeitlang Deinen privaten
Aminet-Mirror, von dem die Welt nichts wu&szlig;te. Wie geht denn sowas,
mu&szlig; man den nicht irgendwo anmelden?<BR>

<BR><B>AO:</B> Jein, ein &quot;privater Mirror&quot; war das recht kurz. Nachdem
alles funktioniert hat, habe ich mich bem&uuml;ht, gleich offiziell zu
werden. Wenn ich nur einen einfachen FTP-Mirror machen will, brauche ich
mich nirgends anzumelden (zumindest bei Public Domain Daten).<BR>

<BR>Normal kopiert man sich die Files per FTP einfach her. Am n&auml;chsten
Tag schaut man nach, was sich getan hat und holt sich die neuen Daten. So
war das bei mir anfangs auch.<BR>

<BR>Urban M&uuml;ller hat das Aminet anders entworfen: Ich melde mich also
jeden Tag beim Server an (mehrmals), und frage, welche Dateien ich mir
holen soll. Das ganze ist also sehr zentralistisch. Der Hauptserver
wei&szlig; demnach immer, was ich da haben sollte. Und welche aktuellen
Files ich noch brauche.<BR>

<BR>Nachdem ich wei&szlig;, was ich mir holen soll, wird die Platte frei
gemacht (und bei Bedarf alte Files gel&ouml;scht) und der Download
begonnen. Das ganze geht nat&uuml;rlich nur, wenn Urban M&uuml;ller etwas
von meiner Existenz als Mirror wei&szlig;.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Du sagst, da&szlig; Du Dich beim Server mehrmals am Tag anmeldest
und Dir die neuen Daten holst. Setzt Du dich da wirklich vor einen Rechner,
schaust Dir eine lange Liste an und tippst dann 200 mal &quot;get
xy.lha&quot; ein? Oder geht das etwas automatisierter?<BR>

<BR><B>AO:</B> Das war nat&uuml;rlich eine Beschreibung dessen, was das etwa 100
zeilige Download Script tut. Das hat Urban M&uuml;ller geschrieben und
wurde von meiner Wenigkeit etwas ge&auml;ndert. Die Scripts werden
nat&uuml;rlich mit einem automatische Scheduler (cron) mehrmals am Tag zu
fixen Zeiten gestartet - es geht also vollautomatisch.<BR>

<BR>Hier w&auml;ren wir bei einem weiteren Unterschied zu anderen (simplen)
FTP-Mirrors. Am Anfang hab ich etliche C-Programme und Shell-Scripts
bekommen. Und au&szlig;erdem ein Rohger&uuml;st f&uuml;r HTML-Seiten.<BR>

<BR><B>AS:</B> Gut, dann wissen wir jetzt also, wie Aminet in seinem Innersten
funktioniert.<BR>

<BR><B>AO:</B> Ich hoffe. Es ist ja ansich recht einfach... bis auf die Probleme,
die auftreten, wenn die Platte eigentlich immer total voll ist.<BR>

<BR><B>AS:</B> Aha, das hei&szlig;t, das L&ouml;schen unwichtiger Daten geht
manuell vor sich?<BR>

<BR><B>AO:</B> Bei einem totalen Overflow mu&szlig; ich manuell Platz machen.
Danach die Datenbank mit den lokalen Dateien neu erstellen und erst
anschlie&szlig;end kann ich per Script l&ouml;schen. Das passiert leider
doch ab und zu - das Problem ist das Zusammenspiel Overflow, Datenbestand
in der Datenbank (nur eine Datei) und Datenbestand auf der Platte. Ich hab
das Problem zwar nicht gel&ouml;st, aber zumindest minimiert - es tritt
jetzt sehr selten auf.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Dann k&ouml;nnen wir eigentlich bei der Geschichte weitermachen.
Inzwischen bist Du von den 512MB weg zu 7.3 GB auf einen anderen Server.
Wie ging es also weiter?<BR>

<BR><B>AO:</B> Irgendwie wollte ich mehr vom Aminet online halten. Kurzum hab ich
einen Spendenaufruf in at.fido.amiga (eine Newsgroup und Fido-Group
gleichzeitig) gestartet. Zuerst war ein reger Zuspruch, doch dann hat es
sich im Sand verlaufen. Das hatte damit zu tun, da&szlig; ein kommerzieller
Provider ebenfalls einen Aminet Mirror starten wollte, aus dem dann
letztendlich aber nichts geworden ist.<BR>

<BR>Ein einzelner aus der Newsgroup hat den heutigen Server aus dem Boden
gestampft: Edwin Cikan hat einen Server und die 8GB an Platte besorgt und
last not least den Standort f&uuml;r den Server. Eigentlich verwalten drei
Leute den Rechner: Edwin Cikan ist der System Administrator, ich bin
f&uuml;r die Downloads zust&auml;ndig und Martin Paul schaut, da&szlig;
physikalisch alles in Ordnung ist und f&uuml;hrt allf&auml;llige Neustarts
des Servers durch. Letzterer ist vom <a href="http://www.par.univie.ac.at/">Inistitut 
f&uuml;r  Softwaretechnik und Parallele Systeme</a>, wo auch der 
Aminet-Rechner steht.<BR>

<BR>Die Migration von ftp.giga.or.at zu vienna.aminet.or.at (heute auch
at.aminet.net) war dann problemlos. Kurze Zeit hatte ich sogar *alle* Files
online, aber eben nur kurz. Die 8GB waren bald &uuml;berschritten...<BR>

<BR><B>AS:</B> Das Meiste funktioniert also &uuml;ber Scripts, die mehr oder
weniger automatisch ablaufen. Da greifst eigentlich nur ein, wenn einmal
ein kleines Problem auftritt. Wie gro&szlig; w&uuml;rdest Du Deinen
w&ouml;chentlichen Zeitaufwand f&uuml;r die Aminet Administration etwa
einsch&auml;tzen?<BR>

<BR><B>AO:</B> Am Anfang recht hoch, derzeit aber fast Null - au&szlig;er, wenn es
einen Overflow gibt. Dazuzusagen ist, da&szlig; ich nat&uuml;rlich selbst
jeden Tag zugreife. Das ist zwar keine Administration, aber wenn's Probleme
gibt, seh' ich es sofort. Es ist also auch eine Art Test.<BR>

<BR><B>AS:</B> Und wenn der Hauptadministrator einmal auf Urlaub geht, wer sieht
dann nach dem Rechten?<BR>

<BR><B>AO:</B> Wir drei haben alle das &quot;root&quot; Passwort des Rechners.
Systemm&auml;&szlig;ig k&ouml;nnen also alle drei eingreifen. Bei den
Downloadscripts kennen sich nur Edwin und ich aus. Da Edwin noch nie hat
einspringen m&uuml;ssen, glaube ich, da&szlig; er alles schon vergessen hat
;-)<BR>

<BR>Aber Platz machen auf der Festplatte und die Scripts starten kann jeder
der Admins. Das Problem ist eher, da&szlig; man drauf kommt, da&szlig;
etwas nicht stimmt. Und das ist nur m&ouml;glich, wenn man t&auml;glich
hinschaut...<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Noch einmal zur&uuml;ck zu den Scripts: Auf welcher Hardware und
welchem System rennt dein Aminet und das Aminet im Allgemeinen?<BR>

<BR><B>AO:</B> Aminet ist f&uuml;r Unix konzipiert. Wir haben eine Sun mit einem
Unix-Derivat. Eigentlich ist alles recht portabel. Mit dem ADE rennt es
auch auf Amigas. Das einzige, das ein bi&szlig;chen haarig ist, ist die
&quot;recent&quot; Funktion, die jedem Benutzer individuell die Dateien
auflistet, die seit seinem letzten Besuch hinzugekommen sind. Das verwendet
Unix-db libraries, die sind aber auch portabel.<BR>

<BR><B>AS:</B> De facto gibt es Deines Wissens aber keinen Amiga, der als Aminet
Server fungiert, auch wenn es technisch m&ouml;glich w&auml;re?<BR>

<BR><B>AO:</B> Da ich keine 100Mbit Ethernetkarte f&uuml;r den Amiga kenne, ist
das wohl der Hauptgrund. Security ist ein zweiter. Aber rein technisch sehe
ich mit dem ADE &uuml;berhaupt kein Problem.<BR>

<BR><B>AS:</B> Kriegt man als Aminet Admin eigentlich mehr mit als
Normalsterbliche? Ich meine, gibt es eine eigene Admin Mailing List, eine
Fanzeitschrift, eine Art j&auml;hrlichen Betriebsausflug oder irgendwas in
die Richtung?<BR>

<BR><B>AO:</B> Leider mu&szlig; man sagen, da&szlig; ich nicht viel mehr
mitbekomme. Es gibt eine Admin Mailing List, dort ist es aber recht ruhig.
Wenn das Aminet ausf&auml;llt, wei&szlig; ich das halt schneller... Fixe
Treffen gibt es nicht, aber auf Amiga Messen kommt es am Abend hin und
wieder zu Zusammenk&uuml;nften.<BR>

<BR><B>AS:</B> Der gute alte Urban M&uuml;ller macht ja das Aminet nicht nur aus
reiner N&auml;chstenliebe, sondern scheffelt auch einiges Geld damit.
Kriegt ihr Administratoren etwas von ihm bezahlt? Oder sponsort er hin und
wieder Hardware?<BR>

<BR><B>AO:</B> Na gut, aber er verwendet auch einen Gro&szlig;teil seiner Zeit
daf&uuml;r, und wie kritisch man das auch betrachten mag:<BR>

<BR>1) die CDs sind nicht teuer, <BR>2) es ist eh alles (eigentlich mehr,
bis auf die &quot;Specials&quot;) online, <BR>3) das Aminet hat sehr viel
zum &uuml;berleben des Amigas beigetragen (die Idee und die
Ausf&uuml;hrung)<BR>

<BR>Bezahlt kriege ich nichts, vielleicht andere, aber die m&uuml;ssen dann
auch was machen (z.B. die Files nach Viren testen, CDs zusammenstellen,
...).<BR>

<BR>Ich bin mir sicher, wenn ich in totaler Hardwarenot w&auml;re,
w&uuml;rde Urban M&uuml;ller mich unterst&uuml;tzen. Andererseits bin ich
so irgendwie unabh&auml;ngiger: Wenn ich mehr Platz f&uuml;r Linux will,
nehm' ich ihn mir einfach...<BR>

<BR>Aja, etwas bekomme ich schon: die CDs kriege ich gratis. Das hat mir
schon mal sehr geholfen, als ich den Server gewechselt habe: ich konnte 90%
von den CDs einspielen, was die Netzlast unglaublich verringert hat.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Du wolltest uns auch ein bi&szlig;chen &uuml;ber die Download
Statistik der vienna.aminet erz&auml;hlen.<BR>

<BR><B>AO:</B> Stimmt. Ich hab mir heute die Logfiles angesehen und hab versucht,
irgendwas Brauchbares darin zufinden:<BR>

<BR>Derzeit gibt es ca. 50000 Zugriffe pro Monat auf den WWW-Server.
Davon sind 65%
HTML-Seiten, Indizes und GIF-Bilder, vom Datenvolumen her machen die aber
nur 20% aus. Der Rest geht also an die LHA-Archive. 25% der Zugriffe sind
File Downloads, je 5% gehen an &quot;Suchen&quot; und Ansehen der
&quot;Recent&quot; Listen.<BR>

<BR>Das Datenvolumen pro Monat hat sich von den paar hundert MB im Jahre
1995 auf inzwischen 4GB erh&ouml;ht. Die meisten Zugriffe kommen aus .com
(36%) dann .at (14%) dann .ger (3%). Danach kommen skandinavische
L&auml;nder und L&auml;nder Osteuropas. Am Anfang waren &uuml;brigens noch
37% aus &Ouml;sterreich.<BR>

<BR>Betrachtet man FTP und WWW gemeinsam, so werden im Monat ca. 16000
Files (LHA und ReadMe) mit einem Datenvolumen von ca. 3GB heruntergeladen.<BR>

<BR><B>AS:</B> Kann es sein, da&szlig; das bei .com alles nur irgendwelche
Suchmaschinen sind?<BR>

<BR><B>AO:</B> Zwar sind bei .com auch etliche Suchmaschinen dabei (bei den
Top-Benutzern), aber das ist trotzdem auch nur ein Bruchteil.<BR>

<BR><B>AS:</B> Wenn ich die obigen Zahlen zusammenz&auml;hle, dann sind bei
36+14+3% noch fast +50% &uuml;brig, die dann aus Skandinavien/Osteuropa
kommen m&uuml;&szlig;ten. Haben die keinen eigenen Aminet Server? Vor allem
bei den Skandinaviern wei&szlig; man ja, da&szlig; die technisch voll auf
der H&ouml;he sind mit dem Rest Europas - wenn nicht voraus.<BR>

<BR><B>AO:</B> Nein, nein: diese L&auml;nder sind bei 1-3%. Ein Gro&szlig;teil des
Restes kommt von .net. Und sehr viele sind auch nur numerische IP-
Adressen, also reine Zahlen statt Namen. Denen kann nat&uuml;rlich nicht
(so leicht) ein Herkunftsland zugeordnet werden.<BR>

<BR>Du kannst dir ja die Statistik selbst ansehen:<BR>

<BR><CENTER><IMG WIDTH=286 HEIGHT=119 ALT="[L&auml;nderstatistik]" SRC="../images_09/usage-country.gif"></CENTER>&nbsp;

<BR><B>AS:</B> Ach so.<BR>

<BR><B>AO:</B> Ich glaube, die Leute w&auml;hlen ihre Server nach
netzwerktopologischer N&auml;he, Geschwindigkeit und Zuverl&auml;ssigkeit
aus. Eigene Server gibt es in all diesen L&auml;ndern. Aber es sind z.B.
Teile Amerikas im Netzwerk &quot;n&auml;her&quot; als Teile
Deutschlands.<BR>

<BR>Potentiell haben nat&uuml;rlich geographisch n&auml;here L&auml;nder
schnellere Verbindungen, aber der Netzwerkausbau ist oft recht
schlecht.<BR>

<BR><B>AS:</B> Man kann also sagen: Die &Ouml;ffentlichkeit h&auml;lt Deinen
Server f&uuml;r einen der zuverl&auml;ssigen und schnellen. ;-) Der Ruf
wird schon nicht von ungef&auml;hr kommen, und aus pers&ouml;nlicher
Erfahrung kann ich das eigentlich best&auml;tigen.<BR>

<BR><B>AO:</B> Eigenlob stinkt. Und bez&uuml;glich der Overflows bin ich nicht
zuverl&auml;ssig. Aber geschwindigkeitsm&auml;&szlig;ig und bez&uuml;glich
Zuverl&auml;ssigkeit w&auml;hrend langen &Uuml;bertragungen gibt's keine
Probleme ;-)<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Nachdem ja ich Dich gelobt habe und nicht Du Dich selbst, tut es
wohl nur ein bi&szlig;chen miachtln... ;-) Am Schlu&szlig; mu&szlig; ich es
noch kurz ausnutzen, da&szlig; wir einmal einen Nicht-Grazer im Interview
haben. Der Aminet Mirror steht also in Wien. Kommst Du auch von dort?<BR>

<BR><B>AO:</B> Nein, ich komme aus K&auml;rnten, Klagenfurt um genauer zu sein.
Mein Studium absolviere ich aber in Wien.<BR>

<BR><B>AS:</B> Von der Wiener Amiga-Szene kriegt man in Graz nicht viel mit. Gibt
es die &uuml;berhaupt?<BR>

<BR><B>AO:</B> Nein, nicht wirklich. Zumindest keine offene, es gibt noch ein paar
Clubs, aber mit denen hab ich keinen Kontakt. Alle, die fr&uuml;her in
at.fido.amiga waren, sind verschollen... leider :-(<BR>

<BR><B>AS:</B> Kennst Du noch wen, der aktiv f&uuml;r Amiga programmiert, sei es
kommerziell oder als &quot;freely distributable&quot;? Im Vergleich dazu
wieder Graz, wo es nach wie vor sowohl als auch gibt.<BR>

<BR><B>AO:</B> Nein, ich kenn' niemanden. Fr&uuml;her gab es einen Thomas Dorn
(XiPaint) und etliche nicht so bekannte, aber heutzutage... Ich hab mal ein
CD-Write Programm f&uuml;r den Amiga geschrieben, z&auml;hlt das?<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Das hei&szlig;t, wir als Provinzler k&ouml;nnen uns wenigstens
selbstgef&auml;llig zur&uuml;cklehnen und sagen, da&szlig; unser Wasserkopf
von Bundeshauptstadt einmal mehr nix zusammenbringt. Wenn das kein guter
Schlu&szlig;satz ist! ;-)<BR>

<BR><B>AO:</B> Ja, in Wien gibt's nur S&auml;cke, die ihren Amiga verschrotten!
;-) Aber ich wei&szlig; nicht, ob das wirklich ins Interview soll...<BR>

<BR><B>AS:</B> Klar, die sollen uns ruhig das Gegenteil beweisen. Dann danke,
da&szlig; Du Dir die Zeit genommen hast.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00BC.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/usage-country.gif">L&auml;nderstatistik</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/usage-year.gif">Anzahl der heruntergeladenen Dateien 1997/98</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00BB.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00BD.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
