<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x09 - NetConnect V2</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00B6.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00B5.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00B7.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00B6.html">NetConnect V2</A> | <A HREF="0x00B7.html">Aminet Tools</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00B1.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00B2.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00B3.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00B4.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00B5.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00B6.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00B8.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00B9.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00BA.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00BB.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00BC.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>NetConnect V2 - &quot;Nimm den Stecker in die Hand!&quot;</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Lange hat's gedauert, bis sich einer dem nodigen
Problem des Nichtvorhandenseins einer sinnvollen Zusammenstellung von
&quot;Internet-Programmen&quot; widmete. <A
HREF="http://www.active-net.co.uk/">Active Technologies</A> versprechen nun
die einfache Verbindung des Amigas zum Netz aller Netze.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Spinnereien...</B></H3>&nbsp;

<BR>...mag sich nun so mancher denken, angesichts der bisher in
m&uuml;hsamer Kleinarbeit zusammengestellten Ansammlung an TCP-Stack,
Browser, Mailer, etc., die nun ganz nach Vorlieben funktioniert. Aber nicht
nur am Cover der CD, die mit einem dicken Inlet aber ohne sonstige
papierener Dokumentation kommt, sitzt eine possierliche Arachnoide
metallisiert in ihrem Netz, auch der Rechner aller Rechner wird somit zur
Schaltzentrale aller heutzutage lebensnotwendigen &quot;Connections&quot;
im Netz.<BR>

<BR>Auf der R&uuml;ckseite des Covers sieht man auch gleich, was man denn
nun so alles mit dieser CD kauft: Neben Vollversionen von AmiTCP-Genesis,
Voyager-NG, MicroDot-II, AmIRC, AmFTP, AmTalk, AmTelnet, AmTerm und NetInfo
finden sich auch praktische Tools wie ein X-Arc, das &quot;Die
Amiga-Antwort auf WinZip&quot; sein soll, einem ContactManager zur
Verwaltung der ganzen Adressen, Online Dokumentation,
&quot;systemweite&quot; MIME-Prefs und das alles zusammengefasst in einer
ToolManager-artigen Umgebung als DockIcon auf der Workbench.<BR>

<BR>Wird dieses Netz nun mal &uuml;ber seine Workbench geworfen, so bietet
es sich in oben beschriebener Weise dar und die installierten Programme
k&ouml;nnen in ihrer jeweiligen Funktion mal einfach so benutzt werden.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Eing'steckt...</B></H3>&nbsp;

<BR>...wird man bei der Installation der NetConnect noch nicht, denn die
installiert &quot;nur&quot; die Programme mittels sch&ouml;ner
Installer-Oberfl&auml;che ins gew&uuml;nschte Verzeichnis. Beim ersten
Start des neuen-alten TCP-Stacks wird dann aber sogleich ein Account
angelegt, mit dem man sich per Modem einw&auml;hlen oder per Sana-II-Device
ans lokale Netz h&auml;ngen kann.<BR>

<BR>Der neuartige SetupWizard der NetConnect f&uuml;hrt dabei durch die
meisten Untiefen einer Konfiguration und l&auml;&szlig;t soweit auch nichts
zu w&uuml;nschen &uuml;brig, denn auch wenn er bunt wird (was sicher so
manche erfreuen wird), tut er seine Pflicht.<BR>

<BR>Das CD-Verzeichnis zeigt sich beim &Ouml;ffnen aufger&auml;umt und
sch&ouml;n eingeteilt in eigene Verzeichnisse f&uuml;r Docs, Programs,
MIME, AmiTCP, Extras und MUI. B&ouml;se &Uuml;berraschungen erlebt man
aber, wenn man etwas das NetConnect-DockIcon oder die zugeh&ouml;rigen
Preferences starten will, da unerh&ouml;rt oft nach
&quot;NetConnectV2:&quot; gefragt wird, die CD aber nur &quot;NETCD2:&quot;
hei&szlig;t. Somit l&auml;&szlig;t sich n&auml;mlich unpraktischerweise
nicht einmal die Doku im Voraus lesen. Wenigstens wei&szlig; ich jetzt, wie
man auf Cancel-Gadgets klickt....<BR>

<BR>Der Doppelklick aufs gewohnte Install-Icon bringt uns aber den
gewohnten Commo-Installer und l&auml;&szlig;t die Wahl der
Installationswahl:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=496 HEIGHT=278 ALT="[Installer]" SRC="../images_09/installer.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=496>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Na, was nemma denn heut'???
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Ja, auch Version 3.8 von MUI ist auf der CD und kann gleich
mitinstalliert werden, ein sp&auml;teres &Uuml;berspringen davon ist
allerdings nicht mehr m&ouml;glich und somit ist eine bestehende
MUI-Installation leicht zerschossen, vergi&szlig;t man vorher das
Abw&auml;hlen des entsprechenden Gadgets. Genauso wird nie
&uuml;berpr&uuml;ft, ob schon Gleiches vorhanden ist, es wird einfach stur
dr&uuml;berkopiert. Eine verfeinerte Auswahl, welche Programme in welcher
Version installiert werden sollen, ist aber m&ouml;glich. Das ist fein:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=496 HEIGHT=278 ALT="[Versions-Gewirr]" SRC="../images_09/versionsgewirr.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=496>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Zahlen &uuml;ber Zahlen...
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Docking Station</B></H3>&nbsp;

<IMG WIDTH=112 HEIGHT=239 ALT="[Dock]" SRC="../images_09/dockicon.gif" HSPACE=15 VSPACE=15 ALIGN=LEFT>

<BR>Nachdem nun das NetConnect-DockIcon gleich aus der WBStartup heraus
aufgerufen werden kann, ist es immer sch&ouml;n pr&auml;sent auf der
Workbench (siehe Bild nebenan). In dieser Version hatte ich schon den
Voyager durch den AWeb ersetzt und die Prefs mit auf das DockIcon geworfen
(was nicht n&ouml;tig gewesen w&auml;re, denn diese Prefs lassen sich auch
durch das zum DockIcon geh&ouml;rige Men&uuml; erreichen), das mittels
NetConnectPrefs frei konfigurierbar ist. Die Icons k&ouml;nnen
herk&ouml;mmliche Icons sein, kleine IFF- oder GIF-Graphiken, was das Herz
begehrt. Dazu k&ouml;nnen dann nat&uuml;rlich individuelle Kommandozeilen,
ToolTypes, ARexx-Scripts, etc. angegeben werden usw.<BR>

<BR>Das DockIcon selber bleibt aber immer zweispaltig und pa&szlig;t sich
automatisch in der H&ouml;he an, bleibt aber bei freier Positionierbarkeit
immer hochformatig.<BR>

<BR>Ins &quot;Hilfsmittel&quot;-Men&uuml; der Workbench werden
zus&auml;tzliche Befehle eingef&uuml;gt, sobald NetConnect gestartet ist
und es lassen sich auch einfach mehrere DockBars erzeugen, indem sie in den
Prefs in der linken SPalte eingef&uuml;gt werden.<BR>

<BR>Das Ganze kann dabei so weit konfiguriert werden, da&szlig; nichts mehr
von der einstigen Installation gleich bleibt (wer braucht da noch einen
ToolManager?). Ich benutze hier zwar gerne die DockBar-Eigenschaften und
die M&ouml;glichkeit, was ins Tools-Men&uuml; einzutragen, aber das neue
AmiTCP ist nicht in meiner Installation. Aber auch mit dem
&quot;alten&quot; AmiTCP funktionieren die NetConnect-Programme
einwandfrei. W&auml;r' ja auch noch sch&ouml;ner!<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Programme und Unterprogramme</B></H3>&nbsp;

<BR>Da ist ja jetzt die Frage: wie wichtig ist denn nun ein TCP-Stack? Da
w&uuml;rden jetzt sich wohl ein paar Leute wundern, wenn ich sagte, er
w&auml;re unwichtig, mitnichten! Drum wanderte das entsprechende Icon
namens &quot;Genesis&quot; auch gleich in die WBStartup. F&uuml;r eine
DialUp-VErbidnung per Modem ist es ja sinnvoll, den Stack nicht gleich beim
Booten zu starten, aber bei Verbindungen in lokalem Ethernet will ich doch
gleich ein Netz haben.<BR>

<BR>Wer AmiTCP bisher kannte, wird es nun nicht wiedererkennen. Und doch
ist alles beim Alten geblieben, nur unter Zaubern verh&uuml;llt...<BR>

<A HREF="../images_09/genesiswizard.gif"><IMG WIDTH=123 HEIGHT=176 ALT="[Der Wizard]" SRC="../images_09/genesiswizardtn.gif" ALIGN=RIGHT HSPACE=15 VSPACE=15 BORDER=0></A>

<BR>Dieser Wizard f&uuml;hrt uns in &quot;bekannt&quot; bunter Manier
ziemlich brauchbar durch die Grundinstallation des Stacks, soda&szlig;
dessen Konfiguration nicht wirklich ein Problem bereitet. Gleich als Erstes
kann man zwischen DialUp- und lokalem Netzwerk w&auml;hlen. Die
Installation Ersteres erweist sich als v&ouml;llig unproblmeatisch, da nach
Angabe der grundlegenden Daten (Schnittstelle, Modem-Einstellungen (Auswahl
aus vielen Vorgaben m&ouml;glich), Provider, Telefonnummer) ein
Einwahlversuch Miami-gleich erfolgt und die restlichen Daten direkt online
ermittelt werden.<BR>

<BR>Auch die Konfiguration f&uuml;r lokale Netzwerke erfolgt im Grunde
problemlos, nur beim ersten Mal weigerte er sich hartn&auml;ckig, die
eingegebene lokale IP-Adresse anzunehmen. Normalerweise w&uuml;rden auch
hier die ganzen Daten von einem BOOTP-Server geholt werden, da ich so etwas
aber nicht habe, mu&szlig;te ein zweiter Versuch her, bei dem - oh Wunder!
- auf einmal alles klappte und ich sogleich einen funktionierenden und
fertig konfigurierten TCP-Stack mein eigen nennen konnte.<BR>

<BR>Die so erstellten Einstellungen k&ouml;nnen allesamt auch sp&auml;ter
noch mittels des Preferences-Programmes ver&auml;ndert werden, soda&szlig;
man sich nicht allzu viele Sorgen machen mu&szlig;. Wer es gar nicht
hinbekommt, wende sich an den Netzwerkmagier seines Vertrauens, bzw. gibt
es f&uuml;r registrierte Benutzer bei <A
HREF="http://www.active-net.co.uk/">Active Technologies</A> eine
Support-Hotline und -Mailadresse.<BR>

<BR>Der TCP-Stack selber zeigt sich als konsequente Weiterentwicklung des
bekannten AmiTCP in neuer Umgebung. Verwirren k&ouml;nnte die Tatsache,
da&szlig; mehrere Interfaces (zum Beispiel mehrere Netzwerkkarten in einem
Rechner, oder Netzwerkkarte plus Modem) als unterschiedliche Provider
angelegt werden und die ganzen FIles aus AmiTCP:db/ im Grunde leer
sind.<BR>

<BR>Bei der Entwicklung d&uuml;rfte wohl ein NeXT-Liebhaber mitgespielt
haben, denn das System der dynamischen Erstellung der notwendigen Dateien
erst zur Laufzeit und die Verwaltung der Daten in eigenen Prefs-Files kenne
ich (bisher) nur von dieser anderen genialen Plattform. In diesem Sinne
wird auch das Icon f&uuml;r X-Arc (die ge&ouml;ffnete Schachtel) wohl
erkl&auml;rbar sein :-))<BR>

<BR>Schaut man sich dann bei laufendem TCP-Stack die relevanten Dateien an,
so sind sie in bekannter Manier gef&uuml;llt und somit gibt es auch
&uuml;berhaupt keine Probleme mit vorhandenen Programmen, die diese Dateien
benutzen.<BR>

<BR>Die Einstellungsm&ouml;glichkeiten im GenesisPrefs sind fast unendlich
und immer wieder findet man weitere Unterpunkte und neue Fenster poppen auf
(welche Verschwendung an &Uuml;berraschungen w&auml;re es, l&auml;se man
erst eine Dokumentation durch. Das w&auml;re ja, als ob man massiv Spoiler
zur 5. Season von Babylon 5 verstreuen w&uuml;rde. Unverantwortlich ;-)
).<BR>

<BR>Vielleicht war ich angesichts dieser Konfigurationsm&ouml;glichkeiten
nur nicht geduldig genug, aber ich fand im Laufe von tagelangem ( ;-) )
Testen nicht heraus, wie ich Samba mit dem neuen AmiTCP zum Laufen bringen
k&ouml;nnte. Die entsprechenden Demons m&uuml;ssen nach Konfiguration der
Interfaces und vor dem globalen InternetDemon gestartet werden, und das ist
so einfach nicht zu schaffen. Dabei ist es an jeder noch so
unm&ouml;glichen Stelle m&ouml;glich irgendwelche Scripts
hineinzuh&auml;ngen und ablaufen zu lassen. Dabei steht in der History zu
Genesis, da&szlig; extra daf&uuml;r der Zeitpunkt eines bestimmten Events
ver&auml;ndert wurde, damit Samba laufen k&ouml;nnte. Dennoch: es wollte
nicht.<BR>

<BR>Sicher w&auml;re es m&ouml;glich gewesen, in den Startup-Scripts zu
w&uuml;hlen und bis zu den Ellbogen bitverschmiert mit einem Grinsen im
Gesicht wieder aufzutauchen, aber das kann wohl nicht im Sinne des
Erfinders sein (&auml;hnlich kommt man sich ja vor, bastelt man an der
heiligen Startup-Sequence herum).<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Krieg ich nun die Mails oder doch nicht?</B></H3>&nbsp;

<BR>Der Microdot-II ist ja ein wirklich schmucker Geselle, und im Grunde
funktioniert er auch, nur hat er so die Angewohnheit, sich die Mails vom
Server zu holen, einzusortieren, sie vom Server zu loeschen und
abzusemmeln. Ungluecklicherweise sind danach die eigentlich einsortierten
Mails weder am Server noch lokal zu finden, sondern irgendwo bei
gl&uuml;cklichen Bits im Nirvana zu finden. Schlecht. Leider ist dieses
Verhalten nicht reproduzierbar, aber ein zu h&auml;ufiges Auftreten
l&auml;&szlig;t mich doch auf ein Problem innerhalb des mailers
schli&szlig;en, da ich ja weder mit Thor, YAM, noch pine je dergestalte
Probleme hatte...<BR>

<BR>Der Voyager pr&auml;sentiert sich in der gewohnten Form, in der
gewohnten Funktionsf&auml;higkeit und in der gewohnten K&ouml;rnigkeit im
Darstellen der Schriften, zumindest mir scheint es, als w&uuml;rden ein
AWeb oder ein IBrowse sichtbar weicher die Buchstaben hinzeichnen. Unser
lieber Herr Chefredakteur hingegen sch&ouml;rt auf die sch&ouml;ne und edle
Darstellung eines Voyagers. Wahrscheinlich ist aber nur sein Monitor
unscharf... <I>(Anm.d.Red.: Der liebe Herr Gerler sollte sich jetzt aber
g'schwind ins Eckerl stellen und genieren! Sein 15&quot; Monitor erfordert
gar unsch&ouml;ne Fonts (Screenshots!) und l&auml;&szlig;t sogar ein 'i'
einem '&uuml;' &auml;hnlich erscheinen. ;-))</I>.<BR>

<BR>AmFTP ist auch nicht anders als sonst, sondern funktioniert einfach,
wie es sich f&uuml;r ordentliche Software halt geh&ouml;rt. Genauso ist es
mit AmIRC, eh schon wissen.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Knautschzonen</B></H3>&nbsp;

<BR>X-Arc hei&szlig;t es, die Amiga-Antwort auf WinZip, und es schaut dem
auch sehr &auml;hnlich. Nach Doppelklick &ouml;ffnet sich das Fenster, in
dem die beschrifteten Gadgets wieder bekannt anmuten...<BR>

<BR>Hat man einmal ein neues Archiv angelegt oder ein bestehendes
ge&ouml;ffnet, wobei X-Arc anfangs mit .lha, .lzx und .zip umgehen kann, so
k&ouml;nnen einfach per Drag&amp;Drop die Files ins Fenster geworfen werden
und sie werden automatisch ins Archiv eingef&uuml;gt. Ist kein Archiv
offen, kann per selbem Drag&amp;Drop ein solches ge&ouml;ffnet werden.
Dabei ist X-Arc so klug, nicht durch das fallengelassene .Info-File ins
archiv zu packen, sondern auch die zugeh&ouml;rige Programm-Datei kommt
automatisch dazu.<BR>

<BR>Die umfangreichen Einstellungsm&ouml;glichkeiten erlauben es, weitere
Packer und Entpacker einfach einzubinden und in einem weiteren Unterpunkt
der Settings k&ouml;nnen global die MIME-Types definiert werden. Bei
Doppelklick auf ein File in einm Archiv wird dann wie in einem Browser
entsprechend der MIME-Types das dazupassende Programm gestartet.
Praktischerweise sind schon sehr viele Konfigurationen vorgegeben und man
braucht nicht mehr alles h&auml;ndisch eintippen.<BR>

<BR>Das interessante Icon rechts unten namens Palette ist eine Art
Interface zur HardDisk, bzw. der Filestruktur am Rechner. Files, die aus
einem Archiv dorthinein gezogen werden, werden automatisch entpackt und
umgekehrt werden die Files ins Archiv gepackt.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Kontaktanzeigen</B></H3>&nbsp;

<BR>...und dann war da noch was: es nennt sich Contact-Manager und bietet
eine zentrale Stelle, um seine BookMarks, FTP-Sites, UserAccounts und
IRC-Sachen verwalten zu k&ouml;nnen. Das ist n&auml;mlich das zweite
Detail, an dem die mitgelieferten Programme ver&auml;ndert sein
m&uuml;ssen: Erstens fragen alle ein gemeinsames KeyFile in s: ab und
zweitens gibt es einen Men&uuml;punkt (im Voyager, etc.), ob die
Informationen aus dem Contact-Manager verwendet werden sollen.<BR>

<BR>Dieser Contact-Manager ist nun MultiUser-f&auml;hig. Jeder, der mittels
Pa&szlig;wort in das Programm einsteigt, hat seine eigenen, ganz
pers&ouml;nlichen Einstellungen und die anderen wissen nix davon. Diese
MultiUser-F&auml;higkeit h&auml;ngt nun davon ab, ob in Genesis, bzw.
NetConnect mehrere User eingetragen und konfiguriert sind. Somit gibt es
ein globales System, da&szlig; immer die gleichen Daten bereitstellt.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Hohle Typen???</B></H3>&nbsp;

<BR>Wenn man nun so sch&ouml;n &uuml;berall die MIME-Types angeben kann,
braucht man auch die dahinterstehenden Programme. Sicher, man kann die sich
alle aus dem Aminet zusammensuchen, aber auf einer CD ist ja so viel Platz:
Drum finden sich im MIME-Verzeichnis auch aMiPEG, CyberAVI, CyberQT und
Songplayer in vorinstallierter Form. aMiPEG liegt dabei in Version 1.1,
CyberAVI in 1.9, CyberQT als 1.4 und Songplayer in Version 1.3 vor. In den
entsprechenden Verzeichnissen finden sich nat&uuml;rlich auch die
dazugeh&ouml;rigen Dokumentationen als .readme oder .guide.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Auch die Leseratten ohne Vorliebe f&uuml;r Spinnen kommen auf ihre Kosten</B></H3>&nbsp;

<BR>Denn die Dokumentation liegt im Gro&szlig;teil als HTML-File-Ansammlung
vor, in der aber die einzelnen Programme gut und ausf&uuml;hrlich
beschrieben sind. Das dicke Inlet der CD gibt eine grundlegende
Einf&uuml;hrung in die Installation von NetConnect (dem DockIcon und den
Men&uuml;intraegen) und Genesis (AmiTCP). Weiters sind die Hauptfenster der
&quot;gro&szlig;en&quot; Programme, wie Voyager, Microdot, etc. abgebildet,
erkl&auml;rt und beschrieben, so da&szlig; man sich f&uuml;rs Erste gleich
einmal zurechtfinden sollte.<BR>

<BR>130K an sch&ouml;nen, kleinen Bilderln und Icons in einem eigenen
Verzeichnis auf der CD lassen des der Pixlerei Unf&auml;higen Herz
h&ouml;herschlagen.<BR>

<BR>Im Gro&szlig;en und Ganzen kann diese Compilation als durchaus gelungen
bezeichnet werden und, wie es auch am Cover beworben steht, sowohl f&uuml;r
Einsteiger als auch die sogenannten PowerUser empfohlen werden.
Schlie&szlig;lich findet man nirgends sonst auf einem Haufen soviel zum
Thema Netzwerkanbindung mit dem Amiga inklusive der sch&ouml;nen
Realisation, dies alles unter eine m&ouml;glichst kompakte Oberfl&auml;che
zu bringen. Nicht zu verachten nat&uuml;rlich die bunten Setup Wizards
;-)).<BR>

<BR>Der Vertrieb erfolgt durch <A HREF="http://www.haage-partner.com/">Haage
&amp; Partner</A> und in &Ouml;sterreich nat&uuml;rlich durch <A
HREF="http://www.pointdesign.com/">PointDesign</A>.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00B6.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.active-net.co.uk/">Active Technologies</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.haage-partner.com/">Haage &amp; Partner</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.pointdesign.com/">PointDesign, Graz</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.vapor.com/">Vaporware</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/contactmanager.gif">Contact Manager</A> (GIF; 7K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/netconnectprefs.gif">NetConnect Prefs</A> (GIF; 12K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/palette.gif">Palette</A> (GIF; 5K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/x-arc.gif">X-Arc</A> (GIF; 12K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/installer.gif">Installer</A> (GIF; 5K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/versionsgewirr.gif">Versions-Gewirr</A> (GIF; 7K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/dockicon.gif">Dock</A> (GIF; 5K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/genesiswizard.gif">Genesis Wizard</A> (GIF; 16K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_09/genesiswizardtn.gif">Der Wizard</A> (GIF; 3K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00B5.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00B7.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
