<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x02 - Gesuder</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0036.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0035.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0037.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0036.html">Gesuder von Thomas Aglassinger!</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x002B.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x002C.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x002D.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x002E.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x002F.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0030.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0032.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x0034.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0036.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0037.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0039.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Netscape, Doom und die Lemminge</B></FONT></H1>&nbsp;

<P ALIGN=CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Die Fakten</B></P>

<P>In den letzten Wochen bzw. Tagen gab es zwei Ereignisse au&szlig;erhalb der
Amiga-Welt, die f&uuml;r einige Aufregung (nicht nur) innerhalb derselben
gesorgt haben:</P>

<P>id-Software stellte den Quellcode f&uuml;r Doom, einem der ersten
3D-Actiongames, das vor einigen J&auml;hrchen in gewi&szlig;en Kreisen
Kultstatus hatte, zur freien Verf&uuml;gung.</P>

<P>Netscape k&uuml;ndigte an, den Source f&uuml;r die kommende Version 5.0
ihres ber&uuml;hmt-ber&uuml;chtigten Navigators, der zu seinen besten
Zeiten erheblichen Einflu&szlig; auf die Entwicklung des WWW hatte,
ebenfalls &ouml;ffentlich zug&auml;nglich zu machen.
H&ouml;chstwahrscheinlich wird es erlaubt sein, daran &Auml;nderungen
vorzunehmen und die neue Version anderen Leuten zur weiteren Verwendung zu
geben.</P>

<P>Auf den ersten Blick haben beide Dinge viele Gemeinsamkeiten. Dieser
Artikel wird versuchen, auch auf die Unterschiede hinzuweisen und ein paar
Denkanst&ouml;&szlig;e &uuml;ber die m&ouml;glichen Hintergr&uuml;nde zu
geben.</P>

<P>Eines vorneweg: Weiterzulesen wird nicht unbedingt angenehm sein. Das mag
vielleicht &uuml;berraschen, da es sich hier doch um durchaus positive
Dinge zu handeln scheint. Woran kann der also Sinn bestehen, alles gleich
wieder schlecht zu machen?</P>

<P>Nun, vielleicht h&auml;ngt es damit zusammen, das viele Sachen nicht immer
so einfach sind, wie einem Marketingabteilungen, speziell von
Softwarefirmen, weismachen wollen.</P>

<P ALIGN=CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Zuerst Doom...</B></P>

<P>Sch&ouml;n der Reihe nach einmal zu Doom: Als das Spiel Ende 1993 f&uuml;r
PC herauskam, entbrannten in den einschl&auml;gigen Newsgroups sofort
heftige Diskussionen, ob so etwas auf einem Amiga auch nur ansatzweise
m&ouml;glich sei.</P>

<P>W&auml;hrend die Doom-Macher selbst verk&uuml;ndeten, da&szlig; es nie eine
Version f&uuml;r &quot;Amiga, Sinclair 2000, Apple IIgs [und] TRS-80&quot;
geben werde (siehe &quot;Official Doom-FAQ v6.666&quot;), m&uuml;hten sich
diverse andere Softwarefirmen in zahlreichen Clones meist vergeblich ab,
ihre Chunky-Planar-Converter auch auf einem 68020/14Mhz nicht peinlich
wirken zu lassen.</P>

<P>Vier Jahre sp&auml;ter: wenige Tage nach der Ver&ouml;ffentlichung des
Quellcodes gibt es die ersten spielbaren Versionen f&uuml;r Amiga, ein paar
Wochen sp&auml;ter sind die Updates nur mehr kleinere Bugfixes, und Doom
l&auml;uft fl&uuml;ssig auf den h&ouml;heren Modellen der ehrw&uuml;rdigen
68k-Generation, wenn es sein mu&szlig; im Fenster auf der Workbench. Dabei
werkelt das Multitasking weiter, und auch kleine Feinheiten wie Joypads
werden unterst&uuml;tzt.</P>

<P ALIGN=CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>...und jetzt Netscape?</B></P>

<P>Da Netscape k&uuml;rzlich vollmundig verk&uuml;ndete, mit ihrem Navigator
&Auml;hnliches vorzuhaben, hoffen nun wohl viele Amiganer, da&szlig; uns
das Gleiche widerfahren wird wie mit Doom: ein paar erfahrene
Freeware-Programmierer opfern einige Tage ihrer Ferien, h&auml;ngen eine
handvoll Amiga-spezifischer Routinen f&uuml;r Tastatureingabe und Grafik in
den Quellcode, fixen nebenbei ein paar Fehler im Original und geben das
Ganze dann zur allgemeinen Freude ins Aminet.</P>

<P>(Ohne nun den Doom-Portieren gegen&uuml;ber undankbar sein zu wollen, oder
ihre unbestritten gro&szlig;artige Leistung heruntermachen zu wollen: viel
mehr war es aber wirklich nicht.)</P>

<P>Ja, warum eigentlich nicht? Sowohl Doom als auch Netscape existieren
f&uuml;r zahlreiche Betriebsysteme (u.a MacOS, diverse Unixe und Windowse),
beide stellen ziemliche Anorderungen an die Rechenleistung, f&uuml;hren
aufwendige Grafikoperationen durch, machen zeitweise L&auml;rm, und greifen
bei Bedarf auf das Netzwerk zu. So gro&szlig; kann da der unterschied ja
nicht sein, oder?</P>

<P ALIGN=CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Der Doom-Source</B></P>

<P>Nun, die Funktionsweise eines Actiongames l&auml;&szlig;t sich in etwa wie
folgt charakterisieren: Der Spieler steuert seine Figur, die Monster rennen
herum, beide Ballern ein Bi&szlig;chen durch die Gegend. Diese
T&auml;tigkeiten werden ein paarmal pro Sekunde in den Grafikspeicher
gerendert, und das war es auch schon. Der einzige Unterschied zwischen Doom
und z.B &quot;Wizard Of War&quot; ist dabei, da&szlig; bei Ersterem die
grafische Darstellung und die Kollisionsabfrage aufwendiger sind.</P>

<P>Will man mehrere Spieler im Netzwerk haben, erfordert das nur wenig
Mehraufwand. Weil das Netzwerkprotokoll, das Doom verwendet, sich im Grunde
darauf beschr&auml;nkt, Spielerkoordinaten und m&auml;&szlig;ig
intelligente Meldungen wie &quot;Next time, scumbag...&quot; auszutauschen.</P>

<P>Um all dies zu realisieren, ben&ouml;tigt es etwa 1.5MB Quellcode, die
compiliert zu einem circa 400K gro&szlig;en Programm werden. WAD und
Tondaten nicht mitgerechnet - diese stellen aus Programmierersicht aber
auch kein Problem dar.</P>

<P ALIGN=CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Der Netscape-Source</B></P>

<P>Netscape hat seinen Quellcode noch nicht ver&ouml;ffentlicht, und darum ist
es zugegeben etwas m&uuml;&szlig;ig, dar&uuml;ber all zu detailierte
Spekulationen anzustellen. Ein paar Dinge sollten sich aber bereits jetzt
mit ziemlicher Sicherheit sagen lassen:</P>

<P>Es werden mehr als 1.5MB sein. Schlicht und ergreifend deshalb, weil
Netscape bereits als ausf&uuml;hrbares Programm um ein Vielfaches
gr&ouml;&szlig;er ist.</P>

<P>Der Browser wird in einem viel schlechterem Zustand sein als Doom. Das
liegt zum Einem daran, da&szlig; Netscape in allen Belangen komplexer ist.</P>

<P>Dar&uuml;ber hinaus implementiert Doom konsequent eine fixe Idee,
w&auml;hrend Netscape wegen all dem (nicht zuletzt selbstverschuldeten)
Chaos um die Weiterentwicklung von HTML und WWW andauern ge&auml;ndert
werde mu&szlig;te.</P>

<P>Oder, wie es Jamie Zawinski, einer der Netscape-Programmierer,
k&uuml;rzliche formulierte:</P>

<CENTER>
&quot;The code is overly complicated because that's what happens when<BR>
<EM>any</EM> piece of software reaches version 5.0 without the authors<BR>
having had the opportunity to sit back.&quot;
</CENTER>

<P>Zum Vergleich: id-Software hat statt Doom 3.0 lieber &quot;Quake&quot;
gemacht. Und dabei kaum viel von dem alten Code weiterverwendet - nicht
zuletzt, weil die Quake-Engine vom Prinzip her vollkommen anderns
funktioniert. Und in Doom wiederum wird nicht mehr viel von Vorg&auml;nger
&quot;Wolfenstein 3D&quot; zu sehen sein (von einem Secret Level einmal
abgesehen). Denn Spieleprogrammierer sind in der gl&uuml;cklichen Lage,
sich nicht um irgendwelche Standards oder Kompatibilit&auml;t scheren zu
m&uuml;ssen.</P>

<P>Des Weiteren implementiert Netscape nicht ein eigenes, den
Bed&uuml;rfnissen angepa&szlig;tes Protokoll, sondern versucht, mit all dem
fossilen Schrott klarkommen, der sich an wirren Konzepten im Internet in
den letzten gut 20 Jahren so angesammelt hat (TCP/IP, FTP, HTTP usw.).</P>

<P>Und nicht zuletzt &ouml;ffnet Netscape schon mal einige weitere Fenster und
startet ein paar neue Tasks.</P>

<P>Damit sollte eigentlich klar sein, da&szlig; die beiden Programme zwar im
Grunde das gleiche machen, aber in einer v&ouml;llig verschiedenen Liga
spielen, was Komplexit&auml;t und Altlasten betrifft.</P>

<P ALIGN=CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Plug-Ins, Java und Konsorten</B></P>

<P>Ein weiterer Hoffnung, die sich eher nicht erf&uuml;llen wird, ist die
Verf&uuml;gbarkeit des ganzen Drumherums um Netscape. So gibt es zum
Beispiel zahllose Plug-Ins, die es erlauben, Daten von diversen anderen
Applikationen direkt im Browser anzuzeigen.</P>

<P>Leider sind die nicht von Netscape, oft nur f&uuml;r ein bestimmtes
Betriebssystem erh&auml;ltlich und schon gar nicht Teil des Quellcodes. Es
ist nicht damit zu rechnen, Dinge wie RealAudio und Shockwave als Teil von
Netscape am Amiga zu sehen.</P>

<P>Anderer Erweiterungen wie Java und Datenbankenfunktionen unterliegen wieder
dem Copyright anderer Firmen. Das hei&szlig;t, viele Teile liegen
vermutlich nicht einmal Netscape zum Entwickeln als Source vor. Und selbst
wenn, ist es ihnen nur gestattet, sie zu compilieren und mit dem fertigen
Programm auszuliefern.</P>

<P>Es ist davon auszugehen, da&szlig; einiges, was derzeit Teil von Netscape
ist, nicht beim Quellcode dabei sein wird. Darunter fallen nicht zuletzt
all die cryptografischen Routinen, die wegen der bekannten,
vieldiskutierten Gr&uuml;nde nicht aus Amerika exportiert werden
d&uuml;rfen.</P>

<P>Zusammenfassend hei&szlig;t das: Marc Andreessen wird nicht einfach
hergehen und sagen:</P>

<PRE><B>         lha -rax a netscape.lha netscape/source</B></PRE>

<P>und das Ergebnis unter comm/www ins Aminet geben. Vorher werden einige
Dingen aus dem source-Verzeichnis rausfliegen, die in &ouml;ffentlichen
Ports dann entweder v&ouml;llig fehlen, oder von wo anders genommen werden
m&uuml;ssen.</P>

<P>(Wahrscheinlich wird auch nicht der Netscape-Chef selbst den Upload machen,
aber das ist ein eher unbedeutendes Detail.)</P>

<P ALIGN=CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Warum Quellcodes?</B></P>

<P>Eine Frage, die bis jetzt noch nicht angesprochen wurde: Warum
ver&ouml;ffentlichen kommerzielle Software-Firmen urpl&ouml;tzlich den
Quellcode ihrer lange Zeit so sorgsam geh&uuml;teten Programme?</P>

<P>Die Antwort ist einfach: Weil er nichts (mehr) wert ist.</P>

<P>Im Falle von Doom ist das offensichtlich: die Macher selbst haben schon
l&auml;ngst Nachfolger geschrieben, die den Vorg&auml;nger in
s&auml;mtlichen technischen Belangen alt aussehen lassen. Kein Mensch
registriert heute mehr Doom, sondern kauft gleich Quake 2. Und die in Doom
verwendeten Algorithmen sind l&auml;ngst nicht mehr State-of-the-Art, kaum
jemand wird auf Basis des Doom-Sources ein Konkurrenzprodukt
ver&ouml;ffentlichen k&ouml;nnen.</P>

<P>Was die Source-Release aber brachte: id war pl&ouml;tzlich in aller Munde,
Tausende zuvor Uninteressierte schn&uuml;ffelten auf ihren Web-Seiten
herum. Ihr ehemaliges Aush&auml;ngeschild wurde in den letzten Wochen (oder
wird gerade) auf so ziemlich alles portiert, was nur ansatzweise die
Anforderungen erf&uuml;llt. Es ist anzunehmen, da&szlig; in den
n&auml;chsten Jahren praktisch alle Systeme in der Tradition von
Minesweeper ihr Doom mitkriegen.</P>

<P>Zum Nachdenken anregen sollte aber, da&szlig; es speziell im Falle von der
Amiga-Version technisch kein echtes Problem gewesen w&auml;re, Doom noch zu
Zeiten, als es verkaufbar war, anzubieten.</P>

<P>Dem allgemeine Gejohle und den diversen unreflektierten Danksagungen vieler
Amiga-Doomer nach zu schlie&szlig;en war die Source-Release ein voller
Erfolg. Gib dem Affen Zucker...</P>

<P ALIGN=CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Muster ohne Wert</B></P>

<P>Bei dem Navigator mag es zuerst etwas gewagt scheinen, von einem wertlosen
Quellcode zu sprechen.</P>

<P>Aber da sind zum Einen jede Menge Zahlen, die R&uuml;ckg&auml;nge von
Aktienkursen, Marktanteilen und Browser-Verk&auml;ufen verlautbaren. Solche
Zahlen sind zwar immer mit Vorsicht zu genie&szlig;en, aber im Falle von
Netscape scheinen derzeit alle dagegen zu sprechen.</P>

<P>Es bietet sich an, die &quot;Schuld&quot; f&uuml;r diese Zahlen im
Aufsteigen des Erzfeindes &quot;Internet Explorer&quot; und dem
Zur&uuml;ckgehen der &quot;Coolness&quot; von WWW und Homepages zu suchen.
Und nicht zuletzt wohl auch in der Tatsache, da&szlig; die letzten paar
Releases kaum eine verwendbare Neuerung enthielten.</P>

<P>Des weiteren soll hier noch einmal der h&ouml;chstwahrscheinlich unwartbare
Zustand des Programms in Erinnerung gerufen werden. Und dem gegen&uuml;ber
all die Dinge, die mit HTML 4.0 pl&ouml;tzlich ins Gerede kamen, etwa CSS
und i18n. Wahrscheinlich w&uuml;rde eine mehr als die derzeitige halbgare
Implementierung dieser Mechanismen der Struktur des Programms
endg&uuml;ltig den Rest geben.</P>

<P>Nat&uuml;rlich ist Netscape im Gegensatz zu Doom nicht technisch veraltert.
Zumindest nicht im Vergleich zur Konkurrenz. Aber der Aufwand, diesen
Status zu erhalten, k&ouml;nnte inzwischen zu gro&szlig; geworden zu sein.</P>

<P ALIGN=CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Reine N&auml;chstenliebe</B></P>

<P>Unbestritten hat die ganze Aktion, wie bei Doom, einen gewi&szlig;en
Werbeeffekt. Der wird sich aber schnell abgen&uuml;tzt haben. Das ist id im
Falle ihres 3D-Spielchens egal, weil sie bei Bedarf immer noch Quake
&quot;versourcen&quot; k&ouml;nnen. Oder Hexen. Oder welchen
Doom-Aufgu&szlig; sie eben gerade im Programm haben. Bei Netscape ist das
aber eine Einmal-Aktion.</P>

<P>Mancheiner scheint ja dazu geneigt zu sein, in der ganzen Sache ein Harke
gegen die Burschen und M&auml;dels aus Redmont zu sehen. Nachdem die
Produkte beider Hersteller de-facto ohnehin immer schon gratis waren, wird
das den reinen Anwender eher m&auml;&szlig;ig beeindrucken.</P>

<P>So gesehen liegt es nahe, mehr von einem Verzweiflungsakt zu sprechen. Und
einem plumpen Versuch, naive Freeware-Programmierer davon zu
&uuml;berzeugen, das versto&szlig;ene marode Kind in deren Hause zu
pflegen, w&auml;hrend man selbst nach wie vor die Kinderbeihilfe
einsackelt.</P>

<P>Beizeiten wird man ja sehen, was daraus wird.</P>

<P>Eines kann man aber mit Sicherheit sagen: Aus reiner N&auml;chstenliebe
wird kein Software-Entwickler seinen Quellcode ver&ouml;ffentlichen. Und
die diversen Vergewaltigungen des einst so unschuldigen Konzepts
&quot;Freeware&quot; von kommerziellen Herstellern im Sinne von &quot;Wer
kann l&auml;nger die Luft anhalten&quot; werden in Zukunft auch noch ein
paar Fragen aufwerfen.</P>

<P ALIGN=CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Das Positive</B></P>

<P>Wenn man lange genug sucht, findet man in all dem Schlamm doch noch ein
paar gute Sachen: z.B kann unsereins jetzt den PC-lern ein Amiga-Doom
demonstrieren. Nicht das es jemanden wirklich beeindrucken w&uuml;rde, aber
es scheint ein Mindest-Niveau zu sein, da&szlig; sie den oft zehn Jahre
alte Dingern nicht zugetraut h&auml;tten.</P>

<P>Schlichte Gem&uuml;ter finden das Spielchen tats&auml;chlich unterhaltsam,
was in Anbetracht der meisten Amiga-Doom-Clones aber auch nicht weiter
verwundert.</P>

<P>Und selbst wenn es nie einen funktionierenden Netscape Navigator f&uuml;r
Amiga geben wird, die Leute, die derzeit f&uuml;r AWeb, IBrowse und Voyager
verantwortlich sind, k&ouml;nnen dennoch dem Quellcode die eine oder andere
kleine Anregung entnehmen.</P>

<P>Im schlimmsten Fall kriegen die Programmierern ein gefl&uuml;geltes Wort,
so a'la &quot;Wenn Du das so machst, schaut den Source bald aus wie
Netscape&quot;.</P>

<P ALIGN=CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Die Lemminge</B></P>

<P>Bleibt eigentlich nur mehr eines zu beantworten: Was haben die Lemminge in
der &Uuml;berschrift verloren?</P>

<P>Ja, die Lemming, die rennen nun schon seit Jahren in ihrer finsteren
H&ouml;hle herum. Manche sagen, weil zu dumm sind, den Ausgang zu finden,
andere meinen, weil nach dem Ausgang eh nur der n&auml;chste Level kommt,
der noch viel gr&ouml;&szlig;er und gemeiner ist als der, in dem sie gerade
sind.</P>

<P>Weil das ja ein Pro-Amiga Artikel sein soll, sagen wir einmal, es ist
Zweiteres; zumindest bei den meisten. Die Lemminge also nicht dumm, haben
sich ihre H&ouml;hle in den letzten Jahren mit ihren bescheidene Mitteln
einigerma&szlig;en wohnlich eingerichtet.</P>

<P>Man erz&auml;hlt sich, da&szlig; die Lemminge im n&auml;chsten Level alle
mit dem Auto fahren. Damit sind sie viel schneller beim Suchen des
Ausgangs. Nur, gefunden haben sie in deswegen auch noch nicht. Stattdessen
stinkt dort die Luft nach Abgasen, weil H&ouml;hlen ja bekanntlich nicht so
leicht zu l&uuml;ften sind. Durch die fehlende Bewegung sind diese Lemminge
alle zu fett geworden und haben einen zu hohen Cholesterinspiegel.</P>

<P>Unl&auml;ngst haben aber die Autoverk&auml;ufer aus dem n&auml;chsten Level
aus Gr&uuml;nden des Marketings angefangen, ausrangierte Autos zu
verschenken. Darum stehen nun v&ouml;llig unerwartet ein paar fetzige
Schlitten in unserer H&ouml;hle herum. Und die Lemminge bestaunen mit
gro&szlig;en Kinderaugen die blitzenden Karosserie. Auf die Idee, die
Motorhaube zu &ouml;ffnen und all den Rost darunter zu entdecken, sind sie
aber noch nicht gekommen.</P>

<P>Und die Autoverk&auml;ufer sagen scheinbar wohlmeinend: Jetzt, wo ihr auch
unsere Autos habt, fehlen euch nur mehr die Stra&szlig;en dazu. Die
m&uuml;sst ihr aber schon selber bauen.</P>

<P>Und derzeit sieht es so aus, als ob die Lemminge alle Feuer und Flamme
sind, wie die wilden Stra&szlig;en zu bauen. Nur wird es dann in unserer
derzeitigen kleinen H&ouml;hle bald noch mehr stinken als in dem viel
gr&ouml;&szlig;erem n&auml;chsten Level mit den &uuml;bergewichtigen
Lemmingen.</P>

<P ALIGN=CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></P>

<P><B>Game Over</B></P>

<P>Vielleicht sollten die Lemminge durchaus ein paar Stra&szlig;en bauen,
damit die &uuml;bergewichtigen Lemminge aufh&ouml;ren zu sticheln,
da&szlig; man bei uns nicht Autofahren kann. Dann aber sollten sie sich
wieder dem widmen, was viele von ihnen in den letzten Jahren ohnehin immer
versucht haben: die Konstruktion des abgasarmen Hubschraubers. Der
mu&szlig; anfangs nicht einmal besonders kr&auml;ftig sein, weil uns
schlanke Lemminge tr&auml;gt er bald einmal.</P>

<P>Und vielleicht findet sich oben im Nebel an der Decke der finsteren
H&ouml;hle ein zweiter Ausgang zu einem anderen Level, wo man ansonsten
weder mit dem Auto noch zu Fu&szlig; hinkommen w&uuml;rde.</P>

<P>Vielleicht aber wird der abgasarme Hubschrauber nie existieren, und viele
kleine Lemminge st&uuml;rzen mit den Prototypen ab und brechen sich dabei
das Genick.</P>

<P>Vielleicht waren die Lemminge bisher wirklich nur zu dumm, den Ausgang in
den stinkenden n&auml;chsten Level zu finden, und tun sich jetzt Dank der
billigen Werbegeschenke und der farbenfrohen Reklame mit ihnen als direkte
Zielgruppe leichter.</P>

<P>Ganz sicher aber sollten sie sich dessen bewu&szlig;t sein, da&szlig; es
f&uuml;r sie derzeit genauso keine einfache L&ouml;sung gibt, wie es eine
solche auch in den letzten Jahren nicht gab. Nur gibt derzeit mehrere
m&ouml;gliche L&ouml;sungsans&auml;tze, &uuml;ber die Nachzudenken
nat&uuml;rliche mehr Aufwand erfordert, als nur jahrelang planlos durch die
H&ouml;hle zu sausen und sich dabei hemmungslos dem Selbstmitleid
hinzugeben. Oder in den Level mit den Autoverk&auml;ufern zu gehen.</P>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0036.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0035.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0037.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
