<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Kommentar: Nichts aus der Vergangenheit gelernt? (von Wolfgang Hosemann)

Am 23. Juni 2002 erreichte die Amiga-User in aller Welt einmal mehr ein 
Executive Update von AMIGA, Inc. Diesmal aber mit mehr oder weniger 
&uuml;berraschendem Inhalt.

Die &Uuml;berraschung war die, inzwischen vieldiskutierte, Ank&uuml;ndigung einer 
"early promotion"-Aktion. Es handelt sich dabei um die M&ouml;glichkeit, f&uuml;r USD 
50 (zahlbar per Kreditkarte) ein T-Shirt mit dem "I am Amiga"-Logo und 
einen Gutschein zu erwerben, der bei Kauf eines AmigaOne und/oder AmigaOS 4
angerechnet werden soll. Au&szlig;erdem w&uuml;rde man an einer Verlosung teilnehmen, 
bei der AmigaOne, Handys und Reisen zu gewinnen sind - dies aber erst ab 
einer bestimmten Anzahl von verkauften Gutscheinen. Inzwischen wurde das 
Angebot noch erweitert um eine Mitgliedschaft in einem "I am Amiga"-Club 
mit Newsletter und ggf. Einkaufserm&auml;&szlig;igungen. 

Zus&auml;tzlich haben sich am 02.07.2002 zwei Amiga-H&auml;ndler in Deutschland 
dieser Aktion angeschlossen und bieten die "early promotion"-Aktion auch 
f&uuml;r die User in Deutschland und Europa an. AMIGA, Inc. hatte n&auml;mlich 
geflissentlich &uuml;bersehen, dass eine derart gro&szlig;e Verbreitung von 
Kreditkarten wie in den USA im Euro-Raum nicht gegeben ist. Man wurde 
daraufhin erst mal mit Anfragen &uuml;berflutet, wie man an dieser Aktion denn 
auch ohne Kreditkarte teilnehmen kann. Die H&auml;ndler &uuml;bernehmen nun die 
Versorgung der "au&szlig;eramerikanischen" Amiga-User.
Zweck dieser ganzen Aktion ist, laut dem Executive Update, die Anzahl 
kaufwilliger Amiga-User weltweit festzustellen.

In den Diskussionsforen im WWW wurde kurz darauf deutlich, dass viele diese
Aktion anfangs f&uuml;r eine der altbekannten (und gehassten) 
Vorbestellungsaktionen hielten. Diese Art von Aktion hatte durch das 
Vorbestellungs-Desaster f&uuml;r die G3-Karten von phase5 traurige Ber&uuml;hmtheit 
erlangt.

Einer der Vorw&uuml;rfe, die einmal mehr in Richtung AMIGA, Inc. gingen, war, 
nichts aus der Vergangenheit gelernt zu haben. Einige der Beitr&auml;ge in 
diversen Foren sprachen auch von dem Versuch, den Usern Geld mit einem 
Vapor-Produkt aus der Tasche ziehen zu wollen.

AMIGA, Inc. ist in mehreren Erweiterungen des Executive Updates auf alle 
oben genannten Aspekte der Promotionsaktion eingegangen. Man stellte klar, 
dass man allen Usern weltweit die Teilnahme an dieser Aktion erm&ouml;glichen 
wolle und daher mit H&auml;ndlern in aller Welt Kontakt aufgenommen habe (in 
Deutschland ist das offensichtlich bereits geschehen). Den Vorwurf der
Vapor-Ware entkr&auml;ftete man mit dem Hinweis auf den bereits vorgef&uuml;hrten
AmigaOne. Der erstaunlichste Satz im letzten Update des Updates(!) war 
allerdings der Hinweis, dass man sehr wohl aus der Vergangenheit gelernt 
habe und die Fehler von damals nicht wiederholen wolle.

Nun, wie ist diese Aktion zu beurteilen?
Es ist nat&uuml;rlich unm&ouml;glich, die Zukunft hundertprozentig vorauszusehen. 
Bisher wissen wir nur, dass die "Strategie" von AMIGA, Inc. ziemlich
sprunghaft ist und Ank&uuml;ndigungen nicht vollst&auml;ndig verwirklicht wurden. 
Prominentestes Beispiel daf&uuml;r ist AmigaDE, und erinnert sich noch jemand an 
"AmigaOS x86" alias Amithlon?

Seit einiger Zeit scheint AmigaOS 4 zusammen mit dem AmigaOne erkl&auml;rtes 
Ziel von AMIGA, Inc. zu sein. Die Vorf&uuml;hrungen des AmigaOne, die 
Erl&auml;uterungen zum AmigaOS 4 und auch die Promotionsaktion scheinen dies zu 
best&auml;tigen.
Wie Bill McEwen erkl&auml;rte, dient diese dazu, die Anzahl der User weltweit 
und die Kaufkraft des Marktes festzustellen. Ob man den Hinweis auf die 
"riesigen Elektronikgesch&auml;fte" und diverse andere Unternehmen ernst nehmen 
muss, wird sich in der Zukunft zeigen.

Eines macht diese Erkl&auml;rung aber deutlich: Selbst die Eigent&uuml;mer des Amiga
wissen offensichtlich nicht genau, wie viele User es denn nun weltweit noch
gibt. 
Aber es gibt nat&uuml;rlich andere M&ouml;glichkeiten, die Anzahl der User zu 
ermitteln. Die Aktion mit einem Geldbetrag zu verbinden, l&auml;sst auf eine 
finanzielle Absicht hinter dieser Aktion schlie&szlig;en. Ob AMIGA, Inc. (immer 
noch) Probleme finanzieller Art hat, dar&uuml;ber l&auml;sst sich aber nur 
spekulieren.

Rechnen wir doch mal eben kurz:

Bei 2.500 ausgegebenen Gutscheinen à 50 US-Dollar k&auml;men wir auf einen 
Betrag von 125.000 US-Dollar, der AMIGA, Inc. zur Verf&uuml;gung st&auml;nde. Klingt 
im ersten Moment viel, aber sehen wir weiter...

Diese Anzahl ist der Startpunkt f&uuml;r die Verlosung von vier 
AmigaOne/AmigaOS4-Systemen mit einem voraussichtlichen Verkaufspreis von 
(grob gesch&auml;tzt) 800 US-Dollar.

800 mal 4 w&auml;ren 3.200 US-Dollar. Abz&uuml;glich dieses Betrages blieben dann 
121.800 US-Dollar &uuml;brig.

Abzuziehen w&auml;ren auch die T-Shirts, sagen wir mal 2 US-Dollar pro St&uuml;ck. 
Das w&auml;ren noch mal 5.000 US-Dollar weniger, also 116.800 US-Dollar.

Nicht zu vergessen sind auch die nun angek&uuml;ndigten Erweiterungen der 
Aktion, Newsletter usw. Daf&uuml;r fallen nat&uuml;rlich auch Kosten an, sch&auml;tzen wir 
mal 2.500 US-Dollar, damit w&auml;ren wir bei 114.300 US-Dollar.

Dieser Betrag k&ouml;nnte also von AMIGA, Inc. dazu eingesetzt werden, um die
Gesch&auml;fte weiterzuf&uuml;hren. Es kann aber davon ausgegangen werden, dass das 
Unternehmen finanziell an der Entwicklung/Fertigung des AmigaOne beteiligt 
ist. Dass so etwas m&auml;chtig ins Geld geht, brauche ich wohl niemandem extra 
zu erl&auml;utern. Da sind die etwas mehr als 100.000 US-Dollar ein nicht mehr 
so gro&szlig;er Betrag. Es ist daher eher fraglich, ob tats&auml;chlich finanzielle 
Probleme der Grund f&uuml;r diese Aktion sind. 
Wenn aber doch finanzielle Probleme bestehen sollten, so sind es zumindest
keine Probleme extremer Gr&ouml;&szlig;enordnung. Es sieht eher so aus, als w&auml;re 
AMIGA, Inc. mehr oder weniger dazu gezwungen, eine weitergehende 
Vermarktung des AmigaOS4/AmigaOne an Dritte vorzufinanzieren (vielleicht 
die "riesigen Elektronikgesch&auml;fte", die im Executive Update erw&auml;hnt 
werden?).

Man kann jetzt nat&uuml;rlich sagen, dass es sich dann wohl doch um eine 
Vorfinanzierungsaktion à la phase5 handelt. Dagegen spricht allerdings die
Existenz des angek&uuml;ndigten Produkts und die Involvierung mehrerer 
Beteiligter in dieses Projekt (Eyetech, Hyperion, externe Entwickler).

Der Hinweis auf die Notwendigkeit der Ermittlung der User-Zahlen liefert
ein weiteres wichtiges Indiz bez&uuml;glich des Status des Projekts 
AmigaOS4/AmigaOne. Um dieses finanziell erfolgreich gestalten zu k&ouml;nnen, 
m&uuml;ssen AMIGA, Inc. und die Partner  einen Rechenansatz haben. Es muss 
ermittelt werden, wie viele Einheiten abgesetzt werden k&ouml;nnen. Schlie&szlig;lich 
entscheidet die Zahl der Einheiten &uuml;ber die Preiskonditionen bei der 
Herstellung und dem Einkauf der Einzelteile. Es scheint also einen 
konkreten Bedarf f&uuml;r diese Zahlen zu geben.

Die Anzahl der (theoretisch) absetzbaren Einheiten ist wiederum ein 
wichtiger Faktor f&uuml;r die Attraktivit&auml;t des "Marktes" Amiga. Mit konkreten 
Zahlen &uuml;ber die Anzahl der User weltweit l&auml;sst sich potenziellen 
Marktinteressenten aufzeigen, dass es gesch&auml;ftlich attraktiv sein kann, in 
Produkte f&uuml;r den Amiga zu investieren. Ich denke, man kann davon ausgehen, 
dass solche Interessenten existieren (wenn auch nicht unbedingt "riesige 
Elektronikgesch&auml;fte") und dass diese das Produkt AmigaOS4/AmigaOne 
begr&uuml;&szlig;en.

AMIGA, Inc. erschl&auml;gt mit dieser Aktion also mehrere Fliegen gleichzeitig: 
Eine (eher geringf&uuml;gige) Vorfinanzierung der Produktions- und Folgekosten 
(Vermarktung, Werbung) sowie Anziehung neuer Produzenten von Hard- und 
Software und somit Einnahmen (z.B. durch Lizenzen). Des weiteren sondert 
man sich von der Markt-internen Konkurrenz ab, die f&uuml;r potenzielle 
Investoren vorerst keine voraussichtlichen Absatzzahlen liefern kann. Nicht 
zu vergessen w&auml;re auch, dass der Name Amiga durch diese Aktion eine gr&ouml;&szlig;ere 
Bekanntheit erreichen kann (ich sage kann, da die Auswirkungen der 
Promotionsaktion auf die Nicht-Amiga-User noch nicht abzusch&auml;tzen sind).

Eigentlich w&auml;re das Ganze also eine sinnvolle Aktion, aber ein schaler 
Beigeschmack bleibt: Die leidvollen Erfahrungen aus der Vergangenheit. 
AMIGA, Inc. t&auml;te daher gut daran, diese Aktion wirklich bis zum Schluss 
(Ver&ouml;ffentlichung AmigaOS4/AmigaOne, Vergabe der Preise) durchzuziehen und 
den eingeschlagenen Weg weiterzugehen. 
Davor w&auml;re eine weiter verst&auml;rkte &Ouml;ffentlichkeitsarbeit in Bezug auf 
AmigaOS4/AmigaOne angebracht, um den Usern definitiv zu zeigen, dass 
AmigaOS4 und AmigaOne keine Vapor-Ware sind. Wie w&auml;re es z.B. mit einer 
lauff&auml;higen Vorf&uuml;hrung auf der AmiWest 2002?

Des weiteren w&auml;re es angebracht, dass AMIGA, Inc. diese Aktion dazu nutzt, 
im gesamten Auftreten endlich professionell zu werden. Das Heckmeck um 
Amithlon in der ersten Version (war zuerst im Sinne von AMIGA, Inc., dann
wieder nicht) und nun in der zweiten Version (ist jetzt im Sinne von AMIGA, 
Inc., demn&auml;chst vielleicht wieder nicht?), die einstige Bevorzugung des 
AmigaDE, nun des AmigaOS 4 & AmigaOne sowie die scheinbare 
Interesselosigkeit bez&uuml;glich der Anwenderschaft und potenzieller Investoren 
hinterlie&szlig;en bisher nur den Eindruck eines Unternehmens, das von 
chaotischen Amateuren gef&uuml;hrt wird.

Nun ist die wahrscheinlich letzte Gelegenheit gekommen, allen zu zeigen, 
dass man nicht nur Spr&uuml;che klopft, sondern tats&auml;chlich aus der 
Vergangenheit gelernt hat und etwas bewegen kann.

Wolfgang Hosemann &lt;whose@gmx.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
