<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. Erstes neues Executive Update von AMIGA-CEO Bill McEwen 

Das folgende Executive Update von AMIGA-CEO Bill McEwen wurde von Lesern 
unseres Partners amiga-news.de &uuml;bersetzt und uns freundlicherweise f&uuml;r eine 
Ver&ouml;ffentlichung zur Verf&uuml;gung gestellt. Der Text ist auch unter der URL 
http://www.amiga-news.de/de/news/AN-2002-06-00222-DE.html zu finden.


»Eine Nachricht an die Community

Bill McEwen - 23. Juni 2002 

Eine Nachricht an die derzeitige, ehemalige und zuk&uuml;nftige Amiga Community: 

Ich m&ouml;chte Ihnen allen zuerst daf&uuml;r danken, dass Sie Ihre Anteilnahme 
ausdr&uuml;ckten und Ihren Beistand f&uuml;r Gary Peake und seine Familie bekundeten, 
als seine Herzattacke bekannt wurde. Ich kann Ihnen mitteilen, dass Gary 
sich darauf freut, im Laufe der n&auml;chsten Wochen an seine Arbeit 
zur&uuml;ckzukehren. Er hat versucht, E-Mails vom Krankenhaus zu versenden 
(w&auml;hrend einem Einwahlversuch dachte er, dass das Piepen des Herzmonitors 
die LOGON-T&ouml;ne seines Modems w&auml;ren), allerdings war das Personal in der 
Lage, ihn mit Beruhigungsmitteln von seinem Computer fernzuhalten. Ich 
m&ouml;chte jedem von Ihnen im Namen Garys und seiner Familie f&uuml;r Ihre Art der 
Unterst&uuml;tzung pers&ouml;nlich danken. 

Es ist eine aufregende Zeit f&uuml;r den Amiga und die Gemeinschaft. Sie waren 
alle geduldig, verst&auml;ndnisvoll und haben mehr Fehlinformationen und 
Ger&uuml;chte vernommen, als irgendeine andere Gruppe von Usern. Jetzt bewegen 
wir uns vorw&auml;rts und gewinnen Kraft. Zugegebenerma&szlig;en haben wir &uuml;ber viele 
unserer Pl&auml;ne und Aktivit&auml;ten bis jetzt nicht viel verbreitet. Aber es gibt 
viele Pl&auml;ne, und wir freuen uns, diese an die Gemeinschaft weitergeben zu 
k&ouml;nnen. 

Eine Bitte: Wenn Sie diese Neuigkeiten f&uuml;r ebenso positiv wie wir halten, 
dann teilen Sie diese mit Ihren Freunden und Bekannten. Geben Sie die 
Neuigkeiten an Menschen weiter, von denen Sie wissen, dass diese Interesse 
am Amiga haben, welche aber nicht so genau die Nachrichten verfolgen. Sagen 
Sie ihnen, dass neue, interessante und sehr wichtige &Auml;nderungen in der Luft 
liegen: dass reale M&ouml;glichkeiten der Amiga-Gemeinde bald zur Verf&uuml;gung 
stehen werden. 

Wir sehen und h&ouml;ren t&auml;glich Reklameschwindel. Wir erkennen es direkt, 
manchmal instinktiv. Aber was Sie hier lesen, ist keine Reklameschwindel. 
Dies sind zutreffende und tragbare Tatsachen. Die Realit&auml;t. Wir k&ouml;nnten 
nicht so durchg&auml;ngig weiterarbeiten, jene Leute zu unterst&uuml;tzen, die daran 
arbeiten, ein reales Produkt zu entwickeln, wenn es keine greifbaren 
Ergebnisse geben w&uuml;rde. 

Haben Sie bemerkt, wie unabl&auml;ssig wir das Wort "real" benutzen? Gut, denn 
was Ihnen dieses Update sagen m&ouml;chte, ist real. 

Ziemlich freudig genie&szlig;e ich die fast t&auml;glichen Updates, die zeigen, wo 
sich Amigas bei Arbeit und Spiel befinden. Ich finde es aufregend 
herauszufinden, wie einige Amithlon benutzen, um Amigas wieder zur 
Anwendung zu bringen. Ich sehe neue Verk&auml;ufe, eine neue Wahrnehmung der 
Chancen und einen neuen Geist auftauchen. Einen Geist, der die herk&ouml;mmliche 
Gedanken herausfordert, und uns bei Amiga t&auml;glich neu herausfordert. Wir 
sind f&uuml;r Sie da. Ihrem Wunsch nach neuen Amiga-Produkten, Ihrem Wunsch 
diese Plattform lebendig und mit richtungsweisenden Konzepten 
weiterzuentwickeln, damit diese Plattform nicht beiseite gefegt wird. Dies 
hat unseren Wunsch gest&auml;rkt, Erfolg zu haben und weiter zu wachsen. 

Nun lasst uns die &Auml;rmel aufkrempeln und loslegen. Wir haben Ihnen eine 
Menge Neues mitzuteilen: 


Amiga Party Pack-K&auml;ufer? Dies ist f&uuml;r Sie! 

Jeder von Ihnen hat sein Party Pack erhalten, und in n&auml;chster Zukunft 
werden Sie die Erm&auml;&szlig;igungen nutzen k&ouml;nnen, die mit dem Kauf Ihres Party 
Packs verbunden sind. Jeder wird eine E-Mail erhalten, die Ihnen die 
M&ouml;glichkeiten erkl&auml;rt, und der Vorgang ist einfach: 

1. Sie k&ouml;nnen die Produkte zum erm&auml;&szlig;igten Preis direkt bei Amiga kaufen, 
und sie werden Ihnen direkt ins Haus geliefert. 

oder 

2. Wenn Sie entweder den AmigaOne mit OS 4.0 oder nur OS 4.0 gekauft haben, 
senden Sie uns eine Kopie der Rechnung mit dem Deckblatt des SDK-
Handbuches, und Amiga wird Ihnen einen Scheck &uuml;ber 100 $ zukommen lassen! 

oder 

3. Nennen Sie uns den H&auml;ndler, bei dem Sie zu kaufen beabsichtigen, und wir 
werden die 100 $ mit ihm verrechnen, so dass Sie sich um nichts weiter 
k&uuml;mmern m&uuml;ssen. 

Wahrlich kein schlechtes Gesch&auml;ft. Jeder hat die Chance gehabt, mit AmigaDE 
zu arbeiten, und viele wurden Entwickler der Amiga Anywhere-Inhalte 
aufgrund des Party Packs. Nun k&ouml;nnen Sie bald 100 $ zur&uuml;ckbekommen, wenn 
Sie ein neues AmigaOne System kaufen. 


AmigaOne und AmigaOS 4.0? Update 

Wir sind mehr als beeindruckt von der Reaktion auf die AmigaOS 4.0 
Screenshots, und auf die Demonstration der AmigaOne Boards. Wir haben 
manchmal Schwierigkeiten zu verstehen, wie uns so viele Interessenten der 
Amiga Plattform und Interessierte an unseren Bem&uuml;hungen, sie in den Markt 
zur&uuml;ckzubringen, so lange verborgen bleiben k&ouml;nnen. Wie auch immer, 
Tatsache ist, dass wir gewisse Produktionsentscheidungen treffen m&uuml;ssen, 
die auf einem zuk&uuml;nftigen Verkaufsvolumen basieren, und wie schnell wir 
einen Ertragsgewinn der Investitionen erhalten k&ouml;nnen. So ist Business eben 
[101 ?]. Deshalb ist eine unserer Schwierigkeiten, &uuml;ber die Anzahl der zu 
fertigenden Einheiten zu entscheiden, und dann sehen wir aufgrund von Web 
Hits und direkten Nachfragen, dass es f&uuml;nfmal mehr Leute da drau&szlig;en gibt, 
die am AmigaOne Interesse haben, als uns bekannt war. Sie k&ouml;nnen das unter 
'&Uuml;ber unseren Erwartungen' einordnen. 

AmigaOS 4.0 wird viele Features enthalten, die eigentlich f&uuml;r sp&auml;tere 
Versionen des AmigaOS Desktop geplant waren. Da es notwendig war, bestimmte 
Teile des Codes neu zu schreiben, hat das Hyperion-Team sich entschieden, 
vorw&auml;rts zu marschieren und in das OS 4.0 einen gro&szlig;en Teil der erst f&uuml;r OS 
4.1 und OS 4.2 geplanten Features einzubringen. Ben Hermans und und sein 
Team haben gute Arbeit geleistet, indem sie uns mit Screenshots, neuen 
Produkt-Features und den derzeitigen Entwicklungs-Roadmaps auf dem 
Laufenden gehalten haben. Ich wei&szlig;, dass wir von Ben und Hyperion sehr bald 
mehr Updates bekommen werden, bezogen auf die reale Entwicklung und auf 
Feature-Details; und vertraut mir, wenn ich sage, dass wir diese 
Einzelheiten bis auf das letzte Bit mit der Community teilen werden. Im 
Moment k&ouml;nnen wir aufgrund unserer letzen Telefonkonferenz mit dem AmigaOS 
4.0 Team bei Hyperion den au&szlig;ergew&ouml;hnlichen Fortschritt sehen; und die 
Featuresammlung, die in diesem Release enthalten ist, ist fantastisch. Dies 
wurde durch Sie, die Amiga Community, vorangetrieben, und ich wei&szlig;, dass 
Sie alle sehr gl&uuml;cklich sein werden. 

Die AmigaOne-Boards sind in den H&auml;nden der AmigaOne-Entwickler und die 
Intregrationsarbeit geht schnell voran, but with the full realization that 
rushing the release to the public will afford no one any real benefits. 
[Rest des Satzes ist noch zu &uuml;bersetzen, da nicht klar, was gemeint ist.] 
Alan und sein Team bei Eyetech haben gute Arbeit geleistet, den "Preis im 
Auge zu behalten". Wir sind wirklich froh, dass die Hardware dort raus ist, 
und dass die Amiga Community, die nach einer langen, langen Zeit erste neu 
f&uuml;r sie entwickelte Hardware - mit ihrem eigenen Betriebssystem - erhalten 
wird. 

Dies sind wirkliche Amiga-Produkte von Amiga und ihren mitverbundenen 
Partner-Gesellschaften. Ja, es hat l&auml;nger gedauert als jeder von uns 
vorhergesehen hat. Auch haben wir Ihre Erwartung und, ja, Ungeduld geteilt, 
aber einige Dinge k&ouml;nnen nur auf einem Wege getan werden: dem richtigen 
Weg. Nachdem das gesagt wurde, wissen wir, dass die Ergebnisse sich sehen 
lassen k&ouml;nnen, und es wert sind, mit Ihren Freunden und anderen Mitgliedern 
der Amiga-Familie geteilt zu werden. 

Die Amiga Community wird bald eine brandneue Plattform bekommen. Sie werden 
bald mit dem raffiniertesten Amiga-Betriebssystem arbeiten, das je 
entwickelt wurde. Es bedarf gro&szlig;er Sorgfalt und Aufmerksamkeit, um es 
richtig hinzubekommen, mit den Features und N&uuml;tzlichkeiten, die Sie, die 
Community, uns als W&uuml;nsche f&uuml;r einen neuen Amiga mitgeteilt haben. Trotzdem 
gibt es eine betr&auml;chtliche Schwierigkeit, die Hand in Hand mit all diesen 
Aktivit&auml;ten geht, und wir brauchen Ihre Unterst&uuml;tzung, indem Sie uns 
helfen, einen Entschluss bez&uuml;glich gewisser Gesch&auml;ftsentscheidungen zu 
treffen, die im Folgenden sehr deutlich gemacht werden. 

Amiga Anywhere/AmigaDE? Warum gibt's da zwei? 

Da braucht es eine Aufkl&auml;rung bzgl. dieser beiden Produkte: Amiga Anywhere 
ist ein Unterprodukt des kompletten AmigaDE. In Gespr&auml;chen mit K&auml;ufern und 
potenziellen Partnern haben wir gelernt, dass sie nach Inhalten suchen, 
nicht dem kompletten DE f&uuml;r ihre Umgebungen. Die Idee war einen so 
minimalen Aufbau (Anm.: des DE) wie m&ouml;glich f&uuml;r ihre Ger&auml;te zu haben. Also 
kreierte Amiga die Amiga Anywhere Content Engine. Dies ist eine Serie von 
einfachen Produkten, die die Bin&auml;rportabilit&auml;ts-Attribute des kompletten DE 
bieten, w&auml;hrend auf der anderen Seite die Features und Produkte in einer 
kleineren Form geliefert werden (Anm.: nicht zwangsweise Features des DE 
werden herausgenommen). Die Entwicklung schreitet z&uuml;gig voran mit diesen 
Produkten und wir bieten zurzeit eine Amiga Anywhere Content Engine f&uuml;r 
PocketPC und Pocket PC Phone edition Ger&auml;te, in K&uuml;rze auch f&uuml;r Smartphone, 
Embedded Linux, und Symbian Ger&auml;te an. Dies wird es erm&ouml;glichen AACE-
Inhalte auf allen diesen verschiedenen Produkten und Ger&auml;ten laufen zu 
lassen und Amiga einem gr&ouml;&szlig;eren Publikum n&auml;her zu bringen. 

Die Entwicklung geht ziemlich gut an beidem voran, dem kompletten DE und 
AACE und Sie werden einige Ank&uuml;ndigungen von neuen Partnern in der n&auml;chsten 
Zeit erleben. 

Es gibt noch eine andere Frage zum aktuellen Amiga Entertainment Pack f&uuml;r 
PocketPC-Ger&auml;te und warum es daf&uuml;r nur so wenige Inhalte gibt. Der Grund 
ist, weil wir eine Art Spielekonsolen-Erfahrung in diesem ersten Release 
kreieren wollten, so wurde das Ganze designed. Die Idee war eine Karte in 
ein Ger&auml;t einzustecken und einfach ein Spiel zu spielen ohne die Ressourcen 
des relativ geringen Speichers im Ger&auml;t zu benutzen. 

Es wird einen aufregenden Promotion/Contest geben, der im Laufe der Woche 
noch angek&uuml;ndigt wird bez&uuml;glich des AACE und des Entertainment Packs. Wir 
versichern Ihnen, dass dies eine spa&szlig;ige Sache wird und werden weiter 
voranschreiten denen Amiga n&auml;her zu bringen, die derzeit PocketPC und 
PocketPC Phone Edition Ger&auml;te benutzen. 

Amithlon Update? Ja, es gibt ein Update!! (Cue Trumpets!) 

Wir sind sehr froh anzuk&uuml;ndigen, dass wir in Verhandlungen eingetreten 
sind, und ja, sie wurden bez&uuml;glich Amithlon von Bernd Meyer unterzeichnet. 
Tats&auml;chlich sind wir nun seit einigen Wochen dabei, eine neue Version 
intern zu testen, und es ist ein gro&szlig;artiges Produkt. Wie Sie sich erinnern 
werden, war ich der Erste, der Amithlon der &Ouml;ffentlichkeit vorstellen 
konnte, und zwar auf der AmiWest 2001 Show, und die Reaktion der Leute dort 
war einfach verbl&uuml;ffend. Seitdem sehen wir den Einsatz von Amithlon an 
vielen neuen Orten, wo einst Amigas beheimatet waren, und wir sehen in 
Amithlon ein neues Leben f&uuml;r Amiga. Bitte nehmen Sie zur Kenntnis, dass wir 
mit Bernd schon mehrere Monate zusammengearbeitet haben, und wir Amithlon 
als ein gro&szlig;artiges Produkt betrachten, mit einer langen, stabilen Zukunft 
f&uuml;r Amiga und Bernd. Sie k&ouml;nnen die Pressemitteilung hier (in dieser 
Ausgabe von AMIGA aktuell) einsehen. 

Die Herausforderung und die M&ouml;glichkeit 

Bevor die N&ouml;rgler dort drau&szlig;en anfangen, sich dar&uuml;ber zu beschweren und 
unh&ouml;fliche Laute von sich geben, will ich die uns bevorstehende reale Lage 
erkl&auml;ren: Es muss klar sein, dass Amiga durch das Folgende kein Geld 
verdient. Tats&auml;chlich werden wir Geld verlieren, so wie mit den Party Packs 
geschehen. Dennoch hat es uns erlaubt, unseren Investoren zu zeigen, dass 
wir den Weg, einen neuen Amiga-Rechner zu bauen, weiter verfolgen sollten. 
Nun sind wir wieder auf demselben Kreuzweg, aber diesmal ist es 
gewisserma&szlig;en komplizierter. 

Wie viele AmigaOnes werden wir bauen und bestellen? 

Wir m&uuml;ssen die AmigaOne-Produktion richtig planen, finanzieren, und wissen 
wie viele wir f&uuml;r die Produktion bestellen m&uuml;ssen. Um das alles abw&auml;gen zu 
k&ouml;nnen, mussten wir uns einen Weg einfallen lassen, der uns Aufschluss 
dar&uuml;ber gibt, wie viele Einheiten wir bestellen, bauen und supporten 
m&uuml;ssen. Sie ahnen es bestimmt. 

Einige sagten uns, wir sollen mit 2.500 bis 3.500 St&uuml;ck rechnen... Wie auch 
immer, &uuml;ber 50.000 Mal wurden die OS4-Screenshots heruntergeladen. Und das 
waren nicht 50.000 Zugriffe auf die Seite, sondern 50.000 verschiedene 
Menschen. Dann waren da noch andere unter Ihnen, die sagten, dass wir uns 
auf 10.000 St&uuml;ck vorbereiten sollen. Das w&auml;re nat&uuml;rlich sehr gut, da 
gr&ouml;&szlig;ere Auflagen sich wesentlich &ouml;konomischer herstellen lassen, und von 
einer 10.000er Auflage alle Beteiligten beg&uuml;nstigt w&uuml;rden. Sie haben 
gesehen, wie Chip-Preis-Kalkulationen gehandhabt werden: Wenn du eine 
10.000er Marge bestellst, erreichst du einfach ein wesentlich besseres 
Preissegment, die Preise fallen mit steigender Absatzmenge. Es wird f&uuml;r 
jeden g&uuml;nstiger. 

Dann haben wir herausgefunden, dass es gegenw&auml;rtig 30.000 Abonnenten Amiga-
bezogener Zeitschriften gibt. Dazu kommt der Fakt, dass wir wissen, dass da 
drau&szlig;en Tausende sind, welche einfach schweigen, gucken und abwarten, was 
mit dem AmigaOne passiert, bevor sie sich &uuml;berhaupt als Interessent melden. 
Zudem haben wir letzte Woche erfahren, dass eine sehr gro&szlig;e europ&auml;ische 
Elektronik-Kette interessiert ist, die Linie wieder in ihr Angebot 
aufzunehmen, wenn das Interesse an den neuen Produkten gro&szlig; genug ist. 


Wie Sie also sehen k&ouml;nnen, liegt eine wahrhaftige Streitfrage vor uns: 

Wir m&ouml;chten nicht zu eng kalkulieren, um Sie, die Benutzer zu versorgen, 
und doch wird es zunehmend schwieriger zu entscheiden, wie viele AmigaOnes 
wir bauen sollten. Sie k&ouml;nnen wie wir sagen, dass es einen ziemlich gro&szlig;en 
Abstand zwischen den ganzen Zahlen gibt. Wir m&ouml;chten jedoch sicherstellen, 
dass wir die Produkte in ausreichender St&uuml;ckzahl fertig haben, wenn Sie sie 
haben wollen, einfach damit Sie nicht warten m&uuml;ssen. Wir m&ouml;chten 
andererseits auch nicht zu viel produzieren. Wir dachten deshalb dar&uuml;ber 
nach, eine Umfrage zu starten, aber wir wissen, dass es einige gibt, die 
versuchen werden, heimt&uuml;ckisch die Ergebnisse zu verf&auml;lschen. Das k&ouml;nnte 
und w&uuml;rde uns in Bezug auf das Release von AmigaOne/Amiga OS 4.0 
wahrscheinlich eine neue Reihe von neuen Problemen bereiten. 

Also haben wir uns entschieden, ein wenig Spa&szlig; mit dieser Umfrage zu haben, 
und glauben daran, einen Weg gefunden zu haben, an dem jeder teilhaben kann 
und welcher uns wirkliche Zahlen liefern wird, und der bessere M&ouml;glichkeit 
bietet, unser Budget und die realen Intensionen der Gemeinschaft 
einzusch&auml;tzen. 

Mit einem kleinen Tusch, hier ist das, was wir tun werden: 

Die AmigaOne/AmigaOS 4.0 "Free Stuff" Vorab-Promotion-Aktion (ziemlich 
einfach): 

Und so funktioniert es: 

Kunden, die Interesse am Kauf eines AmigaOne mit vorinstalliertem AmigaOS 
4.0 haben, werden in der Lage sein, einen 50.00 $-Coupon f&uuml;r 50.00 $ zu 
erstehen! Auf diesem Weg bekommen wir einen guten &Uuml;berblick dar&uuml;ber, wie 
viele Boards wir produzieren m&uuml;ssen. 

Nicht genug sagen Sie? Okay, wie w&auml;re es hiermit: Mit jedem 50.00 $-
Einkaufsgutschein erhalten Sie ein kostenloses Shirt mit der Aufschrift f&uuml;r 
jedermann, dass Sie ein Teil der Zukunft sind. Somit bekommen Sie f&uuml;r 50.00 
$ einen 50.00 $-Gutschein und ein gratis Shirt. 

Noch nicht genug? Okay wie w&auml;re es hiermit: Wenn wir 2.500 Bestellungen 
erreichen, verlosen wir 4 gratis AmigaOne/AmigaOS 4.0 Systeme. 

Ich denke mal, es gibt da ein paar mehr von Ihnen da drau&szlig;en, somit: 
sollten wir 5.000 Bestellungen erreichen, werden wir 10 AmigaOne/AmigaOS 
4.0 Systeme verlosen. Geeeeeenauso.. 10 Leute, die einen Einkaufsgutschein 
bestellen, erhalten ein Shirt und ein komplettes AmigaOne/AmigaOS 4.0 
System ... kostenlos. Das hei&szlig;t kostenlos. Wie kostenlos halt. Keine 
Kosten. Ein urspr&uuml;nglicher Preis, tot am Boden seines K&auml;figs. Oder so etwas 
in der Art. 

Es gibt ein paar Optimisten im B&uuml;ro, die glauben, dass es dort 10.000 Leute 
gibt, die auf das erste Amiga-System seit mehr Jahren als wir z&auml;hlen 
k&ouml;nnen, warten. Wenn wir also 10.000 Bestellungen bekommen, gibt es 20 
AmigaOne/AmigaOS 4.0 Systeme und 5 Amiga-Telefone! 

Einer geht noch: Wenn wir 25.000 Bestellungen erreichen, wird Amiga 50 
Amiga-Systeme, 15 Amiga-Telefone und eine Reise f&uuml;r zwei nach Hawaii oder 
Florida verlosen. 

OK einer noch - schaffen wir 50.000 Bestellungen, dann wird Amiga 100 
Systeme, 100 Amiga-Telefone und 3 Reisen f&uuml;r Zwei nach Hawaii oder Florida 
verlosen. 

Bei &uuml;ber 50.000 Bestellungen kommen wir mit etwas noch Besserem, denn in 
diesem Level k&ouml;nnen wir der Welt beweisen, was Sie uns seit einiger Zeit 
schon erz&auml;hlten, dass Amiga ein schlafender Riese ist, bereit zum Erwachen, 
um seinen rechtm&auml;&szlig;igen Platz an der Spitze einzunehmen. 

Die Telefone und die Amiga-Systeme werden ausgeliefert, sobald Sie 
verf&uuml;gbar sind. 

Sollten Sie die Verlosung nicht gewinnen, k&ouml;nnen Sie immer noch Ihren 
Coupon, Ihr Shirt tragend, zum &ouml;rtlichen Amiga-H&auml;ndler bringen, und Sie 
erhalten 50.00 $ Verg&uuml;nstigung beim Kauf eines neuen Systems. (Amiga-
H&auml;ndler: Wir schicken Ihnen Details, wie die ganze Aktion funktionieren 
wird). 

Da wir uns jetzt um die Bestellungen in nicht allzu ferner Zukunft k&uuml;mmern 
m&uuml;ssen, l&auml;uft diese Aktion von heute (Anm.: 23.06.2002) bis zum 7. Juli 
2002, wobei die Gewinner auf der AmiWest in Sacramento bekannt gegeben 
werden. 

Klicken Sie hier (http://amiga-anywhere.com/shop.php?prod_id=41), um zur 
AmigaOne,/AmigaOS 4.0 Vorab-Promotion-Aktion zu gelangen. 

Da ich wei&szlig;, dass einige Leute wieder unversch&auml;mte Sachen von sich geben 
werden, und alle m&ouml;glichen Arten von Anspr&uuml;chen stellen werden, w&auml;hrend 
andere versuchen werden, dies als Methode zu nutzen, um die Gemeinde weiter 
auseinander zubringen, hoffe ich, dass der Rest von Ihnen, die Mehrheit, 
sehen kann, wohin wir mit diesen News und der Promotion-Aktion zusammen 
gehen k&ouml;nnen. Entwickler werden dieses System als ein System betrachten, 
f&uuml;r das sie den Wunsch versp&uuml;ren zu entwickeln und andere, die gingen, 
werden schauen, ob sie zum Entwickeln an die Amiga-Plattform zur&uuml;ckkehren 
m&ouml;chten. Das Risiko ist da, aber wir k&ouml;nnen uns ihm gemeinsam 
entgegenstellen und Erfolg haben. 

AmigaOne und OS 4.0 sind der Aufbruch in eine neue Zukunft und das ist 
real. 

All jene von Ihnen, die daran denken, an der AmiWest 2002 in Sacramento CA 
teilzunehmen, bitte kommen Sie und seien Sie wie ich dabei. Es macht gro&szlig;en 
Spa&szlig; herauszufinden, ob es im Publikum einen Gewinner geben k&ouml;nnte. Es ist 
auch einer der ganz gro&szlig;en Belohnungen meines Berufs, Sie zu treffen, die 
Mitglieder der Amiga-Gemeinschaft. Sie wissen zudem nie, was ich ank&uuml;ndigen 
werde und wir k&ouml;nnten einige ziemliche &Uuml;berraschungen zu bieten haben. 

Oder ich h&auml;ng einfach nur am Buffet herum. :-D 

Es ist an der Zeit, ein wenig Spa&szlig; zu haben! 

Amiga. Isn't it great? 


&Uuml;bersetzer: Volker Reinhardt, Armin H&uuml;bner, Frank Gutschow und Michael Asse 


Update - 26.06.2002:

F&uuml;r den Fall, dass Sie &uuml;ber keine Kreditkarte verf&uuml;gen, aber an der Aktion 
teilnehmen m&ouml;chten, hat Gary Peake mitgeteilt, dass es auch m&ouml;glich ist, 
bei der Bank Ihrer Wahl eine Art "Money-Order" zu kaufen, und diese per 
Post nach Amerika zu senden. (Details finden Sie hier [http://www.amiga-
news.de/de/news/comments/53480.html]). 

Ich habe mich mit unserer Hausbank dar&uuml;ber unterhalten. Zun&auml;chst g&auml;be es 
die preiswerteste L&ouml;sung, ganz normale Reisechecks bei der Bank Ihrer Wahl 
zu kaufen, und unterschrieben nach Amiga Inc. zu senden (am besten per 
Einschreiben). Es besteht allerdings trotzdem das Risiko des Verlusts auf 
dem Postwege - jeder Dieb oder "Finder" kann den Reisescheck, ohne Spuren 
zu hinterlassen, &uuml;berall einl&ouml;sen. 

Eine andere M&ouml;glichkeit ist eine internationale &Uuml;berweisung, die jedoch bei 
50 $ unverh&auml;ltnism&auml;&szlig;ig teuer wird. Gleiches gilt f&uuml;r das Einsenden von 
Schecks, die Kosten sind bei 50 $ ebenfalls enorm hoch (je ca. 13,- EUR). 
Falls sich noch weitere M&ouml;glichkeiten ergeben, werde ich diese hier bekannt 
geben.

Petra Struck &lt;ps@amiga-news.de&gt;«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
