<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Zweites neues Executive Update von AMIGA-CEO Bill McEwen 

Das folgende Executive Update von AMIGA-CEO Bill McEwen wurde von Lesern 
unseres Partners amiga-news.de &uuml;bersetzt und uns freundlicherweise f&uuml;r eine 
Ver&ouml;ffentlichung zur Verf&uuml;gung gestellt. Der Text ist auch unter der URL 
http://www.amiga-news.de/de/news/AN-2002-07-00003-DE.html zu finden.


»Erkl&auml;rungen zur Promotionaktion und Update

Bill McEwen - 1. Juli 2002 

Gr&uuml;&szlig;e an alle und jeden Einzelnen, und ein gro&szlig;es Dankesch&ouml;n an all 
diejenigen unter Ihnen, die an der Promotionsaktion teilgenommen haben (und 
die, die hoffentlich noch teilnehmen werden). Ich habe hier einige Punkte, 
die ich noch kl&auml;ren m&ouml;chte, und einmal mehr den Wunsch, Ihnen allen die 
Sachlage klar und ehrlich darzulegen. 

Fangen wir also an: 

Eine sehr oft gestellte Frage war: "Warum machen Sie diese 
Promotionsaktion?" 

Diese Promotion ist keine Vor-Verkaufsaktion f&uuml;r AmigaOnes oder AmigaOS4.0. 
Wir vorverkaufen diese Produkte in keinster Weise. Andere Firmen haben von 
Ihnen Vorauszahlungen f&uuml;r Produkte genommen, welche Sie nie erreicht haben. 
Wir tun das jetzt nicht, noch wollten wir es jemals tun. Wir haben uns von 
der Geschichte eines Besseren belehren lassen, und sind auch nicht gewillt, 
die Fehler der Geschichte zu wiederholen. Das AmigaOne Motherboard 
existiert auf jeden Fall, ist keine Vaporware. Es wurde gezeigt, es ist in 
Benutzung, und es wird zur Hardware- und Softwareentwicklung genutzt. Ich 
bin mir sicher, dass - sobald sich die Nachricht nach der Messe in 
Frankreich vom letzten Wochenende weiter verbreitet hat - die gro&szlig;e 
Mehrheit von Ihnen sehr zufrieden mit dem gezeigten Entwicklungs- und 
Produktionsfortschritt des AmigaONE sein wird; und Sie werden wissen, dass 
alles sehr "real" ist. 

Bei dieser Aktion geht es auch nicht um Vorabverkauf des AmigaOS 4.0. Sie 
haben die Bildschirmfotos gesehen, es ist in den H&auml;nden der Entwickler und 
ich bin "excited" dar&uuml;ber, (ja, ich habe das "e"-Wort SCHON WIEDER benutzt, 
aber hey, ich BIN BEGEISTERT, weil wir alle hier sind, und uns das Recht 
erworben haben, begeistert zu sein!), wie gut dieses Projekt vorankommt. OS 
4.0 wird auf anderen PPC-Produkten neben dem AmigaOne laufen, wie den 
CyberStorm- und Blizzard-PPC-Beschleunigerkarten. Das ist so, weil Sie, die 
Mitglieder der Gemeinschaft, mit vielen und unterschiedlichen Bed&uuml;rfnissen, 
diese Unterst&uuml;tzung wollten. Daher haben wir die Unterst&uuml;tzung dieser alten 
Produkte als Antwort auf Ihre ausgedr&uuml;ckten W&uuml;nsche geliefert. OS 4.0 und 
weitere Versionen geben dem AmigaOS auf vielen traditionellen Hardware-
Konfigurationen eine neue Zukunft. 

Zur weiteren Verdeutlichung: Der AmigaOne ist eine Hauptplatine, die von 
H&auml;ndlern verkauft werden wird. Die H&auml;ndler werden dann den AmigaOne, so wie 
er ist, verkaufen k&ouml;nnen, oder k&ouml;nnen ein komplettes System bauen, oder 
k&ouml;nnen Ihnen die Einzelteile verkaufen, und Sie bauen ihn selbst zusammen. 
AmigaOS 4.0 ist nicht vorinstalliert auf dem System, aber es wird zusammen 
mit dem AmigaOne verkauft. 

Was OS 4.0 angeht, k&ouml;nnen Sie dieses Produkt separat vom AmigaOne kaufen, 
und es kann auf anderen Amiga PPC-Produkten und -Systemen, die f&uuml;r OS 4.0 
zertifiziert sind, installiert und verwendet werden. 

Puh, ich denke, jetzt habe ich es korrekt ausgedr&uuml;ckt. 

Nachdem all das gekl&auml;rt ist, und ich bin mir sicher, es verdeutlicht zu 
haben, m&ouml;chte ich mit Ihnen den wirklichen Hintergrund der Aktion teilen, 
und warum sie so wichtig f&uuml;r uns alle ist. Zusammen mit dieser Information 
machen wir eine &Auml;nderung, die besser widerspiegelt, was diese Aktion zu 
pr&uuml;fen versucht: 

Wir arbeiten t&auml;glich mit Entwicklern, Drittfirmen, Investoren, Gro&szlig;- und 
Einzelh&auml;ndlern, und ehemaligen H&auml;ndlern, die zum Amiga-Markt zur&uuml;ckkehren 
wollen. Eine kritische Frage wird uns jeden Tag gestellt: "Wie viele Amiga-
Nutzer k&ouml;nnen wir als Grundlage f&uuml;r zuk&uuml;nftige Einnahmen erwarten?". "Wir 
sind nicht daran interessiert, viel Geld f&uuml;r die Entwicklung von Software 
auszugeben, und dann nur ein paar hundert Exemplare zu verkaufen." Das sind 
wirklich ernste Anliegen, und wir wollen sie genau beantworten. Die gleiche 
Art von Fragen erreichen uns in Bezug auf die Zahl der AmigaOne, die wir 
bauen und die Zahl der Komponenten, die gekauft werden. Die H&auml;ndler 
brauchen eine vern&uuml;nftige Vorstellung, wie viele Geh&auml;use, Peripherieger&auml;te 
und sogar Verpackungen sie kaufen m&uuml;ssen, so dass sie AmigaOne Motherboards 
in komplette Desktopl&ouml;sungen f&uuml;r ihre Kunden einbauen k&ouml;nnen. Und wir haben 
einige sehr gro&szlig;e, ich meine riesige Elektronikgesch&auml;fte, die daran 
interessiert sein k&ouml;nnten, wieder Amiga-Produkte zu f&uuml;hren, wenn... wenn 
wir nur einen lebensf&auml;higen Markt vorzeigen k&ouml;nnen. Das ist eine wichtige 
Information, die wir an diesem Punkt kapieren m&uuml;ssen, nicht nur wir selbst, 
sondern unser Netz von Partnern, die angek&uuml;ndigten Partner und die, die 
noch abwarten, und den Amiga-Markt und die Amiga-Community beobachten. 

Bei diese Aktion geht es um weit mehr, als schwarze Kassen zu f&uuml;llen: Es 
geht darum, die Entwickler und die ganze Welt wissen zu lassen, dass Amiga 
ein gewinntr&auml;chtiger Markt ist, dass es sich selbstverst&auml;ndlich lohnt, f&uuml;r 
diesen Markt zu entwickeln und dass der Markt und die Amiga-Gemeinde es 
wert sind, beachtet zu werden. 

Nun, ich wei&szlig;, dass da drau&szlig;en viele die Entwicklung abwarten und 
beobachten. Ich h&ouml;re nicht auf, Nachrichten von vielen von Ihnen zu 
bekommen, die mir sagen, dass es Hunderttausende von Amiga-Liebhabern gibt, 
die hervorkommen werden, sobald neue Produkte erschienen sind - und ich 
muss sagen, dass ich da zustimme. Ich wei&szlig;, dass es viele mehr gibt, die 
abwarten, bevor sie sich auf einen Kauf festlegen. Auch das verstehe ich 
sehr gut. Das vor uns liegende Problem ist, dass wir wirklich beweisen 
m&uuml;ssen, dass es heute einen Markt f&uuml;r Amiga gibt, und dass es morgen noch 
viele Leute mehr sein werden. 

Bei dieser Aktion geht es darum, die Amiga-Familie wieder 
zusammenzubringen, die Reihen wieder zu st&auml;rken und uns alle auf den gro&szlig;en 
Erfolg vorzubereiten, den wir zusammen erreichen k&ouml;nnen, w&auml;hrend wir die 
notwendigen Schritte hin zur Verschmelzung der DE- und OS-Technologien in 
AmigaOS 5.0 und danach gehen. Wir werden alles daran setzen zu zeigen, dass 
Amiga eine Kraft ist, mit der im technischen Bereich gerechnet werden muss 
und zu zeigen, dass es eine M&ouml;glichkeit f&uuml;r Entwickler gibt, zur Amiga-
Plattform zur&uuml;ckzukehren und dort wieder Geld zu verdienen, zusammen mit 
der Plattform Amiga und dem Unternehmen Amiga. 

Und ja, die Aktion soll Spa&szlig; machen. Ja, sie ist dazu gedacht, Ihnen - den 
Mitgliedern der Amiga-Gemeinde - einen gro&szlig;en Wert zu liefern. Es geht 
au&szlig;erdem auch darum, den Skeptikern zu beweisen, dass Amiga hier ist, um 
weiterzubestehen und dass wir ein Markt sind, der beachtet werden muss, f&uuml;r 
den entwickelt werden sollte, und dass dieser Amiga-Markt es wert ist, 
Zeit, M&uuml;he und Geld zu investieren. Letzten Endes ist alles ein Gesch&auml;ft, 
und bei einem Gesch&auml;ft geht es darum, allen Beteiligten eine Gegenleistung 
zu liefern. 

Nachdem all das gesagt ist, werde ich die Promotionsaktion ein wenig 
ab&auml;ndern, um das, was wir entschlossen sind, mithilfe dieser Aktion, des 
Amigas und Ihnen zu erreichen, zu verdeutlichen. Wir werden alle wissen 
lassen, dass wir Teil von etwas Gro&szlig;em und Wichtigem sind. Die meisten von 
Ihnen sind schon viel l&auml;nger dabei als ich, und ich bin dankbar daf&uuml;r, dass 
die meisten - nicht alle, aber die meisten - mich in ihre Familie 
aufgenommen haben. Um dieses Ziel also besser erreichen zu k&ouml;nnen, wird 
sich diese Aktion ver&auml;ndern. 

Wenn Sie nun f&uuml;r USD 50,00 (EUR 50,00 oder GBP 32,50) Mitglied des "Ich bin 
Amiga Club" werden, so erhalten Sie ein T-Shirt, dass Sie als Mitglied 
ausweist, sowie einen Gutschein, der f&uuml;r einen USD 50,00 (EUR 50,00 oder 
GBP 32,50) Preisnachlass beim Kauf eines AmigaOne oder von OS 4.0 (f&uuml;r 
diejenigen, die dieses neue Betriebssystem auf ihren existierenden 
Fremdhersteller-PPC-Karten benutzen wollen) verwendet werden kann. Sie 
werden au&szlig;erdem einen Newsletter erhalten, und w&auml;hrend der n&auml;chsten 12 
Monate zu den ersten geh&ouml;ren, die von neuen Produkten erfahren. Wir werden 
mit dem Amiga nahe stehenden Unternehmen zusammenarbeiten, um betr&auml;chtliche 
Preisnachl&auml;sse und andere besondere Aktionen f&uuml;r Mitglieder des Amiga-Clubs 
anzubieten. 

Der ganze Rest der Aktion gilt weiterhin und alle Mitglieder nehmen 
automatisch an der Verlosung teil. 

Und so k&ouml;nnen Sie bei der Aktion teilnehmen: 

In meinem sehr USA-fokussierten Ansatz (ich entschuldige mich daf&uuml;r, es 
wird nicht wieder vorkommen) habe ich nicht dar&uuml;ber nachgedacht, wie man 
den Gutschein ohne Kreditkarte bestellen kann. F&uuml;r all diejenigen au&szlig;erhalb 
der USA, wo so viele von Ihnen wohnen, gibt es nun die M&ouml;glichkeit, PayPal 
oder bestimmte Kundenkarten [Anm. des &Uuml;bersetzers: Wahrscheinlich sind ec-
Karten gemeint], die ein Kreditkartenlogo haben, zu benutzen. Sie k&ouml;nnen 
uns auch einen Barscheck, einen Geldbrief oder einen Verrechnungsscheck an 
folgende Adresse schicken: 

Amiga, Inc.
I am Amiga Club
P.O. Box 887
Ravensdale, WA 98051 USA 

Bitte geben Sie Ihren Namen, Ihre Adresse und alle anderen notwendigen 
Daten an, die wir ben&ouml;tigen, um Ihnen die Produkte liefern zu k&ouml;nnen. Geben 
Sie bitte auch Ihre E-Mail-Adresse an, wenn Sie eine haben. 

Ab Ende der Woche sollte es Ihnen auch m&ouml;glich sein, &uuml;ber Ihren Amiga-
H&auml;ndler vor Ort an dieser Aktion teilzunehmen. Dies wird es Ihnen allen 
viel einfacher machen, an der Promotionsaktion teilzunehmen, und die 
Produkte von Ihrem Amiga-H&auml;ndler vor Ort zu beziehen. Wie werden Ihnen das 
Zertifikat und das T-Shirt auch in diesem Fall direkt zuschicken, aber dies 
sollte es f&uuml;r viele von Ihnen einfacher machen, teilzunehmen. 

Letzter Punkt Verl&auml;ngerung der Teilnahmefrist! 

Wir sind von vielen H&auml;ndlern und vielen von Ihnen in der Gemeinde gebeten 
worden, die Teilnahmefrist zu verl&auml;ngern, so dass mehr von Ihnen teilnehmen 
k&ouml;nnen. Nun, wir stimmen zu, und die Teilnahmefrist der Promotionsaktion 
wird bis zum 19. Juli Mitternacht pazifischer Zeit (0900 GMT 20. Juli) 
ausgedehnt. Wir werden die Zahl der Teilnehmer t&auml;glich aktualisieren, und 
wir arbeiten daran, auch andere dazu zu bringen, diese Neuigkeiten ihren 
Freunden mitzuteilen. 

Bis wir uns wiedersehen, freue ich mich schon einmal darauf, dass so viele 
von Ihnen, wie m&ouml;glich mitmachen, und die Welt wissen lassen, dass Amiga 
sehr real und eine Kraft ist, die ihre beste Zeit noch vor sich hat. 

Jedes Mitglied z&auml;hlt. Falls Sie bisher zwischen zwei St&uuml;hlen gesessen 
haben, und sich gefragt haben, ob dies eine "weitere Idee zum 
Geldscheffeln" ist, dann irren Sie sich... Worum es uns wirklich geht, ist 
die Gemeinde der Amiga-Benutzer und Partner zu vereinen, w&auml;hrend wir voran 
kommen. Wir stehen mit Unternehmen und Zwischenh&auml;ndlern in Kontakt, die 
gerne glauben m&ouml;chten, dass es einen lukrativen Markt gibt, und dass die 
Gemeinde gewillt ist, Geld auszugeben. Amiga Inc. muss ihnen nur 
glaubw&uuml;rdig zeigen k&ouml;nnen, dass eine solche Gemeinde und solch ein Markt 
existieren. Ich hoffe, dass Sie alle dem Club beitreten werden, und ein 
Teil dieses Beweises und der Geschichte werden. 

Eine weitere Klarstellung: Alle diejenigen, die bereits den Gutschein 
gekauft haben, werden automatisch Mitglied des Clubs und erhalten alle 
aufgef&uuml;hrten Beg&uuml;nstigungen. 

Zusammenfassung: 

Der AmigaOne ist eine PPC-Hauptplatine, die an H&auml;ndler verkauft werden 
wird, bei denen Sie das Produkt erwerben k&ouml;nnen. 

AmigaOS 4.0 wird auf dem AmigaOne und anderen zertifizierten Amiga-PPC-
Produkten laufen. 

Alle Leute, die den Gutschein gekauft haben, werden automatisch Club-
Mitglied. 

Die Mitgliedschaft im Amiga-Club beinhaltet ein T-Shirt, einen 
Preisnachlass-Gutschein, der beim Kauf eines AmigaOne, von AmigaOS 4.0 oder 
beim Kauf von beiden eingel&ouml;st werden kann. Sie beinhaltet auch einen 
Newsletter und zuk&uuml;nftige Preisnachl&auml;sse auf andere Amiga-Produkte und 
Amiga nahe stehende Produkte. Dies schlie&szlig;t auch AmigaDE-Produkte und 
solche Produkte ein, die "Amiga-Enabled" sind (mehr dazu im Newsletter). 

Die T-Shirts werden &uuml;brigens auf mehr als einem Kontinent hergestellt, so 
dass wir die Auslieferung an Sie beschleunigen k&ouml;nnen. 

Alle Produkte werden nach dem Abschluss der Promotionsaktion und dem Ende 
der ersten Phase der Mitgliedsaufnahme ausgeliefert. 

Also, nun machen Sie schon: Ich wei&szlig;, dass da drau&szlig;en noch mehr von Ihnen 
sind. Lassen Sie uns dies zusammen Wirklichkeit werden. 


&Uuml;bersetzer: 

Hauptteil: Dennis 'Hurrican' Pauler
Weitere Abs&auml;tze: Frank Gutschow und M«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
