<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Diverse Amiga-News
------------------

1. Bericht: Juni-Party der Amiga-Freunde Pfalz (von Patric Kl&ouml;ter)

Auch in diesem Jahr veranstalteten die Amiga-Freunde Pfalz wieder eine 
dreit&auml;tige Party mit ihren Rechnern. Von Freitagmorgen bis Sonntagmittag 
konnten sich die User austauschen und endlich einmal ohne Zeitdruck ihrem 
liebsten Hobby, dem Amiga, nachgehen. 

Im Jahr 2002 wird es wieder 2 Veranstaltungen geben. Die Juni-Party war 
damit quasi Teil eins. Insgesamt waren &uuml;ber das Wochenende immer knapp 15 
Leute der Amiga-Freunde gleichzeitig anwesend. 
Wenn einer ging, kam meist ein anderer Amiga-Freund. Mitgebracht wurden 
haupts&auml;chlich A1200 im Towergeh&auml;use sowie umgebaute A4000. Auch ein 
originaler A3000T (in Erstbesitz) war zu sehen, und zum Zocken war gar ein 
nackter A500 anwesend. Auf diesem liefen einige alte Klassiker wie Elite 
sowie die bekannten Demos aus den Endachtzigern.
Neben dem Amiga darf aber auch nicht der Durst und der Hunger vergessen 
werden, und so wurde wie jedes Mal wieder ausreichend Verpflegung 
mitgebracht. Es gab Kuchen, Br&ouml;tchen, Cola, Malzbier, normales Bier und 
vieles mehr. Hier ein Dankesch&ouml;n an alle, die an die Verpflegung gedacht 
haben.

Achim Stegemann zeigte seine aktuelle Betaversion von Digital Almanac III 
(URL: http://mitglied.lycos.de/achimste/index_d.html). Ein herausragendes 
Feature ist die Verbindung des Programms mit dem Internet. Aktuelle Daten 
k&ouml;nnen sehr leicht und pr&auml;zise aus dem Netz geladen und f&uuml;r das Programm 
verwendet werden (z.B. Bilder aller m&ouml;glichen Sternensysteme). 
In diesen Tagen hat Achim auch ein freies Keyfile f&uuml;r die Vorg&auml;ngerversion 
II ver&ouml;ffentlicht.

Selbstverst&auml;ndlich waren wir auch ans Internet angeschlossen, und es wurde 
ein Datenaustausch per Netzwerk realisiert sowie reichlich "Conflict: 
Freespace" und "DynAMIte" gezockt. Probleme wurden gegenseitig behoben, und 
f&uuml;r fast alle wurde eine L&ouml;sung gefunden, unter anderem konnte Linux auf 
einem 68k-Amiga installiert werden.
Aber leider lief nicht alles glatt, und so sprang mehrmals die Sicherung 
heraus. Dies w&auml;re nicht weiter schlimm gewesen, jedoch war ein Amiga-Freund 
(Nils) damit besch&auml;ftigt, seine Festplatte zu reparieren. Nach ein paar 
Ausf&auml;llen musste er es leider letztendlich aufgeben. Frank hingegen hatte 
vorgesorgt und ein Notfall-Aggregat f&uuml;r seine beiden A4000 dabei.

Ein mitgebrachter Beamer (danke an Ulli) sorgte wie bei der letzten Party 
wieder f&uuml;r Kinoatmosph&auml;re. Frank lie&szlig; es sich nat&uuml;rlich nicht nehmen, sein 
frisch ausgepacktes "Feeble Files" zu installieren und mit dem Beamer 
auszuprobieren. Somit konnten die Amiga-Freunde aus entfernterer Umgebung 
verfolgen, wie das Spiel aussieht, ohne hinter Franks R&uuml;cken stehen zu 
m&uuml;ssen. 

Am Samstagmittag erwartete die Amiga-Freunde dann eine &Uuml;berraschung: Petro 
Tyschtschenko kam zu Besuch. Ich hatte ihn als &Uuml;berraschungsgast 
eingeladen, und er hielt Wort und kam p&uuml;nktlich wie versprochen um 13.30 
Uhr. Als er den Raum betrat, sa&szlig; schon eine Minute sp&auml;ter keiner mehr an 
seinem Amiga, sondern alle standen um Petro herum. Er ist ein wahnsinnig 
sympathischer Mensch und findet immer Zeit, wenn es um den Amiga und seine 
Gemeinde geht. Ich war beeindruckt von seiner H&ouml;flichkeit, die er den 
Leuten entgegenbringt. Seine bekannten langen Hosentaschen sind auch immer 
noch nicht leer, und so brachte er uns reichlich AMIGA-Merchandising-
Artikel mit. Hier noch mal ein dickes Dankesch&ouml;n von allen Usern der Amiga-
Freunde-Pfalz. Man merkt ihm an, dass ihm der Amiga immer noch sehr am 
Herzen liegt, und er freute sich sehr, dass es immer noch Menschen gibt, 
die den Amiga genauso lieben wie er selbst. Er ist genauso wie er in den 
Amiga-Magazinen immer beschrieben wurde: Freundlich und aufgeschlossen f&uuml;r 
Neues. Ich glaube, ohne ihn g&auml;be es den Amiga schon lange nicht mehr.
Kurz bevor er uns verlie&szlig;, konnten wir ihn ohne die obligatorischen 
Signaturen nicht gehen lassen :-), und bereitwillig unterschrieb er unsere 
Mauspads, Tastaturen und komplette Rechner (wie meinen Elbox-Tower). 

Der Samstagabend wurde wieder dazu verwendet, mit dem Beamer Filme 
anzusehen (u.a. Star Wars - Episode 1), w&auml;hrend andere bis in die Nacht 
hinein vor den Amigas sa&szlig;en oder sich intensiv mit den anderen Teilnehmern 
unterhielten.
Die ersten bauten schon am Samstag ihre Rechner ab, die letzten blieben bis 
Sonntag. Alles in allem war es wieder ein wirklich gutes Wochenende, und 
ich denke, dass alle Anwesenden auf ihre Kosten gekommen sind. Aber es 
h&auml;tten ruhig noch ein paar Besucher mehr kommen k&ouml;nnen. Das h&auml;tte der Party 
sicher gut getan. Teil zwei der Party folgt im Oktober. Auch dann wird 
wieder ein Wochenende unter dem Motto "Es gibt Computer und es gibt Amiga" 
stehen. Und vielleicht haben wir dann auch einen AmigaOne oder Pegasos 
inklusive AmigaOS 4.0 zu Besuch...

Bild:
<IMG SRC="../extra/party.jpg" ALT="Bild">

Links: http://www.amiga-freunde.de
       http://www.commodore-amiga.de

Patric Kl&ouml;ter &lt;Porschist@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
