<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Workshop: »ToolsMenu« im t&auml;glichen Einsatz (von Michael Christoph)

Seit der Kurzvorstellung von ToolsMenu V45.6 in AMIGA aktuell 04/2002 wurde 
das Programm weiterentwickelt und liegt jetzt in der Version 45.8 zum 
freien Download [1] vor.
Es sollen hier nicht nur die Neuerungen, sondern vor allem der praktische 
Nutzen von ToolsMenu anhand von t&auml;glichen Arbeiten am Amiga aufgezeigt 
werden.

Freuen d&uuml;rfen sich zuerst einmal die italienisch- und englischsprachigen 
Amiga-User. Dank Arturo Franzin liegt sowohl das Programm (Catalog), als 
auch die Anleitung in italienischer Sprache vor. Gernod Schomberg &uuml;bernahm 
die &Uuml;bersetzung der Anleitung ins Englische.

  Englische und italienische Anleitungen:
<IMG SRC="../extra/toolsmenu0.png" ALT="Englische und italienische Anleitungen">

Nach dem Entpacken des LhA-Archivs wird das Programm mittels Installer auf 
die eigene Festplatte gebracht, was nur wenige Augenblicke dauert.
Nach dem Programmstart f&auml;llt nur bei genauerem Hinsehen ein zus&auml;tzlicher 
Button neben den bisherigen auf. &Uuml;ber diesen Button kann ein Programm oder 
eine beliebige Datei ausgew&auml;hlt werden, die in der aktuellen Zeile dem 
Kommando hinzugef&uuml;gt wird.

  Der neue Button:
<IMG SRC="../extra/toolsmenu1.png" ALT="Der neue Button">

Allerdings unterst&uuml;tzt das Programm auch Drag & Drop, so dass diese 
Programme (und/oder Dateien) auch einfach durch Ziehen von der Workbench 
und Fallenlassen im Fenster eingesetzt werden k&ouml;nnen.
Neu ist die M&ouml;glichkeit, eine komplette Zeile zu kopieren, wenn 
beispielweise mehrere &auml;hnliche Eintr&auml;ge erstellt werden sollen. Dazu gleich 
das erste Praxisbeispiel:

Es existiert der folgende Eintrag:

  | Datei anzeigen   |   | MultiView

  Grafische Ansicht des Eintrags:
<IMG SRC="../extra/toolsmenu2.png" ALT="Grafische Ansicht des Eintrags">

Diese Zeile muss aktiv sein, also der blaue Balken darauf stehen. Ggf. 
einfach durch einmaliges Dr&uuml;cken der linken Maustaste ausw&auml;hlen.
&Uuml;ber die Tastenkombination "Rechte Amiga-Taste + C" wird der Eintrag 
kopiert. Alternativ kann auch aus dem Einstellungen-Men&uuml; der Punkt 
"Aktuellen Eintrag kopieren" ausgew&auml;hlt werden.
ACHTUNG: In anderen Sprachen als Deutsch kann dieser Punkt einer
         anderen Taste zugeordnet sein!

Die neue Zeile wird direkt unter der aktuellen eingef&uuml;gt und sofort 
aktiviert. Der Cursor wird in das Namensfeld gesetzt. Der Eintrag kann also 
sofort bearbeitet werden und in unserem Fall in "Datei auf eigenem 
Bildschirm anzeigen" ge&auml;ndert. Zus&auml;tzlich ist im Kommando nach "MultiView" 
noch der Zusatz "SCREEN" anzugeben. Dadurch zeigt MultiView die Datei nicht 
mehr auf der Workbench an, sondern &ouml;ffnet einen eigenen Bildschirm. Das hat 
dann Vorteile, wenn Bilder angesehen werden und die Workbench nur in einer 
8-Bit-Aufl&ouml;sung (also maximal 256 Farben) l&auml;uft.

Die neuen Einstellungen k&ouml;nnen einfach &uuml;ber "Benutzen" getestet oder 
mittels "Speichern" auch dauerhaft gesetzt werden.

Nach der Auswahl eines der beiden Men&uuml;punkte erscheint der Requester zur 
Auswahl einer Datei, die von MultiView angezeigt werden soll.
Oftmals ist das Bild aber schon auf der Workbench als Piktogramm zu sehen 
(z.B. Bilder-CDs oder Aminet-CDs/gfx-Verzeichnis). Erweitern wir also 
ToolsMenu so, dass sofort diese ausgew&auml;hlte Bilddatei, ohne R&uuml;ckfrage, 
angezeigt wird. Dazu gen&uuml;gt der kleine Zusatz "%" hinter dem Kommando 
"MultiView". Durch das Prozentzeichen wird festgelegt, dass dem Kommando 
beim Starten gleich noch der Name (inkl. Pfad) des aktiven Workbench-
Piktogramms mitgegeben werden soll. Theoretisch k&ouml;nnen auch mehrere 
Piktogramme ausgew&auml;hlt werden, im Falle von MultiView darf es allerdings 
nur eines sein, da dieses Programm keine Mehrfachauswahl beim Dateinamen 
zul&auml;sst.

Die ge&auml;nderten Eintr&auml;ge sehen so aus:

  | Datei anzeigen                        |   | MultiView %
  | Datei auf eigenem Bildschirm anzeigen |   | MultiView % SCREEN

  Grafische Ansicht der geänderten Einträge:
<IMG SRC="../extra/toolsmenu3.png" ALT="Grafische Ansicht der geänderten Einträge">

Wird kein Piktogramm ausgew&auml;hlt, erscheint, wie bisher, der Datei-
Requester.
Aber nicht jedes Programm reagiert so zuvorkommend wie MultiView. Viele 
Programme verlangen zwingend, dass bereits eine (oder mehrere) Datei(en) 
mitgegeben wird (werden). Jedoch existiert auch hierf&uuml;r eine L&ouml;sung:
"%O" und "%A" hei&szlig;en die Platzhalter. W&auml;hrend mit "%O" der Datei-Requester 
nur dann angezeigt wird, wenn kein Piktogramm ausgew&auml;hlt ist (optional), 
wird bei "%A" der Datei-Requester immer angezeigt (always) und evtl. 
ausgew&auml;hlte Piktogramme werden einfach ignoriert.

Wer sich nun dar&uuml;ber &auml;rgert, dass der Datei-Requester immer links oben und 
vielleicht auch noch zu klein ge&ouml;ffnet wird, kann auch das &auml;ndern, und zwar 
durch Abhaken des neuen Men&uuml;punkts "Einstellungen / Fixieren Dateiauswahl". 
Dadurch wird die Position und Gr&ouml;&szlig;e des Datei-Requesters nach einer Auswahl 
gespeichert und dieser beim n&auml;chsten Mal an derselben Stelle in derselben 
Gr&ouml;&szlig;e angezeigt. Dabei wird auch gleich noch das zuletzt aktive Verzeichnis 
ausgew&auml;hlt. Die Daten werden im Klartext in der Umgebungsvariable 
"ENVARC:ToolsMenu_filereq" gesichert.

Aber nicht nur das Auswahlfenster, sondern auch ToolsMenu selbst kann sich 
seine Position und Gr&ouml;&szlig;e merken, um beim n&auml;chsten Starten an der von euch 
bevorzugten Stelle zu &ouml;ffnen. Zust&auml;ndig hierf&uuml;r ist der Men&uuml;punkt 
"Einstellungen / Fixieren Programmfenster". Gesichert wird dabei in der 
Umgebungsvariable "ENVARC:ToolsMenu_window".

Wer die neue Anleitung gelesen hat, wei&szlig; bereits, dass ToolsMenu auch 
Submen&uuml;s generieren kann. Dazu ist im Titelfeld vor dem eigentlichen 
Men&uuml;titel, einfach mittels "\\" getrennt, der Titel f&uuml;r den &uuml;bergeordneten 
Punkt anzugeben. Auch hierzu wieder ein praktisches Beispiel, das mehrere 
Prefs-Einsteller in einem Men&uuml; zusammenfasst.

  | Prefs\\ToolsMenu |   | SYS:Prefs/ToolsMenu   |
  | Prefs\\Drucker   |   | SYS:Prefs/Printer     |
  | Prefs\\Workbench |   | SYS:Prefs/Workbench   |

  Einträge mit Submenüs:
<IMG SRC="../extra/toolsmenu4.png" ALT="Einträge mit Submenüs">

Im Hilfsmittelmen&uuml; der Workbench wird ein neuer Eintrag "Prefs" erzeugt, 
bei dessen &Uuml;berfahren das Untermen&uuml; mit den drei Eintr&auml;gen "ToolsMenu", 
"Drucker" und "Workbench" angezeigt wird. So lassen sich z.B. mehrere 
Bildanzeiger und Anim-Player zu einer Gruppe zusammenfassen. Dadurch kann 
auch die &Uuml;bersichtlichkeit gesteigert werden.

Es gibt aber noch eine andere M&ouml;glichkeit, die &Uuml;bersichtlichkeit zu 
erh&ouml;hen: indem Trennlinien zwischen den Eintr&auml;gen eingesetzt werden.
Wie zu erwarten, ist auch dies kein Problem. Es gen&uuml;gt, im Titelfeld
die Tilde "~" einzutragen:

  | Gruppe 1 |   | ...           |
  | ~        |   |               |
  | Gruppe 2 |   | ...           |

  Gruppen auch optisch trennen:
<IMG SRC="../extra/toolsmenu5.png" ALT="Gruppen auch optisch trennen">

So multimedial wie der Amiga ist, sind auch oft dessen Benutzer davor. 
Heute programmieren, morgen Musik samplen und &uuml;bermorgen zeichnen. Wer nun 
beginnt, all diese Programme im Hilfsmittelmen&uuml; unterzubringen, wird 
irgendwann die &Uuml;bersicht verlieren. Aber auch daf&uuml;r bietet ToolsMenu eine 
m&ouml;gliche Alternative. Denn selten werden alle Funktionen gleichzeitig 
ben&ouml;tigt. Ist man heute eher kreativ beim Zeichen, so reichen Malprogramme 
und Bildanzeiger aus. Morgen beim Programmieren ist neben dem 
Compiler(system) evtl. ein separater Editor und ein Hilfesystem zu den 
Amiga-Befehlen vonn&ouml;ten. F&uuml;r diesen Zweck lassen sich separate 
Men&uuml;belegungen erzeugen und in einzelne Dateien speichern. Beim Speichern 
der Datei erzeugt ToolsMenu auch ein passendes Piktogramm f&uuml;r die 
Workbench. Durch einen einfachen Doppelklick l&auml;sst sich so die komplette 
Men&uuml;belegung &auml;ndern. Werden nun diese Piktogramme ausgelagert, hat man 
au&szlig;erdem jederzeit Zugriff darauf und kann auch zwischendurch mal wechseln.

  Verschiedene Menübelegungen:
<IMG SRC="../extra/toolsmenu6.png" ALT="Verschiedene Menübelegungen">

Sicher findet der eine oder andere Leser auch noch weitere M&ouml;glichkeiten,
wie ToolsMenu ihm das Leben erleichtert. Ich w&uuml;rde mich sehr freuen, 
weitere Ideen von euch zu erfahren. Aber auch sonst darf sich jeder an mich 
wenden, egal ob es Erweiterungsw&uuml;nsche oder auch nur einfach 
"Dankschreiben" sind. ;-)
Denn nur bekannte Fehler k&ouml;nnen beseitigt und bekannte W&uuml;nsche in das
Programm aufgenommen werden!


[1] http://www.meicky-soft.de/abin/toolsmenu.html

Michael Christoph &lt;michael@meicky-soft.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
