<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Leserbrief zum AmigaOS 3.5 (von Wolfgang M&uuml;nch)</H2>
<P>
&raquo;Ich habe mir OS 3.5 auf der Messe besorgt; allein schon, um die
Weiterentwicklung zu unterst&uuml;tzen. Nach der Installation auf meiner
Zweitpartition lief aber nicht mehr viel; sogar Commodities wie der Blanker
oder CrossDOS f&uuml;hrten nur zu Abst&uuml;rzen. Was soll's, nach 6 Jahren ohne
komplette Neuinstallation ist`s vielleicht mal f&auml;llig. Und siehe da: nach
&quot;format dh1:&quot;, Installation von OS 3.1 + 3.5 l&auml;uft das System auch recht
vern&uuml;nftig. Jedenfalls die 68k-Software. Was man von WarpUP-Programmen
(ausgenommen Wipeout) leider nicht sagen kann. Egal ob Demos oder
Anwendung, 90% der PPC-Progs enden in einem &quot;Programmfehler&quot; oder einer
&quot;PowerPC Exception&quot;. Fehlt nur noch ein blauer Bildschirm mit &quot;schwerer
Ausnahmefehler bei Adresse xxx&quot;. Mal ehrlich, seit einem Jahr habe ich mein
PPC-Board; die Hauptpartition ist schon von 2 anderen Rechnern mit
umgezogen, hat PowerUP und l&auml;uft stabil wie Beton. Bei Programmen wie
&quot;Heretic&quot;, wo Ports f&uuml;r PowerUP und WarpUP existieren, ist die PowerUP-
Version schneller und stabiler. Ich sehe ja ein, da&szlig; H&amp;P als Entwickler
WarpUP ins OS 3.5 integriert haben, aber stabiler l&auml;uft MEIN System nicht
damit, trotz richtig gesetzter Env-Variablen, CGX 4.1-Update und so weiter
(f&uuml;r Tips bin ich immer dankbar; bitte an <A HREF="mailto:w.muench@germanynet.de">w.muench@germanynet.de</A>).
Genauso mit dem notwendigen Reset beim Kaltstart: Ich sehe auch ein, da&szlig;
ohne einen Wechsel der Kickstart-ROMs der Reset unumg&auml;nglich ist, aber
nerven tut er mich schon. Wenn man gewohnt ist, da&szlig; der Rechner in 15
Sekunden betriebsbereit ist (inkl.StartMenu, CGX, ModePro, Myzar etc),
wundert man sich beim ersten Booten schon ein wenig. Hoffentlich gibt`s
irgendwann mal Kickstart3.5-ROMs. Solange wird meine Arbeitspartition
jedenfalls auf 3.1 + PowerUP weiterlaufen und 3.5 nur bei Benutzung von
WarpUP-Programmen gestartet!<BR>
Damit man mich nicht falsch versteht: Hut ab vor der Leistung von H&amp;P,
bitte macht weiter mit der OS-Entwicklung. In OS 3.5 sind etliche l&auml;ngst
f&auml;llige Verbesserungen verwirklicht worden, die auch durch Zusatzprogramme
nie so gut ins OS integriert wurden wie durch dieses Update. Aber die
Stabilit&auml;t und Geschwindigkeit ist auf meiner Konfiguration
(A4000/040/604/CybervisionPPC/Netzwerk/Brenner/Scanner/Mac) einfach noch
nicht so exzellent wie auf OS 3.1! Und wenn ich mich an Abst&uuml;rze gew&ouml;hne,
gew&ouml;hne ich mich am Ende auch noch an WinDOS (brrr!). Ich habe OS 3.5
gekauft, aber jetzt erwarte ich noch Nacharbeit und Pflege. Miami als
Demoversion gibt's im Aminet; eine OEM-Version h&auml;tte ich schon erwartet.
AWeb 3.3 hab´ich als Vollversion, das konnte ich verschmerzen. PPC-
Datatypes w&auml;ren auch nicht schlecht. Was auf der CD drauf ist, kann einfach
noch nicht alles gewesen sein!
</P>
<P>
Zum Abschlu&szlig; kann ich eigentlich nur noch ein oft strapaziertes Zitat
liefern: Und wenn ich der letzte Amiga-User bin: F&uuml;r dieses System gibt es
keinen Ersatz!
</P>
<P>
Wolfgang M&uuml;nch &lt;<A HREF="mailto:w.muench@germanynet.de">w.muench@germanynet.de</A>&gt;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
