<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Eine kleine Reise durch die Computergeschichte (von Martin A. Endrikat)</H2>
<P>
&raquo;Angefangen... ja, angefangen hat alles mal Anfang der 70er, als mir in der
Stadtb&uuml;cherei ein Buch &uuml;ber Computer - zimmergro&szlig;e Riesenmaschinen mit
abstrakter Technik, unverst&auml;ndlicher Programmiersprache, gigantisch
beeindruckend - in die H&auml;nde fiel. Damals, als Teenie, hatte ich schon die
Vision: Irgendwann, in ferner Zukunft, m&ouml;chte ich mich auch mit diesen
Monstren beschh&auml;ftigen.
</P>
<P>
Jo, und wie es denn so ist, die Interessen wandeln sich; au&szlig;erdem gab es ja
nichts &quot;zum Anfassen&quot; - und wie hei&szlig;t es so sch&ouml;n: Aus den Augen, aus dem
Sinn!
Es gab dann zwar den ersten Taschenrechner, doch das war ja gar kein
&quot;richtiger&quot; Computer. So kam ich zur Berufsschule, und was hatte einer
meiner Mitsch&uuml;ler? Einen programmierbaren Taschenrechner von Hewlett
Packard, der seine Programme auf kleine Magnetkarten speichern konnte.
Genial...
</P>
<P>
... Und das Karussell beginnt sich zu drehen ...
</P>
<P>
Von da an war der kleine Schwelbrand zur vollen Flamme erwacht. Schon bald
hatte ich ebenfalls einen programmierbaren Taschenrechner, von Casio. Fast
zeitgleich kam der erste &quot;Pers&ouml;nliche Computer&quot; f&uuml;r zu Hause auf den Markt,
der Commodore PET. Ein richtiger Computer, mit Bildschirm und Tastatur und
Kassettenlaufwerk zum Speichern - Wahnsinn!
Leider zu teuer f&uuml;r einen armen Lehrling :-(
Es folgte die Zeit des Dienens, ganz in gr&uuml;n, und alle Welt - ich meine
Technikbegeisterte, und davon gab es noch nicht viele - sprach vom ersten
richtigen Heimcomputer, dem Sinclair ZX 80. Anzuschlie&szlig;en am Fernseher,
kryptische Bedienung (fast so wie die Gro&szlig;rechner aus meinem Buch...), aber
ein richtiger kleiner Computer. Nicht viel sp&auml;ter kam schon der Nachfolger,
der ZX 81. 1 KiloByte Speicher, Minimalgrafik in Schwarz-Wei&szlig;, eingebautes
BASIC und eine Tastatur f&uuml;r M&auml;usepfoten. Aber man konnte programmieren...
</P>
<P>
... und es dreht sich schneller ...
</P>
<P>
Bei einem Rundfunkh&auml;ndler (!) stand eines Tages der Commodore VC 20. In
Farbe! Mit richtiger gro&szlig;er Tastatur!! Doch schon wieder unbezahlbar. Kaum
da&szlig; man sich an diesen Anblick gew&ouml;hnt, kommt schon der Nachfolger (mu&szlig; ein
Virus sein, der die Hersteller bef&auml;llt...), der C64. Eine geniale Maschine.
38 KByte Speicher, f&uuml;r maschinennahe Programmierung sogar 52 KByte. Was
kann es gr&ouml;&szlig;eres geben?
Gut, IBM hatte zwar den PC entwickelt, aber der war ja nur schwarz-wei&szlig;,
sauteuer und f&uuml;r B&uuml;roarbeiten gedacht - wie langweilig. Und mit PC-DOS
ausgestattet, wie kryptisch. Von einem jungen Garagen-Programmierer names
William H. Gates, genannt Bill.
</P>
<P>
Es gab damals wohl ein alternatives Betriebssystem, CP/M - laut
Expertenmeinung das Bessere - aber IBM war von Billie Boy wohl so
angetan... na ja, der Rest ist Geschichte.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">7 Jahre arbeiten, tunen, basteln, philosophieren mit dem C64 folgten. Sogar&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">BTX konnte man schon mit ihm machen...&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
... und schneller ... und schneller ...
</P>
<P>
Der PC d&uuml;mpelte immer noch leise vor sich hin. Atari aber hatte sich schon
aus dem Pool der Home-Computer-Kraucher erporgehoben mit dem 520/1040, da
bekam Commodore den Joker - die vor dem Konkurs stehende Firma Amiga!
Ebenso wie bereits Apple und Atari basierend auf dem 68k Prozessor, aber
irgendwie ... besser!?
Besser f&uuml;r Commodore, denn das System stand, es brauchte nicht erst
entwickelt zu werden. Besser, weil das Potential weit &uuml;ber dem des PCs lag.
Nur leider wurde das von Commodore nicht erkannt; oder anders gesagt,
Commodore hatte nicht die Courage, diesen Vorsprung zu nutzen.
</P>
<P>
Mit einer Einschr&auml;nkung, dem 2000er. Welcher allerdings nicht direkt von
Commodore geplant war, sondern von findigen (denkenden?)
Servicemitarbeitern aus Braunschweig zusammenget&uuml;ftelt wurde. Mein 2000er
l&auml;uft heute noch mit einer Kundendatenbank und als FAX-Maschine in der
Firma... - einen 12 Jahre alten PC m&ouml;chte ich in dieser Situation nicht
sehen...
</P>
<P>
BTW: in den AmigaOS Versionen 1.2 und 1.3 (vorherige Versionen kenne ich
leider nicht) werkelte ein BASIC, geschrieben von unserem Freund Bill G.!
</P>
<P>
... und schneller ... und schneller ...
</P>
<P>
Die PC-Welt staunte fast t&auml;glich &uuml;ber neue Innovationen: schnellere
Prozessoren, bessere Software... und wir Amiganer? Zogen &uuml;ber die dummen
&quot;DOSen&quot; her, wu&szlig;ten zwar, da&szlig; unser System besser war (wu&szlig;te Commodore das
auch?  Wahrscheinlich, leider lie&szlig;en sie es uns nicht wissen, sondern
investierten lieber in den ach so aufstrebenden PC-Sektor), doch das Wissen
alleine auf der einen Seite und die Verf&uuml;gbarkeit von B&uuml;rotauglicher
Anwendungssoftware auf der anderen Seite lie&szlig;en die Waage reichlich schr&auml;g
stehen...
</P>
<P>
Nun, die &quot;Kompatiblen&quot; wurden also mit neuester Technik &uuml;berh&auml;uft, und wir
guckten immer mehr in die R&ouml;hre. Dann das Ende von Commodore - anschlie&szlig;end
die jahrelange Irrfahrt! Sicher, irgendwas mu&szlig; am Amiga dran sein, da&szlig; es
ihn heute trotzdem noch gibt - Doch eigentlich ist das nicht mein Thema,
ich werde emotional...
</P>
<P>
... und schneller ... und schneller ...
</P>
<P>
Tja, so sind wir fast am Ende meiner kleinen Computerreise angekommen. Oder
sollte ich sagen, am vorl&auml;ufigen Ende? Wenn ich also auf alle meine jemals
besessenen Computer zur&uuml;ckblicke, hatte ich mit dem Amiga zugegeben den
meisten Spa&szlig;. Allerdings habe ich mit meinen beiden PCs auch meinen Spa&szlig;.
Einen anderen Spa&szlig; als mit dem Amiga, aber Spa&szlig;. Vor allem die Kinder haben
ihren Spa&szlig;, denn vern&uuml;nftige Kids-Spiele bzw. Lernprogramme gibt es halt
nur f&uuml;r... Aber ich schweife schon wieder...
</P>
<P>
Res&uuml;mee - Was ist in den letzten 20 Jahren passiert?
Vom 256 Byte Taschenrechner &uuml;ber den 1 KByte ZX 81 &uuml;ber den 52 KByte C64
&uuml;ber einen 1 MByte Amiga und einen 9 MByte Amiga und einen 18 MByte Amiga
zum 80 MByte PC.
</P>
<P>
Meine Philosophie ist offensichtlich - nutze das was im Moment die besseren
L&ouml;sungen bietet. Darum sehe ich den Amiga nur als einen Schritt in der
Computertechnik. Warum also um alles in der Welt sich daran festbei&szlig;en?
Irgendwann wird es dem PC genauso gehen, und ein anderer Stern wird
aufsteigen.
</P>
<P>
Vielleicht sogar fr&uuml;her als wir alle erwarten... Und wie hei&szlig;t es so sch&ouml;n:
&quot;Der Computer l&ouml;st f&uuml;r uns die Probleme, die wir ohne ihn gar nicht
h&auml;tten!&quot;
</P>
<P>
...Und angefangen hat alles mal mit einem Buch...
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Martin A. Endrikat&nbsp;</TD><TD VALIGN="TOP">&lt;<A HREF="mailto:mae.nms@foni.net">mae.nms@foni.net</A>&gt;&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
