<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Die Beteiligung war diesmal mit 43 Einsendungen etwas h&ouml;her als im
Vormonat.
</P>
<P>
Denkt dran: Selbst, wenn ihr die Antwort zur Masterfrage nicht wisst, nehmt
ihr an der Verlosung teil, wenn ihr die beiden anderen Fragen beantwortet.
</P>
<P><B>Jetzt aber zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Wie hei&szlig;t die Computermesse, die Mitte November in K&ouml;ln&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">stattfand?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Richtig war nat&uuml;rlich &raquo;Home Electronics World ('99)&laquo;.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Auf dieser Messe hat Metabox seine neue G3-Karte amiJoe 1200&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">vorgestellt. Am Stand welches Amiga-Softwareherstellers war&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">das Produkt (bzw. zeitweilig nur dessen Verpackung) zu sehen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Es handelte sich um Titan Computer.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Wie w&uuml;rde sich deiner Meinung nach ein Aufkauf der Amiga-&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Rechte durch ein anderes Unternehmen auf die zuk&uuml;nftige&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Amiga-Situation auswirken?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Die Auswertung:</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Sehr positiv.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">11&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Eher positiv.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">27&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Eher negativ.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">4&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Sehr negativ.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ein Teilnehmer wollte keine konkrete Antwort geben.
</P>
<P>
Einige Einsender haben zu ihrer Beantwortung der Meinungsfrage Stellung
genommen. Die Aussagen sind inhaltlich zwar mittlerweile &uuml;berholt, d&uuml;rften
aber dennoch nicht uninteressant sein:
</P>
<P>
Walter Terczewski &auml;u&szlig;ert sich wie folgt:
</P>
<P>
&raquo;Nach der &Uuml;bernahme durch Gateway hatte ich eigentlich noch die Hoffnung,
da&szlig; es mit dem Amiga wieder aufw&auml;rts geht.Durch den Rausschmiss von Jim
Collas (einer der wenigen, die in dem Laden &uuml;berhaupt Interesse am Amiga
zeigten) hat sich aber dann doch herausgestellt, da&szlig; seitens Gateway
&uuml;berhaupt kein Interesse besteht, den Amiga am Leben zu erhalten.
Wenn sich nicht umgehend jemand findet, der ernsthaft am Fortbestehen des
Amiga interessiert ist, sieht es wohl sehr, sehr d&uuml;ster f&uuml;r unsere Freundin
aus. Darum sehe ich den Verkauf an einen Interessenten eher positiv. Denn
schlimmer kann es nicht mehr werden ;-)&laquo;
</P>
<P>Dirk Hase meint:</P>
<P>
&raquo;Es kommt nur darauf an, wer Amiga kauft. Hoffen wir, da&szlig; Jim Collas genug
Geld hat !!! :)))&laquo;
</P>
<P>
Ein ausf&uuml;hrliches Statement kommt von Wolfgang M&uuml;nch:
</P>
<P>
&raquo;Die Amiga-Rechte haben schon so oft den Besitzer gewechselt, ohne dass
irgendwas Neues auf den Markt kam. Kein Entwickler, keine Softwarefirma
w&uuml;rde sich von einem neuerlichen Wechsel neue Impulse versprechen. Das
h&auml;tte nur einen Sinn, wenn bereits am Amigamarkt etablierte Firmen wie
Phase 5 oder Haage&amp;Partner die Rechte erhielten; aber die werden wohl kaum
genug Kapital f&uuml;r den Erwerb von Amiga UND Konstruktion neuer Rechner
haben. Nach Gateway sehe ich eigentlich nur noch eine L&ouml;sung:
</P>
<UL>
<LI> Freigabe des OS oder gro&szlig;z&uuml;gige Lizensierung
</LI>
<BR><LI> Portieren des OS auf CHRP-Plattformen inkl. 68k-Emulation
</LI>
</UL>
<P>
Risc-CPUs sind einfach schneller, und da der Wechsel zum PPC auf dem Amiga
schon vollzogen ist, sollte man versuchen, jetzt auf eine Standardhardware
wie das IBM-Board zu setzen. Nur verbreitete Hardware wird auch
weiterentwickelt; die Classic-Hardware wird wohl nach Abverkauf der 1200er
auslaufen. Beim jetztigen Stand (PPC-Karten, 68k-Emulation) ist der Wechsel
auf CHRP nur logisch! Der NG-Amiga h&auml;tte mit der Classic-Serie sowieso nix
mehr gemeinsam gehabt, und ich pers&ouml;nlich h&auml;nge an meinem 4000/PPC wie der
Papst am Katholizismus. Bei einem Classic-Amiga-Kompatiblem auf CHRP-
Standard mit G4 oder sp&auml;ter G5 w&auml;re ich auf jeden Fall dabei, wenn mir mein
604 zu langsam wird!&laquo;
</P>
<P>Fritz Trampnau schreibt:</P>
<P>
&raquo;Je eher Gateway AMIGA verkauft, desto besser! Die Amis blockieren eh
alles, und haben obendrein auch noch Null Ahnung vom AMIGA!
Wenn sich ein neuer K&auml;ufer f&uuml;r AMIGA findet, kann der's noch schlechter
machen?!
Eigentlich kaum vorzustellen - aber warten wir's mal ab!&laquo;
</P>
<P>
Auch Andreas Etzrodt meldet sich zur Wort:
</P>
<P>
&raquo;Nat&uuml;rlich muss man erst wissen, welche Firma dies ist, bevor man
sagen kann, dass es besser oder schlechter wird. Aber viel schlechter als
mit Gateway kann es nicht werden, oder?&laquo;
</P>
<P>
Oliver Tacke fasst seine Ansicht in einem Satz zusammen:
</P>
<P>
&raquo;Es wei&szlig; nat&uuml;rlich keiner, was f&uuml;r Ziele ein neuer K&auml;ufer haben w&uuml;rde, aber
schlimmer kann es kaum werden.&laquo;
</P>
<P>
Stefan Klein sieht einen Aufkauf &raquo;eher positiv - wenn die richtigen Leute
in der Firma arbeiten.&laquo;
</P>
<P>
David Scheibler beantwortet die Frage so:
</P>
<P>
&raquo;Kann man nicht genau sagen, ob positv oder negativ. Je nachdem, was das
Unternehmen so vorhat.&laquo;
</P>
<H3>Fazit:</H3>
<P>
Unter den Einsendern waren zwei verschiedene Grundauffassungen zu
beobachten: Ein Teil der Leser meinte, es sei durchaus wichtig, wer AMIGA
&uuml;bernimmt, andere Teilnehmer entgegneten, dass sich die Amiga-Situation
sowieso nicht mehr verschlimmern k&ouml;nne.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Schnittstellenkarte &quot;Hypercom 1&quot;: Claus Grewe&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Grafiksoftware &quot;SView Productivity Suite&quot;: Oliver Tacke&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Grafiksoftware &quot;SView Productivity Suite&quot;: Wolfgang M&uuml;nch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Grafiksoftware &quot;SView Productivity Suite&quot;: André K&ouml;hler&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Dirk Weyand&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;ManiacBall&quot;: Andreas Wendorf&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Herzlichen Gl&uuml;ckwunsch!
</P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
