<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Nach dem Verkauf von AMIGA: Neue Hoffnung f&uuml;r die User
</P>
<P>
Wer es immer noch nicht fassen kann und es lediglich f&uuml;r einen Traum h&auml;lt,
dem sei nochmals versichert: Es ist wahr. Gateway hat AMIGA an Amino
Development verkauft - und damit an das Unternehmen, das von Bill McEwen
und Fleecy Moss gegr&uuml;ndet worden ist.
</P>
<P>
Nach einem Vierteljahr der Frustration gibt es p&uuml;nktlich zum Jahreswechsel
wieder neue Hoffnung. Mehr noch: Erstmals seit &uuml;ber 15 Jahren ist AMIGA
keine Tochtergesellschaft eines gr&ouml;&szlig;eren Unternehmens, sondern
eigenst&auml;ndig, und wird zudem von Personen gef&uuml;hrt, die sich eher als Amiga-
Fans als als Unternehmer betrachten d&uuml;rften.
</P>
<P>
Trotz alldem ist jedoch keine Euphorie angesagt: Bis zur Ank&uuml;ndigung eines
Amiga-Nachfolgers d&uuml;rfte zwar nur noch wenig Zeit vergehen, damit ist
dieser allerdings noch l&auml;ngst nicht auf dem Markt. Zuviel ist in den
letzten Jahren schief gegangen, und es gibt keine Garantie daf&uuml;r, dass wir
in Zukunft von R&uuml;ckschl&auml;gen verschont werden.
</P>
<P>
Wenn ich mir um etwas Sorgen mache, dann ist es die finanzielle Situation.
Zweifellos hat Amino/AMIGA mindestens einen Geldgeber, sonst h&auml;tten die
f&uuml;nf Millionen US-Dollar nicht aufgebracht werden k&ouml;nnen. Diese wollen
jedoch m&ouml;glichst rasch Erfolge sehen - wenn sie ausbleiben, werden auch
Bill McEwen und Fleecy Moss zwangsl&auml;ufig scheitern.
</P>
<P>
Bislang war AMIGA mit Gateway als Mutterkonzern finanziell auf der sicheren
Seite, jedoch steuerte das Unternehmen seit der Strategie&auml;nderung nach dem
R&uuml;cktritt von Jim Collas in eine Richtung, die von den Amiga-Anwendern
nicht mitgetragen wurde.
</P>
<P>
Nun sind wir mit der umgekehrten Situation konfrontiert: Dem Amino- (in
K&uuml;rze AMIGA-) Pr&auml;sidenten und -CEO Bill McEwen und seinem Gefolgsmann
Fleecy Moss fehlen es ganz sicher nicht am Willen, ein neues Computersystem
in der Tradition des Amigas zu erschaffen - das Gelingen dieses Vorhaben
h&auml;ngt jedoch ganz entscheidend von dem/den Kapitalgeber(n) ab.
Auf jeden Fall aber ist nun erst einmal wieder Zuversicht angesagt. Die
knapp dreij&auml;hrige Gateway-Episode, die zwischenzeitlich so vielversprechend
verlief, die Amiga-Anwender am Ende aber bitterst entt&auml;uschte, ist
Geschichte. Bleibt zu hoffen, dass die dritte AMIGA-&Uuml;bernahme nach dem
Konkurs von Commodore endlich zu einem positiven Ergebnis f&uuml;hrt. Verdient
haben wir uns dies schon l&auml;ngst, und ihr wisst ja: Aller guten Dinge sind
drei.
</P>
<P>
Und was haltet ihr von der AMIGA-&Uuml;bernahme? Wir ver&ouml;ffentlichen eure
Meinungen gern in der n&auml;chsten Ausgabe! Schreibt an: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<P>
Bis n&auml;chsten Monat,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
