<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P>
Hi!
</P>
<P>
Willkommen zu einer neuen Ausgabe des AMIGA aktuell Spieleteils. Nach
dem letzten Mini-Spieleteil gibt's diesen Monat schon wieder eine etwas
besser gef&uuml;llte Ausgabe. Besonders an News gab es diesen Monat sehr
viel und fast nur positiv. Also lest auf jeden Fall die &quot;Spiele News
aus aller Welt&quot;-Rubrik. Besonders auff&auml;llig diesen Monat ist auch, dass
einige Quelltexte zu popul&auml;ren Spielen ver&ouml;ffentlicht wurden, so
z.B. Quake und Descent 2. Ich pers&ouml;nlich finde dies von den Firmen
sehr sozial, da nun auch wir Amiga-User und andere Minderheiten im
Computergesch&auml;ft in den Genuss solcher Spiele kommen.
</P>
<P>
In der letzten Ausgabe hatte ich ein wenig f&uuml;r den Cheats-Service
von Ewald M&ouml;ller geworben und dieser wurde mit gro&szlig;er Resonanz
genutzt, wie ich erfahren habe. Dabei konnte Ewald den meisten
Spielern gleich helfen, sogar mir. Also, wenn ihr eine Frage zu
einem Spiel habt, seit ihr bei Ewald M&ouml;ller genau richtig.
</P>
<P>
Diesen Monat gibt es auch erstmals wieder Reviews von Spielen aus
dem Aminet. Heiko Garrelts hat sich bereiterkl&auml;rt jede Ausgabe ein
paar Spiele etwas n&auml;her vorzustellen. Die ersten Reviews k&ouml;nnt
ihr bereits in dieser Ausgabe lesen. Passend dazu werde ich jetzt
vorraussichtlich auch jeden Monat die Neuzug&auml;nge im Aminet hier
ver&ouml;ffentlichen. Au&szlig;erdem liste ich nun auch in der Emulatorenrubrik
die Neuzug&auml;nge aus dem Aminet auf.
</P>
<P>
Reviews von kommerziellen Spielen gibt es diesen Monat leider
keine, aber n&auml;chsten Monat haben wir bestimmt ein Review zu
Foundation Director's Cut im Spieleteil. M&ouml;glicherweise auch noch
einige andere. Daf&uuml;r k&ouml;nnt ihr in dieser Ausgabe ein Preview
zu Bubble Heroes lesen.
</P>
<P>
Auch die Mac-Ecke gibt`s diesen Monat wieder mit neuen Reviews
und Infos rund um die Macintosh Emulation am Amiga. Lest euch
bitte mal das Vorwort von Andreas Koch durch, denn er sucht
immer noch freiwillige Tester von Macintosh Spielen.
</P>
<P>
So, jetzt aber viel Spa&szlig; mit dieser Ausgabe,
</P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
