<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele8.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. Mac-Ecke</H2>
<H3>7.1. Vorwort</H3>
<P>
Servus im neuen Jahrtausend! [Anm. d. Red.: Das neue Jahrtausend beginnt
erst am 1.1.2001]
</P>
<P>
Und mit dem neuen Jahr auch eine neue Ausgabe der Mac-Ecke - die in dieser
Form wahrscheinlich die letzte ihrer Art ist. Aufgrund meines Studiums
bleibt mir n&auml;mlich im Moment kaum noch Zeit, Spiele vern&uuml;nftig anzuspielen
und l&auml;ngere Testberichte zu verfassen.
</P>
<P>
Im Grunde genommen soll die Mac-Ecke ab sofort so weiterlaufen, wie ich es
&uuml;rspr&uuml;nglich gedacht hatte - n&auml;mlich als Sammlung von Beitr&auml;gen vieler
verschiedener Leser, ohne Notwendigkeit einer eigenen Rubrik. Das Ganze
soll dann folgenderma&szlig;en aussehen: Das Blanko-Formular bleibt, so wie es
ist, im Spieleteil der AAkt erhalten. Wer also einen Testbericht einbringen
will, kann dieses einfach ausf&uuml;llen und an mich oder Andreas Falkenhahn
schicken.
</P>
<P>
Im &uuml;brigen werde auch ich versuchen, mein Limit von mindestens zwei
Artikeln pro Ausgabe zu halten; vielleicht als Ansporn f&uuml;r andere, auch
einmal ihren eigenen Erfahrungsbericht von einem Spiel auf einer
Mac-Emulation zu ver&ouml;ffentlichen. Immerhin hilft das auch allen anderen
Lesern (und damit auch mir), einen besseren &Uuml;berblick &uuml;ber die
Mac-Spielewelt zu erhalten und so Kaufentscheidungen zu rechtfertigen.
</P>
<P>
Ich erspare mir also in dieser Ausgabe den Aufruf und appeliere an dieser
Stelle noch einmal an die Amiga-Userschaft da draussen - lasst andere an
eurem Wissen und euren Erfahrungen teilhaben!
</P>
<P>
Auch die Kompatibilit&auml;tsliste wird vermutlich in n&auml;chster Zeit &uuml;berfl&uuml;ssig,
da das Print-Magazin AmigaOS auf ihrer Homepage eine &auml;hnliche Liste
zusammenstellt - warum also Arbeit doppelt machen? Zur Zeit sind mir aber
noch ein paar Titel dieser Seite etwas Suspekt, weswegen meine Liste
nocheinmal hier ver&ouml;ffentlicht wird, bis Unstimmigkeiten gekl&auml;rt sind.
</P>
<P>
Schlie&szlig;lich noch eine, zumindest f&uuml;r mich, &uuml;beraus positive Nachricht aus
der Mac-Spielewelt: nach Monaten oder Jahren ist endlich die Version 3.3
des Ascii-Rollenspieles Nethack ver&ouml;ffentlicht worden - und wer die erste
Ausgabe der Mac-Ecke gelesen hat, der weiss, dass dieses Spiel mein
absoluter Favorit ist. Wer also Interesse an diesem Spiel bekommen haben
sollte, der besucht schleunigst &quot;www.nethack.org&quot;, wo die aktuelle Version
zum Download f&uuml;r Mac und Linux bereitliegt.
</P>
<P>
Bye,
</P>
<P>
Andreas Koch
</P>
<P>
<A HREF="mailto:Andreas.Koch@wirtschaft.uni-giessen.de">Andreas.Koch@wirtschaft.uni-giessen.de</A>
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
