<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Neues von Lambda
</LI>
</UL>
<P>
Mikko Kallinnen, Autor von Lambda, berichtet in seinem Statusreport,
dass alle Basisfunktionen der 3D Engine definiert wurden und in
OpenGL implementiert sind. &Uuml;ber die Umsetzung von Descent: Freespace
ist er allerdings alles andere als begeistert, er hatte n&auml;mlich
Lambda begonnen, weil es keine guten Weltraum 3D Spiele f&uuml;r den
Amiga gibt. Nun ist er aber fest entschlossen, z&uuml;gig an Lambda
zu entwickeln, dass es auf jeden Fall besser werde, als der Kontrahent.
</P>
<UL>
<LI> Hyperion Software erwirbt neue Lizenz
</LI>
</UL>
<P>
Hyperion Software hat mal wieder was neues eingekauft: Diesmal eine
Lizenz zum Portieren des (technischen) Descent Nachfolgers &quot;Freespace:
The Last War&quot;. Dieses Spiel wird selbstverst&auml;ndlich nur f&uuml;r PowerPC
Amigas ver&ouml;ffentlicht und soll noch in der 1. H&auml;lfte dieses Jahres
erscheinen. Au&szlig;erdem wurden diesen Monat die ersten offiziellen
Screenshots zu Heretic 2 ver&ouml;ffentlicht. AMIGA aktuell Leser durften
allerdings schon im November einen ersten Blick auf die Screenshots
einer Heretic 2 Beta werfen. Die neuen Screenshots k&ouml;nnen bei
Titan Computer unter <A HREF="http://www.titancomputer.de/ami/heretic/" TARGET="_TOP">http://www.titancomputer.de/ami/heretic/</A>
angeschaut werden.
</P>
<UL>
<LI> Die besten Amiga Spiele 1999
</LI>
</UL>
<P>
Die Spieleseite Amigaflame hat die 10 besten Amiga-Spiele 1999
w&auml;hlen lassen. Auf Platz 1 steht Wipeout 2097 mit &uuml;ber 100
Stimmen, auf Platz 2 ist Napalm gelandet und Platz 3 nimmt
Wasted Dreams ein. T-Zer0 ist nur auf Platz 5 gew&auml;hlt worden.
</P>
<UL>
<LI> Simon the Sorcerer 2 Vorbestellungen
</LI>
</UL>
<P>
Laut Epic Marketing wurden bisher erst ca. 160 Vorbestellungen f&uuml;r
Simon the Sorcerer 2 erreicht. Um das Spiel zu ver&ouml;ffentlichen,
br&auml;uchte Epic Marketing aber mindestens 500 Vorbestellungen. Wer
also noch nicht bestellt hat, kann das unter <A HREF="http://www.epic-marketing.de" TARGET="_TOP">http://www.epic-marketing.de</A>
tun.
</P>
<UL>
<LI> Quelltexte von Quake ver&ouml;ffentlicht
</LI>
</UL>
<P>
ID Software hat die Quelltexte von Quake I zum Download bereitgestellt.
Auch clickBOOM hat darauf die Quelltexte von dem Amiga-Port von
Quake bereitgestellt. clickBOOM will Programmierer unterst&uuml;tzen,
die Quake mit Hilfe dieses Quelltextes auf PowerPC portieren.
Die Original CD-ROM von clickBOOM sei dann aber immer noch
erforderlich. Steffen H&auml;user hat schon mit einer Portierung begonnen.
</P>
<UL>
<LI> Descent II Quelltexte ver&ouml;ffentlicht
</LI>
</UL>
<P>
Auch die kompletten Quelltexte von Descent II wurden diesen
Monat ver&ouml;ffentlicht. Erste Amiga Portierungen wurden schon
angek&uuml;ndigt.
</P>
<UL>
<LI> Parrot Island jetzt Freeware
</LI>
</UL>
<P>
Frank Otto hat die Vollversion von Parrot Island ins Aminet
geladen. Parrot Island ist eine Adventure in AMOS, welches
1996 im Amiga Joker die Traumwertung von 27% erzielte. Der
Testbericht war damals ein richtiger Lachknaller.
</P>
<UL>
<LI> Neues von clickBOOM
</LI>
</UL>
<P>
In den sogenannten &quot;S-Files&quot; will clickBOOM jetzt jeden Monat
die Neuigkeiten verk&uuml;ndigen. Diesen Monat gab es nur Weihnachts-
und Neujahrsgr&uuml;&szlig;e sowie einen Scherz &uuml;ber ein angebliches neues
Amiga-Spiel. Diesen Monat soll es aber &quot;echte&quot; Neuigkeiten zu
Nightlong, TNT und einigem mehr geben. Au&szlig;erdem scheint wieder
eine Verlosung bevorzustehen, bei der man alle clickBOOM Spiele
auf Lebzeit gewinnen kann. Ver&ouml;ffentlicht wurden auch neue
Movietrailer zu Nightlong.
</P>
<UL>
<LI> Award f&uuml;r Amiga Active
</LI>
</UL>
<P>
Das Magazin Amiga Active wurde von der Spielenews Seite Amigaflame
f&uuml;r perfekte Reviews pr&auml;miert. Das Spielemagazin, welches nicht im
Handel erh&auml;ltlich ist, kann jetzt auch per Kreditkarte bezogen
werden. Dies w&auml;re auch ein einfacherer Weg f&uuml;r Europ&auml;er an das
Magazin aus den USA ranzukommen. In der neuesten Ausgabe gibt es
auf der Cover CD-ROM eine exklusive Wipeout 2097 Demo sowie
einige andere neue Demos. Mehr Infos gibt es auf Webseite des
Magazins auf <A HREF="http://www.amigactive.com/" TARGET="_TOP">http://www.amigactive.com/</A>.
</P>
<UL>
<LI> Foundation Update 1.27 ver&ouml;ffentlicht
</LI>
</UL>
<P>
F&uuml;r Foundation wurde ein neues Update ver&ouml;ffentlicht. Version 1.27
l&auml;sst sich wie immer von der Foundation Supportseite laden.
(<A HREF="http://www.sneech.freeserve.co.uk/foundation/" TARGET="_TOP">http://www.sneech.freeserve.co.uk/foundation/</A>).
</P>
<UL>
<LI> Amiga Spiele Wunschliste
</LI>
</UL>
<P>
Auf der Amiga Future Webseite (<A HREF="http://www.amigafuture.de/" TARGET="_TOP">http://www.amigafuture.de/</A>) wurde
ein Bereich eingerichtet, der es Amiga Benutzern erm&ouml;glicht, ihre
pers&ouml;nlichen Wunschsspiele einzutragen. Die Ergebnisse werden
ausgewertet und Programmierer k&ouml;nnen sich einen &Uuml;berblick erschaffen,
welche Spiele gew&uuml;nscht sind.
</P>
<UL>
<LI> Neue Bubble Heroes Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Arcadia Developments hat eine neue Version ihres Spieles Bubble Heroes
ver&ouml;ffentlicht. Ein Preview dazu k&ouml;nnt ihr in dieser AMIGA aktuell
Ausgabe lesen.
</P>
<UL>
<LI> Neues von Alive Mediasoft
</LI>
</UL>
<P>
Man mag es kaum glauben, aber Alive Mediasoft verkauft nach
eigenen Angaben mehr Spiele denn je. Sie k&auml;men mit der Produktion
gar nicht mehr hinterher, so gro&szlig; sei die Anfrage in den
letzten Monaten gewesen. Es scheint also doch noch gen&uuml;gend
Interesse an Amiga Spielen zu geben. Besonders erstaunt mich,
dass Alive Mediasoft eigentlich nur alte Spiele neu rausbringt
(Superfrog, Whale`s Voyage u.v.m.) und dass diese sich dann
noch so gut verkaufen. Au&szlig;erdem gibt es eine neue Weihnachtsaushabe
ihres hauseigenen Magazines The Pulse, welches gratis f&uuml;r
alle Amiga Benutzer zu haben ist. Bestellt werden kann es
ganz einfach per e-Mail. Au&szlig;erdem wurden folgende Spiele
ver&ouml;ffentlicht: Black Viper, Goal 2000, Fightin' Spirit, Putty Squad,
Spherical Worlds, Whale`s Voyage und Whale`s Voyage 2. Alle
Spiele au&szlig;er Putty Squad sind Re-Releases von schon vor einigen
Jahren erschienener Amiga-Spiele. Einige dieser Spiele wurden
damals nur in Deutschland ver&ouml;ffentlicht und deshalb k&ouml;nnten
diese Top-Spiele in England noch echte Absatzkn&uuml;ller werden,
denn Spiele wie Whale`s Voyage 2 oder Fightin' Spirit sind
wirklich Hits.
</P>
<UL>
<LI> Sharks! f&uuml;r CD32
</LI>
</UL>
<P>
Es wird seit langem mal wieder ein neues CD32 Spiel geben:
Andreas Etzrodt hat es geschafft, eine Version von seinem
Spiel Sharks! auf dem CD32 lauff&auml;hig zu machen. Das ganze
wird ungef&auml;hr 30 DM kosten und interessierte CD32 Besitzer
k&ouml;nnen sich schon mal bei Andreas Etzrodt &lt;<A HREF="mailto:the_shark@gmx.de">the_shark@gmx.de</A>&gt;
melden.
</P>
<UL>
<LI> WipeOut 2097 Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Digital Images hat eine Demo zu Wipeout 2097 ver&ouml;ffentlicht.
Sie l&auml;sst sich von der Digital Images Webseite laden und
ist etwa 4 MB gro&szlig;.
</P>
<UL>
<LI> Goal 2000 Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Auch von Goal 2000 wurde eine spielbare Demoversion ver&ouml;ffentlicht,
die von der Alive Mediasoft Webseite geladen werden kann.
</P>
<UL>
<LI> Kabuki Dash Zero von Digital Visionaries
</LI>
</UL>
<P>
Die Entwickler von Digital Visionaries haben ihr zweites Spiel
angek&uuml;ndigt: Kabuki Dash Zero. Dieses Spiel soll ein Anime/Manga
Puzzle Spiel werden, in dem folgende Spieltypen vorkommen:
Kampfaktionen, Tetris und Abenteuer. Da darf man also durchaus
mal gespannt sein. Kabuki Dash Zero ben&ouml;tigt 4MB Ram, CD-ROM
und Festplatte. Das Spiel soll noch im 1. Quartal dieses Jahres
erscheinen.
</P>
<UL>
<LI> Neues von Exodus - The Last War
</LI>
</UL>
<P>
Von Exodus - The Last War wurden neue Screenshots ver&ouml;ffentlicht.
Sie k&ouml;nnen auf der Homepage des Spiels (<A HREF="http://free.polbox.pl/a/agnus97/" TARGET="_TOP">http://free.polbox.pl/a/agnus97/</A>)
angeschaut werden. Der Ver&ouml;ffentlichungstermin wurde au&szlig;erdem
auf M&auml;rz-April 2000 verschoben.
</P>
<UL>
<LI> Die besten 50 Amiga Spiele
</LI>
</UL>
<P>
Auf AmigaGames.com k&ouml;nnen st&auml;ndig die 50 besten Amiga Spiele
aller Zeiten gew&auml;hlt werden. Jeden Monat wird die komplette
Liste aktualisiert. Momentan befindet sich Die Siedler auf
Platz 1, Monkey Island auf Platz 2 und Civilization auf Platz
3.
</P>
<UL>
<LI> GUI Programmierer gesucht
</LI>
</UL>
<P>
The World Foundry sucht f&uuml;r ihr Spiel Maim &amp; Mangle einen f&auml;higen
GUI Programmierer, der folgende F&auml;higkeiten mitbringen sollte:
Erfahrung mit allen GUI Typen am Amiga, Erfahrung mit CyberGraphX
Programmierung, portablen C Code zu schreiben und dabei StormC
zu verwenden. Au&szlig;erdem sollte er sich an t&auml;glichen Diskussionen
in einer speziellen Mailingliste beteiligen. Interessierte wenden
sich bitte mit Angabe ihres Amiga-Systems an <A HREF="mailto:ed@worldfoundry.com.">ed@worldfoundry.com.</A>
</P>
<UL>
<LI> Immortal Musik CD-ROM erh&auml;ltlich
</LI>
</UL>
<P>
Ruben Monteiro hat ein Album mit Musikst&uuml;cken der besten Amiga
Spiele ver&ouml;ffentlicht. Auf der Audio CD-ROM befinden sich u.a.
Musikst&uuml;cke aus Shadow of the Beast, Turrican, Superfrog, Alien
Breed 3D und mehr. Alle St&uuml;cken seien mit modernstes Studiotechnik
neu aufgenommen worden, so Monteiro. Die CD ist f&uuml;r umgerechnet
35 DM direkt bei Ruben Monteiro &lt;<A HREF="mailto:Ruben.Monteiro@netzero.pt">Ruben.Monteiro@netzero.pt</A>&gt;
erh&auml;ltlich.
</P>
<UL>
<LI> Programmierer von Erben der Erde gesucht
</LI>
</UL>
<P>
Andreas Magerl vom APC&amp;TCP sucht dringend den Programmierer
der Amiga Version von Erben der Erde. Wer weiterhelfen kann,
wendet sich bitte an Andreas Magerl &lt;<A HREF="mailto:Andreas@chiemgau.org">Andreas@chiemgau.org</A>&gt;.
</P>
<UL>
<LI> Neue Payback Screenshots
</LI>
</UL>
<P>
Auch diesen Monat hat Apex Designs wieder neue Screenshots zu
ihrem Spiel Payback ver&ouml;ffentlicht. Sie k&ouml;nnen auf der Website
der Gruppe <A HREF="http://www.apex-designs.net/" TARGET="_TOP">http://www.apex-designs.net/</A> angeschaut werden.
Apex Designs verdeutlicht immer wieder, dass die Amiga User
durch die st&auml;ndig aktualisierten Screenshots von Payback immer
auf dem laufenden gehalten werden sollen und nicht den Eindruck
bek&auml;men, dass sich nichts in der Entwicklung tut.
</P>
<UL>
<LI> Neues von Delsyd Software
</LI>
</UL>
<BR>
The Last Patriot von Delsyd Software wurde vorerst eingestellt,
da die Gruppe kein PPC Karte zur Verf&uuml;gung hat. Die Arbeiten
an Pimpin' ain't easy werden jedoch fortgesetzt. Man hofft mit
einer baldigen Ver&ouml;ffentlichung.
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
