<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Der Commodore-Untergang aus meiner Sicht - Teil 3 (von Rainer Benda)</H2>
<H3>&raquo;Warum hat Commodore den Amiga 600 auf den Markt gebracht?</H3>
<P>
Gute Frage....der Grund liegt meiner (unserer) Einsch&auml;tzung nach in der
falschen Beurteilung Commodore'e zu dieser Zeit. Wie schon erw&auml;hnt, durften
Gesch&auml;ftsf&uuml;hrer so ziehmlich alles machen was sie wollten, wenn der Umsatz
stimmte.
</P>
<P>
Und anscheinend hatte man bei Commodore das Gef&uuml;hl, sich Experimente wieder
&quot;leisten&quot; zu k&ouml;nnen. Damaliges Megastichwort (vor Multimedia) war
&quot;innovativ&quot;.
</P>
<P>
Man suchte bei Commodore nach einem A500 Nachfolger. Der A500 war
eigentlich der Umsatzbringer und es immer hie&szlig; &quot;solange sich ein Produkt
verkauft, werden wir es anbieten&quot;, trotzdem verschwand der A500, wie auch
der A3000, obwohl daf&uuml;r keine Notwendigkeit bestand. Jedenfalls nicht zu
diesem Zeitpunkt, denn richtige Alternativen gab es ja leider nicht.
</P>
<P>
Commodore USA gab &quot;Entwicklungen&quot; vor und fragte nach dem Prinzip &quot;k&ouml;nnt
ihr das verkaufen ? - und wenn ja, wieviel davon ?&quot;. Helmut Jost war der
Ansicht, er k&ouml;nne vom A600 (Arbeitstitel &quot;A300&quot;) 300.000 St&uuml;ck pro Quartal
verkaufen (in diesen Mengen verkaufte C= zu den besten Zeiten gerademal
seinen A500).
</P>
<P>
W&auml;re der Name bei A300 geblieben, w&auml;re er seinem Ruf vielleicht eher
gerecht geworden :-), es kam nur leider anders. :-(
</P>
<P>
Commodore sah den Vorteil des A600 in der kosteng&uuml;nstigeren
Produktionsweise (SMD), der kompakten Bauart und der &quot;leichten&quot;
Aufr&uuml;stbarkeit via PCMCIA. Anscheinend hatten da einige K&ouml;pfe nicht
bedacht, da&szlig; PCMCIA-Erweiterungen (Anfang der 90er) doch extrem teuer
waren.
</P>
<P>
Eine weiteren &quot;Vorteil&quot; sah man in der M&ouml;glichkeit, im A600 eine HD anzu-
schliessen. Leider gab es dann zwei Varianten des A600, n&auml;mlich ohne HD und
ohne direkte Anschlu&szlig;m&ouml;glichkeit, da das eingebaute Kickstart-ROM V37.299
nicht in der Lage war, HD's anzusprechen (es fehlte dann auch die HD-
Install Diskette und die Halterung f&uuml;r eine HD, sowie das 2,5&quot; Kabel) und
eben den A600HD, der Anfangs mit 20MB Festplatte und sp&auml;ter mit 40MB
Festplatte ausgeliefert wurde.
</P>
<P>
F&uuml;r den nackten A600 gab es dann sp&auml;ter ein Upgrade-Kit auf die 40MB Fest-
platte, mit den anderen &quot;fehlenden&quot; Teilen und dem Kickstart-ROM V37.300,
das sp&auml;ter durch die Version V37.350 ersetzt werden musste, da es 2,5&quot;
Festplatten gab, die eine zu lange Anlaufzeit hatten und somit der A600
bereits beim Booten war, ohne die Festplatte zu ber&uuml;cksichtigen.
</P>
<P>
Konkrete Vorteile, wie eben die M&ouml;glichkeit, 2 MB CHIP-RAM und bis zu 8MB
FAST-RAM (also 10MB insg.) verwalten zu k&ouml;nnen und dies auch in den Werbe-
prospekten unterzubringen, lehnte H. Jost strikt ab. Wir durften f&uuml;r die
Marketingabteilung die Prospektentw&uuml;rfe zwar inhaltlich korrigieren, nur
wurde das entweder nicht ber&uuml;cksichtigt (manche Vorlagen wurden ein halbes
Dutzendmal von uns korrigiert), oder man &uuml;bersah sie einfach. Ich hab die
Passage mit &quot;max. 8MB RAM&quot; solange durchgestrichen, bis H. Jost endlich
nachgab.
</P>
<P>
Die Personalproblematik bei Entscheidungstr&auml;gern bestand nicht nur in
Deutschland, sondern auch in den USA. So war zu diesem Zeitpunkt die
Ansprechperson &quot;Bill Sydnes&quot;. Eigentlich kam er vom PC-Bereich Commodore's
und genau so wirkten sich dann auch seine Ansichten aus. Er verstand nicht
nur nichts von PC's (einhellige Ansicht meiner PC-Kollegen), sondern noch
weniger vom Amiga.
</P>
<P>
Da ich seinerzeit gegen den A600 Sturm gelaufen bin und eigentlich auch in
diesem Bereich aktive &quot;Arbeitsverweigerung&quot; betrieb (H. Jost verlangte von
mir, da&szlig; ich unserem Vertrieb die Vorz&uuml;ge des A600 gegen&uuml;ber einem A500
deutlich machen sollte) und sonst niemand so richtig f&uuml;r den A600 zu
begeistern war, versuchte C= Deutschland sich &quot;Hilfe&quot; aus USA zu besorgen.
</P>
<P>
Dazu verfasste Bill Sydness (1/2) ein Schreiben, in dem ER die Vorz&uuml;ge
dieses Ger&auml;ts auff&uuml;hrte.
</P>
<P>
Er schrieb (2/2) in seinem Memo an die Gesch&auml;ftsf&uuml;hrer genau die Punkte
rein, die eventuell mal Vorteile sein k&ouml;nnten, verkaufte sie aber als
bereits existierende Vorteile. Es war zwar sch&ouml;n zu lesen, da&szlig; man
Netzwerkkarten, Controller uvm. einbauen k&ouml;nne und das PCMCIA der kommende
Standard auch f&uuml;r Low-End Systeme werden w&uuml;rde, nur haben eben diese Punkte
zum damaligen Zeitpunkt nicht gestimmt. Und selbst wenn sie gestimmt
h&auml;tten, w&auml;re es fraglich, ob jemand bei einem 4-500 DM Rechner eine 512KB
PCMIA-Ram Karte f&uuml;r den Preis eines A600 kaufen w&uuml;rde.
</P>
<P>
Im Grunde war das f&uuml;r uns (mich) nie fraglich, denn wir haben weder f&uuml;r den
A600 noch f&uuml;r PCMCIA Zusatzprodukte eine Chance gesehen. Wir haben es
allerdings zur &quot;Kenntnis&quot; genommen, nachdem es hie&szlig;, Commodore w&uuml;rde eigene
PCMCIA-Produkte f&uuml;r den A6000 (und A1200) auf den Markt bringen. Das lie&szlig;
uns wenigstens hoffen, da&szlig; man es nicht kleinen Entwicklern &uuml;berlassen
musste, unsere Produkte zu unterst&uuml;tzen, damit wir &uuml;berhaupt Ger&auml;te
verkaufen konnten.
</P>
<P>
Bedauerlicherweise war auch Petro T. der Ansicht, der A600 sei ein tolles
Ger&auml;t. Ich unterstelle jetzt einfach mal, da&szlig; er es nicht besser wusste.
Wilfried H&auml;ring und ich haben seinerzeit versucht, Petro klazurmachen, da&szlig;
das Teil nichts taugt und er doch (Petro hat(te) einen direkten Draht zu
Mehdi Ali, der sagen wir mal der Commodore-&quot;Oberboss&quot; war) auf diesem Wege
versuchen sollte, Mehdi Ali von der Produktion dieses Ger&auml;ts abzuraten. Wir
wissen leider nicht, ob er das jemals getan hat. Der A600 kam ja leider
dennoch auf den Markt.
</P>
<P>
Nachdem was ich erfahren habe, war der A600 schon in Arbeit, als wir noch
versuchten, Argumente gegen den A600 vorzutragen. Helmut Jost hatte
scheinbar seine Ansicht weiterhin vertreten, er k&ouml;nne die genannten
Absatzzahlen auch wirklich realisieren. Es spielte also schon gar keine
Rolle mehr, ob wir uns wehren w&uuml;rden oder nicht, der A600 war beschlossene
Sache.
</P>
<P>
Kaum war der A600(HD) da, gingen die vorhergesagten Probleme los. Der
Widerstand bei den K&auml;ufern (Amiga-Magazin 7/92, Leserforum) richtete sich
gerechtfertigterweise gegen das Ger&auml;t und dessen Aufr&uuml;stm&ouml;glichkeiten und
Reparaturfeindlichkeit, sowie der nicht mehr 100%igen
Softwarekompatibilit&auml;t, wegen der fehlenden nummerischen Tastatur.
</P>
<P>
Commodore Westchester Ned McCook (1/2) verfasste ein Memo zum A600HD, indem
die einzelnen Niederlassungen aufgefordert wurden, umfangreiche
Softwaretests innerhalb von 48 Stunden (2/2) vorzunehmen und die Titel
aufzuf&uuml;hren, die bei einem A600(HD) Probleme aufgrund des mangelnden
Arbeitsspeichers und des fehlenden Zehnerblocks hatten. Diese &quot;Idee&quot; war
v&ouml;llig abw&auml;gig. Denn woher sollte man in dieser kurzen Zeit a) die Titel
heranschaffen, um einen aussagekr&auml;ftigen Bericht abliefern zu k&ouml;nnen und b)
waren gar keine Kr&auml;fte f&uuml;r solche Aktionen frei. Es gab zwar bei Commodore
eine Art Software-Archiv, die von Wolfgang Trompetter (unser letzter
technischer Direktor) &quot;CATS&quot; verwaltet wurde, allerdings waren diese Sachen
daf&uuml;r nicht geeignet.
</P>
<P>
In einem memo an H. Jost habe ich genau diese Zust&auml;nde bem&auml;ngelt,
allerdings war H. Jost meiner Meinung nach f&uuml;r viele Dinge nicht mehr
&quot;offen&quot;. Er schrieb einfach seine Kommentare auf Memos und wollte
Ergebnisse sehen, egal wie sinnvoll sie waren. Funkspots halfen dem A600
(und anderen Commodore-Produkten) auch nicht. Wer die Spots geh&ouml;rt hat,
wird wohl wissen warum.
</P>
<P>
Um den A600 zu &quot;retten&quot;, kam H. Jost auf die Idee, ihm eine externe Zehner-
tastatur zu verpassen (nicht nur wenig sinnvoll, sondern auch teuer). Zudem
musste das Teil auch irgendwo angeschlossen werden (meinetwegen an einem
durchgeschleiften Joyport) und man ben&ouml;tigte auch noch Treiber, um das Teil
ansprechen zu k&ouml;nnen. Alles keine kurzfristigen L&ouml;sungen (war aber auch
nicht mehr n&ouml;tig, wie sich hinterher rausstellte).
</P>
<P>
Irgendwann in einem Vertriebsmeeting, an dem ausnahmweise auch die Support-
Abteilung teilnehmen durfte, kamen neben verschiedenen Themen auch der A600
zur Sprache. Helmut Jost gab bekannt, da&szlig; Commodore seinerseits die PCMCIA-
Schnittstelle nicht &quot;weiter&quot; unterst&uuml;tzen werde.
</P>
<P>
Auf meine Frage, wo er denn dann die &quot;Vorteile&quot; des A600 s&auml;he, antwortete
er nach einer kurzen Pause: &quot;ich sehe auch keine Vorteile&quot;. Die anwesenden
Vertriebsmitarbeiter waren sichtlich schockiert, denn wie soll man etwas
verkaufen, wenn man keine Argumente f&uuml;r den Kauf sein solchen Produkts
an die Hand bekommt?
</P>
<P>
Kurze Zeit sp&auml;ter ging es mit dem A600 endg&uuml;ltig abw&auml;rts. Sein Preis fiel
immer schneller und H. Jost war besch&auml;ftigt, die Dinger so schnell wie
m&ouml;glich zu ver&auml;u&szlig;ern. Das war dann die Zeit, wo es die 600er so
schweinebillig in verschiedenen M&auml;rkten zu kaufen gab.
</P>
<P>
Ich denke, der A600 war einer der gro&szlig;en Sarkn&auml;gel Commodore's und der C65
(Seite 5) w&auml;re sogar noch ein gr&ouml;&szlig;erer geworden, der sicherlich schon 1-2
Jahre fr&uuml;her das Aus f&uuml;r Commodore bedeutet h&auml;tte.&laquo;
</P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
