<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Workshop: Installation von Debian2.1-Linux - Teil 4 (von Uwe Pannecke)</H2>
<P>
&raquo;Willkommen bei den Pinguinen
</P>
<P>
Linux-Installation
</P>
<P>
Teil 4 &quot;Das Finale&quot;
</P>
<H3>1. Datensicherung</H3>
<P>
Sp&auml;testens nachdem Ihr Euer frisches Linux-System individuell konfiguriert
und die ersten pers&ouml;nlichen Daten anfallen, dr&auml;ngt sich das Problem der
Datensicherung in das Bewu&szlig;tsein. Nat&uuml;rlich kann man dem Motto &quot;Es wird
schon nichts passieren - wozu also Backups wichtiger Daten?&quot; fr&ouml;nen. Aber
nach Murphy geht das nur bis zu dem Zeitpunkt gut, an dem Ihr Eure Daten
wirklich dringend ben&ouml;tigt.
</P>
<P>
Deshalb solltet Ihr der rechtzeitigen Datensicherung unbedingt die ihr
geb&uuml;hrende Aufmerksamkeit widmen. Versch&auml;rfend kommt unter Unix/Linux
hinzu, das ein unbedachter Befehl (insbesondere, wenn Ihr als &quot;root&quot; aktiv
seid), nicht nur die pers&ouml;nlichen Daten, sondern das komplette Linux-System
unwiederbringlich ins Daten-Nirvana schicken kann.
</P>
<P>
Um Euch solche Augenblicke des Entsetzens und der Schockstarre wenn schon
nicht ersparen, so doch nach einem kurzen Durchatmen und nachfolgenden
Griff zum aktuellen Backup ertr&auml;glicher zu machen, steht jederzeit eine
ganze Reihe von Programmen zur Verf&uuml;gung.
</P>
<P>
An erster Stelle sei hier der Tape Archiver &quot;tar&quot; genannt. Obwohl
urspr&uuml;nglich, wie der Name schon andeutet, f&uuml;r die Verwaltung von
Bandarchiven gedacht, kann (GNU-)&quot;tar&quot; ohne weiteres aber auch auf
Disketten zugreifen oder Datenarchive in Dateien auf z.B. Festplatten
anlegen. Zu erkennen sind diese Archive an der Dateiendung &quot;.tar&quot;.
Dar&uuml;ber hinaus ist &quot;tar&quot; in der Lage, die zu erstellenden oder zu
extrahierenden Archive &uuml;ber ein Komprimierungstool zu leiten. Sehr oft wird
f&uuml;r diese Zwecke &quot;gzip&quot; eingesetzt. Und diese Archive besitzen dann
&uuml;blicherweise die Dateiendung &quot;.tar.gz&quot;.
</P>
<P>
Auch auf dem Amiga existieren beide Programme, so da&szlig; Ihr ohne Probleme
Eure unter Linux erstellten Archive auf dem Amiga z.B entpacken k&ouml;nnt.
Selbst ein recht gut funktionirenden Tar-Handler [1] f&uuml;r die transparente
Unterst&uuml;tzung dieser Archive steht unter AmigaOS zur Verf&uuml;gung. So k&ouml;nnt
Ihr ohne Entpacken der Archive auf selbige zugreifen, als w&auml;ren es
Festplatten(verzeichnisse).
</P>
<H4>1.1 &quot;tar&quot; in der Kommandozeile</H4>
<P>
Benutzt Ihr &quot;tar&quot; &uuml;ber die Kommandozeile, m&uuml;sst Ihr dem Programm &uuml;ber
diverse Optionen mitteilen, was Ihr von ihm wollt. Da f&uuml;r die allt&auml;gliche
Arbeit einige wenige Optionen ausreichen, sollen diese an hier kurz
erl&auml;utert werden.
</P>
<B>Konstruieren wir drei Beispiele:</B>
<P>
1.1.1 Eine komprimierte Archivdatei erstellen
</P>
<P>
Ihr habt unter &quot;/home/gast&quot; diverse Dateien abgelegt, die nun von Linux aus
auf die amigaseitige Festplatte &quot;Work:&quot; (unter Linux gemountet als &quot;/ados&quot;-
siehe auch die vorhergehenden Teile dieses Workshops) im Verzeichnis
&quot;Backups&quot; als komprimiertes Archiv &quot;MeineDaten.tar.gz&quot; gesichert werden
sollen.
</P>
<P>
Die passende Kommandozeile w&auml;re dann
&quot;tar cvfz /ados/Backups/MeineDaten.tar.gz /home/gast&quot;.
</P>
<P>
Zur Erl&auml;uterung: tar erzeugt (Option c) die komprimierte (Option z weist
&quot;tar&quot; an, &quot;gzip&quot; f&uuml;r die Komprimierung zu benutzen) Archivdatei (Option f)
&quot;MeineDaten.tar.gz&quot;, in der alle Dateien im Verzeichnis /home/gast
einschlie&szlig;lich eventuell vorhandener Unterverzeichnisse enthalten sind. Die
Option v gibt w&auml;hrend des Packens die gerade behandelte Datei mit ihren
Namen auf dem Bildschirm aus.
</P>
<P>
1.1.2 Eine komprimierte Archivdatei entpacken
</P>
<P>
Ihr wollt ein im &quot;/tmp&quot;-Verzeichnis vorhandenes Archiv mit dem Namen
&quot;Pedro.tar.gz&quot; entpacken. Mit &quot;tar xvfz /tmp/Pedro.tar.gz&quot; wird ausgehend
von Eurem aktuellen (!) Verzeichnis die genannte komprimierte (deshalb
Option z) Archiv-Datei (Option f) unter Ber&uuml;cksichtigung aller eventuell im
Archiv vorhandener Unterverzeichnisse entpackt (Option x). Dabei wird durch
Angabe der Option v jede gerade entpackte Einzeldatei auf dem Bildschirm
angezeigt.
</P>
<P>
1.1.3 Auflisten des Archivinhalts
</P>
<P>
Die Archivdatei &quot;Zeigmich.tar.gz&quot; auf Eurer Selbstgebrannten CD soll ihren
Inhalt preisgeben. Das macht sie umgehend mit &quot;tar tfz
/cdrom/Zeigmich.tar.gz&quot;. &quot;Tar&quot; entlockt so dem komprimierten (Option z)
Archiv-Datei (Option f) ein Inhaltsverzeichnis (Option t).
</P>
<P>
Ausf&uuml;hrliche Informationen zur Bedienung des Programmes k&ouml;nnt Ihr erhalten,
indem Ihr mit &quot;man tar&quot; oder &quot;info tar&quot; die entsprechende Manpage (also die
Anleitung) aufruft.
</P>
<H4>1.2 Taper</H4>
<P>
Neben der &quot;tar&quot;-Nutzung &uuml;ber die Kommandozeile bieten sich unter Linux
verschiedene Programme f&uuml;r die Dateisicherung an. Ein Vertreter, der den
Umgang mit &quot;tar&quot; erleichtert, ist &quot;taper&quot; von Yusuf Nagree [2].
&quot;Taper&quot; &uuml;nterst&uuml;tzt nicht nur, wie der Name eigentlich vermuten l&auml;&szlig;t,
Bandlaufwerke (SCSI und IDE), sondern dar&uuml;ber hinaus auch die
Datensicherung auf Wechselmedien wie Floppy und ZIP-Drives sowie die
Sicherung in Dateien auf der Festplatte.
</P>
<P>
Nach dem Start mit &quot;taper -T OPTION&quot;, wobei die passende OPTION f&uuml;r das
gew&uuml;nschte Backup-Ger&auml;t anzugeben ist (s f&uuml;r scsi, f f&uuml;r floppy, i f&uuml;r ide,
l f&uuml;r file und r f&uuml;r removable), &ouml;ffnet &quot;taper&quot; eine Programmoberfl&auml;che,
die eine Auswahl verschiedener Funktionen anbietet.
</P>
<P>
<A HREF="img/Linux-Taper01.png"><IMG SRC="thumb/Linux-Taper01.jpg" WIDTH="120" HEIGHT="82" ALT="Screenshot"  BORDER="0"></A>
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Au&szlig;erdem l&auml;&szlig;t sich (leider erst nach Konfiguration im z.B. Backup-Modus)&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">eine Online-Hilfe &uuml;ber&nbsp;</TD><TD VALIGN="TOP">h, H oder ? aktivieren.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<A HREF="img/Linux-Taper02.png"><IMG SRC="thumb/Linux-Taper02.jpg" WIDTH="120" HEIGHT="82" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Getestet wurde &quot;taper&quot; mit einem SCSI-DAT-Streamer HP 35470A. Dabei stellte
sich heraus, da&szlig; die &quot;taper&quot;-Version 6.9r1, die der Debian2.1-Distribution
beiliegt, zumindest mit dem vorliegenden Linux nicht korrekt
zusammenarbeiten wollte, sogar das komplette System zum Absturz brachte.
Und das will unter Linux schon etwas bedeuten.
</P>
<P>
Nachdem die vorliegende Version durch die &auml;ltere Version 6.8.4 ersetzt
wurde, geh&ouml;rten die Probleme der Vergangenheit an.
</P>
<P>
<A HREF="img/Linux-Taper03.png"><IMG SRC="thumb/Linux-Taper03.jpg" WIDTH="120" HEIGHT="82" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Programmoberfl&auml;che erm&ouml;glicht nach kurzer Einarbeitungszeit eine recht
flexible und &uuml;bersichtliche Handhabung des Programmes. &quot;Taper&quot; legt f&uuml;r die
Verwaltung der Backups Info-Dateien an, die bei umfangreichen Backups sehr
gro&szlig; (mehrere MB) werden k&ouml;nnen.
</P>
<P>
Vor dem ersten &quot;taper&quot;-Einsatz empfiehlt sich wie bei allen anderen
Programmen auch ein intensives Studium der Anleitung. Wie unter Unix/Linux
&uuml;blich, kann man selbige nach Eingabe von &quot;man taper&quot; in die Kommmandozeile
nach kurzer Wartezeit auf dem Bildschirm lesen.
</P>
<H3>2. Das Amiga Unix Compendium</H3>
<P>
Seit einigen Wochen ist bei Stefan Ossowskis Schatztruhe [3] das &quot;Amiga
Unix Compendium V 1.2&quot; erh&auml;ltlich. Das umfangreiche Paket besteht aus drei
CD-ROM's, die unterschiedliche auf dem Amiga lauff&auml;hige Unix-Varianten
enthalten.
</P>
<P>
<A HREF="img/Linux-AUnixC.jpg"><IMG SRC="thumb/Linux-AUnixC.jpg" WIDTH="104" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Dieses 3-fach CD-ROM-Set wurde freundlicherweise von Carsten Schr&ouml;der f&uuml;r
einen Test zur Verf&uuml;gung gestellt.
</P>
<H4>2.1 Bestandteile</H4>
<P>
Jeweils eine komplette CD ist LinuxPPC (eigentlich Linux/Apus) und
Linux/m68k mit der RedHat 5.1-Distribution gewidmet. Die dritte CD enth&auml;lt
NetBSD 1.4.4 und zus&auml;tzlich als Bonus ein GeekGadgets-Abzug sowie das AROS-
Projekt mit Stand 01/99.
</P>
<H4>2.2 Test m68k-Un*x</H4>
<P>
In Ermangelung eines PPC in meinem Amiga konnte leider Linux/Apus nicht
getestet werden. Daf&uuml;r sollten sich Linux in der RedHat5.1- und NetBSD in
der 1.4.4-Distribution in einem Test beweisen.
</P>
<P>
2.2.1 Linux/m68k -Redhat5.1
</P>
<P>
Nach einem Doppelklick auf das CD-Icon bekommt Ihr zwei Schubladen, mit
&quot;Dokumentation&quot; und &quot;Install&quot; betitelt, zu Gesicht. Beide ge&ouml;ffneten
Schubladen bieten wiederum die Gelegenheit, in der Dokumentation zu st&ouml;bern
oder die Linux-Installation zu starten bzw. ein bestehendes Linux zu
booten.
</P>
<P>
<A HREF="img/Linux-RedHatCD.png"><IMG SRC="thumb/Linux-RedHatCD.jpg" WIDTH="120" HEIGHT="86" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine gute Idee und f&uuml;r eine erfolgreiche Installation auch zwingend
notwendig ist ein gr&uuml;ndliches Studium insbesondere des RedHat-Ordners
innerhalb der Dokumentation.
</P>
<P>
Da im Lieferumfang der CD auch eine Spezialversion von AWeb enthalten ist,
steht dem Studium der HTML-basierten Anleitung (Stand Juli 1998), wie auf
den restlichen CDs leider nur in englischer Sprache, nichts im Wege.
Die wichtigsten Passagen sollte man sich unbedingt ausdrucken, da nach dem
Beginn der Installation der Amiga von Linux vollst&auml;ndig &uuml;bernommen wird und
die Dokumentation nicht mehr zug&auml;nglich ist.
</P>
<P>
<A HREF="img/Linux-RedHatDoku.png"><IMG SRC="thumb/Linux-RedHatDoku.jpg" WIDTH="120" HEIGHT="85" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Vorbereitung der Festplatten entspricht dem der Debian-Distribution und
kann so z.B. aus dem ersten Teil unseres Workshops vollst&auml;ndig &uuml;bernommen
werden. Sind die HD's partitioniert und eingerichtet, startet ein Klick auf
&quot;Install&quot; ein Script, welches als erstes den gew&uuml;nschten Video-Modus und
anschlie&szlig;end den zu verwendenden Kernel (wobei hier v2.0.33pl11 und v2.3.16
zur Auswahl stehen) erfragt. Im Anschlu&szlig; wird mit der get&auml;tigten Wahl der
Installations-Vorgang in Gang gesetzt.
</P>
<P>
<A HREF="img/Linux-RedHatInst01.png"><IMG SRC="thumb/Linux-RedHatInst01.jpg" WIDTH="120" HEIGHT="27" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Linux-RedHatInst02.png"><IMG SRC="thumb/Linux-RedHatInst02.jpg" WIDTH="120" HEIGHT="33" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Erstaunlich, da&szlig; der seit l&auml;ngerer Zeit als stabil (auch f&uuml;r m86k-Systeme)
geltende Kernel 2.0.36 nicht ber&uuml;cksichtigt wird. Viel &auml;rgerlicher aber ist
beim recht aktuellen beigelegten zweiten Kernel 2.3.16 die Tatsache, da&szlig;
man bei der Kompilierung ausgerechnet die Unterst&uuml;tzung des Amiga-
FastFileSystem deaktiviert und damit einen Zugriff auf Amiga-Partitionen
von Linux aus unm&ouml;glich gemacht hat. Auch scheint die RetinaZIII-
Unterst&uuml;tzung der Konsole fehlerhaft. Zwar l&auml;uft X11 mit diesem Kernel
unter der RetinaZIII, aber so weit mu&szlig; man erst einmal kommen. Und im
Blindflug durch die Konsole wird dies mit Sicherheit nichts. Um den Lapsus
komplett zu machen, hat man wohl einen unvollst&auml;ndigen Source f&uuml;r diesen
Kernel mitgeliefert, der eine nachtr&auml;gliche, angepa&szlig;te Kompilierung
unm&ouml;glich machte. Schade.
</P>
<P>
Aber zum Gl&uuml;ck f&uuml;r alle RetinaZIII-Besitzer l&auml;&szlig;t sich das Linux-System auch
unter der nativen Amiga-Grafik mit dem &auml;lteren Kernel installieren.
Die RedHat5.1-Distribution leitet &auml;hnlich der Debian2.1-Linux-Variante mit
vielen Abfragen durch die Installations-Prozedur. Dabei bietet die RedHat-
Variante eine Sprach-Auswahl auch f&uuml;r die deutsche Sprache. Nur ist die
&Uuml;bersetzung doch sehr l&uuml;ckenhaft realisiert und der Anwender mu&szlig; sich bei
vielen Abfragen durch ein buntes Gemisch (oder sollte man Wirrwar sagen?)
deutsch-englischer Ausdr&uuml;cke k&auml;mpfen. Und wer denkt, wenn er die deutsche
Sprache f&uuml;r die Installation ausw&auml;hlt, bekommt er auch ein lokalisiertes
Linux oder zumindest eine deutsche Tastaturbelegung, der wird sich nach der
Installation verwundert die Augen reiben.
</P>
<P>
Wirklich verwirrend hingegen ist der Installationspunkt &quot;Festplatten
patitionieren&quot;. Da dies ja bereits unter AmigaOS mit der HDToolBox passiert
ist, irritiert hier die Liste der vorhandenen/erkannten Festplatten und der
&quot;Fertig&quot;-Button.
</P>
<P>
Insgesamt wird man jedoch recht gut durch die Installationsprozedur
geleitet und hat nach Wahl der gew&uuml;nschten Programmpakete, die schon in
einer Vorauswahl f&uuml;r typische Anwendungsf&auml;lle (X-Window-System, TeX-
Document Formatting, Web-Server,C++ Devel, ...) angeboten werden oder der
individuellen Paket-Selektion ein einsatzf&auml;higes Linux auf der Festplatte.
Im Unterschied zur Debian-Distribution m&uuml;sst Ihr die eigentliche
Installation der Programmpakete nicht &uuml;berwachen, da kein weiterer Dialog
mit dem User stattfindet.
</P>
<P>
Seid Ihr das erstemal in das frische RedHat5.1-Manhatten eingeloggt,
zaubert ein &quot;startx&quot; (mit Kernel 2.3.16 auch unter der RetinaZIII) eine
vorkonfiguriertes X11 auf den Bildschirm.
</P>
<P>
<A HREF="img/Linux-RedHatX11_01.png"><IMG SRC="thumb/Linux-RedHatX11_01.jpg" WIDTH="120" HEIGHT="71" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Dauerhaft sinnvoll nutzbar ist diese Konfiguration unter einem 8bit tiefen
Farbraum jedoch nicht. &quot;The Gimp&quot; z.B. startet erst gar nicht, da ihm nicht
ausreichend Farben zur Verf&uuml;gung stehen. Zwar kann man &quot;Gimp&quot; dennoch zur
Mitarbeit &uuml;berreden, indem in der &quot;.gimprc&quot;-Datei im Heimatverzeichnis die
f&uuml;hrende Raute (#) in der Zeile &quot;install-colormap&quot; entfernt, ein sinnvolles
Arbeiten ist dennoch nicht m&ouml;glich, da sich die verschiedenen Programme,
wie es scheint, ins Farbpaletten-Gehege kommen.
</P>
<P>
<A HREF="img/Linux-RedHatX11_02.png"><IMG SRC="thumb/Linux-RedHatX11_02.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Aber Linux w&auml;re nicht Linux, wenn dies mit etwas Umkonfigurierung nicht in
den Griff zu bekommen w&auml;re - beispielsweise des aktuellen oder durch
Verwendung eines alternativen Fenstermanagers.
</P>
<P>
<A HREF="img/Linux-RedHatX11_03.png"><IMG SRC="thumb/Linux-RedHatX11_03.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Auch das noch amerikanisierte Linux l&auml;sst sich unter RedHat schnell an die
eigenen, also auch an die deutschen Bed&uuml;rfnisse anpassen. F&uuml;r diesen Zweck
steht das &quot;Setup&quot; genannte Tool jederzeit zur Verf&uuml;gung und erm&ouml;glicht eine
Einstellung von z.B. Tastatur, Maus und Zeitzone.
</P>
<P>
<A HREF="img/Linux-RedHatSetup.png"><IMG SRC="thumb/Linux-RedHatSetup.jpg" WIDTH="120" HEIGHT="81" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine dar&uuml;ber hinausgehende Lokalisierung ist ebenfalls unter Linux bereits
in Ans&auml;tzen verf&uuml;gbar.
</P>
<P>
Leider haben sich in die ReHat5.1-Installation auch Fehler eingeschlichen.
Ein besonders unangenehmer: So l&auml;&szlig;t sich aus dem &quot;ControlPanel&quot; in der
Standard-Konfiguration ausgerechnet das &quot;Package Management&quot; (Glint), also
die Verwaltung der RedHat-eigenen RPM-Pakete nicht starten. Hier mu&szlig; der
Amigianer, der zum Linuxer geworden ist, zumindest zeitweilig selbst Hand
anlegen und &quot;zu Fu&szlig;&quot; &uuml;ber &quot;rpm&quot; Pakete installieren, updaten oder
entfernen.
</P>
<P>
&Auml;hnlich der Debian2.1-m68k-Distribution ist auch das RedHat5.1-Manhatten-
Linux nur sehr bedingt f&uuml;r absolute Linux-Anf&auml;nger geeignet. Wer nicht
gewillt ist, bei kleineren (und manchmal auch etwas gr&ouml;&szlig;eren) Problemen
viel Zeit f&uuml;r deren L&ouml;sung zu investieren oder wer sich scheut, eine in
englischer Sprache verfasste Dokumentation zu studieren, sollte die Finger
von RedHat5.1/m68k lassen. Alle anderen bekommen mit dieser CD eine
interessante Linux-Spielwiese...
</P>
<P>
2.2.2 NetBSD 1.4.1
</P>
<P>
Tja, dieser Text/Test-Abschnitt muss (noch) sehr kurz ausfallen, da sich
sowohl Kernel 1.4/1.4.1 als auch die zus&auml;tzlich mitgelieferte 1.3.3-Version
und der ebenfalls beiliegende 2.3/2.5-OpenBSD-Kernel nicht zu einer
Zusammenarbeit mit dem Test-Amiga-System &uuml;berreden lie&szlig;en. Die RetinaZIII
wird erkannt, ebenso die Hardwarekomponenten, dann aber wird der Boot-
Vorgang an identischer Stelle abgebrochen.
</P>
<P>
Erstaunlich- denn NetBSD in der Version 1.0/1.1 l&auml;uft auf dem gleichen
System ohne Probleme. Hier soll in der n&auml;chsten Zeit noch eine Eingrenzung
des verursachenden Fehlers (?) im Amiga versucht und ein dann hoffentlich
m&ouml;glicher Test nachgereicht werden.
</P>
<H4>2.3 Fazit zum &quot;Amiga Unix Compendium V1.2&quot;</H4>
<P>
Das &quot;Amiga Unix Compendium&quot; hinterl&auml;&szlig;t einen zwiesp&auml;ltigen Eindruck. Zwar
hat so der Amigianer tats&auml;chlich drei unterschiedliche Unix-Varianten f&uuml;r
einen Test oder einen dauerhaften Einsatz zur Verf&uuml;gung. Aber mit einem
Preis von 69,- DM ist diese Vielfalt doch recht teuer erkauft.
</P>
<P>
Dazu kommt, da&szlig; kein gedrucktes Handbuch mitgeliefert wird. Und die Online-
Installations-Anleitungen helfen sp&auml;testens bei gestarteter Unix-
Installation nicht weiter, da sie ab diesem Zeitpunkt nicht mehr erreichbar
sind. So bleibt dem Unix-Willigen nur ein separater Ausdruck der Anleitung.
Zus&auml;tzlich wird dem Neuling durch eine lediglich in englischer Sprache zur
Verf&uuml;gung stehende Dokumentation der Einstieg erschwert.
</P>
<P>
Wenn man den Werbetext der Firma Schatztruhe f&uuml;r dieses CD-ROM-Set in
diversen Anzeigen liest, dr&auml;ngt sich der Eindruck auf, hier wird
&quot;Frischware&quot; verkauft.
</P>
<P>
Zitat: &quot;Sie erhalten eine aktuelle RedHat Linux-Version f&uuml;r 68k und f&uuml;r
PowerPC...&quot;
Zus&auml;tzlich wird ein verg&uuml;nstigter Update-Preis von der RedHat5.1-CD aus dem
gleichen Hause angeboten. Jeder m68k-User, der dieses Update wahrnimmt,
wird (wohl ver&auml;rgert und) staunend feststellen, das im &quot;Amiga Unix
Compendium V1.2&quot; die gleiche (inzwischen leicht angegraute) RedHat5.1-
&quot;Manhatten&quot;-Version enthalten ist... Ein Schelm, wer hier an T&auml;uschung
denkt...
</P>
<P>
Der recht hohe Preis des CD-Sets l&auml;&szlig;t sich mit gutem Willen vieleicht noch
durch die beigef&uuml;gte Zugabe des &quot;GeekGadgets&quot;-Paketes mit Stand vom Februar
1999 und einem Schnappschu&szlig; des AROS-Projektes vom Januar 1999
rechtfertigen.
</P>
<P>
Wer lediglich eine Linux- oder NetBSD-Distribution erstehen m&ouml;chte, ist mit
einer Solo-CD diverser Anbieter [4], [5] und einem Drittel des &quot;Amiga Unix
Compendium&quot;-Preises deutlich besser bedient.
</P>
<H3>3. Ausblick</H3>
<P>
Eigentlich sollte der Linux-Workshop mit seinem vierten Teil gleichzeitig
auch seinen Abschlu&szlig; finden. Da aber die standhafte Weigerung des NetBSD-
Kernels, mit dem Amiga in seiner vorliegenden und gewohnten Hardware-
Umgebung zusammenzuarbeiten, gleichzeitig den &quot;Es-muss-doch-gehen&quot;-Trotz
ausl&ouml;st, wird wohl (hoffentlich) in der n&auml;chsten AmigaAktuell-Ausgabe ein
entsprechender Bericht nachgeliefert werden k&ouml;nnen.
</P>
<P>
[1] <A HREF="http://www.kazik.de/en/tarhandler.html" TARGET="_TOP">http://www.kazik.de/en/tarhandler.html</A><BR>
[2] <A HREF="mailto:yusuf@omen.net.au">yusuf@omen.net.au</A><BR>
[3] <A HREF="http://www.schatztruhe.de" TARGET="_TOP">http://www.schatztruhe.de</A><BR>
[4] <A HREF="http://www.linuxservice.de/" TARGET="_TOP">http://www.linuxservice.de/</A><BR>
[5] <A HREF="http://www.olliweb.de/" TARGET="_TOP">http://www.olliweb.de/</A><BR>
</P>
<P>
Uwe Pannecke &lt;<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
