<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais">
<title>Iron Maiden: Blast From The Past</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Iron Maiden: Brave New World</font></center></h1></P>

<p>Die gro&#223;e Iron Maiden Reunion war wohl das Thema im Jahre 1999 im Metal
Bereich und mit &quot;Brave New World&quot; haben die Eisernen Jungfrauen nun auch
endlich ihr neustes Werk abgeliefert und die ganze Metal Szene war gespannt,
ob man an alte Glanztaten wie etwa &quot;Piece Of Mind&quot; oder &quot;Powerslave&quot;
ankn&#252;pfen konnte. Um es gleich vorweg zu nehmen: &quot;Brave New World&quot; ist der
erwartete &#220;berhammer geworden und macht genau da weiter, wo Iron Maiden vor
zw&#246;lf Jahren mit &quot;Seventh Son Of A Seventh Son&quot; aufgeh&#246;rt hatten. Schon der
Opener &quot;The Wicker Man&quot; zeigt eindrucksvoll, da&#223; die Band ihr Gesp&#252;r f&#252;r
eing&#228;ngige Songs nicht verloren hat und wirkt wie eine Mischung aus &quot;Aces
High&quot; und &quot;2 Minutes To Midnight&quot;. Aber auch die Uptempohymne &quot;Ghost Of The
Navigator&quot;, der &quot;Fear Of The Dark&quot; &#228;hnliche, sehr epische Titeltrack oder
auch die straighte Headbangernummer &quot;The Mercenary&quot; sind Songs, die allesamt
auf einem hohen Niveau stehen und es durchaus mit alten Heldentaten
aufnehmen k&#246;nnen. Gl&#252;cklicherweise begn&#252;gten sich Iron Maiden nicht damit,
stur sich selbst zu kopieren, sondern konnten sich auch weiternetwickeln,
was sich auf &quot;Brave New World&quot; insbesondere am dezent vorhandenen
Progressive Faktor bemerkbar macht. So sind Songs wie das orientalisch
angehauchte &quot;The Nomad&quot; sowie &quot;Dream Of Mirrors&quot; nicht unbedingt als typisch
f&#252;r Iron Maiden zu bezeichnen, obwohl auch diese beiden &#252;berlangen
Kompositionen wahre Oberh&#228;mmer sind und gekonnt unter Beweis stellen,
da&#223; Iron Maiden auch im Jahre 2000 noch lange nicht zum alten Eisen zu
z&#228;hlen sind. 
Insbesondere der zur&#252;ckgekehrte Gesangsgott Bruce
Dickinson ist &#252;ber jede Kritik erhaben und macht die Durststrecke, auf der
sich Iron Maiden mit Aushilfss&#228;nger Blaze Bayley von 1994 - Anfang 1999
aus meiner Sicht befanden, schnell vergessen und zeigt zudem eindrucksvoll, welcher
qualitative Unterschied zwischen diesen beiden S&#228;ngern besteht. Der Rest der
Band geht gewohnt routiniert zu Werke, wobei aber der nunmehr dritte
Gitarrist Adrian Smith, der in der Bl&#252;tezeit von Iron Maiden (1981-1988)
schon einen wesentlichen Anteil am Erfolg hatte, der CD noch den letzten
Kick gibt, wobei hier insbesondere die filigranen Solopassagen zu nennen
sind, die man in den letzten Jahren so schmerzlich vermisst hatte. Insgesamt
ist &quot;Brave New World&quot; (gl&#252;cklicherweise!) das von allen erwartete Highlight geworden
und d&#252;rfte schon jetzt als &quot;Highlight des Jahres&quot; durchgehen - Schwachstellen lassen
sich beileibe nicht ausmachen und wer mit den beiden Vorg&#228;ngern &quot;The X Factor&quot; oder &quot;Virtual XI&quot;
nichts anfangen konnte, der erh&#228;lt auf &quot;Brave New World&quot; die absolute
Vollbedienung. Buy or die!</P>

<p>Fazit: 10 von 10 Punkten</P>
<Center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P></Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
