<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,Progressive,sphere">
<title>Thought Sphere: A Vague Horizon</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Thought Sphere: A Vague Horizon</font></center></h1></P>

<p>Offiziell ist &quot;A Vague Horizon&quot; zwar das &#252;ber das kleine, aber sehr feine Label B.Mind Records herausgebrachte Debut von Thought Sphere, aber schon 1997 legten die Jungs mit &quot;Grailkeeper`s Gate&quot; eine geniale, eigenproduzierte CD hin, die schon erahnen lie&#223;, was aus der Band werden sollte. Und drei Jahre sp&#228;ter sollten diese Vorahnungen endlich in Erf&#252;llung gehenn, denn &quot;A Vague Horizon&quot; ist ein superbes Album geworden, welches man zwar dem Progressive Sektor zuordnen muss, das aber gleichzeitig auch sehr eing&#228;ngig daherkommt und nicht so verspielt ist, wie viele andere Alben aus dem Progressive Sektor. Dies unterstreicht der Hammeropener &quot;Like An Angel`s Choir&quot; auf`s eindrucksvollste und ist ein Ohrwurm in progressiver Reinkultur, den man nach einmaligen h&#246;ren garantiert nicht so schnell vergessen wird. Von dieser Marschrichtung weichen Thought Sphere dann auch nicht mehr ab und haben mit &quot;Edenquest&quot;, &quot;(Nothing But) A Vague Horizon&quot; sowie &quot;Pinion`s Ablaze&quot; gleich noch drei weitere, &#228;hnlich qualitativ hochwertige Kompositionen vorzuweisen. Dazu kommt noch die &#228;u&#223;erst gelungene No Doubt Coverversion &quot;Tragic Kingdom&quot;, die so entfremdet wurde, da&#223; sie fast als Thought Sphere Eigenkomposition durchgehen k&#246;nnte und sich stilistisch fast natlos an das weitere Material ankn&#252;pft. Ihr seht also, die CD ist mit Highlights nur so durchsetzt und wer nun denkt, da&#223; ausschlie&#223;lich Progressive Metal Fans hier voll auf ihre Kosten kommen, der irrt ganz gewaltig: Wie oben schon erw&#228;hnt ist &quot;A Vague Horizon&quot; bei weitem nicht so verspielt (oder selbstverliebt - je nach Sichtweise) und unzug&#228;ngig wie unz&#228;hlige Acts aus diesem Genre und ist somit auch f&#252;r Metal Fans geeignet, die ansonsten nur wenig mit dieser Metal Sparte zu tun haben und mit Acts wie Dream Theater oder Spock`s Beard &#252;berhaupt nichts anfangen konnten. Diesen Metallern kann ich nur eines sagen: Thought Sphere werden Eure Meinungen &#252;ber Prog. Metal gewaltig auf den Kopf stellen. Ehrensache, da&#223; gestandene Prog. Metal Fans die CD zumindest mal anchecken sollten - f&#252;r mich in diesem Jahr das bisherige Highlight im Progressive Sektor und f&#252;r Thought Sphere, die sicherlich als einer der Newcomer des Jahres durchgehen werden, der Beginn zu einer sicherlich noch sehr interessanten Karriere; verdient h&#228;tten sie es allemal.</P>

<p>Fazit: 10 von 10 Punkten</P>
<Center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P></Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
