<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,steele,virgin">
<title>Virgin Steele: Magick Fire Music</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Virgin Steele: Magick Fire Music</Font></center></h1></P>

<p>Um die Wartezeit auf den zweiten Teil von &quot;The House Of Atreus&quot;, der &#252;brigens Ende September erscheint, etwas zu &#252;berbr&#252;cken, ver&#246;ffentlichten Virgin Steele nun eine EP mit gut 30 Minuten Spielzeit, die besonders f&#252;r Fans der Band interessant sein d&#252;rfte, da sich auf der EP, neben drei neuen Songs, auch alternative Versionen von drei &#228;lteren Virgin Steele Songs finden: Da w&#228;re zun&#228;chst einmal eine rauhere Version von &quot;Prometheus The Fallen One&quot;, dessen Original auf dem zweiten Teil der &quot;Marriage Of Heaven And Hell&quot; Saga stand und in dieser Version unter anderem mit ver&#228;nderten Lyrics und einem anderen Arrangement aufwarten kann. Und dann w&#228;ren da noch eine gelungene Acoustic Version von &quot;Gate Of Kings&quot; sowie ein Rough Mix von &quot;Great Sword Of Flame&quot;, derren beide Originale auf dem erstren Teil von &quot;The House Of Atreus&quot; zu finden waren. Aber neben &#228;lteren Sachen befinden sich auch drei Neukompositionen auf der CD, wovon die ersten beiden, &quot;Wings Of Vengeance&quot; und &quot;Flames Of Thy Power&quot;, hier noch als Rough Mixes vorliegend, auch auf dem neuen Album &quot;The House Of Atreus-Part II&quot; zu finden sein werden. Die Qualit&#228;t der St&#252;cke ist astrein und wer die &#228;lteren Alben mochte, der wird auch diese beiden Neukompositionen m&#246;gen, die den typischen Virgin Steele Flair aufweisen. Das letzte neue St&#252;ck &quot;Agamennon`s Last Hour&quot; ist nicht mehr als eine kurze Zwischenpassage von gut einer Minute L&#228;nge, die nochmals die Handlung von &quot;The House Of Atreus&quot; aufnimmt. Bleibt alles in allem eine sehr gute EP &#252;brig, die f&#252;r Virgin Steele Fans ein absolutes Muss ist und an der man wirklich nicht vorbeikommt. Wer allerdings noch niemals Kontakt mit der Band hatte, der sollte lieber mal ein regul&#228;res Album der Band antesten oder auf die neue CD warten.</P>

<p>Fazit: ---</P>
<Center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P></Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
