<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="RED">Newsflash</font></center></h1></P>
<ul>
<p><li><b>Stratovarius</B>, dessen aktuelles Opus &quot;Infinite&quot; sich bisher zurecht stark verkauft hat, wollen nach der &quot;Infinite&quot; Tour erstmal eine Pause, die mindestens zwei Jahre dauert, einlegen. Kann ich ziemlich gut verstehen, da die Band seit 1995 insgesamt 5 Studio- und ein Livealbum herausgebracht hat. Immerhin wollen sich S&#228;nger <b>Timo Kotipelto</B> und Gitarrist <b>Timo Tolkki</B> an ihrem ersten bzw. zweiten Soloalbum versuchen, so da&#223; Stratovarius Fans nicht zwei Jahre auf dem trockenen sitzen m&#252;ssen.</LI></P>

<p><li>Zur allgemeinen Abwechselung pr&#228;sentieren <b>Testament</B> mal wieder einen neuen Drummer: Jon Allen (<b>Sadus</B>) &#252;bernimmt den vakanten Platz bei den Trashern hinter der Schie&#223;bude. Ein neues Langeisen soll bis August fertig sein - hoffen wir nur, da&#223; der Band weitere Line-up Wechsel erspaart bleiben.</LI></P> 

<p><li>Ebenfalls recht umstritten ist die Position des Drummers bei <b>Hades</B>: Nachdem in der letzten Metal Corner noch verk&#252;ndet wurde, da&#223; ein gewisser Adam Kiefer bei Hades eingestiegen sei, so ist dieser Job nun wieder offen. Gr&#252;nde f&#252;r die recht schnelle Trennung wurden nicht genannt, aber wenn das so weitergeht, werden die Jungs wohl nie mehr einen neuen Drummer finden...</LI></P>

<p><li>Die Prog. / Power Metal G&#246;tter <b>Steel Prophet</B> bereiten die gro&#223;e Offensive vor: F&#252;r die Tour mit Angel Dust &amp; Lefay (siehe Tourdaten) ist Line-up m&#228;&#223;ig wieder alles im gr&#252;nen Bereich. Gitarrist Jim Williams ersetzt John Pons und Karls Rosqvist &#252;bernimmt die Position des Drummers, die vorher Aushilfsdrummer Kevin Cafferty inne hatte. Ende August erscheint dann auch die angek&#252;ndigte Doppel CD unter dem Titel &quot;Genesis&quot;, die sowohl das &quot;Inner Ascendence&quot; Demo als auch s&#228;mtliche Coverversionen der Band enth&#228;lt. Auch an Material zum &quot;Messiah&quot; Nachfolger wird flei&#223;ig gearbeitet, der Anfang 2001 erscheinen soll.</LI></P>

<p><li>Aufgel&#246;st haben sich die holl&#228;ndischen Stoner / Glitter Rocker <b>7 Zuma 7</B>, wobei die angek&#252;ndigten Shows im Sommer auf jeden Fall noch gespielt werden sollen.</LI></P>

<p><li>Ein gemeinsames Projekt planen <b>Angra</B> S&#228;nger <b>Andre Matos</B> und <b>Heavens Gate</B> Gitarrist / Producer <b>Sascha Paeth</B>. Das Projekt wird den Namen &quot;Virgo&quot; tragen, wobei man auf das Gesamtergebnis recht gespannt sein darf, denn zahlreiche Klassik Elemente sollen nicht fehlen. Ein Ver&#246;ffentlichungstermin wurde aber leider noch nicht genannt.</LI></P>

<p><li><b>Annihilator</B> k&#246;nnen der breiten &#214;ffentlichkeit auf dem Wacken Open Air einen neuen S&#228;nger pr&#228;sentieren: <b>Joe Comeau</B>, der auch bei <b>Liege Lord</B> f&#252;r die Vocals zust&#228;ndig ist und ansonsten bei <b>Overkill</B> die Gitarre bedient. Ob er fest bei Annihilator f&#252;r Randy Rampage einsteigen wird, ist noch nicht klar.</LI></P>
 

<p><li>Neben <b>Sacred Reich</B> (siehe letzte Metal Corner) hat eine weitere amerikanische Metal Band den L&#246;ffel abgegeben: Die <b>Galactic Cowboys</B> haben sich ebenfalls aufgel&#246;st. Bevor aber nun Panik ausbricht: Das neue Album &quot;Let It Go&quot; wird noch erscheinen und anschlie&#223;end wenden die Bandmitglieder sich ihren Soloprojekten zu, so da&#223; die Jungs nicht ganz im Abgrund verschwinden. Trotzdem schade!</LI></P>

<p><li>&#196;h, wie jetzt? Der Reunion-Wahn in den letzten Monaten war ja schon recht witzig mit anzusehen, aber das neueste Ger&#252;cht ist der Hammer: So soll bei <b>Sepultura</B> angeblich eine Reunion mit <b>Max Cavalera</B> anstehen. Wenn man bedenkt, wie unsanft sich die Band von ihrem ehemaligen Shouter damals getrennt hatte, ist das schon recht verwunderlich. Vorher steht aber erstmal das n&#228;chste Album &quot;Sepulnation&quot; an, f&#252;r den <b>Sepultura</B> als Producer <b>Steve Evetts</B> (u.a. Earth Crisis, Snapcase) gewinnen konnten. 
</LI></P>
<p><li>Und wo wir gerade bei Reunions sind: Sowohl eine <b>At The Gates</B> als auch <b>Winger</B> Reunion werden momentan ganz hei&#223; in der Ger&#252;chtek&#252;che gehandelt. Was freilich dran ist, ist momentan noch schwierig zu beurteilen. Wir halten Euch auf dem laufenden...</LI></P>

<p><li>Ein neues Sideprojekt k&#246;nnte bald f&#252;r Aufsehen sorgen: <b>Taraxacum</B> (Bandname des Jahres!), bestehend aus <b>Edguy</B> Bassist <b>Tobias Excel</B> und <b>Steel Prophet</B> S&#228;nger <b>Rick Mythiasin</B>, haben erste Demotracks fertig und sind momentan auf der Suche nach einem Plattendeal, der sich aber wohl recht einfach finden lassen d&#252;rfte.</LI></P>

<p><li>Eine evtl. sehr bizarre Mischung steht uns wohl in der fernen Zukunft aus dem Hause <b>Ayreon</B> an: So wollen <b>Ayeron</B> Mastermind <b>Arjen Lucassen</B> (ein sehr sympatischer Mensch!) und <b>Bruce Dickison</B>, seines Zeichens S&#228;nger bei <b>Iron Maiden</B>, eine reine Gothic CD aufnehmen - wann dabei aber der Terminplaner von <b>Bruce &quot;Airraid Siren&quot; Dickinson</B> mitspielt, ist die andere Frage. Bis dahin vergn&#252;gen wir uns halt mit den beiden aktuellen <b>Ayeron</B> Alben, auf denen <b>Bruce Dickinson</B> auch einen Gastauftritt als S&#228;nger hat (ansonsten sind u.a. noch <b>Ralf Scheepers, Andi Deris, Lana Lane, Fabio Leone, Timo Kotipelto</B> und viele ander mit von der Partie).</LI></P>

<p><li>Das erste <b>Manowar</B> Homevideo mit dem Titel &quot;Hell On Earth - Part 1&quot; ist nun auch endlich erschienen und beinhaltet neben einigen bekannten Songs der True Metal G&#246;tter auch zahlreiche Backstage Szenen. Freigegeben ist das Teil ab 16 Jahren (wobei ich erstaunt bin, da&#223; das Video nicht erst ab 18 freigegeben wurde...); eine DVD Version folgt gegen Ende des Jahres.</LI></P></ul>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
