<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais">
<title>Oldie Review: Savatage`s Streets</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center>Oldie Review: Savatage`s Streets</Center></h1></P>

<p>Neben Iron Maiden geh&#246;ren Savatage wohl zu den international erfolgreichsten Metal Bands &#252;berhaupt, obwohl die Band in der j&#252;ngsten Vergangenheit ihren Sound weg vom klassischen Heavy Metal hin zum bombastischen, mehrch&#246;rigem und anspruchsvolleren Metal ge&#228;ndert hat und mit ihrem letzten Album &quot;The Wake Of Magellan&quot; (1997) ihr bisheriges Highlight abgeliefert hat, welches aber mit dem &#228;lteren Material nur noch bedingt zu tun hat. Eines dieser &#228;lteren Alben nennt sich &quot;Streets&quot; und ist ein weiteres Highlight in der Savatage History, die, &#228;hnlich Iron Maiden, in ihrer Karriere lediglich ein durchschnittliches Album (&quot;Fight For The Rock&quot;) vorzuweisen hat.</P>

<p>Bei &quot;Streets&quot; handelt es sich um ein interessantes Konzeptalbum mit einer &#228;u&#223;erst gelungenen Story &#252;ber einen Musiker namens D.T. Jesus, in dem man teilweise auch Savatage, die in dieser Zeit, &#228;hnlich D.T.Jesus, ebenfalls mit Drogenproblemem zu k&#228;mpfen hatten, wiedersehen kann. Auf eine Zusammefassung der kompletten Story verzichte ich hier, da dies den Rahmen der Kritik sprengen w&#252;rde. Die 12 Songs sind inhaltlich also in die Story eingebettet und ergeben zusammen eine packende Atmosph&#228;re, die nat&#252;rlich auch musikalisch hervorragend umgesetzt wurde. So befindet sich nicht ein schlechter Song auf der CD, sondern ausschlie&#223;lich Highlights: Vom  straighten Opener &quot;Jesus Saves&quot;, eine traditionelle Heavy Metal Komposition im Stile der vorrausgegangenen Savatage Alben, &#252;ber das ergreifende &quot;New York City Don`t Mean Nothing&quot; sowie &quot;Ghost In The Ruins&quot; (welches einige Jahre sp&#228;ter dem verstorbenen Gitarrist Chriss Olivia gewidmet wurde) bis hin zur G&#246;ttergabe und dem st&#228;rkesten St&#252;ck in der gesamten Savatage History &quot;Somewhere In Time / Believe&quot;, welches durch seine G&#228;nsehautatmosph&#228;re auch auf heutigen Savatage Konzerten sich immer noch der gr&#246;&#223;ten Beliebtheit erfreut. Der Sound ist auch recht vielschichtig ausgefallen und kann vor allem durch den gelungenen Einsatz des Pianos, heute ein unverzichtbares Instrument bei Savatage, sowie die Vielschichtigkeit und Abwechselung der Songs begeistern - hier merkt man wirklich, da&#223; die Musiker sehr viel Herzblut und Zeit in die CD gesteckt haben; etwas, was ich mir von den heutigen Charts auch w&#252;nschen w&#252;rde. Nicht zuletzt durch den vermehrten Einsatz des Pianos wurden Savatage sp&#228;ter immer wieder mit einer h&#228;rteren Version von Queen verglichen, wobei man &#196;hnlichkeiten auch durchaus schon auf &quot;Streets&quot; ausmachen kann.</P>

<p>&quot;Streets&quot; ist somit ein absolut zeitloses Album geworden, welches bestimmt auch in zwanzig Jahren noch nichts von seinem Flair verloren hat und geh&#246;rt somit in jede gut sortierte Metal Sammlung - wie eigentlich fast alles Savatage Alben. Weitere Kommentare spaare ich mir zu &quot;Streets&quot;, denn wer es einmal geh&#246;rt hat, der wird es nicht mehr hergeben und sich seinem Bann nicht mehr entziehen k&#246;nnen. Pflicht!</P>

<p>Fazit: 10 von 10 Punkten</P><center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></Center>
    





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
