<HTML>

<!-- Questa pagina e' stata realizzata da Riccardo Lanzidei.
Per qualsiasi informazione: lanzidei@tin.it -->

<HEAD>
</HEAD>

<BODY BACKGROUND="sfondo.jpg">



<TABLE WIDTH=560>
<TD>
<FONT SIZE=+0 FACE="comic sans ms">


<p align="justify"><FONT SIZE=+1>Qualunque appassionato di musica ha la necessit&agrave;
di dover fare una copia dei propri cd e vinili, per ascoltarli fuori casa,
in macchina o per strada con un lettore portatile. Oppure potreste avere
delle musicassette a cui tenete molto e vorreste copiarvele in un supporto
pi&ugrave; affidabile e duraturo. Vediamo allora quali sono i supporti
che offre il mercato e le loro caratteristiche principali.</FONT>

<FONT SIZE=+1>&nbsp;</FONT>

<p align="justify"><B><FONT COLOR="#FF0000"><FONT SIZE=+1>MC</FONT></FONT></B>
<BR><FONT SIZE=+1>La musicassetta &egrave; il supporto pi&ugrave; anziano
e quindi anche il pi&ugrave; superato tecnicamente. Ha dalla sua l'enorme
diffusione e il costo molto limitato delle cassette da registrare. I suoi
difetti, per&ograve; sono molti: fruscio di sottofondo, usura del nastro
con conseguente degrado della qualit&agrave; di ascolto, disallineamento
delle testine con il nastro, ricerca dei brani non ottimale (si basa solo
sugli spazi non registrati tra un brano e l'altro) e lenta.</FONT>
<BR><FONT SIZE=+1>E' vero che alcuni lati negativi sono stati, con il passare
del tempo, molto migliorati nei registratori di fascia alta (per ridurre
il fruscio ad esempio sono stati introdotti il Dolby B, C, HX Pro e in
ultimo S) per&ograve; alle soglie del duemila si pu&ograve; affermare che
ormai la musicassetta non costituisce pi&ugrave; un sistema al passo coi
tempi.</FONT>

<P><FONT SIZE=+1>&nbsp;</FONT>

<p align="justify"><B><FONT COLOR="#FF0000"><FONT SIZE=+1>DAT</FONT></FONT></B>
<BR><FONT SIZE=+1>La cassetta DAT (Digital Audio Tape) &egrave; stata il
primo supporto di registrazione audio in formato digitale e si basa su
una meccanica molto simile a quella dei videoregistratori e telecamere
video 8, ma la cassetta &egrave; pi&ugrave; piccola. La durata massima
di registrazione &egrave; di 180 minuti (360 minuti in velocit&agrave;
dimezzata) e la velocit&agrave; di ricerca dei brani (accessibili indicando
il numero) &egrave; notevolmente superiore a quella delle musicassette,
ma inferiore ai CD. Tecnicamente, la qualit&agrave; audio del DAT &egrave;
superiore a quella dei CD, perch&egrave; utilizza una maggiore frequenza
di campionamento.</FONT>
<BR><FONT SIZE=+1>Purtroppo per&ograve; fin dalla sua introduzione il DAT
&egrave; stato osteggiato dalle case discografiche, intimorite dalla possibilit&agrave;
di fare copie digitali perfette dei cd e quindi nei negozi non sono mai
comparse cassette DAT preregistrate. Il deck DAT per&ograve; &egrave; diventato
uno standard usato nelle sale di registrazione e un'ottimo supporto casalingo
per quelli che l'hanno comunque acquistato.</FONT>

<P><FONT SIZE=+1>&nbsp;</FONT>

<p align="justify"><B><FONT COLOR="#FF0000"><FONT SIZE=+1>DCC</FONT></FONT></B>
<BR><FONT SIZE=+1>La cassetta DCC (Digital Compact Cassette) &egrave; stata
inventata dalla Philips, ed il suo scopo &egrave; quello di far passare
alla qualit&agrave; del suono digitale, senza rinunciare alle tradizionali
musicassette: infatti nei registratori e lettori DCC si possono sentire
anche queste ultime.</FONT>
<BR><FONT SIZE=+1>La DCC &egrave; abbastanza simile a una musicassetta,
ma il nastro &egrave; protetto da uno sportellino tipo quello dei floppy
disk per computer, le durate disponibili sono da 60, 75 e 90 minuti. Il
fruscio &egrave; completamente assente, il problema del disallineamento
delle testine presente nelle MC &egrave; stato drasticamente ridotto, per
ogni brano sono memorizzati il numero, il titolo e altre informazioni.
Ci si pu&ograve; chiedere: come &egrave; stato possibile inserire tutte
queste informazioni digitali nel normale spazio di nastro che ha una MC?
Il segreto &egrave; presto detto: il suono non &egrave; pi&ugrave; quello
"normale" campionato, ma &egrave; stato compresso con un fattore 4 da un
algoritmo chiamato PASC (Precision Adaptive Sub-band Coding). Naturalmente
oltre allo spazio occupato, anche la qualit&agrave; musicale diminuisce,
perch&egrave; il 75 % delle informazioni originali sul suono vengono "buttate
via". In fase di ascolto per&ograve;, il suono viene ricostruito da un
algoritmo e la qualit&agrave; sonora si colloca vicino a quella del cd:
con un buon stereo da casa si riescono a sentire differenze tra CD e DCC,
ma non certo con un walkman o in macchina.</FONT>

<P><FONT SIZE=+1>&nbsp;</FONT>

<p align="justify"><B><FONT COLOR="#FF0000"><FONT SIZE=+1>MD</FONT></FONT></B>
<BR><FONT SIZE=+1>Poco dopo l'uscita del DCC, la Sony ha lanciato il MD
(Mini Disc). L'estetica del supporto &egrave; simile a quella di un floppy
disc per computer e dentro c'&egrave; un disco di 64 mm di diametro. Il
suono, essendo registrato digitalmente, non presenta fruscii, le modalit&agrave;
di ricerca dei brani sono come quelle del cd, con la stessa velocit&agrave;
di salto tra un brano e l'altro, le funzioni in registrazione sono ottime,
le pi&ugrave; complete tra i vari supporti provati. Anche il MD, come il
DCC, registra i suoni in maniera compressa: il sistema del MD si chiama
ATRAC (Adaptive Transform Acoustic Coding) e il fattore di compressione
&egrave; 5 (elimina l'80 % dei dati originali). I dati "persi" dal Mini
disc quindi, sono maggiori di quelli persi dal Dcc.</FONT>

<P><FONT SIZE=+1>&nbsp;</FONT>

<p align="justify"><B><FONT COLOR="#FF0000"><FONT SIZE=+1>CD-R</FONT></FONT></B>
<BR><FONT SIZE=+1>I cd-r sembrano, a parte il colore leggermente diverso,
dei normali cd. A differenza di tutti gli altri supporti che si possono
ri-registrare pi&ugrave; volte, i cd-r si possono registrare una volta
solo, attenti quindi a non sbagliare! I registratori di cd-r pi&ugrave;
diffusi sono quelli da collegare al computer, anche se esistono registratori
cd-r, un po' pi&ugrave; cari, da inserire direttamente nell'impianto stereo
(il primo &egrave; stato il Philips CDR870 che costa poco meno di 1.300.000)</FONT>
<BR><FONT SIZE=+1>Una volta registrato, il cd-r diventa, all'atto pratico,
un normale cd che si pu&ograve; ascoltare con un qualunque lettore di casa,
portatile o da macchina. Cosa volete di piu?</FONT>
<BR><FONT SIZE=+1>In realt&agrave; il sistema con cui vengono registrati
i cd "casalinghi" non &egrave; come quello dei cd comprati: nei primi i
microscopici fori vengono fatti "bruciando" una parte della superficie
dei cd, mentre nei secondi i fori vengono praticati per stampaggio, con
una tecnica molto pi&ugrave; precisa e accurata. I cd comprati infatti
hanno una maggiore durata.</FONT>
<BR><FONT SIZE=+1>Esistono masterizzatori che possono registrare anche
su cd riscrivibili pi&ugrave; volte (chiamati cd-rw), ma oltre ad essere
pi&ugrave; costosi non si possono sentire nei normali lettori per cd musicali.
Per il momento quindi, quest'ultima soluzione &egrave; indicata pi&ugrave;
che altro per l'utilizzo con il computer (back-up di dati, ecc.)</FONT>

<P>&nbsp;

<P>&nbsp;
<TABLE BORDER CELLPADDING=3 >
<CAPTION valign="top">Tabella comparativa</CAPTION>

<TR>
<TD>&nbsp;</TD>

<TD BGCOLOR="#FFFF9B"><B><FONT SIZE=+1>Mc</FONT></B></TD>

<TD BGCOLOR="#FFFF9B"><B><FONT SIZE=+1>DAT</FONT></B></TD>

<TD BGCOLOR="#FFFF9B"><B><FONT SIZE=+1>Dcc</FONT></B></TD>

<TD BGCOLOR="#FFFF9B"><B><FONT SIZE=+1>Mini Disc</FONT></B></TD>

<TD BGCOLOR="#FFFF9B"><B><FONT SIZE=+1>Cd-R</FONT></B></TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Durata max di registrazione</TD>

<TD>120'</TD>

<TD>180' (360' in lp)</TD>

<TD>90'</TD>

<TD>74' (140' in mono)</TD>

<TD>74'</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Reperibilit&agrave; attuale dei supporti</TD>

<TD>Ottima</TD>

<TD>Ottima</TD>

<TD>Difficile</TD>

<TD>Buona</TD>

<TD>Ottima</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Possibilit&agrave; di memorizzare informazioni sul
supporto (titolo disco, canzoni, ecc.) e visualizzarle su un display</TD>

<TD>No</TD>

<TD>No</TD>

<TD>Si</TD>

<TD>Si</TD>

<TD>Si (solo su lettori che supportano il cd text)</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Velocit&agrave; di ricerca dei brani</TD>

<TD>Scarsa</TD>

<TD>Buona</TD>

<TD>Buona</TD>

<TD>Ottima</TD>

<TD>Ottima</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Compatibilit&agrave; con altri supporti</TD>

<TD>Nessuna</TD>

<TD>Nessuna</TD>

<TD>Nei registratori Dcc si possono sentire anche le vecchie cassette Mc</TD>

<TD>Nessuna</TD>

<TD>I Cd-R si possono ascoltare anche nei normali lettori Cd</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Modalit&agrave; di registrazione audio</TD>

<TD>Analogica</TD>

<TD>Digitale</TD>

<TD>Digitale con compressione 4:1 in perdita</TD>

<TD>Digitale con compressione 5:1 in perdita</TD>

<TD>Digitale</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Frequenze di campionamento (per sistemi digitali)</TD>

<TD>&nbsp;</TD>

<TD>48 Khz, 44,1 Khz, 33 Khz</TD>

<TD>44,1 Khz</TD>

<TD>44,1 Khz</TD>

<TD>44,1 Khz</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFF9B">Qualit&agrave; audio</TD>

<TD>Discreta</TD>

<TD>Ottima</TD>

<TD>Buona</TD>

<TD>Molto buona (nei modelli recenti)</TD>

<TD>Ottima</TD>
</TR>
</TABLE>
&nbsp;

<p align="justify"><FONT COLOR="#FF0000"><FONT SIZE=+1>Conclusioni</FONT></FONT>
<BR><FONT SIZE=+1>L'audiocassetta sta sentendo i suoi anni ed &egrave;
prossima alla pensione.</FONT>
<BR><FONT SIZE=+1>Il DAT, &egrave; ormai uno degli standard per gli studi
di registrazione, la qualit&agrave; audio &egrave; la migliore in assoluto,
anche se la praticit&agrave; di utilizzo non &egrave; eccelsa.</FONT>
<BR><FONT SIZE=+1>Il Dcc quando &egrave; uscito sembrava un'ottima soluzione
(il fatidico uovo di Colombo), perch&egrave; permetteva di leggere le cassette
dcc digitali e le vecchie audiocassette analogiche, ma attualmente la Philips
sembra averlo abbandonato...</FONT>
<BR><FONT SIZE=+1>Il Mini Disc invece continua ad essere molto pubblicizzato
dalla Sony, ma fino ad ora la sua diffusione &egrave; comunque scarsina,
complice il costo troppo elevato dei supporti MD. Verso la fine del 1997
per&ograve;, il costo sia del lettore che dei supporti si &egrave; notevolmente
abbassato, per cui &egrave; possibile un certo aumento delle vendite.</FONT>
<BR><FONT SIZE=+1>Il rivale pi&ugrave; pericoloso del registratore MD &egrave;
il masterizzatore di cd, che si preannuncia un best-seller a causa dei
prezzi molto bassi dei cd vergini.</FONT>

<p align="justify"><FONT SIZE=+1>Ora dovreste avere gli elementi per poter valutare come
registrare al meglio la vostra musica. Comunque ricordatevi: oltre alla
qualit&agrave; sonora, bisogna anche e soprattutto ricercare la qualit&agrave;
artistica e la valenza culturale di ci&ograve; che sentite.</FONT>
</TD></TABLE>
</BODY>
</HTML>
