<HTML>

<!-- Questa pagina e' stata realizzata da Riccardo Lanzidei.
Per qualsiasi informazione: lanzidei@tin.it -->

<HEAD>

<TITLE>I racconti di DADAm@g</TITLE>

</HEAD>
<BODY BACKGROUND="sfondo.jpg">

<TABLE WIDTH=560 CELLPADDING=10>

<TD>
<FONT SIZE=+0 FACE="comic sans ms">
<P ALIGN="JUSTIFY">Era stanco. Camminava senza guardare esattamente dove metteva i piedi. Come tutte le sere, dopo l'ufficio, quella camminata avrebbe dovuto aiutarlo a scaricare tutte le tensioni accumulate durante la giornata e invece, come tutte le sere, si ritrovava a maledire se stesso per non aver preso la macchina.</P>
<P ALIGN="JUSTIFY">Il suo sguardo vagava tra un cartellone pubblicitario e l'altro, senza capire esattamente quello che c'era scritto: forse era proprio quello che volevano i &quot;creativi&quot;, si diceva spesso.</P>
<P ALIGN="JUSTIFY">Improvvisamente il suo sguardo fu dirottato verso un palazzo, apparentemente senza attrattive particolari, uguale agli altri che lo circondavano, in quel quartiere popolare di tante case tutte dello stesso colore e con i cancelli arrugginiti.</P>
<P ALIGN="JUSTIFY">Non capiva perch&eacute; fosse attratto da quell'edificio per&ograve; sentiva un desiderio irrefrenabile di visitarne l'interno. Si chiese se per caso non facesse parte di qualche suo ricordo ormai sepolto sotto la polvere degli anni ma non gli venne in mente nulla. Decise di entrare.</P>
<P ALIGN="JUSTIFY">Mentre stava per varcare il portone vide una finestra aperta al piano rialzato. Guard&ograve; all'interno e gli si present&ograve; una stanza in disordine, polverosa, con parecchi oggetti sparsi sul pavimento. Vide, appoggiato ad un divano, un quadro antico con ritratto un volto familiare.</P>
<P ALIGN="JUSTIFY">&quot;Ma quello &egrave; il nonno&quot; - esclam&ograve; Max perplesso.</P>
<P ALIGN="JUSTIFY">Prov&ograve; a guardare nuovamente la facciata del palazzo ma non gli ricordava assolutamente nulla. Cosa ci faceva il ritratto di suo nonno in quell'appartamento, proprio non riusciva a capirlo.</P>
<P ALIGN="JUSTIFY">Entr&ograve; e sal&igrave; gli scalini che portavano al piano rialzato.</P>
<P ALIGN="JUSTIFY">Sul pianerottolo si ferm&ograve; davanti alla porta dell'appartamento e suon&ograve; il campanello, deciso di scoprire cosa ci facesse l&igrave; quel quadro.</P>
<P ALIGN="JUSTIFY">Non rispose nessuno.</P>
<P ALIGN="JUSTIFY">Prov&ograve; ad entrare ma la porta era chiusa a chiave. Mentre stava per andarsene vide un oggetto luccicare nel portaombrelli accanto alla porta; guard&ograve; meglio e not&ograve; un mazzo di chiavi.</P>
<P ALIGN="JUSTIFY">Ecco come entrare. Prese le chiavi e prov&ograve; ad aprire la porta. Ci fu lo scatto, la chiave era quella giusta.</P>
<P ALIGN="JUSTIFY">Apr&igrave; la porta e gli apparve la stanza che aveva scorto dalla finestra: in totale disordine con mobili, quadri, lampade, sedie ed altri oggetti ammucchiati per terra, alla rinfusa.</P>
<P ALIGN="JUSTIFY">Cerc&ograve; il quadro ma non riusc&igrave; a trovarlo: vide solo un dipinto che poteva vagamente ricordare un volto familiare ma, indubbiamente, non era il ritratto di suo nonno. La stanchezza l'aveva certamente ingannato. Dalla strada la distanza aveva dato l'illusione che si trattasse davvero del volto di suo nonno ma si era decisamente sbagliato.</P>
<P ALIGN="JUSTIFY">A quel punto si sentiva un intruso, penetrato in un appartamento, che poteva essere scambiato per un ladro e cominci&ograve; a preoccuparsi. Usc&igrave; velocemente dalla stanza, chiuse a chiave e rimise le chiavi nel portaombrelli, dove le aveva trovate.</P>
<P ALIGN="JUSTIFY">Sospir&ograve;, ormai libero dalla tensione per la paura di essere sorpreso.</P>
<P ALIGN="JUSTIFY">Ritorn&ograve; sulla strada che l'avrebbe ricondotto a casa ma, improvvisamente, si rese conto di non avere pi&ugrave; la valigetta con i documenti dell'ufficio.</P>
<P ALIGN="JUSTIFY">L'appartamento: sicuramente l'aveva appoggiata nell'appartamento, maledizione. Doveva tornare indietro e aprire di nuovo quella porta, tornare ad essere un intruso, con la possibilit&agrave; che lo sorprendessero l&agrave; dentro.</P>
<P ALIGN="JUSTIFY">Cominci&ograve; a sudare, preoccupato, ma torn&ograve; sui suoi passi, entr&ograve; nuovamente dal portone, sal&igrave; gli scalini e giunse sul pianerottolo. Prese le chiavi dal portaombrelli e fece scattare la serratura. Apr&igrave; la porta e vide subito la valigetta accanto al divano.</P>
<P ALIGN="JUSTIFY">La prese ed usc&igrave; velocemente. Chiuse a chiave, rimise il mazzo nel portaombrelli ed usc&igrave; di corsa dal portone. Giunto sulla strada controll&ograve; di non aver combinato qualche altro pasticcio. C'era tutto. Trasse un sospiro di sollievo e s'incammin&ograve; verso casa.</P>
<P ALIGN="JUSTIFY">Giunse finalmente davanti al portone, estrasse le chiavi ma non riusc&igrave; ad inserirle nella serratura. Le guard&ograve; e riconobbe le chiavi di quell'appartamento. Probabilmente si era confuso e aveva messo in tasca quelle chiavi poi aveva preso le sue, sempre dalla tasca e le aveva messe nel portaombrelli.</P>
<P ALIGN="JUSTIFY">Non era proprio la sua giornata. Quell'appartamento lo stava perseguitando.</P>
<P ALIGN="JUSTIFY">Torn&ograve; indetro, velocemente. Entr&ograve; dal portone, sal&igrave; gli scalini e guard&ograve; immediatamente nel portaombrelli: le sue chiavi erano proprio l&igrave;. Le prese e le sostitu&igrave; con le altre. Fece per andarsene quando ud&igrave; delle voci all'interno dell'appartamento. Incuriosito accost&ograve; l'orecchio alla porta ed origli&ograve;.</P>
<P ALIGN="JUSTIFY">Dall'interno due persone stavano discutendo animatamente e da ci&ograve; che dicevano Max cap&igrave; che stavano aspettando qualcuno che doveva giungere a momenti.</P>
<P ALIGN="JUSTIFY">Decise a quel punto di andarsene, di averne decisamente abbastanza di quel posto. Mentre stava per scendere gli scalini due persone, un uomo ed una donna, sulla sessantina, stavano entrando dal portone.</P>
<P ALIGN="JUSTIFY">&quot;Buon giorno.&quot; </P>
<P ALIGN="JUSTIFY">&quot;Buon giorno.&quot; - rispose Max dirigendosi verso il portone.</P>
<P ALIGN="JUSTIFY">&quot;Dove va?&quot;</P>
<P ALIGN="JUSTIFY">&quot;Prego?&quot; - Max li guard&ograve; perplesso.</P>
<P ALIGN="JUSTIFY">&quot;S&igrave;, erano anni che la stavamo aspettando e adesso che finalmente &egrave; qui, se ne va?&quot;</P>
<P ALIGN="JUSTIFY">Max deglut&igrave; a fatica e in quel momento si apr&igrave; la porta dell'appartamento: all'interno non c'era nessuno, anche se pochi istanti prima Max aveva udito distintamente due persone che stavano parlando.</P>
<P ALIGN="JUSTIFY">&quot;Prego, prima lei.&quot; - disse la signora rivolta verso Max.</P>
<P ALIGN="JUSTIFY">&quot;No, grazie, devo proprio andare.&quot; - le rispose.</P>
<P ALIGN="JUSTIFY">&quot;Ma sta scherzando? Questa &egrave; casa sua.&quot;.</P>
<P ALIGN="JUSTIFY">Max fece finta di non aver udito e corse fuori dal portone. Sempre di corsa arriv&ograve; fino a casa. Estrasse le chiavi ed apr&igrave; la porta. Entr&ograve;, si chiuse la porta alle spalle e si appoggi&ograve; al muro, riprendendo fiato.</P>
<P ALIGN="JUSTIFY">&quot;Merda!&quot; - esclam&ograve; all'improvviso.</P>
<P ALIGN="JUSTIFY">Aveva perso la valigetta.</P>
<P ALIGN="JUSTIFY">Si ricord&ograve; di averla appoggiata a terra sul pianerottolo e sicuramente si era dimenticato di riprenderla. Non aveva intenzione di tornare in quella gabbia di matti ma non poteva nemmeno abbandonare la valigetta con i documenti.</P>
<P ALIGN="JUSTIFY">Torn&ograve; in strada e in pochi minuti si ritrov&ograve; davanti a quel portone. Guard&ograve; verso l'interno e non vide nessuno. Entr&ograve; silenziosamente e vide che il pianerottolo era spoglio: della sua valigetta nemmeno l'ombra.</P>
<P ALIGN="JUSTIFY">Sent&igrave; ancora delle voci all'interno dell'appartamento.</P>
<P ALIGN="JUSTIFY">&quot;Torner&agrave;, torner&agrave;, ne sono certo.&quot; - sicuramente stavano parlando di lui. Ma cosa volevano?</P>
<P ALIGN="JUSTIFY">&quot;L'ho sempre detto che era testardo ma qualcuno non voleva darmi retta, vero?&quot;.</P>
<P ALIGN="JUSTIFY">Era tentato di bussare ma non trovava il coraggio. Chiss&agrave; cosa stavano architettando quelle persone. Poteva anche essere pericoloso. Forse doveva andare alla Polizia. Cominci&ograve; ad avere paura: perch&eacute; avrebbero dovuto avercela proprio con lui?</P>
<P ALIGN="JUSTIFY">Giunse un rumore dal portone d'ingresso e Max, ormai terrorizzato, si appiatt&igrave; contro la parete per evitare di essere visto. Un signore stava salendo gli scalini per raggiungere il piano rialzato.</P>
<P ALIGN="JUSTIFY">Max decise di salire qualche gradino della scala che portava al primo piano, per nascondersi meglio.</P>
<P ALIGN="JUSTIFY">Il signore si ferm&ograve; davanti alla porta dell'appartamento ed appoggi&ograve; il cappello al portaombrelli. Si accost&ograve; alla porta e cominci&ograve; ad origliare. Dopo qualche secondo trasal&igrave; e corse velocemente verso l'uscita, dimenticando il cappello sul portaombrelli.</P>
<P ALIGN="JUSTIFY">Max grid&ograve;: &quot;Signore, il cappello! Avete dimenticato il cappello.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Non pu&ograve; sentirla.&quot; - disse una voce alle sue spalle.</P>
<P ALIGN="JUSTIFY">&quot;Chi diavolo &egrave; lei?&quot; - Max cerc&ograve; di riprendere fiato e fulmin&ograve; con lo sguardo la persona che gli aveva rivolto la parola prendendolo di spalle e spaventandolo a morte.</P>
<P ALIGN="JUSTIFY">&quot;Mi dispiace di averla spaventata,&quot; - disse il signore, indicando la parte superiore della scala, la cui fine non riusciva a scorgere - &quot;volevo solo darle il benvenuto tra noi.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Senta, mi lasci perdere perch&eacute; non &egrave; la giornata giusta.&quot; - Max era furibondo.</P>
<P ALIGN="JUSTIFY">&quot;No, non si arrabbi; noi siamo come lei, condannati a restare su questa scala, per sempre.&quot; - disse sconsolato il vecchio - &quot;Anche noi abbiamo cercato di dirle che stava dimenticando la valigetta, le chiavi, ma lei non poteva sentirci. Cos&igrave; come ha fatto lei anche quel signore torner&agrave;, si lascer&agrave; tentare, entrer&agrave;, torner&agrave; nuovamente e dimenticher&agrave; qualcos'altro. Questo &egrave; un trabocchetto che dura da un'infinit&agrave; di giorni, di mesi, di anni. Croller&agrave; questo palazzo ma la scala rester&agrave;, per sempre.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Provi a raggiungere la cima: passeranno anni, decenni senza che lei riesca mai a raggiungere la fine. Dovr&agrave; desistere, cos&igrave; come abbiamo desistito tutti. Non c'&egrave; via di scampo.&quot;.</P>
<P ALIGN="JUSTIFY">Max alz&ograve; le spalle, come se questo strano signore fosse completamente pazzo e quindi tutto ci&ograve; che gli aveva detto non avesse alcuna importanza.</P>
<P ALIGN="JUSTIFY">Alz&ograve; una mano, come per salutarlo e fece un passo per scendere dalla scala, per superare gli ultimi gradini che lo separavano dal pianerottolo. D'un tratto gli parve di essere su di una scala mobile che si muovesse in senso contrario al suo e pi&ugrave; cercava di scendere pi&ugrave; risaliva.</P>
<P ALIGN="JUSTIFY">Poi la scala si ferm&ograve; bruscamente e Max cadde in avanti. Dall'alto della scala, dai piani pi&ugrave; alti, risuon&ograve; una risata fragorosa. Pareva che migliaia di persone stessero prendendosi gioco di lui. Alz&ograve; lo sguardo indispettito verso la sommit&agrave; della scala e vide che, effettivamente, centinaia, forse migliaia di persone, stavano ridendo di lui.</P>
<P ALIGN="JUSTIFY">Cerc&ograve; di individuare l'anziano signore che aveva parlato poco prima con lui e lo riconobbe, tra le centinaia di volti che incrociavano il suo sguardo, unico tra tutti che non ridesse. Anzi, una lacrima gli solcava il viso.</P>
<P ALIGN="JUSTIFY">&quot;Non mi guardi cos&igrave;,&quot; - disse l'anziano signore - &quot;non sono migliore degli altri. Sono solo l'ultimo arrivato, anzi il penultimo ormai, ed &egrave; per questo che provo pena per lei: ci sono appena passato anch'io.</P>
<P ALIGN="JUSTIFY">&quot;Ma stiamo scherzando?&quot; - Max respirava a fatica e le gambe gli tremavano.</P>
<P ALIGN="JUSTIFY">&quot;Purtroppo no.&quot; - rispose il vecchio sospirando.</P>
<P ALIGN="JUSTIFY">Qualche secondo dopo risuon&ograve; un grido, agghiacciante, proveniente dalla sommit&agrave; della scala.</P>
<P ALIGN="JUSTIFY">Alzarono tutti la testa per cercare di vedere poi, a pi&ugrave; riprese, scoppiarono a ridere, una risata fragorosa che riemp&igrave; l'aria facendo quasi mancare il respiro.</P>
<P ALIGN="JUSTIFY">&quot;Cos'&egrave; successo?&quot; - chiese Max.</P>
<P ALIGN="JUSTIFY">&quot;Uno dei piani alti ha ceduto.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Cosa vuol dire?&quot;</P>
<P ALIGN="JUSTIFY">&quot;Si &egrave; gettato verso il basso.&quot; - rispose il vecchio chiudendo gli occhi e aprendo le braccia come per imitare il volo di un aeroplano.</P>
<P ALIGN="JUSTIFY">&quot;E' morto?&quot; - Max guard&ograve; il vecchio che aveva ancora gli occhi chiusi.</P>
<P ALIGN="JUSTIFY">&quot;Morto?&quot; - il vecchio lo guard&ograve; lasciando trasparire nello sguardo un'immensa piet&agrave;.</P>
<P ALIGN="JUSTIFY">Quella domanda risuon&ograve; per la scala e tutti risero nuovamente gridando in coro: &quot;Morto! Morto!&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Qui non si pu&ograve; morire&quot; - disse un ragazzo qualche gradino pi&ugrave; in alto.</P>
<P ALIGN="JUSTIFY">&quot;Non &egrave; permesso.&quot; - disse un altro.</P>
<P ALIGN="JUSTIFY">&quot;E quello che si &egrave; buttato?&quot; - Max cominciava a credere di essere impazzito.</P>
<P ALIGN="JUSTIFY">&quot;Ricomincia dal basso, senza luce, come noi.&quot; - disse l'anziano signore - &quot;Ad ogni nuovo arrivato la scala permette di salire in altezza. Dopo qualche tempo si raggiunge la luce e l&igrave; &egrave; un po' meglio.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Meglio?&quot; - Max si sedette sconsolato sul gradino.</P>
<P ALIGN="JUSTIFY">&quot;S&igrave;, meglio,&quot; - rispose il vecchio - &quot;nel senso che la luce fa cambiare il modo di vedere le cose.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Per poi crollare e tentare di uccidersi, pur sapendo che &egrave; impossibile?&quot;.</P>
<P ALIGN="JUSTIFY">&quot;S&igrave;, credo di s&igrave;.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Io sarei l'ultimo arrivato, vero?&quot; - Max si alz&ograve; di scatto.</P>
<P ALIGN="JUSTIFY">&quot;Certo.&quot; - rispose il vecchio.</P>
<P ALIGN="JUSTIFY">&quot;E se io mi gettassi verso il basso?&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Non saprei, credo che dovrebbe arretrare anche lei, ma non &egrave; possibile visto che lei &egrave; l'ultimo.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Mi &egrave; venuta un'idea, mi ascolti...&quot; - Max cominci&ograve; a sussurrare all'orecchio del vecchio - &quot;Io mi butto verso il basso. Essendo l'ultimo potrei anche uscire di qui. Se non mi dovesse pi&ugrave; vedere si getti anche lei e lo dica a quello prima di lei e cos&igrave; via. Ce la faremo tutti, vedr&agrave;.&quot;.</P>
<P ALIGN="JUSTIFY">&quot;Non ne sarei cos&igrave; sicuro.&quot; - rispose il vecchio alzando le spalle.</P>
<P ALIGN="JUSTIFY">&quot;Proviamo, cosa ci costa?&quot;.</P>
<P ALIGN="JUSTIFY">Detto ci&ograve; Max si volse e si gett&ograve; verso il basso.</P>
<P ALIGN="JUSTIFY">L'impatto fu violento e appena tocc&ograve; il suolo sent&igrave; un forte dolore alla testa.</P>
<P ALIGN="JUSTIFY">Era buio, completamente buio.</P>
<P ALIGN="JUSTIFY">&quot;Mio dio non ha funzionato. Sono caduto nel buio totale, devo avvisare gli altri. Fermatevi, non fatelo, non buttatevi.&quot; - urlava come un ossesso.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="RIGHT">FINE</P>

</TD></TABLE>

</BODY>
</HTML>
