<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <!-- Author = Uwe Simon, genannt Dreiachser -->

    <TITLE>Aufruf</TITLE>
  </HEAD>

  <BODY background="bgc.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Aufruf</B></FONT></P>

          <P>Uwe Simon, genannt Dreiachser hat einen Aufruf und bittet
          inst&auml;ndig, ihn diesbez&uuml;glich zu unterst&uuml;tzen.</P>
          <HR>

          <P>Hallo zusammen,<BR>
          ich habe an <B>mailto:rufus@rufusbeck.de</B> geschrieben und schon eine
          Antwort erhalten. Jetzt sollten wir gemeinsam an<BR>
          <B>mailto:stefanie.fruehauf@hoerverlag.de</B> mailen und denen mitteilen,
          dass wir Rufus Beck wollen.</P>
          <HR width="60%">

          <P>Hier die Antwort von Herrn Beck:</P>

          <BLOCKQUOTE>
            Vielen Dank f&uuml;r die Mail.<BR>
            <BR>
            Was im Internet und in den Printmedien zur Zeit &uuml;ber mich verbreitet
            wird, kommt einer Verleumdung gleich. Ich bin bei meinen
            Vertragsverhandlungen mit dem H&ouml;rverlag sehr wohl &uuml;ber mein
            Honorar einig geworden , doch hat der H&ouml;rverlag pl&ouml;tzlich eine
            Forderung erhoben, nach der ich, Rufus Beck keine &ouml;ffentliche
            Potter-Lesungen mehr ohne den H&ouml;rverlag machen d&uuml;rfte.<BR>
            <BR>
            Au&szlig;erdem sollte ich nie f&uuml;r einen anderen Verlag ein "Harry
            Potter H&ouml;rbuch" lesen d&uuml;rfen. Da der H&ouml;rverlag aber die
            Rechte f&uuml;r Band 6 und 7 nicht hat, k&auml;me das einem Berufsverbot
            gleich, falls im n&auml;chsten Jahr ein anderer Verlag die Audio Rechte an
            Harry Potter bek&auml;me.<BR>
            <BR>
            Ich habe in dieser Angelegenheit meinen Anwalt eingeschaltet und hoffe ,
            dass in den n&auml;chsten Tagen positive Gespr&auml;che mit dem
            H&ouml;rverlag zu Stande kommen und dieser seine absurde Forderung
            zur&uuml;cknimmt. Dann steht einer weiteren Zusammenarbeit mit mir nichts
            im Wege.<BR>
            <BR>
            Mit herzlichem Muggelgru&szlig; und in der Hoffnung auf ein gutes Ende<BR>
            Rufus Beck
          </BLOCKQUOTE>
          <HR width="60%">

          <P>Hier meine Mail:</P>

          <P>From: "dreiachser.xxl" &lt;simon.uwe@arcor.de&gt;<BR>
          To: &lt;stefanie.fruehauf@hoerverlag.de&gt;<BR>
          Sent: Sunday, October 26, 2003 8:28 PM<BR>
          Subject: Harry Potter Band 5</P>

          <P>Sehr geehrte Frau Fr&uuml;hauf,<BR>
          mein Name ist Uwe Simon, und ich schreibe diese Mail im Namen einer Reihe
          erwachsener Harry-Potter-Fans.</P>

          <P>In den letzten Tagen mu&szlig;ten wir aus mehreren Medien erfahren,
          da&szlig; aufgrund vertraglicher Uneinigkeit zwischen dem H&ouml;rVerlag
          und Herrn Rufus Beck die Fortsetzung der H&ouml;rbuchreihe Harry Potter,
          gelesen von Rufus Beck, mehr als gef&auml;hrdet ist. Einige Medien
          berichteten, Herr Beck habe schlicht zu viel Geld gefordert, andere
          erw&auml;hnten ganz einfach "rechtliche Gr&uuml;nde".</P>

          <P>Wir wandten uns in der vergangenen Woche direkt an Rufus Beck, der uns
          in einer Antwortmail mitteilte, da&szlig; das Haupthindernis darin besteht,
          da&szlig; der H&ouml;rVerlag ihn vertraglich darauf festlegen will, Harry
          Potter nur mit und f&uuml;r den H&ouml;rVerlag zu lesen, in Aufnahmen und
          auch &ouml;ffentlich. Nach seinen Angaben weigerte sich Herr Beck, diesen
          Vertrag zu akzeptieren, da noch nicht sicher sei, ob der H&ouml;rVerlag die
          Rechte an Band 6 und 7 &uuml;berhaupt bekommt, und, falls dies nicht der
          Fall sein sollte, Herr Beck f&uuml;r den dereinstigen Rechteinhaber das
          Werk gar nicht lesen d&uuml;rfte, was f&uuml;r ihn faktisch im Falle Harry
          Potter einem Berufsverbot gleich k&auml;me.</P>

          <P>Sehr geehrte Frau Fr&uuml;hauf, im Namen mehrerer Harry-Potter-Fans
          appelliere ich an den H&ouml;rVerlag, nicht auf dieser Vertragsklausel zu
          bestehen und damit Herrn Beck davon zu entbinden. Ich habe mit mehreren
          Fans gesprochen, die die ersten vier Ausgaben der brillanten Lesung von
          Rufus Beck gekauft haben, viele sogar zweimal, zuerst als Kassetten- und
          sp&auml;ter als CD-Ausgabe, die jedoch, und da schlie&szlig;e ich mich
          selbst mit ein, Band 5 NICHT kaufen werden, wenn er nicht von Herrn Beck
          gelesen wird. Kein Sprecher kann ihn ersetzen, wer auch immer, so
          pr&auml;gnant, so brillant kann niemand das fortf&uuml;hren, was Rufus Beck
          mit dieser Reihe begonnen hat und vor allem in "Harry Potter und der
          Feuerkelch" zu nahezu h&ouml;rspielhaften Qualit&auml;ten gesteigert
          hat.</P>

          <P>Ihre Chefetage sollte daran denken, da&szlig; Harry Potter nicht mehr
          das erfolgreichste Produkt Ihres Hauses bleiben wird, wenn Sie aus nicht
          nachvollziehbaren Gr&uuml;nden von Herrn Beck als dem vortragenden Akteur
          Abstand nehmen. Meiner Ansicht nach d&uuml;rfte mindestens ein Drittel der
          Ausgaben des "Orden des F&ouml;nix" in den Regalen der Buchh&auml;ndler
          verbleiben und an Sie zur&uuml;ckgeschickt werden, wenn die Fans erfahren,
          da&szlig; irgendein Herr XY Herrn Becks Stelle &uuml;bernommen hat, der sie
          aber nicht VOLL AUSF&Uuml;LLEN K&Ouml;NNEN WIRD!!!</P>

          <P>Die Manager Ihres Hauses sollten daran denken, da&szlig; der
          H&ouml;rVerlag ohne den grandiosen Erfolg der Serie Harry Potter heute
          garantiert nicht der gr&ouml;&szlig;te deutsche H&ouml;rbuchverlag
          w&auml;re, sondern einer unter vielen. M&ouml;glicherweise h&auml;tten ihn
          der Audioverlag und L&uuml;bbe Audio oder andere l&auml;ngst
          &uuml;berfl&uuml;gelt und auch einen weit gr&ouml;&szlig;eren
          Bekanntheitsgrad erreicht, wenn er nicht die Rechte an Harry Potter
          bekommen h&auml;tte und auch die Rechte f&uuml;r Band 5 haben w&uuml;rde.
          Eines sollte den M&auml;chtigen Ihres Hauses klar sein: Wenn Rufus Beck die
          Sprecherrolle &uuml;bernimmt, werden sicher die meisten Fans, die die vier
          vorherigen Folgen gekauft haben, auch Band 5 erwerben; wenn er die Rolle
          nicht bekommt, d&uuml;rfte nach meiner (zugegeben optimistischen)
          Sch&auml;tzung ein Drittel, viele meinen sogar die H&auml;lfte der
          H&ouml;rb&uuml;cher, nicht verkauft werden.</P>

          <P>Noch einmal appelliere ich im Namen der Fans und auch im Namen des
          Erfolges des H&ouml;rVerlages an Ihr Haus, Herrn Beck einen Vertrag zu
          geben, den er akzeptieren kann und damit sicherzustellen, da&szlig; Band 5
          ein eben solcher Kn&uuml;ller f&uuml;r den Verlag wird wie die vier
          Vorg&auml;nger. Herr Beck will Harry Potter weiter vorlesen und er kann es
          am besten, ihn &uuml;bertrifft hier niemand, und die Fans wollen seine
          Lesungen weiter erwerben.</P>

          <P>Wenn Ihre Chefetage nur ein bi&szlig;chen Phantasie hat, d&uuml;rfte sie
          sich vorstellen k&ouml;nnen, was ein schleppender Verkauf von Harry Potter
          Band 5 f&uuml;r Folgen f&uuml;r Ihr Haus hat, dieser Mi&szlig;erfolg
          d&uuml;rfte auch andere Produkte mitrei&szlig;en, und der H&ouml;rVerlag
          w&uuml;rde bald seine Spitzenposition verlieren.</P>

          <P>Ist das ein Beharren auf einer solchen Vertragsklausel Wert? Wir meinen
          nein.</P>

          <P>Wirklich hoffend, da&szlig; alles zu einem guten Ende kommt, verbleibe
          neben vielen anderen bisher treuen Fans<BR>
          ich, Uwe Simon, Bergstra&szlig;e 26, 95239 Zell.</P>

          <HR width="60%">


          <P>Diese Nachricht habe ich auf der Fanseite harrypotter-buch.de entdeckt:
          </P>

          <BLOCKQUOTE>
            <P>"Rufus Beck spricht definitiv nicht Band 5!<BR>
            22.10.2003 | Geschrieben von Arne (Webmaster)</P>

            <P>Die FAZ hat gerade folgendes berichtet: Der Schauspieler Rufus Beck
            steht f&uuml;r das neueste Harry-Potter-H&ouml;rbuch nicht mehr als Sprecher zur
            Verf&uuml;gung. Eine faire und gedeihliche Zusammenarbeit sei nicht mehr
            gegeben, sagte am Mittwoch eine Sprecherin des H&ouml;rverlags in M&uuml;nchen und
            best&auml;tigte damit einen Bericht der M&uuml;nchner "Abendzeitung". </P>

            <P>Allerdings sei nicht das von Beck geforderte h&ouml;here Honorar der
            entscheidendende Grund f&uuml;r die Trennung gewesen. N&auml;here Angaben wollte der
            Verlag nicht machen. Als H&ouml;rbuch soll Band 5 Mitte Februar 2004 erscheinen.
            Auch der neue Sprecher soll ein professioneller Schauspieler sein. "Wir
            sind mit Wunschkandidaten im Gespr&auml;ch", hie&szlig; es im H&ouml;rverlag. Mitte
            November will der H&ouml;rverlag den neuen Sprecher pr&auml;sentieren.</P>
          </BLOCKQUOTE>

          <P>Da musste der H&ouml;rverlag wohl seine Pressemitteilung etwas &auml;ndern,
          nachdem sie offensichtlich falsch war." </P>


          <P>Schaaade! :-( </P>

          <P>Hoffnungslose Gr&uuml;&szlig;e: Uwe. <BR>

          "dreiachser.xxl" &lt;simon.uwe@arcor.de&gt;</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

