<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>und sorgt damit f&uuml;r einen Skandal in
    Italien</TITLE>
  </HEAD>

  <BODY background="bge.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Nacktkalender</B></FONT></P>

          <P>"Nacktkalender schockt Italien - Darf man Behinderte
          erotisch fotografieren?" titelte die Internetplattform
          von "Bild" und "T-Online " am 7. Januar. Was im
          katholischen und machistischen Italien noch einen
          handfesten Skandal ausl&ouml;ste, wurde hierzulande
          sogleich n&uuml;chterner kommentiert. "Wir haben nichts
          gegen die sch&ouml;nen Fotos, zumal sich die behinderten
          Frauen selbst zur Verf&uuml;gung gestellt haben ", sagte
          Dr. Stefan Heinik, Vorsitzender des Sprecherrates des
          Deutschen Behindertenrates. Und so erledigt sich die
          Frage von "Bild", Gralsh&uuml;ter des urdeutschen
          Machismus, eigentlich von selbst: Nat&uuml;rlich darf man
          Menschen mit Behinderungen erotisch fotografieren! Denn
          wenn dies so nat&uuml;rlich und ungeniert und zugleich
          hintersinnig und selbstironisch in Szene gesetzt wird wie
          im Werk Benvenutos, dann k&ouml;nnen wir uns an
          sch&ouml;nen Frauen im Rollstuhl sowohl sinnlich als auch
          intellektuell erfreuen.</P>

          <P>Da ist Vanessa, die mit dem Rolli nackt und
          sympathisch l&auml;chelnd durch eine
          Fu&szlig;g&auml;ngerzone flaniert - unbemerkt, weil alle
          Passanten bunte Augenbinden tragen. Das Bild ist eine
          Chiffre, die verdeckt und zugleich enth&uuml;llt: Wer ist
          hier eigentlich behindert? Oder Anna, das obskure Objekt
          der Begierde von au&szlig;erirdisch gr&uuml;nen
          H&auml;nden, die aus einem Geb&uuml;sch hervorzuwachsen
          scheinen, den nackten K&ouml;rper begierig bedecken und
          ihn zugleich dem nat&uuml;rlichen Umfeld einverleiben. Da
          ist Lucia, die mit dem Rolli in einem Kiesbett zu
          versinken scheint oder Marianna, die mit schweren Ketten
          beh&auml;ngt eine Sado-Maso-Phantasie abgibt und damit
          dem uns&auml;glichen An-Den-Rollstuhl-Gefesselt-Sein eine
          ironisch-erotische Interpretationsm&ouml;glichkeit
          verleiht. Lisa probiert rote Pumps an und Loredana zeigt
          sich nackt mit ihrem Baby -Selbstverst&auml;ndlichkeiten,
          die nur in einer Welt, in der querschnittgel&auml;hmten
          Frauen die Geschlechtlichkeit abgesprochen wird, immer
          noch als Tabubruch gelten k&ouml;nnen.</P>

          <P>Sicher, einigen Kritikern wird die Inszenierung der
          zw&ouml;lf Frauen im Kalender &uuml;berfrachtet und zu
          plakativ erscheinen. Tats&auml;chlich zeugt schon der
          Titel des Projektes "Angeli senza Ali" (Engel ohne
          Fl&uuml;gel) von einer geh&ouml;rigen Portion Pathos.
          Treffend bemerkte der Kolumnist der kobinet-nachrichten
          dazu, dass es sich bei Engeln ohne Fl&uuml;gel um
          "gefallene Engel" handeln m&uuml;sse. Doch das
          entspr&auml;che nicht den nackten Wahrheiten, die diese
          Bilder vermitteln, denn die Engel ohne Fl&uuml;gel sind
          Menschen aus Fleisch und Blut. "Sinnlichkeit und Erotik
          werden hier nicht mit entw&uuml;rdigender
          Gyn&auml;kologie verwechselt. Jedes Bild erz&auml;hlt
          eine Geschichte. Die Fotos stellen k&uuml;nstlerisch
          fragil komponierte, vielsagend sprechende Szenen dar,
          lautlos wie ein pantomimisches Ballett, und jede der
          zw&ouml;lf Frauen ist darin eine Hauptdarstellerin",
          urteilt kobinet. "Sie sind unverklemmte, moderne, junge
          Frauen. So wie sie uns an jedem Zeitungskiosk oder auf
          den Werbeplakaten f&uuml;r die angeblich sch&ouml;nen
          Dinge des Lebens an jeder Bushaltestelle begegnen. Diese
          zw&ouml;lf Rollifrauen machen nicht den Eindruck, dass
          ihnen etwas fehlt, au&szlig;er der d&uuml;mmliche
          Gesichtsausdruck mancher professioneller Models aus der
          internationalen Catwalkszene."</P>

          <P>In Internet-Foren brandete sofort eine lebhafte
          Diskussion auf, ob es sich bei den abgebildeten Frauen
          &uuml;berhaupt um behinderte Models oder um
          professionelle Schauspielerinnen handeln w&uuml;rde. Wie
          sehr hier ein verhunzter Ma&szlig;stab von
          Normalit&auml;t angesetzt wird, macht wohl der Beitrag
          einer "Alexa 99" bei FatNews.de besonders deutlich: "Wenn
          die alle top aussehen, dann k&ouml;nnen es keine
          Behinderten sein! Denn Frauen, die schon lange an den
          Rollstuhl gefesselt sind, haben Muskelschwund und
          dementsprechend sehen dann auch ihre Beine aus! Auch die
          &uuml;brigen K&ouml;rperteile werden in Mitleidenschaft
          gezogen! Sie haben nat&uuml;rlich auch nicht mehr eine so
          grazile Haltung!" Doch machen Sie sich selbst ein Bild:
          Alle Fotos des Kalenders k&ouml;nnen Sie sich hier
          ansehen. Und vielleicht gibt es ja eine Neuauflage des
          Kalenders f&uuml;r 2004 mit zw&ouml;lf sch&ouml;nen
          M&auml;nnern . . .</P>

          <P>Text: Gunther Belitz, Fotos: G.A. Benvenuto</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

