<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <!-- Author = Birgit Heitfeld -->

    <TITLE>Eine ungew&ouml;hnliche St&auml;dtereise als ganz
    pers&ouml;nliches, mutiges Abenteuer</TITLE>
  </HEAD>

  <BODY background="bga.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="5"><B>Eine
          ungew&ouml;hnliche St&auml;dtereise als ganz
          pers&ouml;nliches, mutiges Abenteuer</B></FONT></P>

          <P align="center"><FONT color="#000080" size="4">von
          Birgit Heitfeld</FONT></P>

          <P>Die Dame an der Rezeption hat offenbar ihren "Bad Hair
          Day". Sie plaudert mit ihrer Kollegin unger&uuml;hrt
          &uuml;ber die neusten M&auml;nnerbekanntschaften und die
          besten Manik&uuml;re-Studios in Manhattan. Business as
          usual. So hatte Steffen Prey sich seine Premiere am
          Broadway wirklich nicht vorgestellt. Bislang kannte der
          21-J&auml;hrige aus Rellingen in Schleswig-Holstein, seit
          Geburt schwerstbehindert, New York nur aus den Medien.
          Doch die Webcam spiegelt nicht wider, wie laut, schnell
          und bunt es am Times Square zugeht.</P>

          <P>Nach dem Frischmachen geht es ins Weltstadtgew&uuml;hl
          dieser wilden Betonw&uuml;ste namens "Big Apple". Das
          Hotel liegt nahe des Empire State Building. Nur wenige
          Minuten - ein paar Amerikaflaggen, eine
          Sicherheitskontrolle und zwei rumpelige Aufzugfahrten -
          sp&auml;ter pr&auml;sentiert sich die launische Diva New
          York von einer ganz anderen Seite. Von hier oben wirken
          die Wolkenkratzer wie filigrane, zerbrechliche
          Kunstwerke, eingetaucht in rosa Abendlicht. Winzige
          F&auml;hren ziehen auf dem Hudson ihre Bahnen. 80
          Stockwerke tiefer, in H&auml;userschluchten und
          schnurgeraden Avenues, geht der Nahkampf im
          City-Dschungel weiter. Wir schieben Steffen im Rollstuhl
          holpernd vorbei an dampfenden Gullies und
          Schlagl&ouml;chern, die provisorisch mit Eisenplatten
          bedeckt sind. Hindurch zwischen schrottreifen "Yellow
          Cabs", blankpolierten Stretch-Limousinen und schwarzen
          M&uuml;llt&uuml;ten. Es riecht nach verbrannter Pizza und
          China-Imbiss.</P>

          <P>Die meisten Menschen im Rollstuhl w&uuml;rde diese
          Stadt abschrecken. Steffen Prey nicht. Er wollte sehen,
          wie auf diesem gedr&auml;ngten Flecken Erde die Welten
          aufeinanderprallen. Der angehende Online-Journalist bei
          einer Radiostation in M&uuml;nchen kann nur einen Arm und
          seinen Kopf koordiniert bewegen. Das Tempo Manhattans hat
          schon Besitz von ihm ergriffen.</P>

          <P>"Gib mal'n bisschen Gas!", bittet er seine Mutter, die
          den Rollstuhl zum vergoldeten "Trump Tower" in der Upper
          East Side, 57. Stra&szlig;e, steuert.</P>

          <P>In Steffen Preys Behindertenausweis steht "B" f&uuml;r
          Begleitung: Er kann so einen Trip nie ohne
          Unterst&uuml;tzung absolvieren. Bei der telefonischen
          Ticket-Reservierung von Lufthansa werden Details wie
          Extra-Service, Ma&szlig;e des Rollstuhls und Art der
          Behinderung abgefragt. Die Daten verwandeln sich
          sp&auml;ter in Dienstleistungen, etwa beim Check-in und
          Umsteigen. Wenn es hei&szlig;t: "Sanis, ready for
          pre-boarding", geht es ins Flugzeug.</P>

          <P>Nach dem Take-off werden die ersten Drinks gereicht.
          Die Flugbegleiterin geht durch die Kabine und klebt an
          viele Sitze bunte Punkte: Manche Passagiere wollen
          koscher essen, andere vegetarisch, wieder andere Hindu.
          Ein Fluggast verlangt Aspirin. Steffen will nur zur
          Toilette.</P>

          <P>Der Weitsicht von Kabinenausstattern ist es zu
          verdanken, dass sich in einem Jumbo mit 396 Passagieren
          in 12 000 Metern Flugh&ouml;he ein Mini-Bord-WC in eine
          rollstuhlgerechte Toilette verwandeln l&auml;sst. Der
          Umbau gestaltet sich zeit- und personalintensiver als
          erwartet. Erprobte Bastler sind hier klar im Vorteil.</P>

          <P>F&uuml;r einen "Rolli" misst sich die Topographie New
          Yorks in Rollstuhlrampen, behindertengerechten Bussen,
          Hotlines und hilfsbereiten Menschen. Die Busfahrt in die
          Wall Street erlebt man wie eine dichte Folge von Bildern,
          als einen Mikrokosmos aus Nationalit&auml;ten und
          Neurosen. Ground Zero und Brooklyn Bridge lassen sich von
          hier aus zu Fu&szlig; erreichen. Weiter geht es nach
          Chinatown, vorbei an asiatischen Superm&auml;rkten, Shops
          mit Billigprunk aus Korea.</P>

          <P>Um 18 Uhr &ouml;ffnet der Jazz-Club "Blue Note" im
          Village. Trompeter und Pianist Arturo Sandoval,
          Exilkubaner und Grammy-Preistr&auml;ger, steigert mit
          seinem eindringlichen Latin Jazz die Wirkung der
          Cocktails. Beim Fr&uuml;hst&uuml;ck am n&auml;chsten
          Morgen unterhalten wir uns bei Muffins, R&uuml;hrei und
          Orangensaft noch einmal &uuml;ber das Konzert. Zeit zum
          Aufbrechen.</P>

          <P>Der "Bellman" schl&auml;gt vor, statt des Express Bus
          einen Wagen zu nehmen. &Uuml;berredet. Kurz darauf
          betritt ein Chinese die Lobby. Ob der Rollstuhl in den
          Kofferraum passt? "No ploblem!" Drau&szlig;en will der
          Fahrer den Kofferraumdeckel mit Gewalt zuschlagen.
          H&auml;tte er vorher gefragt, w&uuml;sste er, dass
          Steffens Rollstuhl 89 mal 59 mal 93 Zentimeter misst und
          nicht in seinen Lincoln Towncar passt. Schlie&szlig;lich
          wird die Klappe mit einem Band am Auspuff befestigt. Das
          "rollstuhlgerechte" Taxi zum Airport bew&auml;hrt sich
          nur wenige Meilen, dann l&ouml;st sich das Band.</P>

          <P>Auch bei der Landung in Hamburg zeigt sich: Jemand
          beim "Handling" hat nicht richtig in Steffens Papiere
          geschaut, den Rollstuhl versehentlich falsch montiert.
          Ein Fall f&uuml;r den Pannendienst. F&uuml;r Steffen kein
          Grund, k&uuml;nftige Reisepl&auml;ne zu verwerfen. Er hat
          sich f&uuml;r weitere Trips eine Miles &amp; More-Karte
          besorgt. "Old Frankie-Boy" w&uuml;rde ihm da beipflichten
          und seine alte New-York-Hymne schmettern: "If you can
          make it there ..."</P>

          <P>Informationen: Eine kostenlose Brosch&uuml;re der
          Arbeitsgemeinschaft Deutscher Verkehrsflugh&auml;fen
          (ADV) gibt Informationen &uuml;ber Einrichtungen und
          Services f&uuml;r Behinderte an den deutschen Airports.
          Bestelladresse: ADV, Fischer Insel 16, 10179 Berlin. Tel.
          030/310 11 80. Mehr im Internet: www.adv-net.org
          Flughafen: Am Frankfurter Flughafen schl&auml;gt das Herz
          des Lufthansa Betreuungsdienstes: 250 Mitarbeiter helfen
          Rollstuhlfahrern, Blinden, Tauben, Kranken, Alten, allein
          reisenden Kindern und Menschen mit Sprachproblemen durch
          die Gates (im Internet: www.lufthansa.com, siehe:
          Lufthansa Services, spezielle Services, Reisen ohne
          Barrieren). Bucht irgendwo in der Welt ein
          betreuungsbed&uuml;rftiger Passagier ein Lufthansa
          Ticket, treffen seine Daten im Frankfurter Rechner ein
          und werden in Anfragen und Services verwandelt. 2002
          nahmen fast 350 000 G&auml;ste, auch von anderen
          Airlines, diesen Sonderdienst in Anspruch. In einem
          speziellen Aufenthaltsraum k&ouml;nnen sie Kaffee
          trinken, sich ausruhen oder lesen und werden
          p&uuml;nktlich zum Take-off von ihrem Betreuer wieder
          abgeholt. Auch an vielen gro&szlig;en Zielflugh&auml;fen
          sind die Helfer im Einsatz.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

