<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1"><!-- Author = Anja Winkler -->

    <TITLE>Retinitis Pigmentosa</TITLE>
  </HEAD>

  <BODY background="bgb.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Retinitis Pigmentosa</B></FONT></P>

          <P>Der Begriff "Retinitis Pigmentosa" (RP) bezeichnet
          eine Gruppe von Augenerkrankungen, bei denen es zu einem
          allm&auml;hlichen Absterben der Netzhaut, der
          lichtempfindlichen Schicht im Auge, kommt. Beim
          "klassischen" Verlauf schr&auml;nkt sich das Gesichtsfeld
          der Betroffenen allm&auml;hlich von den
          Au&szlig;engrenzen her ein, bis nur ein kleiner,
          zentraler Sehrest &uuml;brig bleibt, &uuml;blicherweise
          als "Tunnelblick" bezeichnet. Der Betroffene sieht damit
          nur diejenigen Gegenst&auml;nde, welche er direkt
          anschaut, nicht aber die zur Orientierung ebenfalls
          wichtigen Objekte au&szlig;erhalb der Blicklinie. Es kann
          auch zur v&ouml;lligen Erblindung kommen.</P>

          <P>Die Sehbehinderung durch Retinitis Pigmentosa tritt
          h&auml;ufig schon im fr&uuml;hen Kindesalter auf,
          entwickelt sich aber h&auml;ufig erst beim
          Heranwachsenden, manchmal auch noch sp&auml;ter. Die
          Krankheit verl&auml;uft schleichend, so dass das Leiden
          meist erst nach dem 20. Lebensjahr erkannt wird, wenn der
          Betroffene gro&szlig;e Sehst&ouml;rungen hat und ein Arzt
          daraufhin, nach eingehender Untersuchung und gezielter
          Befragung, die Diagnose RP stellt.</P>

          <P>In der Netzhaut geschieht die Umwandlung von Licht in
          Sinneserregung durch die Sehzellen: die St&auml;bchen und
          Zapfen. Die Signale von St&auml;bchen und Zapfen werden
          in der Netzhaut verarbeitet und dann durch den Sehnerv an
          das Gehirn weitergeleitet. Dort kommt es zur eigentlichen
          Wahrnehmung. In der Netzhaut erg&auml;nzen sich die
          St&auml;bchen und Zapfen in ihren Aufgaben beim Sehen.
          Die St&auml;bchen machen das Sehen im D&auml;mmerlicht
          und bei Nacht m&ouml;glich. Sie besiedeln vornehmlich die
          Au&szlig;enzonen der Netzhaut. Die Zapfen
          erm&ouml;glichen das Tagessehen und die Farbwahrnehmung,
          sie kontrollieren au&szlig;erdem die Mitte des
          Gesichtsfeldes, den Bereich der Blicklinie, die Zone der
          besten Sehsch&auml;rfe. Man liest normalerweise mit den
          Zapfen.</P>

          <P>Am Beispiel eines Farbfilmes kann man die Erkrankung
          etwas besser verdeutlichen: Man stelle sich vor, die
          Netzhaut ist die lichtempfindliche Oberfl&auml;che des
          Filmes in einer Kamera. Wenn diese in irgendeiner Weise
          besch&auml;digt ist und nicht mehr richtig arbeitet, d.
          h. keine einwandfreien Bilder mehr macht, dann n&uuml;tzt
          das Reinigen des Objektives wenig &ndash; der Film bleibt
          kaputt. Auch ein Austauschen der Linse bringt keine
          Besserung. Der Film ist besch&auml;digt und muss
          ausgetauscht werden. Das gelingt bei der Netzhaut bisher
          nicht.</P>

          <P>Wesentliche Zeichen der "klassischen" Retinitis
          Pigmentosa sind folgende: Der Betroffene kann
          tags&uuml;ber noch ganz vern&uuml;nftig sehen, ohne dass
          dem Umfeld seine Erkrankung auff&auml;llt, aber in der
          D&auml;mmerung und nachts hat er Schwierigkeiten, sich zu
          orientieren. Die Lichtempfindlichkeit nimmt im Laufe der
          Zeit zu und bei schnellem Wechsel von hell zu dunkel,
          wenn man z.B. an einem sonnigen Tag einen dunklen Raum
          betritt, kann das Auge sich nicht so schnell umstellen.
          Die langsame oder unvollst&auml;ndige Anpassung an die
          Dunkelheit stellt sich zumeist allm&auml;hlich in der
          Jugend ein und entwickelt sich zur v&ouml;lligen
          Nachtblindheit - im Allgemeinen das erste deutliche
          Anzeichen f&uuml;r Retinitis Pigmentosa.</P>

          <P>Das Bed&uuml;rfnis des nachtblinden RP-Betroffenen
          nach einer dunklen Brille erscheint zun&auml;chst
          widerspr&uuml;chlich. Es wird aber aus zwei Gr&uuml;nden
          verst&auml;ndlich. Das einfallende Licht wird an den
          h&auml;ufig vorhandenen Linsentr&uuml;bungen gestreut und
          verursacht dadurch Blendung.</P>

          <P>Im Zuge der Gesichtsfeldverengung wird bei den
          RP-Betroffenen zun&auml;chst die Funktion der
          St&auml;bchen beeintr&auml;chtigt. Au&szlig;enzonen des
          Gesichtsfeldes werden als erstes von RP betroffen. Das
          Gesichtsfeld des gesunden Menschen ist bei Benutzung
          beider Augen ca. 180 Grad weit. Es vermittelt eine
          Panoramasicht, wobei aber nicht alle Zonen funktionell
          gleichwertig sind. Die Gesichtsfeldmitte hat die beste
          Sehsch&auml;rfe und ist damit von besonderer Wichtigkeit
          f&uuml;r das Unterscheiden von feinen Details, z. B.
          f&uuml;r das Erkennen von Gesichtern und das Lesen von
          Texten. Sie bleibt im Verlauf der RP lange, bei vielen
          Betroffenen sogar lebenslang, erhalten (=&gt;
          Tunnelblick). W&auml;hrend das zentrale Gesichtsfeld mit
          seiner Sehsch&auml;rfe dazu dient die Dinge anzuschauen
          und zu identifizieren, werden die Au&szlig;enzonen des
          Gesichtsfeldes f&uuml;r die Orientierung im Raum
          ben&ouml;tigt.</P>

          <P>Sp&auml;ter kommt es auch zur Beeintr&auml;chtigung
          der Zapfenfunktion. Das Farb- und Kontrastsehen sowie die
          Lesef&auml;higkeit wird beeintr&auml;chtigt, was dann
          praktisch zur Erblindung f&uuml;hren kann. Der
          Krankheitsverlauf erstreckt sich meist &uuml;ber
          Jahrzehnte, weshalb von einem schleichenden Charakter
          gesprochen wird.</P>

          <P>Die hier beschriebene Verlaufsform des
          Gesichtsfeldverfalls bei Retinitis Pigmentosa entspricht
          dem klassischen Typus. Eine Reihe weiterer Typen
          k&ouml;nnen vorkommen, die sich durch die Art und durch
          den Beginn des Gesichtsfeldausfalles unterscheiden. So
          kann es z. B. zu sektorenf&ouml;rmigen, seltener auch zu
          einseitigen oder zu perizentralem (ringf&ouml;rmig dicht
          um die Gesichtsfeldmitte angeordnetem) Befall kommen.
          M&ouml;glich sind auch ein diffuser Befall (ohne
          Bevorzugung bestimmter Gesichtsfeldpartien) oder ein
          zentraler Befall - hierbei beginnt der Schaden
          ausnahmsweise in der Gesichtsfeldmitte (inverse RP).</P>

          <P>Anja Winkler &lt;anja.winkler@blindzeln.de&gt;</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

