<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <META name="author" content="Johannes Weidner">

    <TITLE>Erdwein: &Uuml;belauge - ein M&auml;rchen vom Blindsein</TITLE>
  </HEAD>

  <BODY bgcolor="#FFFFFF" text="#333333" link="#0033CC" vlink=
  "#333366" leftmargin="10" topmargin="10" marginwidth="10"
  marginheight="10">
    <TABLE border="0" cellspacing="0" cellpadding="10" width="100%"
    bgcolor="#99aaaa">
      <TBODY>
        <TR>
          <TD valign="top" width="6%">
          </TD>

          <TD valign="top" bgcolor="#ffffff">
            <H1 align="center"><BR>
            &Uuml;belauge</H1>

            <H2 align="center">Ein M&auml;rchen vom Blindsein</H2>

            <H3 align="center">von Hanno Erdwein</H3>

            <P>&nbsp;</P>

            <P>Vor langer, langer Zeit, als es noch nicht so viel
            L&auml;rm auf der Welt gab und es so still war, dass
            man sogar die Vogelsprache verstand, als die Menschen
            noch Zeit hatten, sich den kleinen Dingen zu widmen,
            als die Liebensw&uuml;rdigkeit noch
            selbstverst&auml;ndlich war, lebte in einer
            Fischerh&uuml;tte Hans, ein nicht ganz
            f&uuml;nfzehnj&auml;hriger Junge. Er und seine Eltern
            ern&auml;hrten sich recht und schlecht vom Fischfang.
            Der Vater fuhr jeden Morgen auf's Meer hinaus. Die
            Mutter wirtschaftete emsig im kleinen Haus, bis es
            blitzte. Und Hans - tja, der sa&szlig; den ganzen Tag
            in der Sonne und lauschte dem Gesang der V&ouml;gel.
            Ihr fragt euch mit Recht, weshalb er nicht dem Vater
            beim Fischen oder der Mutter beim Reinemachen geholfen
            hat. Die Antwort ist: Hans war blind.</P>

            <P>Oft kam ein etwa gleichaltriges M&auml;dchen vorbei
            und leistete Hans Gesellschaft. Grete, die Tochter des
            Nachbarn. Dann sa&szlig;en die beiden auf einer Klippe
            und Grete erz&auml;hlte dem Hans, was sie sah. Und das
            machte sie so gut, dass sich der Junge alles lebhaft
            vorstellen konnte. Grete hatte ihren Hans schon lange
            lieb gewonnen. Und Hans ging es ebenso, obschon er
            ihren Liebreiz nicht sehen konnte. Grete war
            &uuml;beraus sch&ouml;n.</P>

            <P>Eines Tages nun sa&szlig; Hans vor dem Haus auf der
            Bank und seufzte:<BR>
            "Ach k&ouml;nnte ich doch nur mal einen kurzen Moment
            meine liebe Grete ansehen!"<BR>
            "Dummkopf!", kr&auml;chzte es da vom Dach herab.<BR>
            "Wer spricht zu mir?"<BR>
            "Ich nat&uuml;rlich. Der Rabe Corvus."<BR>
            "Warum bin ich ein Dummkopf, wenn ich mir f&uuml;r
            kurze Zeit gesunde Augen w&uuml;nsche?"<BR>
            "Weil du mit wenig M&uuml;he f&uuml;r immer sehen
            k&ouml;nntest."<BR>
            "Das w&auml;re sch&ouml;n. Und wie stell ich das
            an?"<BR>
            "Schwing Dich auf die F&uuml;&szlig;e und geh
            nordw&auml;rts zur Hexe Morgus Nachtgewand. Die hat
            noch ganz andere Dinge fertiggebracht, als so ein paar
            dumme Augen zu reparieren."<BR>
            "Das ist wahr und eine gute Idee!"<BR>
            "Wird sich rausstellen, ob es eine so gute Idee
            ist."</P>

            <P>Hans sch&uuml;ttelte den Zweifel ab und sprang
            sogleich auf, bedankte sich voll &Uuml;berschwang bei
            dem Vogel. "Ich lauf sofort los."<BR>
            "Nicht so hastig. Die Sache will &uuml;berlegt sein.
            Morgus macht das nicht umsonst."<BR>
            "Ich geb alles hin, was ich hab, wenn ich daf&uuml;r
            endlich sehen kann."<BR>
            "Wie du willst. Aber beklag Dich dann nicht."</P>

            <P>Corvus flog davon und Hans lief zu seiner Mutter.
            Erz&auml;hlte auch Grete von dem Vorhaben und konnte es
            nicht erwarten, bis am Mittag der Vater nach Hause kam.
            Sie alle hatten gro&szlig;e Bedenken. Aber die konnten
            sie Hans nicht vermitteln, der mit Feuereifer seine
            Reise vorbereitete und sich schon mal einen soliden
            Stecken schnitt.</P>

            <P>"Bist du nicht zufrieden, meine glatte Haut zu
            sp&uuml;ren, mein weiches Haar und den Samt meiner
            Lippen, wenn wir uns k&uuml;ssen?" Grete weinte, weil
            sie ein gro&szlig;es Ungl&uuml;ck voraus ahnte.</P>

            <P>"Ich werde dich noch tausendmal mehr lieben, wenn
            ich dich endlich sehen kann", versicherte er ihr.</P>

            <P>Darauf dr&uuml;ckte Hans ein letztes Mal sein
            M&auml;del fest an sich. "Ich komme mit", entschied
            sich Grete und wandte sich, um Vorbereitungen f&uuml;r
            die Reise zu treffen.</P>

            <P>"Geht nicht." Hans hielt sie am Arm fest.<BR>
            "Warum nicht?"<BR>
            "Ein altes Gesetz der Hexen und Zauberer. Man darf
            denen nur alleine unter die Augen treten."</P>

            <P>Grete wusste das. Sie hatte selbst genug magisches
            Wissen von ihrer Gro&szlig;mutter geerbt. Wollte aber
            dreist dem Verbot zuwider handeln.<BR>
            "Bitte, liebes M&auml;del", bat Hans, "bleib hier und
            bring uns nicht in Gefahr!"</P>

            <P>Traurig ging sie davon und Hans tastete sich auf den
            Weg nach Norden. "He! Pass auf, wo du hintrittst!" Die
            Stimme kam von unten. Hans hielt an und lauschte.<BR>
            "Hier bin ich, Schwachkopf!"<BR>
            "Wo hier?"<BR>
            "Vor deinen F&uuml;&szlig;en. Noch einen Schritt und du
            h&auml;ttest mein H&auml;uschen zertreten."<BR>
            "Also bist du eine Schnecke."<BR>
            "Was denn sonst, Bl&ouml;dian."<BR>
            "Nicht so unfreundlich. Schlie&szlig;lich bin ich blind
            und wusste nicht, dass du dich auf meinem Pfad
            befindest."</P>

            <P>Jetzt tat der Schnecke ihre Grobheit leid.<BR>
            "Verzeihung, das hatte ich nicht gesehen. du kamst so
            dahergebraust, als h&auml;ttest du gute Augen."<BR>
            "Ich hab es auch furchtbar eilig."<BR>
            "So? Wohin des Wegs, Kamerad?"<BR>
            "Nach Norden zur Morgus. Die soll mich von meiner
            Blindheit heilen."<BR>
            "Tststs - hast du dir &uuml;berlegt, worauf du Dich da
            einl&auml;sst?"<BR>
            "Klar, hab ich. Ich will um alles in der Welt sehen
            k&ouml;nnen."<BR>
            "Wir m&ouml;chten so manches, was uns dann, wenn wir es
            haben, nur schadet."<BR>
            "Dummes Geschw&auml;tz! Ein klarer Blick hat noch
            niemandem &Uuml;bles gebracht."<BR>
            "Da w&auml;r ich mir nicht so sicher. Wer hat dir denn
            den Floh ins Ohr gesetzt?"<BR>
            "Rabe Corvus."<BR>
            "Ach der. Dachte es mir. Morgus dunkler Bote. Dieses
            schwarze Federvieh ist an so manchem Elend schuld."
            Seufzen."Wenn ich es k&ouml;nnte, w&uuml;rde ich dir
            abraten. Aber ich sehe, dass du schon total verblendet
            bist." Damit kroch die Schnecke aus dem Weg und gab
            Hans den Pfad frei.</P>

            <P>Nach einer weiteren, recht langen und
            m&uuml;hseligen Wegstrecke flog mit einem Mal ein Vogel
            &uuml;ber Hans' Haupt dahin, pfiff ein lustiges Lied
            und zog immer engere Kreise. Der Junge blieb stehen und
            fragte:<BR>
            "Munterer S&auml;nger, wer bist du?"<BR>
            "Der Martinsvogel."<BR>
            "Aha? Ich bin am Martinstag geboren."<BR>
            "Das wei&szlig; ich. Deshalb hab ich auf dich
            aufzupassen."<BR>
            "Unsinn! Auf mich braucht niemand achtzugeben. Ich bin
            gro&szlig; und stark und werde mit jedem Tag
            kr&auml;ftiger." In der Tat war Hans seit seinem
            Aufbruch m&auml;chtig gewachsen und hatte breite
            Schultern bekommen. Auf den am Weg liegenden
            Geh&ouml;ften fand er &uuml;berall bereitwillig
            Unterschlupf und man f&uuml;tterte ihn t&uuml;chtig
            heraus. Allerdings verschwieg er sorglich, wohin seine
            Reise ging. Man h&auml;tte ihn dann wohl weniger
            freundlich aufgenommen.</P>

            <P>"Ich mach mir ernsthaft Sorgen um dich",
            fl&ouml;tete der Vogel.<BR>
            "Das brauchst du nicht. Ich wei&szlig;, was ich
            tue."<BR>
            "Davon bin ich nicht &uuml;berzeugt. Kennst du die
            Macht der Morgus?"<BR>
            "Pah - ein Weib!"<BR>
            "Aber was f&uuml;r eins! Sie hat alle Tricks der
            schwarzen Magie drauf, die man sich vorstellen
            kann."<BR>
            "Wenn schon. Mich macht sie so rasch nicht kirre."<BR>
            "Hans - du &uuml;bersch&auml;tzt dich gewaltig. Ein
            Wink von ihrem kleinen Finger verwandelt dich in ein
            bibberndes H&auml;ufchen Elend."<BR>
            "Abwarten. Ich lass mich durch solch ein Gerede nicht
            einsch&uuml;chtern."<BR>
            "Wie du willst. Ich werde dir folgen und dich nicht aus
            dem Auge lassen."<BR>
            "Ist zwar nicht n&ouml;tig. Aber wenn du es unbedingt
            m&ouml;chtest, dann mag ich dich nicht hindern."</P>

            <P>Hans zog mehr als zwei Jahre nach Norden. Es wurde
            kalt und immer k&auml;lter. Bald bedeckte Schnee und
            Eis seinen Weg. Aber das focht ihn nicht an. Es
            w&auml;rmte ihn der Gedanke, sich bald an der
            strahlenden Sch&ouml;nheit seiner Grete erfreuen zu
            k&ouml;nnen.</P>

            <P>Inzwischen war er ein stattlicher Mann von achtzehn
            Jahren, als er im Land der Hexe Morgus ankam. Die
            Schreckliche wohnte in einem Eispalast voller lebloser
            Menschen und Tiere; denn alles, was ihr ungebeten vor
            Augen kam, musste zu Kristall erstarren.<BR>
            "Sieh an! du willst also zu mir", empfing ihn Morgus
            mit falschem L&auml;cheln. Sie war &uuml;ber die
            Einzelheiten durch ihren Raben gut unterrichtet,
            lie&szlig; sich aber nichts anmerken. Hans
            sch&uuml;ttete vor ihr sein Herz aus. Morgus stellte
            sich so, als sei sie von seinem Schicksal
            ergriffen.<BR>
            "Das ist aber schlimm! Was machen wir denn da? Hm, ich
            werde mal dar&uuml;ber nachdenken." Lie&szlig; ihn
            stehen und ging, eine ausgemachte Teufelei
            vorbereiten.</P>

            <P>Nach einer guten Stunde kam sie strahlend, aber
            voller Zynismus zur&uuml;ck: "Ich kann dir helfen!"<BR>
            "Ja?", freute sich der Ahnungslose.<BR>
            "Aber es kostet ein wenig."<BR>
            Hans rutschte das Herz in die Hose: "Geld hab ich
            leider keines."<BR>
            "Wer redet hier von Mammon.Was ich von dir verlange ist
            nur ein ganz klein wenig von deinem K&ouml;rper."</P>

            <P>Die Miene des Jungen Mannes hellte sich sichtlich
            auf:<BR>
            "Nimm, was du brauchen kannst. Ich geb alles hin, wenn
            ich daf&uuml;r den klaren Blick bekomme."<BR>
            "Das wirst du", erwiderte die Hexe
            hinterh&auml;ltig.<BR>
            "Was verlangst du denn?"<BR>
            "Nicht viel. Nur das vordere Glied deines linken
            kleinen<BR>
            Fingers."<BR>
            "Das kannst du gerne haben. Zwei gesunde Augen sind mir
            mehr<BR>
            wert."</P>

            <P>Nun war das Zauberweib am Ziel. Hans wusste nicht,
            welche Macht gerade im ersten St&uuml;ck eines jeden
            kleinen Fingers verborgen ist. Und zudem hat der linke
            die meisten Kr&auml;fte. Arglos reichte er der Hexe die
            Hand und sie trennte mit einer Rabenfeder das Glied
            ohne Blutvergie&szlig;en ab. Durch seinen Leib lief ein
            Ruck, als sp&uuml;re er ein starkes Erdbeben. Danach
            war ihm merkw&uuml;rdig leicht im Kopf.</P>

            <P>"Mach deine Augen auf", befahl Morgus. Ber&uuml;hrte
            mit der gleichen Feder sacht die R&auml;nder seiner
            Lider.<BR>
            "Was siehst du?"<BR>
            "Ich sehe Nacht und viele helle Punkte darin."<BR>
            "Gut. Es ist gelungen. Die hellen Punkte sind die
            Sterne. Nun aber schau mich an."<BR>
            "Du bist blendend sch&ouml;n, oh Zauberin."<BR>
            "Sch&ouml;n?", lachte die mokant, "da solltest du erst
            mal meine Tochter Lilith sehen, die ganz im S&uuml;den
            wohnt."<BR>
            "Ja, das m&ouml;chte ich gern", rief Hans begeistert,
            der von einem Augenblick zum andern seine Grete
            vergessen hatte. Daf&uuml;r konnte er nicht genug die
            Augen in der f&uuml;r ihn neuen Welt herumwandern
            lassen.</P>

            <P>"Ich sende dich zu ihr. Du wirst ihr willkommen
            sein. Solch einen prachtvollen und t&uuml;chtigen Mann
            kann sie immer gebrauchen."<BR>
            "Ja,", jubelte Hans, "ich will nach S&uuml;den und
            Lilith besuchen. Denn nun habe ich gute Augen und mag
            mir endlich alles ansehen, was sch&ouml;n und lieblich
            ist."</P>

            <P>Morgus schnippte mit den Fingern und der Rabe kam
            auf ihre Schulter geflogen.<BR>
            "Mach dich auf, Corvus, und melde meiner Tochter, dass
            ich ihr einen starken Burschen sende."</P>

            <P>"Schon unterwegs", kr&auml;chzte Corvus und warf
            einen bedauernden Blick auf Hans. Ihm tat bereits leid,
            was er durch seinen Rat angerichtet hatte.</P>

            <P>Hans zog ebenfalls los. Seelenlose Augen k&ouml;nnen
            zwar sehen, aber sie geben alles verzerrt wieder, was
            sie erblicken. Und das ist verderblich f&uuml;r den,
            der durch sie die Welt erf&auml;hrt. Es gibt nichts,
            woran er sich erw&auml;rmen, erfreuen kann. Morgus
            Zauberbann hatte das Opfer fest im Griff. Wie auf einer
            Fl&ouml;te blies die Hexe ihren Willen durch jenes
            kurze Fingerglied, das sie so leicht erbeutet
            hatte.</P>

            <P>Hans kam auf dem Weg nach S&uuml;den durch gleiche
            D&ouml;rfer und Gemarkungen wie auf dem Hinweg.
            Diejenigen, welche ihm zuvor mit Speise, Trank und
            guten Worten die Reise erm&ouml;glicht hatten,
            empfingen nun von ihm lauter Grobheiten und Gewalttat.
            Er nahm sich, was er brauchte und pr&uuml;gelte sich
            seinen Weg frei. Ihm ging bald der Ruf voraus:
            "Versteckt euch. Da kommt &Uuml;belauge!" Denn Hans
            hatte einen eiskalten und gemeinen Blick, bei dem einem
            das Blut in den Adern gefror. Man warf ihm freiwillig
            alles vor die F&uuml;&szlig;e, was er fluchend forderte
            und nahm schleunigst Rei&szlig;aus.</P>

            <P>"Hans, was hat man dir angetan?", weinte &uuml;ber
            ihm sein Martinsvogel.<BR>
            "Mach dich weg, du lausiges Federvieh!", rief der und
            schleuderte einen Stein nach ihm, der den guten Vogel
            nur um Haaresbreite verfehlte.<BR>
            "Ich werde dir dennoch folgen, du armer Mensch."<BR>
            "Lass dich ja nicht mehr sehen!"</P>

            <P>Auch die Schnecke sah Hans daherst&uuml;rmen.<BR>
            "Hast du nun deinen klaren Blick, dummer Hans?!"<BR>
            "Aus dem Weg, widerlicher Schleimer, sonst zerquetsch
            ich dich."<BR>
            "Wahrhaft freundliche Menschen entl&auml;sst die
            Morgus", brummte sie und verzog sich eilig in ihr
            Haus.</P>

            <P>Dann aber kam ihm Grete entgegen gelaufen:<BR>
            "Liebster! Bist du wieder zur&uuml;ck!" Sie hatte zwar
            von der schlimmen Verwandlung ihres Hans geh&ouml;rt,
            mochte das aber nicht glauben. Mit ausgebreiteten Armen
            empfing sie ihn.<BR>
            "Hau ab, gemeine Dirne!"<BR>
            "Ich bin es, deine Grete!"<BR>
            "Fort sag ich. Kenne dich liederliches Weib nicht. Gib
            die Stra&szlig;e frei, damit ich bald zu meiner Lilith
            komme."<BR>
            "Du kennst deine Grete nicht mehr?", weinte sie und
            fiel ihm vor die F&uuml;&szlig;e. Er aber trat nach ihr
            und st&uuml;rmte, Gemeinheiten rufend,
            vor&uuml;ber.</P>

            <P>Lassen wir den heillosen Menschen nach S&uuml;den
            rasen. Er wird noch eine gute Weile unterwegs sein.
            Schauen wir lieber, was Grete unternimmt, ihren
            Liebsten zu retten. Denn das will sie mit aller Kraft
            ihres Herzens. Erst einmal war sie, wie wir uns denken
            k&ouml;nnen, totungl&uuml;cklich, ihren Freund derart
            ver&auml;ndert zu finden. Dann aber wischte sie die
            Tr&auml;nen ab und besuchte das Grab ihrer
            Gro&szlig;mutter. Unter dem schattigen Birkenbaum hatte
            sie oft gesessen und in Zwiesprache mit der Ahnfrau die
            gro&szlig;en und kleinen Schicksalsschl&auml;ge
            verarbeitet. Nach einer Weile des Stillsitzens rauschte
            es wieder in der Krone des Baums.<BR>
            "Meine liebe Grete. Wie ich sehe, bedr&uuml;ckt dich
            ein gro&szlig;er Kummer."<BR>
            "Gro&szlig;mutter hilf mir. Gib Rat, was ich tun
            soll."<BR>
            "Besinne dich auf das, was du gelernt hast. Du bist alt
            genug, die Kr&auml;fte der wei&szlig;en Magie in dir zu
            wecken."<BR>
            "Morgus ist viel, viel st&auml;rker, als ich je sein
            kann."</P>

            <P>"Du hast ein reines Herz - und was noch wichtiger
            ist - eine gro&szlig;e Liebe. Sie allein sollte ihre
            dunklen Kr&auml;fte besiegen." Grete schluckte tapfer
            die Tr&auml;nen hinunter und gewann Zuversicht.</P>

            <P>"Martinsvogel", rief sie dann. Und der
            Weggef&auml;hrte ihres Hans kehrte zu ihr
            zur&uuml;ck.<BR>
            "Bleib du hier. Ich werde in deiner Gestalt und an
            deiner Stelle nach S&uuml;den fliegen."</P>

            <P>Hans erreichte nach gut einem Jahr sein Ziel. Man
            kann sich die gewaltigen Schritte vorstellen, die er
            bei seinem Dahinrasen gemacht hatte. Auch bemerkte er
            nicht, dass, je weiter er nach S&uuml;den kam, die Welt
            immer lauter und unmenschlicher wurde. Keine
            B&auml;ume, Wiesen und lauschigen B&auml;che, an denen
            man sich erholen konnte. &Uuml;berall dr&ouml;hnten
            Maschinen, ratterten Transportwagen vor&uuml;ber und
            stampften<BR>
            Bohrmei&szlig;el die Erde auf. Und wenn nachts? der
            Arbeitsl&auml;rm verstummte, h&auml;mmerten einem
            w&uuml;ste Musikrhythmen die Ohren voll. Dann tanzte
            Lilith mit ihren Sklaven zum Schein des<BR>
            nie erl&ouml;schenden Hexenfeuers.</P>

            <P>So also empfing ihn das Reich der
            Morgus-Tochter.</P>

            <P>"Kommst du endlich?", wurde er auch gleich von
            Lilith angeschnauzt, die sich aus gutem Grund stets in
            einer Nebelwolke verbarg. "Hast dir ja arg viel Zeit
            gelassen."<BR>
            "Im Gegenteil", wehrte sich Hans. "Ich bin so rasch wie
            m&ouml;glich hierher geeilt."<BR>
            "Widersprich nicht, Sklave!" Dabei r&uuml;hrte sie ihn
            t&uuml;ckisch mit einem Hy&auml;nenknochen an. Die
            Glieder des jungen Mannes gehorschten ihm nicht mehr,
            sondern folgten von nun an nur noch Liliths Willen.<BR>
            "Los, los! An die Arbeit! Die Zeit des Faulenzens ist
            vor&uuml;ber!"</P>

            <P>F&uuml;r l&auml;ngere Zeit verlieren wir Hans aus
            den Augen. Er verrichtete niedrigste Sklavendienste bei
            seiner neuen Herrin, die er nicht einmal Mu&szlig;e
            hatte, in Augenschein zu nehmen. H&auml;tte er dazu
            Zeit und Gelegenheit gehabt, w&auml;re ihm schon
            aufgefallen, wie sehr er betrogen wurde. Lilith war Von
            kleiner Gestalt und mit ihrer schuppigen Haut glich sie
            eher einem zweibeinigen Reptil. Sie war die Frucht
            einer fl&uuml;chtigen Liebschaft zwischen Morgus und
            dem im S&uuml;dmeer hausenden Wasserkobold
            Asperagus.</P>

            <P>Lange brauchte Grete, die schreckliche Situation
            auszukundschaften, in der sich ihr Hans befand. Sie
            flog umher, immer unter der Gefahr, von der wachsamen
            Lilith entlarvt zu werden.</P>

            <P>"Los!", kreischte das Unweib. "Such W&uuml;rmer und
            kau sie mir zu Brei. Ich brauch Kraft f&uuml;r den
            Hexensabatt!" Schlug immerfort auf hans ein, dessen
            blo&szlig;er R&uuml;cken schon ganz zerfurcht war. Das
            Niedrigste und Unw&uuml;rdigste war dieser Sadistin
            gerade recht, die sich am Elend m&auml;stete wie andere
            an feiner Speise.</P>

            <P>Aber es gab Stunden, an welchen Lilith nicht so sehr
            auf alles achten konte. Die nutzte Grete, einen
            Rettungsplan auszuhecken.</P>

            <P>So musste ihr Freund einmal t&auml;glich im Meer die
            verkotete und verdreckte Leibw&auml;sche seiner Herrin
            waschen. Das tat er mit stoischem Gleichmut. Ihn band
            nach wie vor die Zauberl&auml;hmung.<BR>
            "Hans! H&ouml;rst du mich?"<BR>
            Grete flog in Vogelgestalt dicht &uuml;ber ihm hin.
            Aber er reagierte nicht.<BR>
            "Da muss ich nachhelfen", dachte sie. Eilte zu einem
            T&uuml;mpel in der N&auml;he, der schon viele ihrer
            Tr&auml;nen aufgenommen hatte und tauchte die
            Fl&uuml;gelhand hinein. Tr&auml;nen, das wei&szlig;
            man, haben einen ganz besonders starken Zauber. Mit der
            nassen Schwinge strich sie Hans &uuml;ber's Haupt.<BR>
            "Bist du es, Martinsvogel?" Endlich sah er hoch. Und
            der tieftraurige Blick, schnitt Grete m&auml;chtig ins
            Herz.<BR>
            "Ich will dir helfen", zwitscherte sie nah an seinem
            Ohr.<BR>
            "Mir kann niemand helfen. Ich w&uuml;nschte, ich
            w&auml;re tot."<BR>
            "Du sollst, du wirst leben! Es gibt Menschen, die
            dringend w&uuml;nschen, dass du zur&uuml;ckkehrst."<BR>
            "Ich hab alles falsch gemacht. Darf gar nicht daran
            denken, wen ich mit meiner Grobheit verletzt hab."<BR>
            "Da warst du verzaubert. Und das bist du auch jetzt
            noch. Willst du, dass ich dir helfe?"<BR>
            "Ist das denn m&ouml;glich? Kann ich aus dieser
            Gefangenschaft loskommen?"<BR>
            "Du kannst. Aber wir m&uuml;ssen uns beeilen!"<BR>
            "Hilf mir! Ich will alles tun."<BR>
            Sie brachte ihn zum T&uuml;mpel, der ihre Tr&auml;nen
            enthielt.<BR>
            "Tauch dort hinein."<BR>
            "Ich darf das nicht"<BR>
            "Mach rasch, bevor das Hexenweib was merkt."<BR>
            "Und glaubst du, das hilft?"<BR>
            "Schnell. Der Nebel wird dichter. Ein Zeichen, dass
            Lilith wach wird."<BR>
            Endlich tauchte Hans den Kopf in das Nass. Die
            magischen Fesseln fielen von ihm ab. Er reckte die
            Glieder und sch&uuml;ttelte seine F&auml;uste:<BR>
            "Nun werde ich dieses Drecksst&uuml;ck von Lilith
            zerquetschen!"<BR>
            "Mach keinen Unsinn", warnte Grete und umflatterte
            nerv&ouml;s sein Gesicht. "Daf&uuml;r ist keine Zeit.
            Lauf so rasch du kannst nach Norden."<BR>
            Unwillig folgte er. Und das war klug. Denn kaum hatten
            sie den l&auml;rmenden Einflussbereich der Hexentochter
            verlassen, merkte die den Verlust und sandte etliche
            Bannfl&uuml;che hinter Hans her, die aber wirkungslos
            an der Grenze abprallten.</P>

            <P>Die Welt wurde still. Ab und an schon ein zaghafter
            Vogellaut, wo wieder das Gr&uuml;n der Erde entspross.
            Das tat Augen und Ohren wohl.<BR>
            "Ich sehe alles so h&auml;sslich verzerrt", klagte
            Hans. "Die Dinge erscheinen mir wenig freundlich und
            reizvoll."<BR>
            "Das liegt daran, dass dich die Morgus sehend gemacht
            hat. Du bist noch in ihrem Bann."<BR>
            "Wie komme ich da je wieder raus?"<BR>
            "Du bist nicht allein. Ich helfe dir."<BR>
            "Du und mir helfen, kleiner schwacher
            Martinsvogel!"<BR>
            "Habe ich dich nicht aus Liliths Macht befreit."<BR>
            "Schon. Aber Morgus ist unendlich viel
            st&auml;rker."<BR>
            "Abwarten!"</P>

            <P>Sie eilten nach Norden. Wieder sahen die Leute den
            wilden Hans daherst&uuml;rmen und warfen ihm
            &auml;ngstlich Nahrungsmittel vor die
            F&uuml;&szlig;e.<BR>
            "Sorgt euch nicht, liebe Leute!", pfiff Grete in
            Gestalt des Vogels den Fliehenden nach. "Hans ist nicht
            mehr wild und wird bald wieder der sein, der er mal
            war." Skeptisch blieben sie stehen und betrachteten
            scheu den riesenhaften Kerl, der langbeinig
            dahinschritt.<BR>
            "Dort ist unsere H&uuml;tte", rief Hans begeistert.
            "Vater und Mutter schauen aus dem Fenster. Aber ich
            sehe Grete nicht."<BR>
            "Sie trauert um dich und will dir erst begegnen, wenn
            du wieder der alte sein wirst."<BR>
            "Das will ich!", schrie er voll Schmerz in der Brust
            und st&uuml;rmte um so heftiger vorw&auml;rts.<BR>
            "Der Tollkopf tritt mich eines Tages noch tot", maulte
            die Schnecke. "Hast du immer noch nicht genug von dem
            Hexenweib und willst wieder zu ihr?"<BR>
            "Muss doch mein altes Ich zur&uuml;ckbekommen."<BR>
            "Dummer Mensch du! Weshalb hast du es auch abgegeben"
            Sie kroch st&ouml;hnend aus dem Weg und winkte ihm mit
            den H&ouml;rnchen einen Segen hinterdrein. Eigentlich
            war sie ein gutm&uuml;tiges, wenn auch m&uuml;rrisches
            Tier. Auf dem letzten St&uuml;ck gesellte sich Corvus
            zu ihnen.<BR>
            "Ich bin an allem schuld", kr&auml;chzte er kleinlaut.
            "H&auml;tt ich dir nicht zu der Fahrt geraten,
            w&auml;rst du heute ein gl&uuml;cklicher Mensch."<BR>
            "Er wird es wieder sein", zwitscherte der vermeintliche
            Martinsvogel zuversichtlich.<BR>
            "Meinst du wirklich", zweifelte der Rabe.<BR>
            "Wir werden ja sehen."</P>

            <P>Damit ging es weiter. Endlich waren sie angelangt.
            K&auml;lte umgab sie. Unter klirrendem Frost war die
            Welt erstarrt.<BR>
            "Was willst du, Sklave meiner Tochter? Marsch! Kehr um
            und tu deine Pflicht!" Morgus schnaubte vor Wut und hob
            schon das Fingerkn&ouml;chlein, um hineinzublasen.</P>

            <P>Heimlich winkte Corvus dem vermeintlichen
            Martinsvogel zu. Sobald nun der Rabe die Hexe
            umflatterte und nach ihrer Hand hackte, worauf Morgus
            das Kn&ouml;chlein fallen lie&szlig; und erbost nach
            Corvus schlug, flog Grete auf und lie&szlig; eine
            Tr&auml;ne nach der anderen auf die Zauberin
            herabtropfen.<BR>
            "&Auml;h, widerlich!", kreischte die. "Tr&auml;nen voll
            &auml;tzender Liebe!"<BR>
            Unter Schmerzen sprang sie umher und haschte bald nach
            dem Raben, bald nach Grete, die fortfuhr, Morgus mit
            dem Nass ihrer Augen zu treffen.<BR>
            "Aufh&ouml;ren! Aufh&ouml;ren! Ich verbrenne!"<BR>
            Aber es h&ouml;rte nicht auf. Schon knisterte es im
            ewigen Eis ringsum. Auch wurde es sp&uuml;rbar
            w&auml;rmer. Die Zauberin lag am Boden und w&auml;lzte
            sich wimmernd in der inzwischen reichlich
            herabstr&ouml;menden Tr&auml;nenflut. Die einst so
            gro&szlig;e und m&auml;chtige Hexe schrumpfte und wurde
            von Augenblick zu Augenblick kleiner und
            schw&auml;cher. Auch die Umgebung verwandelte sich.
            Tauwetter herrschte und bald spross
            Fr&uuml;hlingsgr&uuml;n. V&ouml;gel und andere Tiere
            l&ouml;sten sich aus ihrer Erstarrung. Der Fuchs strich
            vor&uuml;ber und ein geweihtragender Hirsch blieb
            stehen und sah freudig zu, wie die Macht der Morgus
            immer weiter dahinschwand. Zuletzt aber regten sich die
            verwandelten Menschen aus ihrer Verzauberung. Dankten
            f&uuml;r ihr Erl&ouml;stsein und zogen lachend und
            singend heimw&auml;rts.</P>

            <P>"Gleich ist es geschafft!", seufzte Grete. Ihre
            gro&szlig;en Augen entlie&szlig;en Tr&auml;ne um
            Tr&auml;ne . Von der Zauberin war nur noch ein Klumpen,
            dann endlich ein kleines Ascheh&auml;ufchen &uuml;brig.
            Mehr Tiere kamen und gruben diesen Rest ihrer
            Unterdr&uuml;ckung tief in den Boden.</P>

            <P>"Gott sei es gedankt! Die Hexe ist fort", murmelte
            Hans. "Aber ich sehe immer noch alles verzerrt." Corvus
            setzte<BR>
            sich auf seine Schulter: "Tja, mein Lieber. Du hast nun
            die Wahl. Entweder wirst du das verzerrte Sehen
            behalten oder blind sein wie damals."<BR>
            "Lieber blind sein", st&ouml;hnte Hans. "Das Sehen ist
            mir inzwischen derart verhasst wie diese widerliche
            Hexe!" Wischte sich &uuml;ber die Augen, um die
            Zerrbilder loszuwerden, die aber nicht zu entfernen
            waren.<BR>
            "Ein weiser Entschluss! Mach die Augen auf. Ich werde
            deine Lider mit meiner Schwinge ber&uuml;hren." So
            wurde Hans wieder, was er einst war. Sein Blick
            tr&uuml;bte sich ein, erlosch ganz. Dann sp&uuml;rte
            er, wie etwas sanft seine Hand ber&uuml;hrte.<BR>
            "Halt still. Ich will dir dein Fingerglied wieder
            ansetzen." Grete umflatterte ihn einige Male. Dann war
            auch das geschafft.<BR>
            "Und nun nach Hause!", rief der junge Mann froh. "Ich
            will endlich wieder mein M&auml;del in die Arme
            schlie&szlig;en k&ouml;nnen."<BR>
            "Das sollst du auch", kr&auml;chzten und zwitscherten
            die beiden treuen V&ouml;gel gleichzeitig.</P>

            <P>Der Weg kam ihnen k&uuml;rzer vor. W&auml;rmende
            Sonne, freundliche Tiere und Menschen begleiteten sie.
            Auch kam Nachricht aus dem S&uuml;den, dass dort die
            Macht der Lilith gebrochen war. Die Unholdin sei in die
            W&uuml;ste entflohen, hie&szlig; es. Alle Sklaven waren
            frei und zerst&ouml;rten in ihrer Wut die
            L&auml;rmmaschinen, deren Tr&uuml;mmer nun langsam vor
            sich hin rosteten. Jubel war rings im Land. Und
            &uuml;berall, wo sie hinkamen, wurde ein Freudenfest
            gefeiert.<BR>
            "Ich seh schon dein Haus", kr&auml;chzte Corvus.<BR>
            "Dann werd ich vorausfliegen, um deine Eltern
            vorzubereiten", zwitscherte Grete. Aber sie wollte ihn
            in ihrer wahren Gestalt empfangen und verbarg sich im
            Haus ihrer Eltern.</P>

            <P>"Da bist du ja wieder", r&auml;usperte sich die
            Schnecke zufrieden. "Alles ist, wie es war. Weshalb
            dann die lange Reise?"<BR>
            "Das verstehst du nicht", antwortete der Rabe rasch.
            "Aus einem Schneckenhaus heraus? kann man die Welt nun
            mal nur teilweise begreifen."<BR>
            "Ist mir auch lieber so", knurrte sie und kroch zur
            Seite. Kurz darauf umschlangen den jungen Mann zwei
            M&auml;dchenarme.<BR>
            "Grete, meine Grete!"<BR>
            "Woher wei&szlig;t du, dass ich deine Grete bin? Du
            siehst mich doch nicht."<BR>
            "Meine Seele sieht dich. Und das ist ein so klares
            Bild, dass ich das andere nicht brauche." Sie gingen zu
            den Eltern. Freude und Erleichterung waren gro&szlig;.
            Auch hier wurde ein Fest gefeiert. Und die Hochzeit
            lie&szlig; nicht lange auf sich warten. Was aus Hans
            wurde? Er war bald ein geachteter Mann, der in vielen
            Dingen um Rat befragt wurde. Auch verstand er es,
            packend und unterhaltsam zu erz&auml;hlen.<BR>
            "Schreib das doch auf", rieten die Leute. Und Grete
            nahm Papier und Feder zur Hand, um die Geschichten
            ihres Mannes festzuhalten. Es wurde ein gro&szlig;es
            und sch&ouml;nes Buch.</P>

            <P>Ende</P>
            <BR>
          </TD>
        </TR>
      </TBODY>
    </TABLE>
  </BODY>
</HTML>

