<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">
    <META name="DESCRIPTION" content=
    "Ein Computer-Magazin von 1984">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY bgcolor="#fffff4" background="mm_hc13b.gif">
    <TABLE border="0" cellpadding="8" summary="Seitengestaltung">
      <TR>
        <TD>
          <CENTER>
            <IMG src="mm_hc13a.gif"><BR>
            <I>Folge 13</I>
          </CENTER>
          <BR>
           

          <P>Der neue Heimcomputer "Einstein" soll fast alles
          bieten, was sogar teurere Computer oft nur gegen Aufpreis
          besitzen - darunter ein 3-Zoll-Diskettenlaufwerk.</P>

          <H1 align="CENTER">Relativ preiswert: Einstein</H1>

          <P>Schon das Basic des Einstein weist so komfortable
          Befehle wie zum Beispiel AUTO, DEL, RENUM, ON ERROR GOTO,
          IF THEN ELSE, PRINT AT sowie hervorragende Grafik- und
          Musikbefehle auf. Auch "exotische" Basic-Anweisungen wie
          HOLD (ein Teil des Programmes kann separat editiert,
          geMERGEt und RENUMbert werden) sowie LOCK / UNLOCK und
          ADC (Analog-Digital-Converter-Signal lesen) sind
          vorhanden. Mit dem eingebauten Maschinensprach-Monitor
          kann man eigene Basic-Befehle definieren. Da beim
          Einstein jede Sprache (also auch Basic) erst geladen
          wird, k&ouml;nnen die Befehle jedesmal einfach mit
          geladen werden! Durch CREATE kann man ein RDN-Access-File
          kreieren, mit PSW (Password) Files vor Unbefugten
          sch&uuml;tzen. 33 Zeichen lassen sich ganz einfach per
          SHAPE definieren. Mit mehr Kenntnis k&ouml;nnen alle
          Zeichen ge&auml;ndert werden. 32 Sprites plus die Shapes
          sind aufgrund der guten Grafikbefehle &uuml;beraus leicht
          zu handhaben, zum Beispiel im Rahmen von schicken
          Lernprogrammen oder Spielen.<BR>
           Die beiden Joystickeing&auml;nge sind analog ausgelegt.
          Sie sind daher erstens sehr exakt, zweitens kann man
          &uuml;ber sie auch Messungen vornehmen!<BR>
           16 Farben und eine 40 x 24-Zeichen-Darstellung
          (umschaltbar auf 32 x 24 Zeichen) erlauben freies Mischen
          von Text, Grafik, Shapes und Sprites. Ein Zusatz f&uuml;r
          80 Zeichen pro Zeile soll sp&auml;ter folgen. Um erste
          Musik produzieren zu k&ouml;nnen, gen&uuml;gt ein
          einziger Befehl. Der gro&szlig;e eingebaute Lautsprecher
          garantiert eine exzellente Wiedergabe.<BR>
           Der Z80A-Prozessor verwaltet ganze 80 KByte Ram, das
          hei&szlig;t 64 KByte dynamisches RAM (davon 47 f&uuml;r
          Basic) plus 16 KByte f&uuml;r Grafik. Das eingebaute
          Diskettenlaufwerk (3 Zoll, robust, kinderleicht zu
          bedienen) bietet 250 KByte pro Seite (wobei das Laufwerk
          nur einseitig arbeitet, die Disketten aber gewendet
          werden k&ouml;nnen).</P>

          <CENTER>
            <IMG src="mm_hc13c.gif" alt="Einstein" width="346"
            height="362">
          </CENTER>
          <BR>
           

          <P>Was die Peripherie betrifft, so ist der Einstein auch
          hier vorz&uuml;glich ausger&uuml;stet: Nachdem das erste
          Diskettenlaufwerk eingebaut ist und ein zweites
          nachger&uuml;stet werden kann, gibt es noch
          Anschl&uuml;sse f&uuml;r ein externes drittes und viertes
          Laufwerk. Eine Centronics- und eine RS232C-Schnittstelle
          sowie ein User-Port sind ebenfalls vorhanden.
          Dar&uuml;ber hinaus existiert eine sogenannte
          Tatung-pipe, eine Allzweck-Schnittstelle, &auml;hnlich
          der BBC-tube. Das Geh&auml;use des Einstein ist relativ
          gro&szlig;, der Monitor kann obendrauf stehen. Es ist
          alles sauber im Inneren des Computers untergebracht.
          Weder ein Kabelgestr&uuml;pp noch ein Netzteil
          k&ouml;nnen herumliegen.<BR>
           Die Tastatur besitzt Schreibmaschinen-Qualit&auml;t
          (QWERTY-Anordnung, hellgrau), Funktions- und
          Kontrolltasten (dunkelgrau) sowie eine orange
          ENTER-Taste. Es gibt acht Funktionstasten, die &uuml;ber
          einen Basicbefehl (KEY) selbst belegt werden k&ouml;nnen.
          Die Tastatur f&uuml;hlt sich gut an und taugt auch
          f&uuml;r langes Programmieren oder Textverarbeitung.<BR>
           Einige Tastenkombinationen sind eigent&uuml;mlich, aber
          praktisch: "CTRL A" bewirkt einen Bildschirmausdruck,
          "CTRL R" l&ouml;st das Drucker-Echo aus (alles folgende
          wird sowohl auf dem Bildschirm ausgegeben als auch auf
          Papier ausgedruckt). "CTRL S" stoppt diese Echo-Funktion.
          Dr&uuml;ckt man BREAK, dann stoppt die Auflistung eines
          Programms nur solange, wie man die Taste festh&auml;lt;
          BREAK mit SHIFT hingegen hat die f&uuml;r BREAK-Tasten
          &uuml;bliche Wirkung (mit CONT kann die Auflistung
          fortgesetzt werden), w&auml;hrend ESC das Auflisten ganz
          stoppt. Ein PLIST listet auf Papier. Wie man sieht geht
          beim Einstein vieles wesentlich einfacher als bei
          vergleichbaren Computer-Typen! Sogar ein eigener
          RESET-Knopf ist eingebaut. Es gibt &uuml;brigens einen
          hervorragenden Screen-Editor, der wiederum durch
          bestimmte Tasten-Kombinationen mit CTRL unterst&uuml;tzt
          wird. Eine Taste bewirkt das L&ouml;schen einer Zeile,
          eine andere das L&ouml;schen des Zeilenrestes ab der
          Position des Cursors.<BR>
           Der Einstein wird mit Basic und Logo geliefert, aber es
          ist bereits gen&uuml;gend fertige Software vorhanden, um
          ihn sehr vielseitig einsetzen zu k&ouml;nnen: zum
          Beispiel andere Sprachen (Forth, Pascal, Comal, C),
          Business-Software (Textverarbeitung, Database,
          Kalkulation) und Spiele (sowohl Action- als auch
          Strategie-Spiele). Man kann also sofort eine Menge mit
          ihm anfangen. Da gro&szlig;e Softwareh&auml;user sich
          schon jetzt um diesen Computer bem&uuml;hen (Vizasoft
          will bald Vizawrite f&uuml;r den Einstein bringen), kann
          man gespannt sein. &Uuml;brigens ist der Einstein mit
          einer Variante von CP/M ausger&uuml;stet, die von Crystal
          Research stammt. Das bedeutet, da&szlig; vorl&auml;ufig
          fast alle CP/M-Programme mit 40 Zeichen Zeilenbreite (zum
          Beispiel f&uuml;r Apple) auf ihm laufen. bald aber soll
          die 80-Zeichen-Kette kommen.Dann st&uuml;nde einem eine
          Riesenmenge an Software f&uuml;r alle Bereiche offen! Ein
          Hindernis kann allerdings die fehlende Verbreitung des
          3-Zoll-Diskettenformats sein.<BR>
           Was besonders gef&auml;llt: Erstens, der Einstein kommt
          mit vielen "Extras": Disk Drive, zwei Sprachen (Basic und
          Logo), CP/M-&auml;hnlichem Betriebssystem, Demos und
          einem "Typing-Tutor" (Schreibmaschinen-Kurs). Zweitens
          ist das Basic enorm leistungsf&auml;hig (90 Befehle und
          Funktionen), so da&szlig; "Basic-Erweiterungen"
          unn&ouml;tig werden! Man kann nicht nur sehr leicht
          zeichnen (PLOT, UNPLOT, DRAW, ELLIPSE, POLY und FILL
          stehen zu Verf&uuml;gung), sondern man kann auch
          bestimmen, wie die Linie aussehen soll (solide,
          gepunktet, gestrichelt etc.). Sogar POKEs sind
          m&ouml;glich (obgleich weitaus seltener n&ouml;tig als
          bei den Konkurrenz-Modellen): PEEK/POKE, DEEK/DOKE,
          VPEEK/VPOKE (V steht f&uuml;r "Video"). Der Einstein
          bietet also dem Einsteiger ebenso viel wie dem, der
          beruflich mit ihm arbeiten will. Was will man mehr
          f&uuml;r 1900 Mark?</P>
          (Vera F. Birkenbihl)<BR>
          <HR>
          <BR>
          In der n&auml;chsten NoCover gibt es einen Spiele-Test:
          "Uncle Groucho" f&uuml;r den Spectrum.
        </TD>
      </TR>
    </TABLE>

    <TABLE align="CENTER" border="3">
      <TR bgcolor="#ffffff">
        <TD><A href="mailto:">Thomas Nawroth</A></TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

