<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>AMIGA vs. ME</TITLE>
    <META name="author" content="Antidote">
  </HEAD>

  <BODY bgcolor="#ffffff" text="#000000">
    <P><IMG src="st_antidote.gif" border="0"></P>

    <P>Ich besitze meinen Amiga1200 nun seit eigentlich genau 10
    Jahren...also 1993 kaufte ich ihn von einem damaligen Kumpel ab
    (war ein Schn&auml;ppchen, glaube 40 DM :)<BR>
    Gleich mit einer Mtec1230/40 und unglaublichen 8MB Ram. War
    damals f&uuml;r mich ein super Teil, was die
    Leistungsf&auml;higkeit anging, auch wenn sich der
    Bekanntenkreis f&uuml;r den PC entschied.<BR>
    War ich ja eigentlich auch gewohnt, immer mit meinem System
    einen Schritt hinterher zu hinken. Denn Ende der 80er fing es
    jeweils nach der Welle mit nem Commodore plus4 an und ging
    &uuml;ber meinen geliebten C=64 (der immer noch aufgebaut steht
    ;), bis zum A500. Nebenbei standen (und stehen) hier noch
    etlich Videospieleger&auml;te, die mir gut die Softwareflaute
    vom Amiga vergessen liessen.<BR>
    Der A1200 hat aktuell ne Blizzard 1260/50 mit SCSI und 64 MB
    Ram, Winner ZIV Board, , C64/3D, 24x CD Rom usw. Der Rechner
    wurde immermal wieder auf und abger&uuml;stet. Mein
    gr&ouml;sster Fehlkauf war wohl die Blizzard 603/160Mhz (oder
    240Mhz...). War sehr unzufrieden mit der
    Geschwindigkeitssteigerung und die wenige Software, die die
    Karte nutzen konnte.<BR>
    Ein PC war zwar hin und wieder im Gespr&auml;ch, aber nicht
    wirklich angedacht. Spielte dann halt bei Kumpels nette
    Games.<BR>
    Nun habe ich aber nach etlichen Jahren von sog. "Mutterfirmen"
    die Schnauze voll!! Ich war eh nie ein gro&szlig;er Verfechter
    von Firmen, fand es immer wichtiger die "Kleinprojekte" zu
    unterst&uuml;tzen. Mir war klar, wenn es jemals einen neuen
    Amiga geben sollte, werde ich weder vorausbezahlen, noch bei
    Erscheinen direkt zuzugreifen. Denn mein Geld ist mir zu Schade
    um es einem nicht unterst&uuml;tzten System zu stecken.<BR>
    Wer 50E (oder $?) im Voraus f&uuml;r ein T-Shirt bezahlt hat,
    ist aus meiner Sicht selber Schuld. Ich habe das Warten auf
    neue Hard- und Software satt. Ich brauche kein
    "Baby-vogel"-System, was weder fliegen kann, noch ein Nest zum
    Landen hat!!<BR>
    Auch auf Ank&uuml;ndigungen, die dann mal mit 2 Jahren
    Versp&auml;tung evtl erscheinen kann ich verzichten! Klar gibt
    es das auch in der Mac/Win-Welt, aber da gibt es dann
    wom&ouml;glich Ausweichprodukte!<BR>
    Als Amigauser hat man es auch einfach nicht n&ouml;tig einer
    Firma hinterher zu geistern, wie J&uuml;nger einem Guru. Lange
    Zeit dachte ich auch, dass das Eyetechboard, Sprich der
    AmigaOne(...) mit AOS4 in meine Wohnung kommt. Allerdings finde
    ich zur Zeit die Genesi-Variante interessanter und auch
    durchsichtiger. "Da passiert etwas!"<BR>
    Vielleicht ist es in 2 Wochen wieder AMIGA Inc. Variante(...was
    fr&ouml;stelt mich denn gerade so...?)<BR>
    Doch f&uuml;r mich ist entscheidend, wann die Produkte
    marktreif sind und ich als User eine grosse Auswahl an guter
    Software habe. Vorher entscheide ich garnix!<BR>
    Mag sein das Hyperions Art von "Marketing" besser ist, ja ich
    finde es sogar professioneller, wenn man erst ein komplettes
    Betriebssystem, als eine Beta anbietet (man muss ja nich
    Windows abkupfern;) Allerdings gibt es nur wage Aussagen,
    welche Software speziell daf&uuml;r umgesetzt, evtl. sogar neu
    entwickelt wird. Ich kann mir zwar denken, welche Software
    erscheinen wird, aber damit ist mir ja auch nicht geholfen.<BR>
    Ich finde AMIGA Inc. arbeitet in Punkto Zeit absolut gegen mich
    (also meine Ausdauer des Wartens) und im Endeffekt gegen sich,
    da ein potentieller Kunde, der ich ja sein k&ouml;nntel,
    abspringen k&ouml;nnte.</P>

    <P>......</P>

    <P>Nun habe ich letzte Woche einen PC (ne Kr&uuml;cke: PI/133
    Mhz, 32 MB Ram usw.) f&uuml;r 10 EUR von einer Bekannten
    bekommen und muss sagen das ich relativ zufrieden bin. Gerade
    Grafikbearbeitung mit Photoshop l&auml;uft um einiges schneller
    als mit ArtEffect4! Nun zocke ich zur Zeit Diablo und werde
    nach Beendigung dieses Artikels Monkey3 installieren :)<BR>
    Das alles tr&uuml;bt nat&uuml;rlich nicht dar&uuml;ber hinweg,
    das ich Micro$oft mit Windows etc. f&uuml;r v&ouml;llig daneben
    halte, gerade was das Umgehen mit Daten angeht. Zur Zeit
    benutze ich noch Win98SE, was sogar ganz gut funzt. Vielleicht
    werde ich mir zu Weihnachten eine kleine Aufr&uuml;stung
    schenken lassen (AMD XP2200+, 256 DDR-Ram, +Mainboard etc.
    f&uuml;r unter 145EUR!!). Dann w&uuml;rde sich bestimmt eine
    Amiga Forever CD mit WinUAE lohnen!?! Denn auch mein
    Amigasystem streikt mit jedem weiteren Tag.</P>

    <P>Nat&uuml;rlich werde ich meinen Amiga1200 bis zu seinem
    letzten Tag nutzen, denn vieles macht damit einfach mehr spass.
    So schreibe ich diesen Artikel mit GoldEd, dem wohl besten
    Editor wo gibt ;)<BR>
    W&auml;re ein anderer Amiga fr&uuml;her auf den Markt gekommen,
    w&auml;re es keine Frage, aber meine HW stellt einfach die
    "aktuellen" Amigasachen nicht mehr fl&uuml;ssig da. Ob es sich
    um eine Hollywoodanimation handelt, oder Wordworth7.1.<BR>
    Die positiven Aspekte und Vorteile eines Amigasystem
    gegen&uuml;ber eines PCs kann man auch keinem mehr
    erl&auml;utern!! Da alles bei einem Azubi eine Geldsache ist,
    werde ich ein bisschen in den neuen Rechner und f&uuml;r gute
    Amigasoft investieren.<BR>
    Wenn ein neuer Amiga wirklich marktreif erscheint, werde ich
    das genau beobachten und bei gutem Support und interessanter
    Software bestimmt wieder zum Sparschwein greifen ;)</P>

    <P>Ciao Antidote</P>
  </BODY>
</HTML>

