<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Arbeitsordnung
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling131003">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="Vierzehn Regeln zur Arbeit">
      <TR>
        <TD>
          <H2 align="center">
            <B><U>A r b e i t s o r d n u n g</U></B>
          </H2>
          <BR>

          <P>
          </P>
          <OL type="1">
            <LI>
              Die Arbeit ist eine Erholung, jede Anstrengung ist zu vermeiden.<BR>
               Wer bei der Arbeit schwitzt, ist sofort zu entlassen!<BR>
              <BR>
            </LI>
            <LI>
              Der Beginn der Arbeitszeit liegt im Ermessen der Arbeiter (Angestellten), darf jedoch nicht vor 10 Uhr vormittags liegen. Vor Beginn der T&auml;tigkeit werden Br&ouml;tchen, sowie
              Kaffee und Kuchen verabreicht.<BR>
              <BR>
            </LI>
            <LI style="list-style: none">
              Der Mindestlohn betr&auml;gt 20,- &curren; die Stunde, das w&auml;ren 3840,- &curren; im Monat! Zus&auml;tzlich noch freie Bek&ouml;stigung, Bier und Kaugummi.<BR>
              <BR>
            </LI>
            <LI>
              Jeder Arbeiter (Angestellter) hat im tadellosen, nach Ma&szlig; gearbeiteten Anzug zu erscheinen. Die Kosten tr&auml;gt die Gesch&auml;ftsleitung.<BR>
              <BR>
            </LI>
            <LI>
              Alle Arbeiter (Angestellte), die l&auml;nger als f&uuml;nf Wochen im Betrieb sind, werden im Auto zur Arbeitsst&auml;tte und wieder nach Hause gefahren. Kraftfahrzeuge stehen
              gen&uuml;gend zur Verf&uuml;gung, ebenso eine Luxuslimousine f&uuml;r &auml;ltere Betriebsangeh&ouml;rige.<BR>
              <BR>
            </LI>
            <LI>
              W&auml;hrend der Arbeitszeit darf gesungen und gepfiffen werden. Wird ein Superhit angestimmt, so hat es jeder als Pflicht anzusehen nach Kr&auml;ften mitzusingen (pfeifen).<BR>
              <BR>
            </LI>
            <LI>
              Von 12 Uhr bis 15 Uhr ist Mittagstafel. M&auml;nner und Frauen nehmen an geschm&uuml;ckter Tafel Platz.<BR>
              <BR>
            </LI>
            <LI>
              Von 15 Uhr bis 16 Uhr ist allgemeine Kaffeetafel. W&auml;hrend dieser Zeit sorgt der Arbeitgeber f&uuml;r Musikalische Unterhaltung.<BR>
              <BR>
            </LI>
            <LI>
              Wer bei der Arbeit einschl&auml;ft darf nicht geweckt werden!<BR>
              <BR>
            </LI>
            <LI>
              Um 17 Uhr ist Feierabend. Beim Verlassen der Arbeitsst&auml;tte ist der Chef verpflichtet, jedem Arbeiter (Angestellten) die Hand zusch&uuml;tteln und ihm Namen der
              Gesch&auml;ftsleitung f&uuml;r die aufopfernde T&auml;tigkeit w&auml;rmsten Dank auszusprechen!<BR>
              <BR>
            </LI>
            <LI>
              Das Austreten w&auml;hrend der Pausen ist m&ouml;glichst zu unterlassen, daf&uuml;r ist die Arbeitszeit da.<BR>
              <BR>
            </LI>
            <LI>
              Will ein Arbeiter (Angestellter) heiraten, so hat die Gesch&auml;ftsleitung f&uuml;r eine vollst&auml;ndige Aussteuer zu sorgen. Die Hochzeit findet in der Villa des Chefs statt. Der
              Betrieb ist aus diesem Anlass mindetens 8 Tage zu schliessen.<BR>
              <BR>
            </LI>
            <LI>
              Bei Streitigkeiten unter Kollegen sind Tisch- und Stuhlbeine m&ouml;glichst zu schonen. Kn&uuml;ppel, Revolver und Schlagringe sind beim Betriebsrat zu haben!<BR>
              <BR>
            </LI>
            <LI>
              Der Wahlspruch lautet: Arbeit lustig und gediegen, was nicht fertig wird bleibt liegen!<BR>
            </LI>
          </OL>
          <BR>

          <DIV align="CENTER">
            <IMG src="st_arbeit.jpg" alt="Areiter trinkt Bier">
          </DIV>
          <BR>
           <BR>

          <HR>
          <BR>

          <CENTER>
            <IMG src="mitglieder/jojo.jpg" alt="JoJo" width="212" height="50">
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

