<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

    <TITLE>Bankautomat</TITLE>
  </HEAD>

  <BODY background="bga.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Bankautomat</B></FONT></P>

          <P>Die Sparkasse hat ab dem 01.10.2000 erstmalig den "Drive Thru" Bankomat
          in Betrieb! Kunden sind damit in der Lage, Bargeld abzuheben ohne Ihr Auto
          verlassen zu m&uuml;ssen. Um alle Vorteile dieser Einrichtung nutzen zu
          k&ouml;nnen, bitten wir Sie, folgende Hinweise zu beachten.</P>

          <H3>F&uuml;r unsere m&auml;nnlichen Kunden</H3>

          <OL>
            <LI>Fahren Sie an den Bankautomaten heran.</LI>

            <LI>&Ouml;ffnen Sie Ihre Fensterscheibe.</LI>

            <LI>F&uuml;hren Sie Ihre Kreditkarte ein und geben Sie Ihre Pin-Nummer
            ein.</LI>

            <LI>Geben Sie den gew&uuml;nschten Betrag ein und entnehmen Sie das
            Bargeld.</LI>

            <LI>Entnehmen Sie Ihre Kreditkarte und Quittung.</LI>

            <LI>Schlie&szlig;en Sie Ihr Fenster und fahren Sie ab.</LI>
          </OL>
          <HR width="60%">

          <H3>F&uuml;r unsere weiblichen Kunden</H3>

          <OL>
            <LI>Fahren Sie an den Bankautomaten heran.</LI>

            <LI>Starten Sie den abgew&uuml;rgten Motor.</LI>

            <LI>Fahren Sie r&uuml;ckw&auml;rts, bis der Bankautomat in H&ouml;he Ihres
            Seitenfensters ist.</LI>

            <LI>&Ouml;ffnen Sie die Fensterscheibe.</LI>

            <LI>Leeren Sie Ihre Handtasche auf dem Beifahrersitz und suchen Sie Ihre
            Kreditkarte.</LI>

            <LI>Suchen Sie Ihr Make-Up und checken Sie Ihr Make-Up im
            R&uuml;ckspiegel.</LI>

            <LI>Versuchen Sie Ihre Kreditkarte in den Bankautomaten
            einzuf&uuml;hren.</LI>

            <LI>&Ouml;ffnen Sie die Autot&uuml;r um den Automaten besser erreichen zu
            k&ouml;nnen.</LI>

            <LI>F&uuml;hren Sie die Kreditkarte in den daf&uuml;r vorgesehenen
            Schlitz.</LI>

            <LI>Entnehmen Sie die Karte und f&uuml;hren Sie sie in umgekehrter Richtung
            nochmal ein.</LI>

            <LI>Nehmen Sie Ihre Handtasche und suchen nach Ihrem Terminplaner. Die
            Pin-Nummer steht auf der ersten Innenseite.</LI>

            <LI>Geben Sie die Pin-Nummer ein.</LI>

            <LI>Dr&uuml;cken Sie "Cancel" und geben Sie die Pin-Nummer korrekt
            ein.</LI>

            <LI>Geben Sie den gew&uuml;nschten Betrag ein.</LI>

            <LI>Checken Sie abermals Ihr Make-Up im R&uuml;ckspiegel.</LI>

            <LI>Entnehmen Sie Bargeld und Quittung.</LI>

            <LI>&Ouml;ffnen Sie die Fahrert&uuml;r und heben Sie Ihr Geld auf.</LI>

            <LI>Leeren Sie Ihre Handtasche erneut und suchen Sie Ihre Geldb&ouml;rse,
            in welcher Sie dann das geld verstauen.</LI>

            <LI>Checken Sie wieder Ihr Make-Up im R&uuml;ckspiegel.</LI>

            <LI>Fahren Sie 2 Meter vor.</LI>

            <LI>Fahren Sie zur&uuml;ck zum Automaten und entnehmen Sie Ihre
            Kreditkarte.</LI>

            <LI>Leeren Sie wiederholt Ihre Handtasche und stecken Sie die Kreditkarte
            in die daf&uuml;r vorgesehene H&uuml;lle.</LI>

            <LI>Starten Sie den abgew&uuml;rgten Motor.</LI>

            <LI>Fahren Sie 3-4 Kilometer und l&ouml;sen Sie dann Ihre Handbremse.</LI>

          </OL>
          <HR width="60%">

          <P>Eingesandt von Cord Hagen</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>
