<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <!-- Author = [NUNTIUS] -->

    <TITLE>Di&auml;ten</TITLE>
  </HEAD>

  <BODY background="bgc.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Di&auml;ten</B><BR>
           Neue physikalische Erkenntnis zum Abnehmen</FONT></P>

           <H3>Was noch nie bei Di&auml;ten ber&uuml;cksichtigt wurde......</H3>

           <P>Alle bekannten Di&auml;ten vernachl&auml;ssigen v&ouml;llig einen
           wichtigen Punkt: die Temperatur der Speisen und Getr&auml;nke.</P>

           <P>Wir alle wissen, dass eine Kalorie notwendig ist um 1 g Wasser um 1 Grad
           C zu erw&auml;rmen. Man muss kein Wunderkind sein errechnen zu k&ouml;nnen,
           dass der Mensch wenn er ein Glas kaltes Wasser trinkt -sagen wir mit 0
           Grad- ca. 200 Kalorien braucht, um es um 1 Grad zu erw&auml;rmen. Damit es
           auf K&ouml;rpertemperatur gebracht wird, sind also ca. 7400 Kalorien
           notwendig, d.h. 200g Wasser mal 37 Grad Temperaturunterschied. Diese muss
           unser K&ouml;rper aufbringen, da die K&ouml;rpertemperatur konstant bleiben
           muss. Dazu nutzt er die einzige Energiequelle, die ihm kurzfristig zur
           Verf&uuml;gung steht, unser K&ouml;rperfett. Es muss also K&ouml;rperfett
           verbrennen, um die Erw&auml;rmung zu leisten. Denn die Thermodynamik
           l&auml;sst sich nicht bel&uuml;gen.</P>

           <P>Trinkt man also ein gro&szlig;es Glas Bier ca. 400 g mit 0 Grad verliert
           man ca. 14800 Kalorien. Jetzt muss man nat&uuml;rlich noch die Kalorien des
           Bieres abziehen ca. 800 Kalorien f&uuml;r 400 g Bier.</P>

           <P>Unter dem Strich betrachtet verliert man also ungef&auml;hr 14000
           Kalorien bei einem kalten Glas Bier. Nat&uuml;rlich ist der Verlust um so
           gr&ouml;&szlig;er, je k&auml;lter das Bier ist. Ebenso verh&auml;lt es sich
           mit kalten Nachspeisen wie Eis zum Beispiel. Bei einer Portion von 200g
           nehmen wir ca. 1000 Kalorien zu uns verlieren aber durch die Erw&auml;rmung
           auf K&ouml;rpertemperatur 7400 Kalorien. Hinzu kommen dann noch ca. 7000
           Kalorien zum Schmelzen des Eises, ca. 35 Kalorien pro Gramm. Richtig
           betrachtet bleibt also ein Verlust von 13400 Kalorien. Da der Anteil der
           Kalorien in Lebensmitteln, im Vergleich zu den Kalorien des
           W&auml;rmeverbrauchs nur sehr gering ist, ist es also fast egal was wir
           essen oder trinken, nur kalt muss es sein.</P>

           <P>Diese Art Kalorien abzubauen ist wie jedem einleuchten mag viel
           effektiver als z.B. Fahrrad fahren oder Joggen bei denen nur ca. 1000
           Kalorien pro Stunde verbrannt werden. Auch Sex ist mit nur 100 Kalorien pro
           Orgasmus gegen kaltes Bier sehr ineffektiv.</P>

           <P>Abnehmen ist so einfach. Wir m&uuml;ssen alle einfach nur kaltes Bier
           und Eis in Mengen zu uns nehmen und die Thermodynamik erledigt den Rest.
           Ein Nachteil dieser Di&auml;t bleibt allerdings, wenn wir z.B. eine
           hei&szlig;e Pizza essen, die uns durch ihre W&auml;rmeenergie eine Unmenge
           an Kalorien zuf&uuml;hrt.</P>

           <P>Der aufmerksame Leser hat aber bestimmt schon die L&ouml;sung parat: man
           muss die hei&szlig;e Pizza einfach nur mit genug kaltem Bier und Eis
           ausgleichen.</P>

          <P>Gefunden bei: [NUNTIUS] - BLINDzeln</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

