<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <!-- Author =  Mathias Klingner -->

    <TITLE>Der Goldene Herbst in Berlin</TITLE>
  </HEAD>

  <BODY background="bga.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <A href="st_stx.html"><B>zur&uuml;ck zum Frame</B></A> 

          <DIV align="center">
            <TABLE border="0" width="740">
              <TR>
                <TD>
                  <P align="center"><FONT color="#000080" size="7"><B>Der Goldene Herbst in
                  Berlin</B></FONT></P>

                  <P align="center"><FONT color="#000080" size="5"><B>Ein Fotobericht
                  von Mathias Klingner</B></FONT></P>

                  <P>Ich hatte mir schon immer einmal vorgenommen
                  an einem freien Arbeitstag in meiner
                  t&auml;glichen Posttour Fotos von Dingen zu
                  machen, die ich w&auml;hrend der Postzustellung
                  gesehen habe und von denen ich meinte das es sich
                  lohnen w&uuml;rde diese auf Film zu bannen.</P>

                  <TABLE border="0" align="left">
                    <TR>
                      <TD><IMG src="st_herbst01.jpg" width="240" height="360" alt="Bild1"><BR>
                      <FONT size="-2">Haus gegen&uuml;ber vom Postamt Hindenburgdamm 1</FONT> </TD>
                    </TR>
                  </TABLE>

                  Ich lud also meine Nikon F-65 Spiegelreflexkamera mit einem 200 ASA- Film
                  und machte mich an einem arbeitsfreien Donnerstag, an dem zum Gl&uuml;ck
                  auch die Sonne schien, fr&uuml;hzeitig auf den Weg.<BR>

                  <TABLE border="0" align="right">
                    <TR>
                      <TD><IMG src="st_herbst02.jpg" width="240" height="360" alt="Bild2"><BR>
                      <FONT size="-2">neuer Ast im Jungstadium - auch Trieb genannt</FONT> </TD>
                    </TR>
                  </TABLE>
                  <BR>

                  Ich fotografierte zuerst das Haus, welches ich immer sehe, wenn ich mit
                  meinem mit Post beladenen Fahrrad zum ersten Haus meines Zustellbezirkes
                  fahre. An diesem Haus faszinierten mich besonders die Ranken an der rechten
                  Seite. Wenn man das Foto genauer betrachtet, dann kann man links oben in
                  der Ecke auch den Mond erkennen.<BR> <BR>

                  Im Zustellbezirk angekommen fotografierte ich in der Tulpenstra&szlig;e das
                  Foto mit dem Trieb am Baumstamm. Der Baumstamm, der den alten Baum
                  verk&ouml;rpert und im Gegensatz dazu der junge Trieb, der das ewige
                  Wachstum in der Natur veranschaulicht. <BR>
                  <BR clear="all">
                   

                  <TABLE border="0" align="left">
                    <TR>
                      <TD><IMG src="st_herbst03.jpg" width="360" height="240" alt="Bild3"><BR>
                      <FONT size="-2">Meise in den herbstlichen Ranken des Hauses
                      Tulpenstra&szlig;e 2</FONT></TD>
                    </TR>
                  </TABLE>

                  Danach gelang es mir, die Meise an der Hauswand in den Ranken zu
                  fotografieren. Es war nicht ganz einfach. Ich drehte den Zoom des
                  Objektives bis zum Anschlag (300mm) und fotografierte freih&auml;ndig.
                  Trotzdem meine ich, das Foto ist mir ganz gut gelungen. Im Herbst ist das
                  Licht ja nicht allzu hell und man hat da bei Teleaufnahmen schon so seine
                  Probleme um die Aufnahmen nicht zu verwackeln. <BR> <BR>
                                     
                  
                  <TABLE border="0" align="right">
                    <TR>
                      <TD><IMG src="st_herbst04.jpg" width="240" height="360" alt="Bild4"><BR>
                      <FONT size="-2">die Natur ergreift Besitz</FONT></TD>
                    </TR>
                  </TABLE>

                  <P>Deshalb nehme ich f&uuml;r solche Tieraufnahmen in der Regel auch einen
                  400 ASAFilm um gen&uuml;gend Belichtungsreserven zu haben, und um somit die
                  k&uuml;rzeren Belichtungszeiten der Kamera nutzen zu k&ouml;nnen.</P>

                  <P>Des weiteren fiel mir noch das helle Haus auf, welches ich im Hof des
                  Hauses Asternplatz 1 fotografierte. Dieses wird von den Ranken fast
                  vollkommen in Besitz genommen. </P>

                  <P>Vor dem einzigen Einfamilienhaus, der ansonsten nur mit gro&szlig;en,
                  mehrst&ouml;ckigen Mehrfamilienh&auml;usern bebauten Tulpenstra&szlig;e,
                  faszinierte mich der herbstliche, junge Ast im Gegenlicht. Diesen
                  fotografierte ich gegen den Hintergrund des Daches des Einfamilienhauses um
                  ihn so wirksam freistellen zu k&ouml;nnen.</P>

                  <P>Ich ging dann weiter, &uuml;ber den Asternplatz in die
                  Willdenowstra&szlig;e. Diese Gegend ist &uuml;berwiegend mit
                  Einfamilienh&auml;usern bebaut. Auf der unbebauten Stra&szlig;enseite
                  dieser Stra&szlig;e ist der Zaun zum Botanischen Garten Steglitz. Durch
                  diesen hindurch fotografierte ich die herbstlichen B&auml;ume in ihrer
                  Vielfarbigkeit. Um die Entfernung zwischen ihnen zu &uuml;berbr&uuml;cken
                  nutzte ich das Teleobjektiv. So war es mir m&ouml;glich die verschiedensten
                  B&auml;ume gleichzeitig wirkungsvoll ins Bild setzen zu k&ouml;nnen.</P>
                  <BR clear="all">
                   

                  <TABLE border="0" summary="Bild">
                    <TR>
                      <TD><IMG src="st_herbst05.jpg" width="360" height="240" alt="Bild5"><BR>
                      <FONT size="-2">Herbsttrieb im Gegenlicht</FONT></TD>

                      <TD><IMG src="st_herbst06.jpg" width="360" height="240" alt="Bild6"><BR>
                      <FONT size="-2">ein Blick durch den Zaun in den Botanischen Garten
                      Berlin-Steglitz</FONT></TD>
                    </TR>
                  </TABLE>

                  <TABLE border="0" align="left">
                    <TR>
                      <TD><IMG src="st_herbst07.jpg" width="360" height="240" alt="Bild7"><BR>
                      <FONT size="-2">Amsel-Schnappschuss</FONT></TD>
                    </TR>
                  </TABLE>

                  <P>Im Garten, der etwas abseits der Willdenowstra&szlig;e gelegenen
                  H&auml;usern, fotografierte ich die Amsel im Ge&auml;st eines Baumes. Ich
                  hatte bei dieser Aufnahme sehr wenig Licht zur Verf&uuml;gung. So musste
                  ich mit einer relativ langen Belichtungszeit arbeiten und doch gleichzeitig
                  auch mit einer langen Brennweite um die Amsel auch noch in einer
                  erkennbaren Gr&ouml;&szlig;e auf den Film zu bekommen. Schwierig war dabei,
                  die Sch&auml;rfe genau auf die Amsel zu legen. Dies ist mir leider nicht
                  ganz gelungen. Auch h&auml;tte ich etwas l&auml;nger belichten m&uuml;ssen
                  um die dunkle Amsel noch besser darstellen zu k&ouml;nnen. </P>
                                     

                  <P>Von der Willdenowstra&szlig;e ging ich dann in die Malvenstra&szlig;e.
                  Dies ist eine kleine Querstra&szlig;e mit insgesamt nur 8 H&auml;usern.
                  Dort nahm ich die Treppe mit den rechts und links zu sehenden
                  Blumenschalen, den Fr&uuml;chten und dem Herbstschmuck an der T&uuml;r
                  auf.</P> <BR clear="all">
                   

                  <TABLE border="0" summary="Bild">
                    <TR>
                      <TD><IMG src="st_herbst08.jpg" width="360" height="240" alt="Bild8"><BR>
                      <FONT size="-2">Herbststilleben in der Malvenstra&szlig;e</FONT></TD>

                      <TD><IMG src="st_herbst09.jpg" width="360" height="240" alt="Bild9"><BR>
                      <FONT size="-2">Halloween in der Kamillenstra&szlig;e</FONT> </TD>
                    </TR>
                  </TABLE>

                  <P>Von der Malvenstra&szlig;e kommt man auch gleich in die
                  Kamillenstra&szlig;e, der letzten Stra&szlig;e meiner Posttour. Wobei ich
                  anmerken muss, das meine Tour auch noch weitere blumige Namen, wie zum
                  Beispiel die Geranienstra&szlig;e, die Lilienstra&szlig;e und die
                  Limonenstra&szlig;e sowie den Begonienplatz umfasst, was wohl an der
                  N&auml;he zum Botanischen Garten liegen wird.</P>

                  <P>In der Kamillenstra&szlig;e fotografierte ich durch einen Gartenzaun
                  hindurch die Halloweendekoration. Dabei legte ich das Teleobjektiv auf den
                  Eisenzaun auf und konnte so eine relativ lange Belichtungszeit nutzen und
                  auch in aller Ruhe den richtigen Ausschnitt einstellen. Das M&auml;nnchen
                  im dunklen Kost&uuml;m soll nach Auskunft der Mieterin des
                  Einfamilienhauses einen Raben darstellen, sagte sie mir einige Tage
                  sp&auml;ter, als ich ihr die Post &uuml;berreichte und ihr erz&auml;hlte,
                  das ich davon ein Foto gemacht habe.</P>

                  <P>Dies war auch mein letztes Foto, welches ich an diesem Tage machte.
                  Danach verschwand die Sonne immer &ouml;fters hinter den Wolken und es
                  lohnte sich nicht noch weitere Fotos zu machen. Ich beendete diesen
                  Fotoausflug an diesem Tage mit einem Mittagessen im Restaurant "Moldau"
                  Unter den Eichen, unweit der Kamillenstra&szlig;e.</P>

                  <P>Da ich auf dem Film aber noch ca. 12 Negative unbelichtet hatte,
                  fotografierte ich dann am darauffolgenden Sonntagmorgen im Volkspark
                  Jungfernheide in Berlin-Wedding weitere Herbstmotive. Diese sind nun
                  folgend nach meinen schriftlichen Ausf&uuml;hrungen unkommentiert dem
                  Bericht zugef&uuml;gt. Schaut Euch diese nur in Ruhe an und denkt dabei an
                  die goldene Herbstzeit zur&uuml;ck.</P>

                  <TABLE border="0" summary="Bild">
                    <TR>
                      <TD><IMG src="st_herbst10.jpg" width="360" height="240" alt="Bild10"><BR>
                      <FONT size="-2">Wildschweingehege im Volkspark Rehberge in
                      Berlin-Wedding</FONT></TD>

                      <TD><IMG src="st_herbst11.jpg" width="360" height="240" alt="Bild11"><BR>
                      <FONT size="-2">Morgenstimmung im Volkspark Rehberge</FONT> </TD>
                    </TR>
                  </TABLE>
                  <BR>

                  <TABLE border="0" summary="Bild">
                    <TR>
                      <TD><IMG src="st_herbst12.jpg" width="360" height="240" alt="Bild12"><BR>
                      <FONT size="-2">Herbstwiese im Volkspark Rehberge</FONT></TD>

                      <TD><IMG src="st_herbst13.jpg" width="360" height="240" alt="Bild13"><BR>
                      <FONT size="-2">Raureif morgens 10 Uhr (So.-Zeit) im Volkspark
                      Rehberge</FONT> </TD>
                    </TR>
                  </TABLE>
                  <BR>

                  <TABLE border="0" summary="Bild">
                    <TR>
                      <TD><IMG src="st_herbst14.jpg" width="360" height="240" alt="Bild14"><BR>
                      <FONT size="-2">Goldener Herbst</FONT></TD>

                      <TD><IMG src="st_herbst15.jpg" width="360" height="240" alt="Bild15"><BR>
                      <FONT size="-2">Raureif in der Morgensonne im Volkspark Rehberge</FONT> </TD>
                    </TR>
                  </TABLE>
                  <BR>

                  <TABLE border="0" summary="Bild">
                    <TR>
                      <TD><IMG src="st_herbst16.jpg" width="360" height="240" alt="Bild16"><BR>
                      <FONT size="-2">Der Herbst in seiner Farbvielfalt im Volkspark
                      Rehberge</FONT></TD>

                      <TD><IMG src="st_herbst17.jpg" width="360" height="240" alt="Bild17"><BR>
                      <FONT size="-2">Herbstkontraste - Zweig im  Gegenlicht - Volkspark Rehberge</FONT> </TD>
                    </TR>
                  </TABLE>

                  <P>Mathias Klingner<BR>
                  E-Mail: Tschandru.Shing@berlin.de</P>
                </TD>
              </TR>
            </TABLE>
          </DIV>
          <A href="st_stx.html"><B>zur&uuml;ck zum Frame</B></A>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

