<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Imperium der Bazillen
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling131003">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="Text ohne Tabelle">
      <TR>
        <TD>
          <H2 align="center">
            <B>Imperium der Bazillen</B>
          </H2>
          <P>
            <TT>In dem Wissenschaftsmagazin Prisma des <A href="http://www.ndr.de/tv/prisma/index.html">NDR-Fernsehn</A> sah ich am 23.09.2003 einen Bericht, der f&uuml;r alle von uns von Interesse
            sein d&uuml;rfte. Es ging darin um Hygiene...<BR>
             Hier der Bericht von der NDR-Web-Seite:</TT>
          </P>
          <HR align="center" width="75%">
          <BR>
           <IMG src="st_tastatur.jpg" border="0" width="160" height="80" alt="Computertastatur"><BR>

          <H6>
            Hier f&uuml;hlen sich die Bazillen wohl
          </H6>
        </TD>
        <TD>
        </TD>
      </TR>
      <TR>
        <TD colspan="2">
        </TD>
      </TR>
    </TABLE>
    In jedem Haushalt ist es zu finden, das schmutzigste anzunehmende Utensil. Ein hygienischer Krisenherd. &Uuml;brigens: Wir sprechen nicht von der Toilette.
    <P>
      Folgen Sie uns. Dahin, wo noch nie ein Mensch zuvor gewesen ist. Denn hier, in der Computer-Tastatur, tobt hygiene-technisch die H&ouml;lle.
    </P>
    Andreas Sammann vom Institut f&uuml;r Hygiene und Umwelt z&auml;hlt auf: "Ich finde alles das, was ich normalerweise auf der Hautflora auch habe. Das hei&szlig;t: Ich finde Staphylokokken, ich
    finde Mikrokokken, ich finde Sporenbildner, die wir in der Umwelt auch haben, also Bazillen - wie der Volksmund sagt. Das alles finde ich in sch&ouml;ner Regelm&auml;&szlig;igkeit und in
    gro&szlig;en Mengen auch auf der Computertastatur."<BR>
     <BR>
     Ein Vergleich zwischen einer Probe von einer Klobrille und einer Probe von einer Computer-Tastatur: Der Computer ist verdreckter als die Toilette.<BR>
     <BR>
     Wir sind umzingelt<BR>
     Gibt es noch mehr Dinge und Pl&auml;tze, bei denen wir die hygienischen Verh&auml;ltnisse falsch einsch&auml;tzen? Das Hamburger Institut f&uuml;r Hygiene und Umwelt hat es f&uuml;r uns
    getestet.
    <UL>
      <LI>
        Beispiel: Rolltreppe. Was h&auml;ngt da alles am Griffband?
      </LI>
      <LI>
        Oder in Telefonzellen...
      </LI>
      <LI>
        Stinkt Geld vielleicht doch?
      </LI>
      <LI>
        Darf man T&uuml;rgriffe noch anfassen?
      </LI>
      <LI>
        Was l&auml;ppert sich in so 'nem Lappen?
      </LI>
      <LI>
        Und K&uuml;ssen - das ist doch bestimmt nicht hygienisch.
      </LI>
    </UL>
    Hier, in den Labors des Instituts, wird, was wir nicht mit blo&szlig;em Auge sehen k&ouml;nnen, sichtbar gemacht: Rote Platten f&uuml;r Abstriche, helle f&uuml;r Abdr&uuml;cke.<BR>
     "Das sind so genannte Aga-Platten", sagt Andreas Sammann, "das sind N&auml;hrb&ouml;den, auf denen die Bakterien wachsen k&ouml;nnen. Was wir hier sehen, sind verschiedene kleine Punkte in
    unterschiedlicher Form und auch unterschiedlicher Farbe. Hinter jedem dieser kleinen Punkte verbirgt sich die Menge von einer Million Bakterien. Urspr&uuml;nglich haben wir eine Bakterie hier auf
    die Aga-Platte gebracht; in so fern kann man auch anhand der Punkte ausz&auml;hlen, wie viele Bakterien es urspr&uuml;nglich waren.<BR>
     Eine Bakterie vermehrt sich etwa alle zwanzig Minuten einmal, so dass wir nach sieben bis acht Stunden einen Haufen von etwa einer Million haben."
    <P>
      Also dann... Was haben wir gefunden? Wo tobt der bakterielle Kulturkampf am heftigsten?
    </P>
    <UL>
      <LI>
        Die Rolltreppe. Nicht der Rede wert. Gerade mal 40 Millionen Bakterien.
      </LI>
      <LI>
        &Uuml;berraschend wenig: die Telefonzelle.
      </LI>
      <LI>
        Wir wussten es immer: Geld ist schmutzig.
      </LI>
      <LI>
        Auf der T&uuml;rklinke: Nicht eine einzige Bakterie nachweisbar.
      </LI>
      <LI>
        Aber Lippen sind offenbar eine Problemzone.
      </LI>
      <LI>
        Und das Bazillenmutterschiff: ein eine Woche altes Geschirrtuch. Mehr Bakterien im Lappen als Menschen auf der Erde.
      </LI>
    </UL>
    Mit anderen Worten: Wir sind umzingelt.<BR>
     <BR>
     Desinfektionsmittel schaden mehr, als sie nutzen<BR>
     <BR>
     <IMG src="st_spray.jpg" border="0" width="160" height="80" alt="Desinfektionsspray">
    <H6>
      Desinfektionsmittel schaden oft mehr als sie helfen
    </H6>
    Gott sei Dank gibt es ja Sagrotan...!
    <P>
    </P>
    Aber Sammann warnt: "Um Gottes Willen! Desinfektionsmittel haben in einem Privathaushalt nichts verloren. Die normalen Reiniger - m&ouml;glichst auch umweltschonende Reiniger - sind das Mittel
    der Wahl, und es langt, wenn man die Bakterien von den Oberfl&auml;chen wegnimmt oder sie ausd&uuml;nnt. Das Schlimmste, was man mit den Desinfektionsmitteln gerade auch auf unserer Haut und
    unseren H&auml;nden machen kann, ist, dass wir die normale Hautflora zerst&ouml;ren, die uns n&auml;mlich sch&uuml;tzt vor der Besiedelung mit anderen Keimen.
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="Text ohne Tabelle">
      <TR>
        <TD>
        </TD>
      </TR>
      <TR>
        <TD>
        </TD>
      </TR>
    </TABLE>
    <BR>
     <BR>
     Na dann. Seien Sie ein bisschen nett zu Ihren Bakterien. F&uuml;r Sie ist es vielleicht nur eine Tastatur, f&uuml;r Ihre "Mitbewohner" das Schlaraffenland!<BR>
     <BR>
     <BR>

    <HR align="center" width="75%">
    <BR>

    <P>
      <TT>Soweit der Bericht vom NDR.<BR>
       Leider vermisse ich dabei eines: Wie bekomme ich denn nun meine Tastatur einigerma&szlig;en sauber?</TT>
    </P>
    <HR>
    <BR>

    <CENTER>
      <IMG src="mitglieder/jojo.jpg" alt="JoJo" width="212" height="50">
    </CENTER>
    <BR>
  </BODY>
</HTML>

