<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <!-- Author = Gabi Spieck-Huepeden -->

    <TITLE>Wieder da aus Kanada!</TITLE>
  </HEAD>

  <BODY background="bgb.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Wieder da aus Kanada!
          </B></FONT></P>

          <P>Eine sch&ouml;ne, erlebnisreiche Reise liegt hinter mir. 14 Tage Kanada!
          Ums vorweg zu nehmen, 14 Tage f&uuml;r dieses herrliche Riesenland sind
          eigentlich zu kurz, aber nichtsdestotrotz will ich versuchen, denjenigen,
          die das interessiert, einen kurzen Abriss meiner Erlebnisse
          n&auml;herzubringen. Schon das Kofferpacken war recht spannend, weil ich
          &uuml;berhaupt nicht so richtig wusste, was ich denn nun mitnehmen sollte.
          Sommersachen - eigentlich eher nicht, ich rechnete mit Regen und sogar mal
          mit Schnee, also, &Uuml;bergangsklamotten, warme Jacke und "Handschuh,
          Schal und M&uuml;tze" nicht zu vergessen. Gut, als ich sagen konnte, ich
          sei fertig mit Einpacken, hatte ch schon etwas M&uuml;he, den Koffer noch
          zu zu bekommen, aber es ging noch. Am Samstag, den 13. 9. fuhr ich also zum
          Flughafen nach Hannover und der freundliche Fahrer hatte mich samt
          Gep&auml;ck noch bis zum Schalter gebracht, von wo aus ich dann weiter in
          die Maschine nach M&uuml;nchen bef&ouml;rdert wurde. Der Flug startete um
          9.30 Uhr. Neben mir sa&szlig; ein Herr, der Kanada schon kannte, aber jetzt
          nur bis nach M&uuml;nchen wollte. In M&uuml;nchen angekommen (ein paar
          gemischte Gef&uuml;hle im Kopf, denn nun war ich ganz allein), wurde ich
          gleich om Bodenpersonal in Empfang genommen und mit einem Elektrokarren in
          einen Warteraum gebracht, da der Abflug nach Toronto sich wohl doch noch
          verz&ouml;gern w&uuml;rde. Aber es ging mir nicht schlecht, ich bekam
          hei&szlig;en Tee zu trinken, der meinem noch vorhandenen Husten recht gut
          tat. Dann war es so weit. Ich wurde samt meinem Handgep&auml;ck wieder auf
          einen Elektrokarren geladen und zum Gate in Richtung Toronto gebracht. Die
          Maschine war riesig, aber eine Dame mit MS, die im Rollstuhl ins Flugzeug
          gefahren wurde, leistete mir bald gute Gesellschaft. Der Flug verlief ruhig
          und die Zeit bis Toronto verging eigentlich sehr schnell. Dort angekommen,
          waren alle Flugg&auml;ste weg, bis wir beide als letzte aus diesem
          Gef&auml;hrt geholt wurden. Naja, die Dame im Rollstuhl hatte dann
          irgendwann ihre Angeh&ouml;rigen, die sie besuchen wollte und war auch weg
          und niemand wusste so recht, wohin ich eigentlich nun geh&ouml;rte. TUI
          kannte dort niemand, obwohl es immer "international" hei&szlig;t, aber was
          anderes wusste ich auch nicht, so wurde ich in ein B&uuml;ro gebracht und
          durfte warten. Wer mich kennt, wei&szlig;, dass Warten &uuml;berhaupt nicht
          zu meinem Lieblingsbesch&auml;ftigungen z&auml;hlt, da ich von Hause aus
          leider ziemlich ungeduldig bin! :-) Aber es vergingen sage und schreibe 3
          volle Stunden, bis endlich klar war, wo ich hin-geh&ouml;rte und bis man
          mich dann in ein Taxi setzte, was mich zumHotel bringen w&uuml;rde. Und da
          kam auch schon der erste Schock: Das Taxi vom Flughafen zum Hotel kostete
          mich 42 Dollar und die wollte der auch noch bar ausbezahlt haben! Das
          Sch&auml;rfste an dieser Geschichte war, dass der Taxifahrer auch noch die
          Unverfrorenheit besa&szlig;, mich an seinen "Tipp" zu erinnern. Also gut,
          gab ich ihm 45 Dollar und dann konnte ich endlich aussteigen!</P>

          <P valign=top><table border=0 summary="bild1" align=left cellpadding=6>
          <tr><td><img src="st_kanada1.jpg" width="384" height="256" alt="Bild 1"><br>
          <b>Blumgengarten bei Vancouver-Island</b></td></tr></table>

          Niemand war da, der mich mit meinem gro&szlig;en Koffer in Empfang nahm,
          ich durfte ihn die vielen Stufen alleine hochschleifen, aber auch das hatte
          ich letztendlich geschafft. Schwei&szlig;gebadet landete ich dann endlich
          vor dem Schreibtisch der Reiseleiterin, die uns auf unserer Tour begleiten
          w&uuml;rde. Elisabeth Borgers begr&uuml;&szlig;te mich aber nicht etwa mit:
          "Na gut, da sind Sie ja endlich", oder so was &Auml;hnlichem, sondern
          meinte stattdessen: "Das Geld f&uuml;r das Taxi wird meine Firma aber kaum
          ersetzen"! "Na toll", dachte ich bei mir "du kennst Gabi
          Spieck-H&uuml;peden noch nicht, das werden wir doch erst nochmal erst
          sehen!" Aber, ich hatte mein Kofferschild, das mich als Teilnehmerin der
          Tour auswies und meine Zimmerschl&uuml;sselkarte, mit der ich nun
          ersch&ouml;pft, aber wieder besser gestimmt auf mein Zimmer fuhr.
          Schl&uuml;sselkarte war auch unproblematisch, die T&uuml;r ging ohne
          weiteres auf. Das kannte ich von USA schon noch anders! :-) Mein Zimmer war
          nicht sehr gro&szlig;, aber f&uuml;r 2 N&auml;chte w&uuml;rde es
          ausreichen! Ich stellte mein Handgep&auml;ck ab, machte mich frisch und zog
          wieder los, denn irgendwie hatte ich doch noch Hunger auf ein Abendessen.
          Nicht weit von unserem Hotel weg war eine kleine Bude, an der es Pizza und
          &auml;hnliches gab. Ich sa&szlig; da ganz alleine und vertilgte meine
          Lasagne. Dann entdeckte ich nebenan noch einen kleinen Supermarkt, wo ich
          mir noch ein Getr&auml;nk mitnahm, aber nun wurde es Zeit schlafen zu
          gehen, denn der anderen Morgen w&uuml;rde wohl schneller da sein, als mir
          lieb w&auml;re.</P><br clear=all>

          
          <P>Es war noch dunkel, als mein Wecker mich rausscheuchte, halb sechs, aber
          ich wollte schlie&szlig;lich auch nicht zu sp&auml;t zum
          Fr&uuml;hlst&uuml;ck kommen. Ums Gro&szlig;gep&auml;ck brauchte ich mich
          heute nicht zu k&uuml;mmern, denn wir w&uuml;rden am Abend wieder im
          gleichen Hotel sein. Also, schnell Rucksack mit Fotoapparat, Regenzeug und
          allen anderen n&uuml;tzlichen Kleinigkeiten packen, sch&ouml;n warm duschen
          und los ging es.</P>

          <P>Den "Jonview"-Fr&uuml;hst&uuml;cksraum zu finden, war kein Problem. Dann
          ab in den Bus, wo mir gleich wieder Elisabeth entgegenkam und mir sagte,
          dass sie schon mit ihrem Chef gesprochen h&auml;tte und das letzte Wort
          &uuml;ber mein Geld f&uuml;r das Taxi noch nicht gesagt w&auml;re, naja,
          jetzt erst mal abwarten. Im Bus bekam ich Gesellschaft. 3 Leute waren
          zusammen angereist, aber da es nur Zweierreihen in Bus gab und ich auch
          alleine war, wurde eine mittelalte Dame (ca. 60 Jahre) in meine Sitzreihe
          gesetzt. Wir haben uns auf Anhieb gut verstanden und keiner mochte den
          anderen neben sich w&auml;hrend der wei-teren Reise missen! Da war mein
          gro&szlig;es Gl&uuml;ck! Die Dame hei&szlig;t Ingrid und kommt
          aus&acute;Mannheim!</P>
          <br clear=all>
          
          <P valign=top><table border=0 summary="bild2" align=left cellpadding=6>
          <tr><td><img src="st_kanada2.jpg" width="384" height="256" alt="Bild 2"><br>
          <b>Boo-Wasserfall in der Rockies</b></td></tr></table>
          Eine Eigenart der Reiseleiterin kam hier gleich zum Tragen: Es wurde
          sofort festgelegt, dass alle G&auml;ste zu "routieren" h&auml;tten, das
          hei&szlig;t, wer ganz vorn im Bus sitzt, muss am n&auml;chsten Tag ganz
          nach hinten, so dass jeder mal in den Genuss kommt vorne sitzen zu
          d&uuml;rfen. Nach einer Stadtrundfahrt in Toronto ging es dann weiter zu
          den Niagaraf&auml;llen. Aber wenn ich es mir nochmal durch den Kopf gehen
          lasse, lohnt es nicht, wenn man in USA ist, die teuere Tour zur kanadischen
          Seite zu be-zahlen, so viel sch&ouml;ner ist es dort auch nicht, wenn man
          die F&auml;lle in den USA gesehen hat, reicht das vollkommen aus! O.k.,
          aber das nur nebenbei. An den F&auml;llen angekommen, gab es die
          M&ouml;glichkeit mit einem Boot durch die Fluten zu zischen, aber da ich
          keine so begeisterte Wassersportlerin bin, habe ich es vorgezogen, mit
          "meinen Mannheimern" die Gegend zu Fu&szlig; zu erkunden. Ein sehr
          sch&ouml;ner Tag an den Niagaraf&auml;llen ging langsam zu Ende und ich
          hatte Reisegesellschaft, die mir w&auml;hrend der gesamten Tour erhalten
          bleiben sollte.</P>

          <P>Am Montag ging es dann weiter mit dem Bus nach Ottawa, der Hauptstadt
          Kanadas. Auch hier hatten wir wieder eine Stadtrundfahrt, die unsere
          Reiseleiterin selbst f&uuml;hrte.</P>

          <P>Ottawa zeigt f&uuml;r meine Begriffe am deutlichsten den Unterschied
          zwischen neuen und alten, geschichtstr&auml;chtigen Geb&auml;uden in
          Kanada. Ich habe hier noch mein Heft, das weitere Einzelheiten zu den
          einzelnen St&auml;dten enth&auml;lt. Wenn dich das interessiert, wende dich
          bitte gern noch mal an mich. In Ottawa war das Abendessen dann f&uuml;r
          mich wieder etwas abenteuerlich, denn meine Mannheimer waren pl&ouml;tzlich
          verschwunden. Es sollte ein Restaurant geben, in dem Spaghetti essen
          k&ouml;nnte, aber ich habe das nicht gefunden. Nach ein paar freundlichen
          Worte mit dem dieensthabenden Personal der Rezeption bekam ich
          schlie&szlig;lich meine Spaghetti auf mein Zimmer serviert, warm, lecker
          und wohlschmeckend, wenn auch aus dem Schnellrestaurant! :-))) Mein Zimmer
          in Ottawa war ziemlich gro&szlig; und doch behaglich, aber leider blieben
          wir hier nur f&uuml;r die eine Nacht, also, hie&szlig; es am Abend wieder:
          "Koffer sortieren".</P>

          <P>Am Dienstag ging es weiter nach Quebec-City, der franz&ouml;sischsten
          Stadt unserer Tour. In Quebec kam eine eigens daf&uuml;r engagierte
          Stadtf&uuml;hrerin in unseren Bus und Elisabeth hatte Pause! :-) Diese
          wurde von ihr u. a. daf&uuml;r genutzt, mir mein Taxigeld
          zur&uuml;ckzuerstatten. Wir hatten in Quebec dann auch noch ein bisschen
          Zeit f&uuml;r uns, in der ich mich wieder den Mannheimern anschlie&szlig;en
          konnte. Zusammen haben wir die Stadt noch ein wenig erkundet und so
          rumgeguckt, zum Schluss ein ganz nettes Caf&eacute; entdeckt "Caf&eacute;
          de Paris", naja, ziemlich teuer, aber sonst gut. Ich habe dort nur einen
          Cappucchino getrunken, weil wir heute beschlossen hatte, auch noch
          zusam-men Abendessen zu gehen. Es gab H&auml;hnchen mit Pommes!</P>
          <br clear=all>

          <P valign=top><table border=0 summary="bild3" align=left cellpadding=6>
          <tr><td><img src="st_kanada3.jpg" width="384" height="256" alt="Bild 3"><br>
          <b>Columbia-River</b></td></tr></table>
          Hier in Quebec wurde der erste unserer Koffer vermisst. Das, so meinte
          Elisabeth, sei nur normal, das k&ouml;nne in Kanada durchaus passieren, "Oh
          Gott," dachte ich "hoffentlich &uuml;bersteht das mein Koffer"! In Quebec
          war mein Zimmer sehr dunkel und sehr klein, so dass ich gut daran getan
          habe, meine Klamotten "zusammenzuhalten", damit nichts liegenblieb. Am
          Mittwoch ging es auf "Wal-Watching-Tour" mit einem gro&szlig;en Schiff.
          Aber vorher musste nat&uuml;rlich noch f&uuml;r das leibliche Wohl gesorgt
          werden und wir gingen mit Elisabeth in einen Supermarket, wo sich jeder das
          kaufen konnte, was ihm am besten schmeckt. Ich freute mich auf ein bisschen
          Salami und ein gro&szlig;es Baguette, nat&uuml;rlich brauchten wir auch was
          zu trinken und dann kamen auch noch Kekse mit!! Auf dem Schiff gab es dann
          erstmal ein f&uuml;rstliches Picknick, bei dem ich alles, was ich hatte,
          mit den Mannheimern und Elisabeth teilte und sie mit mir. Es war ein
          herrlicher Tag auf See mit "Minki-Wales", die sogar ich gesehen habe.</P>

          <P>Am Donnerstag hatten wir nur eine relativ kurze Strecke von Quebec nach
          Montreal zu bew&auml;ltigen (255 km), auch in Montreal, wo wir
          nat&uuml;rlich das Olympische Dorf noch sehen konnten, gab es eine
          Stadtf&uuml;hrung mit fremder F&uuml;hrerin, die jedoch recht gut war.
          Abends gab es ein typisch kanadisches Essen, was jeder extra bezahlen
          musste. Ich hatte leckeren Lachs, der mir hervorragend schmeckte. Nach dem
          Essen ging es noch zu Fu&szlig; ein St&uuml;ck durch die Stadt (auch hier
          war meine Ingrid aus Mannheim sofort wieder an meiner Seite, da sie
          inzwischen von mir wusste, dass ich mich im Dunkeln schwertue), bis wir an
          einem Punkt landeten, von dem aus man &uuml;ber die gesamte Stadt sehen
          konnte, bei Nacht wirklich supersch&ouml;n und romantisch. Dann folgte am
          Freitag eine unserer l&auml;ngsten Strecken, bei der ich wieder mit
          "meiner" Ingrid ganz vorne sitzen konnte, es ging n&auml;mlich von Montreal
          zur&uuml;ck nach Toronto (545 km). Hier wieder angekommen im Hotel, das ich
          schon kannte, verabredeten wir uns f&uuml;r den Abend noch ein bisschen
          herumzulaufen und zum Essen!</P>

          <P>Am Samstag sollten wir endlich mal ein bisschen Luft holen und auch ein
          bisschen l&auml;nger schlafen d&uuml;rfen. Aber um 10.00 Uhr war ich wieder
          mit den Mannheimern zum "CN-Tower" verabredet. Die Koffer wurden
          untergestellt und um 13.00 Uhr ging es ab zum Flughafen Toronto zum Flug
          nach Calgary in den Westen. Hier hatten wir nun noch einmal 2 Stunden
          Zeitverschiebung und man musste sich schon genau &uuml;berlegen, wann es
          angebracht sein k&ouml;nnte, in Deutschland anzurufen! Auch in Calgary
          blieben wir nur eine Nacht. Erw&auml;hnenswert vielleicht noch, dass auf
          dem Flug 2 weitere Koffer verschwunden waren, zum Gl&uuml;ck nicht meiner!
          :-)</P>

          <P>Am Sonntag fuhr unser Bus weiter nach Banff in den Nationalpark. In
          Banff hatten wir ebenfalls wieder ein sehr sch&ouml;nes Hotel. In Banff
          wurden wir vom Leiter unseres Hotels selbst begr&uuml;&szlig;t.</P>

          <P>Da ich dringend Geld umtauschen musste, ging Elisabeth mit mir zu der
          Stelle, wo ich das tun konnte. Nach einem Rundgang hatte ich dort noch
          einen Pulli mit Kanada-Eichblatt f&uuml;r meine Nichte erstanden. Abends
          war ein gemeinsames Essen in der "Spaghetti-Factrory" m&ouml;glich. Am
          n&auml;chsten Tag, Montag fand ein Ausflug zum Icefields-Park-Way und Lake
          Louise statt. Wer einmal nach Kanada kommt, solte sich diesen Anblick nicht
          entgehen lassen, der auch durch viele V&ouml;gel und andere Tiere auf
          akustischem Wege sehr reizvoll sein kann. Hier erstand ich das Mitbringsel
          f&uuml;r meinen Mann, eine Packung echten kanadischen Lachs und ein Video
          von dieser herrlichen Gegend, das wir uns heute zum ersten Mal angesehen
          haben! Durch Elisabeth bekam ich darauf sogar Prozente, da sie die Dinge
          wie f&uuml;r sich kaufte und dann mit mir g&uuml;nstig abrechnete!</P>

          <P valign=top><table border=0 summary="bild4" align=left cellpadding=6>
          <tr><td><img src="st_kanada4.jpg" width="384" height="256" alt="Bild 4"><br>
          <b>Lake Louise</b></td></tr></table>
          Am Dienstag ging es dann von Banff weiter nach Kamloops, eine herrliche
          Fahrt durch die Rockies, die mir ewig in Erinnerung bleiben wird.
          Dienstagabend hatte ich mich mit den Mannheimern nicht verabredet und alles
          ging irgendwie ziemlich schnell und ziemlich chaotisch zu, ich war aber
          kaum auf meinem Zimmer, als mein Telefon klingelte und mir einen
          "Long-Distance-Call" anzeigte! Mein Mann! Er hatte sich Sorgen um mich
          gemacht, mal eine ganz neue Erfahrung! :-)!</P>

          <P>Als ich frisch geduscht unten auftauchte, warteten die Mannheimer schon
          am Tisch auf mich, um das Abendessen zu bestellen, Lachs, den es dort an
          dem Abend ganz frisch gab.</P>

          <P>Am Mittwoch fuhr unser Bus von Kamloops nach Whistler, wo wir im Hotel
          mit einem musikalischen Gru&szlig; durch den Leiter empfangen wurden. Auch
          in Whistler kann man sehr sch&ouml;n spazieren gehen, auch auf den Spuren
          der Indianer. Vorbei an vielen Wasserf&auml;llen, waren wir immer noch in
          den Rockies. Den dort fakultativ angebotenen Helikopterflug musste ich dann
          auch nicht mitmachen, Hubschrauberflug, das kenne ich von Deutschland, da
          wird mir immer schlecht, das muss nicht sein! :-))</P>

          <P>Donnerstag kam dann meine letzte Tour mit den Mannheimern, von Whistler
          nach Vancouver, wo die dann zu ihren Verwandten weiterzogen. Aber
          nat&uuml;rlich machten sie die Stadtrundfahrt am Donnerstag erst noch mit,
          vorbei an der ber&uuml;hmten Dampfuhr, die wir gerade um 12.00 Uhr mittags
          erreichten und das Schauspiel in voller L&auml;nge genie&szlig;en konnten.
          Am Abend zogen wir 4 dann ein letztes Mal gemeinsam los, landeten bei
          "Chinies" und a&szlig;en Abend. Am Freitagmorgen galt es dann Abschied zu
          nehmen, denn die Gruppe hatte den Tag f&uuml;r Vancouver-Island geplant.
          Nat&uuml;rlich ging das f&uuml;r mich nicht ganz ohne Tr&auml;nen ab!</P>

          <P>Da die Mannheimer nun nicht mehr da waren, k&uuml;mmerte sich Elisabeth
          vorwiegend um mich, damit ich ja alles sehen und mitverfolgen konnte, holte
          mir Kaffee und bem&uuml;hte sich ganz lieb um mich, welche Wandelung zum
          Anfang der Reise. In Vancouver-Island erstand ich noch etwas f&uuml;r
          meinen Neffen und wir tranken zu zweit gem&uuml;tlich drau&szlig;en Kaffee
          und a&szlig;en Kuchen. Leider verging der letzte Tag in Kanada auch so
          schnell, dass es bald Abend wurde. Auf dem Schiff a&szlig; ich dann mit
          Elisabeth noch eine Kleinigkeit zu Abend, so dass ich danach ich Vancouver
          nicht mehr zu suchen brauchte, zumal unser Bus am n&auml;chsten Tag bereits
          um 6.30 Uhr zum Flughafen fahren w&uuml;rde. Es war f&uuml;r Elisabeth
          selbstverst&auml;ndlich, dass sie mich zumindest bis zum Airport begleiten
          w&uuml;rde, wenngleich sie auch einen anderen Flug nach Toronto zur&uuml;ck
          gebucht hatte, sie wollte versuchen, mit uns zu fliegen, die wir den
          Anschluss nach Frankfurt nehmen mussten. Sie hatte es schlie&szlig;lich
          geschafft, sich und mich in die "Business-Class" umzubuchen und wir
          sa&szlig;en f&uuml;rstlich auf unseren Pl&auml;tzen nebeneinander,
          a&szlig;en warmes Essen und hatten jeder unseren eigenen Bildschirm am
          Platz! :-)</P>

          <P>In Toronto galt es dann, Abschied zu nehmen. Wir waren beide sehr
          traurig, dass die gemeinsame Zeit schon zu Ende sein sollte. Aber wir
          hatten in Banff schon Adressen ausgetauscht und uns versprochen, in
          Verbindung zu bleiben. Von Toronto nach Frankfurt sa&szlig;en vor mir
          Leute, die meinten, sie l&auml;gen in ihrem eigenen Schlafzimmer.
          Entsprechend eng war dort f&uuml;r mich der Platz, zumal neben mir eine
          Frau thronte, die eigentlich zwei Pl&auml;tze f&uuml;r sich gebraucht
          h&auml;tte. Aber wir haben den Flug nach Frankfurt dann doch gut
          &uuml;berstanden und auch das Flugzeug nach Hannover nicht verpasst. So
          weit war alles klar, aber als ich dann meinen Abholer am Kofferband sah,
          war ich doch sehr gl&uuml;cklich, wieder zu Hause zu sein.</P>

          <P>Herzliche Gr&uuml;&szlig;e aus der Stadt Heinrichs des
          L&ouml;wen<BR clear=all>
          Gabi Spieck-Huepeden</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

