<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="author" content="Dirk Zemisch">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Odyssee eines Datenreisenden</TITLE>
  </HEAD>

  <BODY background="bgb.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <H1 align="center"><B>Odyssee eines
          Datenreisenden</B></H1>

          <H3 align="center">oder: Kabellose Kommunikation auf dem
          (Vor-)Marsch</H3>

          <H4 align="center">(C) Dirk Zemisch 2003</H4>

          <P>An einem lauen Fr&uuml;hlingstag, mitten in
          Deutschland, ich sto&szlig;e zuf&auml;llig auf <A href=
          "http://www.spiegel.de" name=
          "www.spiegel.de">www.spiegel.de</A> auf einen
          gro&szlig;en Artikel zur freien Kommunikation. Diesmal
          nicht im Sinne geistiger Freiheit, sondern als
          Umschreibung f&uuml;r Bewegungsfreiheit, also 'Wireless'
          - kabellos.</P>

          <P>Und was lese ich da? Hamburg sei <B>die</B>
          Vorreiterstadt bei der Bereitstellung &ouml;ffentlicher
          und kostenloser (!) Hotspots. Auf <A href=
          "http://www.hamburg-hotspot.de" name=
          "www.hamburg-hotspot.de">www.hamburg-hotspot.de</A> wird
          dann auch kr&auml;ftig die Werbetrommel ger&uuml;hrt.</P>

          <P>Na, denke ich, das ist ein 'Zeichen'. Hab ich doch
          gerade ein Projekt in HH, und die Unterkunft mu&szlig;
          leider ohne Telefonanschlu&szlig; auskommen. Endlich wird
          sich die Investion in eine Wireless-LAN (WLAN) Karte als
          richtig erweisen. Tr&auml;ume scheinen manchmal wahr zu
          werden.</P>

          <P>Wo also sind in der N&auml;he des Projektkunden
          Hotspots... Boah - f&uuml;nf St&uuml;ck, davon drei
          innerhalb von 10 Fu&szlig;minuten... Eine Sushi-Bar,
          allerdings ein wenig abseits, naja, wird auch notiert.
          Ah, hier, das'ALEX'. Blick auf die Alster, lecker snacken
          und dabei Mails lesen... Tr&auml;ume werden wahr...</P>

          <P>Naja, erstmal anreisen. Mit der Bahn dauert das einen
          kleinen Moment. Vorsichtshalber schon mal ein paar Mails
          schreiben. Sonst sitz ich nachher da und hab nix zu
          versenden - w&auml;r das <B>peinlich</B>...</P>

          <P>Montag ist ein Sch***-Tag, bin einfach zu fr&uuml;h
          aufgestanden. Und dann das ganze Gep&auml;ck... Aber
          morgen - gleich fr&uuml;h zum Fr&uuml;hst&uuml;ck geht's
          ab, Mail mit Latte (Milchkaffee, was hast Du denn gedacht
          :-( ).</P>

          <TABLE border="0" cellpadding="0" summary=
          "Text mit Zeiten" width="100%">
            <TR>
              <TD width="50" valign="top">7:30</TD>

              <TD>Ich steh vor dem 'ALEX'. Ziemlich zu um die Zeit.
              Na gut, gehen wir erstmal woanders
              fr&uuml;hst&uuml;cken...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">8:05</TD>

              <TD>Ich bin wieder da. Und jetzt auch jemand von der
              Crew. Also hingesetzt, Kaffee bestellt, Notebook raus
              - man bootet das Teil langsam... Windows-Anmeldung,
              WLAN-Suche aufgerufen - da!!! ein Netz!</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>HOTSPOT_HAMBURG prangt in scheinbar riesigen
              Lettern auf dem Bildschirm. Browser aufrufen ... Hmm,
              worauf wartet der denn? Wartet, wartet ... FEHLER!
              Kann Server nicht erreichen... Hmm. Nochmal das
              Ganze. FEHLER!</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">8:15</TD>

              <TD>Das Personal mu&szlig; ran. Ob denn jemand
              w&uuml;&szlig;te, ob und wie... "Au ja, wir haben da
              so eine Flyer, Moment, Kollege ... findet ihn nicht"
              :-( Der Chef wei&szlig; auch warum. Die sind vor drei
              Wochen aus und noch nicht wieder nachgeliefert
              worden... Ahh ja... Ich probier noch eine halbe
              Stunde rum, aber irgendwann verlangt auch der
              geduldigste Kunde, da&szlig; man erscheint... Also
              zusammenr&auml;umen. Wenigstens war der Latte
              lecker...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">17:55</TD>

              <TD>Wieder zusammenr&auml;umen. Diesmal aber
              wesentlich schneller, schlie&szlig;lich hab ich
              tags&uuml;ber nochmal die einschl&auml;gigen
              WebSites, FAQs und Foren abgegrast. Eigentlich kann
              nix mehr schief gehen... Die Hotline (von 8-19 Uhr!)
              hat mir versprochen, da&szlig; es klappen mu&szlig;.
              Eigentlich hab ich ja auch fast alles richtig gemacht
              am Morgen.</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">18:15</TD>

              <TD>Ziemlich genau zehn Stunden nach meinem ersten
              heutigen Kontakt mit dem 'ALEX', stehe ich wieder in
              der T&uuml;r. Ganz sch&ouml;n voll hier...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Aber da! Genau unter dem Access Point - ein
              freier Tisch. Na, wenn das keinen guten Connect
              verspricht. Also noch einmal: Bestellung (diesmal
              darf's ein Bier sein), auspacken, starten...
              Telefonieren. Mit der Hotline. Weil: Connect ja, aber
              kein Internet...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Nach 10 Minuten stellt sich raus, da&szlig; der
              Access Point (oder der Router?, der Mensch von der
              Hotline traut sich wohl nicht, mir was falsches zu
              sagen und so wirft er beide Begriffe lustig
              durcheinander)... Na jedenfalls irgendwas ist
              'down'.</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Jetzt f&auml;llt es mir auch auf: neben den
              beiden gr&uuml;nen LEDs, die am Access Point
              leuchten, blinkt wie wild auch noch sowas
              orange-rotes, bisher hatte ich das f&uuml;r die
              Traffic-LED gehalten...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Das m&uuml;sse jemand vor Ort mal eben
              'resetten', dauert f&uuml;nf Minuten. Und ich
              br&auml;uchte mich um nichts zu k&uuml;mmern - S*-ow
              Computer macht das! Na dann.</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>"Ober! Die Karte."</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">18:50</TD>

              <TD>Naja, wenigstens lecker Essen gibt's hier. Und
              die Portionen sind genau f&uuml;r mich abgemessen -
              wollte sowieso h&ouml;chstens 800 kcal t&auml;glich
              zu mir nehmen. Und der Tee heute hatte schon 500. Da
              pa&szlig;t das ganz gut...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Neuer Versuch. Aber ein Blick auf den Access
              Point l&auml;&szlig;t nichts Gutes erahnen - man ahnt
              es schon - das orange-rote Blinklicht ...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Das 'O weh!' im Namen der Computerfirma hatte
              mich wohl nicht umsonst stutzig gemacht.</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Die Bedienung ist auch &uuml;berfordert, der
              *Wissende* nat&uuml;rlich inzwischen im
              wohlverdienten Feierabend... Wenigstens k&ouml;nnen
              wir in einem gemeinsamen Brainstorming herausfinden,
              wie ich am schnellsten zu den n&auml;chstgelegenen
              HOTSPOTs komme. Manchmal hat Papier halt auch was
              Gutes...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">19:20</TD>

              <TD>"Ober! Zahlen!"</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">19:35</TD>

              <TD>Nach nur einer Viertelstunde hab ich auch schon
              die '&Ouml;ffentlichen B&uuml;cherhallen Hamburg'
              gefunden, obwohl die nur f&uuml;nf Minuten vom 'ALEX'
              entfernt liegen... Aber wer vermutet eine Bibliothek
              auch im Keller eine Theaters? (Anm. d. Autors: Im
              Nachhinein stellte sich heraus, da&szlig; es sich
              wohl eher um den Dachboden handelt, die Assoziation
              f&auml;llt deswegen aber nicht leichter.) Aber ist
              auch egal: Die Hallen schlie&szlig;en um 19 Uhr. Kann
              man machen nix...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Auf zum n&auml;chsten HOTSPOT. Das ist die
              Handelskammer Hamburg. Die haben bestimmt bis
              mindestens 20 Uhr offen...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">19:50</TD>

              <TD>Die Handelskammer hab ich gefunden.
              &Uuml;brigens. Warum nennen sich die Bewohner von
              Hamburg eigentlich Hamburger? *Ich* wei&szlig; es
              jetzt - sie kennen nur den Weg zum n&auml;chsten
              McDonalds. Selbst Stra&szlig;en und Pl&auml;tze
              direkt neben dem Rathaus sind ihnen ansonsten
              v&ouml;llig fremd. Selbst wenn sie gerade darauf
              stehen. Nur gut, da&szlig; hier so viele Touristen
              rumlaufen...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">19:52</TD>

              <TD>Hallo?!? Hat die H&uuml;tte auch einen Eingang?
              Ich hab ja nun schon zwei (Neben-)Ausg&auml;nge
              gefunden - aber der Eingang mu&szlig; entweder in
              einem Tunnel oder am Helikopter-Landeplatz auf dem
              Dach sein...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">19:55</TD>

              <TD>'WLAN strahlt doch bis zu 300 Metern' f&auml;llt
              es mir wie Schuppen aus den Haaren. Dann schlag ich
              doch meine Zelte hier drau&szlig;en auf. Es regnet ja
              nicht und da ist auch schon ein passendes
              Steingel&auml;nder - breite, glatte
              Oberfl&auml;che...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Notebook ausgepackt und mitten auf der Plaza
              hochgefahren. Kichernd laufen ein paar M&auml;dchen
              vorbei - ooch diese Jugend!!!</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">19:58</TD>

              <TD>Da! Wieder ein Netz: HOTSPOT_HAMBURG prangt es
              wieder auf dem Bildschirm. Da mir der freundliche
              Herr von der Hotline verraten hat, da&szlig; hier mit
              Keksen (Cookies) gearbeitet wird, bleibt der Opera
              gleich zu - Internet Explorer (IE) rulez! Und weil
              das noch nicht unsicher genug sei, soll ich denn doch
              auch gleich das Antivirusprogramm deaktivieren! Der
              Mensch versteht sein Handwerk!!!</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Das Netzwerk steht! 100% Link quality -
              Excellent! Signal strange - auch 100%. Sauber!!!</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Yeehaw, kein DNS-Fehler mehr, als ich endlich mit
              klammen Fingern (die Fr&uuml;hlingsn&auml;chte sind
              noch richtig kalt hier im Norden!)
              www.hamburg-hotspot.de eingeklimpert habe. IE
              arbeitet... Fertig! Aber wo ist die WebSite. Mich
              lacht ein leeres Fenster an. Refresh! Fertig! Leere.
              Ooch neeheeh!</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Netzwerk nochmal deaktiviert. Aktiviert.
              Verbindung hergestellt. IE starten... Dazu komme ich
              nicht mehr - "Das Netzwerkkabel wurde entfernt!" Ich
              wei&szlig; - WIRELESS. *Meinen* tut das Teil aber,
              da&szlig; die Verbindung gekappt worden ist. Wie,
              jetzt?</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">
              </TD>

              <TD>Ladenschlu&szlig;. Anders kann ich mir das nicht
              erkl&auml;ren. Der Netzwerkadministrator der
              Handelskammer scheint zumindest f&auml;hig genug zu
              sein, um einen Job anlegen zu k&ouml;nnen, der Punkt
              20 Uhr die Access Points ausknipst. Na super...</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">20:05</TD>

              <TD>Leicht genervt trete ich den Weg in meine
              spartanische Unterkunft an. Wieder geht ein Tag ohne
              Mails zu Ende... Aber Wireless ist auf dem Vormarsch.
              Das Joggen kann ich mir heute schenken. Bewegung
              hatte ich genug.</TD>
            </TR>

            <TR>
              <TD width="50" valign="top">22:00</TD>

              <TD>Eine weitere Mail wartet darauf, da&szlig;
              Deutschland in die kabellose Zukunft startet. Aber
              morgen ist ja auch noch ein Tag. Wozu also
              eilen...</TD>
            </TR>
          </TABLE>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

