<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <!-- Author = [NUNTIUS] -->

    <TITLE>Organspende</TITLE>
  </HEAD>

  <BODY background="bgd.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>ORGANSPENDE RETTET
          LEBEN!</B></FONT></P>

          <P>Die Erfolge in der Transplantationsmedizin wurden erst m&ouml;glich
          durch die Bereitschaft vieler Menschen zur Organspende!</P>

          <P>Wussten Sie schon ...<BR>
          dass man durch Organtransplantationen Tausenden allein in Deutschland
          das Leben gerettet oder die Gesundheit zur&uuml;ckgegeben hat?</P>

          <P>Helfen Sie ...<BR>
          todkranken Menschen durch Ausf&uuml;llen eines Spenderausweises und durch
          das st&auml;ndige Mitf&uuml;hren dieses Ausweises!</P>

          <P>Denken Sie daran ...<BR>
          dass vielleicht schon morgen Familienangeh&ouml;rige, Lebenspartner,
          Freunde, Ihnen nahestehende Personen oder sogar Sie selbst erkranken
          k&ouml;nnen und auf eine Organspende angewiesen sind!</P>

          <P>Reden Sie ...<BR>
          mit Ihrer Familie und Ihren Freunden &uuml;ber Ihren Entschluss, nach Ihrem
          Tode durch eine Organspende anderen Menschen helfen zu wollen!</P>

          <P>Fragen Sie nach ...<BR>
          wenn Sie mehr zum Thema Organspende wissen m&ouml;chten! Der BDO bietet
          Ihnen auf seinen Internet-Seiten die M&ouml;glichkeit, sich umfassend zu
          informieren!</P>

          <P>Gesch&auml;ftsstelle des BDO</P>

          <P>BDO - Bundesverband der Organtransplantierten e.V.<BR>
          Paul-R&uuml;cker-Str. 20 - 22, 47059 Duisburg<BR>
          Tel. (02 03) 44 20 10<BR>
          Fax (02 03) 44 21 27<BR>
          Internet: http://www.bdo-ev.de<BR>
          eMail: Geschaeftsstelle@bdo-ev.de</P>
          <HR width="60%">

          <H3>Organspendeausweis</H3>

          <P>F&uuml;r viele Menschen ist eine Organtransplantation die einzige
          Chance, ein neues Leben zu beginnen! Wir m&ouml;chten sie daher bitten,
          sich mit dem Thema Organspende zu besch&auml;ftigen und Ihre Entscheidung
          zu treffen.</P>

          <P>Ihre Bereitschaft, nach Ihrem Tode Organe spenden zu wollen, sollten Sie
          mit Hilfe des Organspendeausweises dokumentieren. Ihr
          Selbstbestimmungsrecht hat unbedingten Vorrang. Ihre Entscheidung ist
          bindend und muss auch von Ihren Angeh&ouml;rigen respektiert werden.</P> Es
          gibt folgende M&ouml;glichkeiten, einer Organspende auf diesem Ausweis
          zuzustimmen:

          <UL>
          <LI> Man der Spende von Organen und Geweben uneingeschr&auml;nkt
          zustimmen,</LI>

          <LI> die Spende beschr&auml;nken, das hei&szlig;t bestimmte Organe und
          Gewebe von der Spende ausschlie&szlig;en;</LI>

          <LI> nur bestimmte Organe und Gewebe spenden;</LI>

          <LI> einer Spende widersprechen oder</LI>

          <LI> die Entscheidung auf eine andere Person &uuml;bertragen, zum Beispiel
          auf den Ehepartner, einen guten Freund oder eine sonstige Vertrauensperson,
          wenn man sie nicht pers&ouml;nlich oder nicht sofort treffen will. Damit
          die n&auml;chsten Angeh&ouml;rigen die pers&ouml;nliche Entscheidung
          kennen, ist es wichtig, mit ihnen dar&uuml;ber zu reden. Man kann z.B. in
          der Zeile "Anmerkungen/Besondere Hinweise" eine Person benennen, die im
          Todesfall benachrichtigt werden soll, weil sie &uuml;ber die getroffenen
          Entscheidung informiert ist, oder auf eine Erkrankung hinweisen kann, die
          f&uuml;r die Spende von Bedeutung sein k&ouml;nnte.</LI>
          </UL>

          <P>In Deutschland k&ouml;nnen derzeit bis auf Darmtransplantationen
          (hierf&uuml;r gibt es bisher kein Programm) folgende Organe nach dem Tod
          gespendet und transplantiert werden:<BR>

          Herz, Lunge, Leber, Nieren, Bauchspeicheldr&uuml;sen und Teile der Haut
          (Organe) sowie die Hornhaut der Augen (Cornea), Geh&ouml;rkn&ouml;chelchen,
          Herzklappen und Teile der Blutgef&auml;&szlig;e (Adern), der Hirnhaut, des
          Knochengewebes, des Knorpelgewebes und der Sehnen (Gewebe).</P>

          <P>Spenden kann grunds&auml;tzlich jeder Mensch. Es gibt keine feste
          Altersgrenze f&uuml;r eine Organspende. Ob Organe und Gewebe f&uuml;r eine
          Transplantation in Frage kommen, wird nach dem Tode medizinisch beurteilt;
          es ist daher nicht erforderlich, sich &auml;rztlich untersuchen zu lassen.
          Wichtig ist nicht das Alter des Spenders, sondern das biologische Zustand
          seiner Organe und Gewebe.</P>

          <P>Das Bundesministerium f&uuml;r Gesundheit hat nach Inkrafttreten des
          Transplantationsgesetzes (TPG) durch eine allgemeine Verwaltungsvorschrift
          ein Muster f&uuml;r einen Organspendeausweis bekanntgemacht. Dieses Muster
          wird von Beh&ouml;rden der L&auml;nder und des Bundes, den Krankenkassen
          und den privaten Krankenversicherungen verwendet und ist dort kostenlos zu
          erhalten (Aufkl&auml;rungspflicht nach &sect; 2 Abs. 1 TPG). Alle
          bisherigen Ausweise oder Erkl&auml;rungen zur Organspende verlieren dadurch
          nicht ihre G&uuml;ltigkeit.</P>

          <P>Wenn man seine Entscheidung auf einer Organspendeerkl&auml;rung
          festh&auml:lt, erspart man seinen Angeh&ouml;rigen unter Umst&auml;nden
          erhebliche Belastungen.</P>

          <P>Selbstverst&auml;ndlich kann man die getroffene Entscheidung jederzeit
          wieder r&uuml;ckg&auml;ngig machen oder ab&auml;ndern.</P>

          <P>Gefunden bei: [NUNTIUS] - BLINDzeln
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML> 
