<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Hacker, Heringe und hehre Ziele</TITLE>
    <META name="description" content=
    "Beim Chaos Communication Camp">
    <META name="author" content="Rolf N&uuml;nninghoff">
    <META name="generator" content="Ulli Meybohms HTML EDITOR">
  </HEAD>

  <BODY background="st_rolf0.gif" text="#000000" link="#0000FF"
  vlink="#000080" alink="#FF0000" bgcolor="#FFFFF4">
    <DIV align="center">
      <H2>Hacker, Heringe und hehre Ziele</H2>

      <H3>Beim Chaos Communication Camp entpuppen sich die
      vermeintlichen Netz-Anarchisten als Technik-verliebte
      Perfektionisten</H3>

      <P>Diesen Artikel hatte ich aus einer Zeitung ausgeschnitten
      - ich wei&szlig; nicht mehr aus welcher - gelesen habe ich
      ihn erst zu Hause nach unserem Urlaub auf R&uuml;gen.</P>

      <P>Und jetzt m&ouml;chte ich Euch diese Zeilen ebenfalls zum
      lesen und nachdenken anheim stellen.</P>
      <FONT size="-1">- Geschrieben hat diesen Artikel Constanze
      von Bullion - und abgeschrieben hat der Untenstehende
      -</FONT><BR>
      <BR>
    </DIV>
    <B>Altlandsberg</B>&nbsp;&nbsp;. August - Am besten, man schaut
    sich das Spektakel bei Nacht an, wenn irre Lichtkegel durch die
    B&auml;ume geistern, wenn die Menschen in den Zelten zu
    Schattenrissen verk&uuml;mmern und die Bildschirme gl&uuml;hen
    wie kleine H&ouml;llenfeuer. Drinnen im gro&szlig;en Hackzelt,
    sitzen sie noch um Mitternacht dicht an dicht vor ihren
    Laptops, die R&uuml;cken gebeugt und die Nasen an den
    leuchtenden Fenstern in diese andere Welt, aus der mancher nur
    ungern zur&uuml;ckkehrt. Der Computermensch, so scheintes,
    kennt weder Hunger noch Schlaf. Und wer ihn ein St&uuml;ck
    begleitet bei seiner Reise durch den digitalen Orbit,kommt sich
    bald ziemlich abgeh&auml;ngt vor hinter seinen analogen
    Horizont.<BR>
     Ein Besuch beim Chaos Communication Camp 2003, das ist
    f&uuml;r Nicht-Eingeweihte ungef&auml;hr so, als w&uuml;rde man
    einen Wochentrip zum Mars buchen und die professionellen
    Astronauten unterwegs st&auml;ndig fragen, welche Funktion
    ihres Raumschiffes sie gerade aktivieren. Oder sind die am Ende
    gar nicht so professionell, die Hundertschaften von "Hackern",
    also Computerfans und Internet-Spezialisten, die seit
    Donnerstag in Shorts und Schlabber-Shirts auf eine Wiese in
    Altlandsberg bei Berlin pilgern, bunte Zelte aufschlagen und
    ihre Wohnmobile parken? Gutb&uuml;rgerliche Vorzelte nebst
    gebl&uuml;mten Campingst&uuml;hlen werden dann installiert, und
    weil es hier offenbar viele gibt, die noch nie im Leben ein
    Zelt aufgebaut haben, brechen an allen Ecken Debatten aus.<BR>
     Ein Trupp bleicher Finnen wei&szlig; nicht , wohin mit den
    &uuml;berladenen Rucks&auml;cken. Die Holl&auml;nderwollen
    n&auml;her ans Wasser, die Bayern diskutieren die ideale
    Position der Heringe,"Stolperfallen vermeiden!",bis endlich
    jeder sein Allerheiligstes rausholt. Feine Laptops kommen ans
    Licht, Rechner, Scanner, Plattenspieler, Kilometer von Kabeln
    und immer neue Stecker, die in immer neue Anschl&uuml;sse
    genestelt werden. Am Ende sind die Zelte restlos vollgestopft,
    aber bis die Kisten richtig laufen, k&ouml;nnen noch Stunden
    vergehen. Doch das ist wohl der Sinner der Sache.<BR>
     Der Computerhacker n&auml;mlich ist ein Perfektionist, der
    alles immer noch ein bisschen besser hinkriegen will, und wer
    meint, bei der Konferenz des "Chaos Computer Clubs" in
    Altlandsberg einen Haufen Anarchisten anzutreffen, die sich wie
    wild gewordene Insekten in die Rechner des Pentagons bohren,
    Regierungen lahm legen oder geheime Datenbanken von Banken
    ausr&auml;umen, der ist v&ouml;llig fehl am Platz.<BR>
     

    <P><FONT size="+1"><B>Kampf gegen den
    Werbem&uuml;ll</B></FONT></P>
    "Hier passieren doch keine illegalen Dinge, um Gottes Willen",
    sagt Andy M&uuml;ller-Maguhn und rollt die Augen. Der Sprecher
    des Chaos Computer Clubs geh&ouml;rt mit seinen 31 Jahren
    l&auml;ngst zu den Veteranen im Camp - und zu denen, die
    versuchen, den politischen Anspruch des Vereins hochzuhalten.
    "Wir besch&auml;ftigen uns mit
    Internet-&Uuml;berwachungsmethoden, auf die wir technologische
    Antworten geben wollen", sagt er. Um die Folgen des 11.
    Septembers soll es in den Workshops des Camps gehen, um immer
    neue Sicherheitsvorgaben und Zugriffsrechte auf private Daten,
    die die US-Regierung zwecks Terrorabwehr fordert. Aber auch der
    Kampf gegen <I>Spam</I> ist ein Thema hier, also die Frage, wie
    man Lawinen unerw&uuml;nschter Werbung blockiert, die den
    Leuten ihre E-Mail-Accounts zum&uuml;llen.<BR>
     Klingt ganz vern&uuml;nftig, denkt der Laie, der loszieht, die
    harmlosen <I>white hats</I> und die b&ouml;sen <I>black
    hats</I> kennen zu lernen, die <I>Script-Kiddies</I> und die
    <I>Chracker</I>, denen im Hack-Zelt erstmal die Leviten gelesen
    werden. Keine Hunde im Camp, kein M&uuml;ll, keine laute Musik
    nach 22 Uhr, nicht auf den Sendemasten klettern und den
    Anweisungen der Crew Folge leisten: Hier herrscht Ordnung und
    Sauberkeit, und damit auch im Netz nicht zu viel Unfug
    getrieben wird, hat man den Computerfans ein Richtfunknetz mit
    einer Leistung von 155 Mega-Bit hingezaubert, den Zugang zu
    Polizei-Seiten aber offenbar gesperrt.<BR>
     Macht nichts, findet Rubbel aus Frankfurt, der bei tropischen
    Temperaturen unter einer Zeltplane br&uuml;tet, eingeklemmt
    zwischen einem Eimer Bierdosen und seinem Kumpel Johannes, der
    wie alle anderen hier nur seinen Vor- oder K&uuml;nstlernamen
    verraten will. Fragt man die beiden,was sie Geheimnisvolles
    tun, wenn sie so stumm nebeneinander sitzen und auf ihre
    schwarzen Bildschirme starren, auf denen endlose Zahlenkolonnen
    vorbeidefilieren, sagen sie: "Nur ein bisschen was
    ausprobieren". Um WLAN geht es da, um ein
    Daten&uuml;bertragungssystem per Funk, das nur Banken und
    gro&szlig;e Firmen haben und in das man "eigentlich nicht
    reinkommen sollte". Sagt Rubbel, der selbst bei einer
    Gro&szlig;en Bank arbeitet, Software f&uuml;r
    Auslands&uuml;berweisungen &uuml;berwacht und nat&uuml;rlich
    nicht im Traum daran denken w&uuml;rde, seine Hack-Kenntnisse
    im richtigen Leben anzuwenden. Hier wird bestenfalls mal der
    Code eines Computerspiels geknackt, um l&auml;stige
    Geb&uuml;hren zu sparen, v ersichern die beiden. "Man will ja
    sein Leben nicht in der Illegalit&auml;t verbringen." 

    <P><FONT size="+1"><B>Schnitzeljagd per E-Mails</B></FONT></P>
    Wo sind sie blo&szlig;, die hartgesottenen Hacker, die es
    irgendwo in diesem Camp geben soll, die aber die
    &Ouml;ffentlichkeit meiden wie lichtscheues Getier? Vielleicht
    geh&ouml;rt der junge Mann mit dem seltsam rasierten Kopf dazu,
    der stundenlang &uuml;ber einem Klapptisch sitzt und winzige
    Symbole auf ein Papier zeichnet? Oder der Typ mit dem
    bodenlagen Rock, der sich hinter einer dunklen Sonnenbrille
    versteckt? Oder die beiden blassen Jungs, die mit aufgeklappten
    Laptops durcj die Wiese irren? Immer wieder tippen sie
    Nachrichten in ihre Rechner, bis sie voreinander stehen. Die
    beiden kannten sich schon lange, aber nur aus dem Netz,
    erz&auml;hlen sie, jetzt haben sie mit einer Art
    E-Mail-Schnitzeljagd zueinander gefunden.<BR>
     Ein Zelt weiter kopieren Visigoth und Sneaker gerade
    Programme. Sie sind 20 Jahre alt, haben sich schon in der
    Grundschule ins Internet verabschiedet und bieten jetzt
    Baus&auml;tze f&uuml;r Antennen an. Nat&uuml;rlich werden die
    Kupferdr&auml;hte nur zum guten Zweck verwendet, etwa um
    Freunde auf dem Land zu vernetzen. "Wenn man b&ouml;se
    Absichten h&auml;tte, die man ja nicht hat, k&ouml;nnte man von
    der Stra&szlig;e aus auf Kosten anderer Leute ins Internet
    gehen", sagt Visigoth. Er ist mal "rein zuf&auml;llig" mit dem
    Auto durch die Stadt gefahren und ins offene Netz eines
    Steuerberaters geraten. Angeschaut hat er sich nicht, was da
    war. Hacker wollen knacken, Inhalte interessieren sie selten.
    Und mit dem Wissen &uuml;ber Sicherheitsl&uuml;cken im System
    eine Firma zu erpressen, das gilt hier als Tabu.<BR>
     &Uuml;berhaupt, es geht nicht um Profit,sagt Phil, der in der
    Properen Zeltburg der Schweizer haust und "Elektronik so weit
    wie m&ouml;glich ins Leben integrieren" will. Wenn er morgens
    aufsteht, l&auml;sst er sich automatisch die Tagesschau
    vorspielen und E-Mails vorlesen. Sein Handy sagt ihm dann, ob
    er W&auml;sche waschen muss, und wenn er nach zehn Stunden
    Bildschirmarbeit aus dem B&uuml;ro heimf&auml;hrt, um zu Hause
    weiter zu tippen, l&auml;uft im Rucksack der Laptop mit
    elektronischer Musik. Ein Wunder eigentlich, dass einer wie
    Phil in einem ganz normalen Zelt &uuml;bernachten kann. Aber
    vielleicht l&auml;sst der das Schlafen ja diesmal einfach
    ausfallen. Denn nachts, hei&szlig;t es, geht das Hacken erst
    richtig los.<BR>
     

    <DIV align="center">
      <IMG src="st_rolf1.jpg" width="62" height="58" border="0"
      alt="Hacker">
    </DIV>
    <HR>
    <IMG src="st_rolf1.gif" width="40" height="40" border="0" alt=
    "Burg" align="right" hspace="10"> von: &nbsp;<A href=
    "nuenninghoff.html">Rolf Nue. aus Wue.</A><BR>
    E-Mail:<A href=
    "mailto:093113563-0001@t-online.de">093113563-0001@t-online.de</A><BR>

    Homepage:<A href="http:\\www.rolfnuenninghoff.de">Rolf
    N&uuml;nninghoff</A> 
    <HR>
  </BODY>
</HTML>

