<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

    <TITLE>Woche des Sehens</TITLE>
  </HEAD>

  <BODY bgcolor="#FFFFFF" topmargin="0" leftmargin="0">
    <TABLE border="0" cellpadding="8" width="100%" summary="Seitenformat">
      <TR>
        <TD valign="top">
          <A href="st_stx.html"><B>zur&uuml;ck</B> zum Frame</A>
          <BR>
          <IMG src="st_wds00.gif" alt="Logo"><BR>
          <BR>
          <BR>

          <TABLE border="0" cellpadding="0" cellspacing="0" width="100%" summary="&Uuml;berschriften">
            <TR>
              <TD width="2%">&nbsp;</TD>

              <TD width="98%">
                <H1><A name="na"></A>Dokumentation 2002</H1>
              </TD>
            </TR>

            <TR>
              <TD width="6%" height="236">&nbsp;</TD>

              <TD width="94%" align="left" valign="top" class="titel">
                <TABLE width="100%" border="0" cellspacing="0" cellpadding="0">
                  <TR>
                    <TD width="4%" align="center" valign="top">
                    &nbsp;</TD>

                    <TD width="46%" align="left" valign="top">
                    Artikel:<BR>
                    <BR>
                    </TD>

                    <TD rowspan="3" align="left" valign="top" width="10%">&nbsp;</TD>

                    <TD rowspan="3" align="left" valign="top" width="40%">
                      <IMG src="st_wds2a.gif" width="17" height="20" alt="Downloadsymbol">
                      Download der Dokumentation:<BR>
                      <BR>

                      <TABLE width="100%" border="0" cellspacing="0" cellpadding="0">
                        <TR>
                          <TD width="11%" align="center" valign="top">&middot;</TD>

                          <TD width="89%" align="left" valign="top"><FONT color="#0000ff">als
                          PDF-File</FONT></TD>
                        </TR>

                        <TR>
                          <TD width="11%" align="center" valign="top">&middot;</TD>

                          <TD width="89%" align="left" valign="top"><FONT color="#0000ff">als
                          HTML-Seite</FONT><BR>
                          (in gek&uuml;rzter Fassung)<BR>
                          </TD>
                        </TR>
                      </TABLE>
                    </TD>
                  </TR>

                  <TR>
                    <TD width="4%" align="center" valign="top">
                    &middot;</TD>

                    <TD width="46%" align="left" valign="top">Erste bundesweite "Woche des
                    Sehens" endete 2002 mit Konzert von Corinna May</TD>
                  </TR>

                  <TR>
                    <TD width="4%" align="center" valign="top">
                    &middot;</TD>

                    <TD width="46%" align="left" valign="top">
                    Corinna May und Joachim Erwin lassen Jan Wellem "erblinden"</TD>
                  </TR>
                </TABLE>
                <BR>
                <BR>
                 <B>Erste bundesweite "Woche des Sehens" endete 2002 mit Konzert von Corinna
                 May&nbsp;</B> <BR>
                <B><BR>
                Abschlussveranstaltung auf dem K&ouml;lner Rudolfplatz mit bunter Mischung
                aus Musik und Information</B><BR>
                <BR>
                Die Probleme blinder Menschen im &ouml;ffent lichen Nah- und Fernverkehr
                standen im Mittelpunkt des Tages des wei&szlig;en

                <TABLE width="220" border="0" align="right"
                cellpadding="0" cellspacing="0">
                  <TR>
                    <TD colspan="2" align="center"><IMG src=
                    "st_wds2b.jpg" width="300" height="254"></TD>
                  </TR>

                  <TR>
                    <TD align="center" valign="middle" width="10">&nbsp; </TD>

                    <TD width="210" align="center" valign="middle">
                    <FONT size="1">Das Jahresmotiv der Woche des
                    Sehens im Premierenjahr 2002</FONT> </TD>
                  </TR>
                </TABLE>
                Stockes, der in diesem Jahr den offiziellen Abschlu&szlig; der Woche des
                Sehens bildete.&nbsp; Exemplarisch wurden vom Deutschen Blinden- und
                Sehbehindertenverband im K&ouml;lner Hauptbahnhof die neuralgischen Stellen
                vorgestellt.<BR> <BR>

                Am traditionellen Aktionstag der Blinden, dem "Tag des wei&szlig;en
                Stockes", endet am Dienstag, 15. Oktober 2002, die erste bundesweite "Woche
                des Sehens". Auf dem K&ouml;lner Rudolfplatz informierten die acht
                Partnerorganisationen umrahmt von einem attraktiven Musikprogramm &uuml;ber
                die Probleme Blinder und die M&ouml;glichkeiten zur Vermeidung von
                Blindheit.&nbsp;<BR> <BR>

                Stargast bei der Abschlu&szlig;veranstaltung in K&ouml;ln auf&nbsp; dem
                Rudolfplatz: S&auml;ngerin Corinna May. Mit ihrer ausgezeichneten Stimme
                konnte sie die Besucher&nbsp; auf dem Rudolfplatz begeistern. F&uuml;r die
                passende Musik sorgte u.a. auf dem Rudolfsplatz Liedermacher Clemens
                Bittlinger und Band. H&ouml;hepunkt war ein kostenloses Konzert der blinden
                Musikerin Corinna May. Parallel dazu testeten die Selbsthilfeorganisationen
                der Blinden den K&ouml;lner Hauptbahnhof auf seine Blindentauglichkeit und
                machten auf ihre Probleme bei der Nutzung &ouml;ffentlicher Verkehrsmittel
                aufmerksam. Dabei wurden 14 W&uuml;nsche an die Deutsche Bahn
                gerichtet.<BR> <BR>

                Das Hilfswerk der Deutschen Lions berichtete &uuml;ber ihr
                SIGHT-FIRST-Programm, mit dem u.a. Augenhospit&auml;ler in der Dritten Welt
                aufgebaut werden.&nbsp; Auch das Deutsche Komitee zur Verh&uuml;tung von
                Blindheit war mit einem Informationsstand in K&ouml;ln dabei und
                informierte &uuml;ber die Arbeit in Entwicklungsl&auml;ndern.<BR> <BR>

                Bundesweit fanden von Hamburg bis M&uuml;nchen und zwischen Greifswald und
                Aachen weit &uuml;ber 40 Aktionen in Rahmen der "Woche des Sehens" statt.
                Gestartet war die Aktionswoche mit der symbolischen Verh&uuml;llung der
                Augen des D&uuml;sseldorfer Stadtpatrons Jan Wellem am "Welttag des Sehens"
                (10. Oktober).&nbsp; Im Interview mit der bekannten WDR-Moderatorin&nbsp;
                Anke Bruns informierten Dr.Georg Mehrle und sein&nbsp; Kollege Dr. Martin
                Bresgen &uuml;ber die Arbeit des&nbsp; Berufsverbandes der Augen&auml;rzte
                und der Deutschen Ophthalmologischen Gesellschaft.<BR> <BR>

                Dabei wurden die drei Ziele der "Woche des Sehens" konkretisiert. Die
                Menschen sollen die Bedeutung guten Sehens erkennen, Ursachen von Blindheit
                verstehen und vorsichtiger mit ihrer Sehkraft umgehen.&nbsp; Michael Herbst
                vom Deutschen Verein der Blinden und Sehbehinderten im Studium und Beruf
                informierte &uuml;ber die Rehabiliationsm&ouml;glichkeiten blinder
                Menschen. Au&szlig;erdem soll das Verst&auml;ndnis f&uuml;r die rund
                155.000 Blinden und 500.000 Sehbehinderten in Deutschland und ihre Belange
                verbessert werden. Drittes Ziel war, &uuml;ber die Bek&auml;mpfung der
                Armutsblindheit in der Dritten Welt informieren.<BR> <BR>

                Nicht nur die Anzahl der Veranstaltungen, sondern auch die Kreativit&auml;t
                und Vielfalt der Aktionen &uuml;bertraf die Erwartungen der Initiatoren bei
                weitem, so dass f&uuml;r alle Beteiligten am Schlusstag eines bereits
                feststeht: Im n&auml;chsten Jahr wird es die zweite bundesweite "Woche des
                Sehens" geben.<BR> <BR> <BR>

                <B>Corinna May und Joachim Erwin lassen Jan Wellem "erblinden"</B><BR>
                <B><BR>

                Der gro&szlig;e Augenblick in D&uuml;sseldorf: Jan Wellem wird
                anl&auml;sslich des Welttages des Sehens symbolisch blind&nbsp;
                gemacht"</B><BR> <BR>

                <IMG src="st_wds2c.jpg" width="200" height="119" align="right" alt="">Mit
                einer symbolischen "Verh&uuml;llung" des Jan-Wellem-Denkmals auf dem
                Rathausplatz in D&uuml;sseldorf durch Corinna May und
                Oberb&uuml;rgermeister Joachim Erwin begann am Donnerstag, 10.Oktober die
                erste bundesweite "Woche des Sehens".&nbsp;<BR> <BR>

                <IMG src="st_wds2d.jpg" width="150" height="100" align="left" alt="">
                Aufmerksame Zuh&ouml;rer hatten Andreas Pruisken, D&uuml;sseldorfs
                Oberb&uuml;rgermeister Joachim Erwin und Corinna May auf dem
                D&uuml;sseldorfer Rathausplatz. Das D&uuml;sseldorfer Wahrzeichen wurde mit
                einer Augenbinde vor&uuml;bergehend "blind" gemacht, um somit auf die
                Bedeutung guter Sehf&auml;higkeit und die Ursachen von Blindheit aufmerksam
                zu machen.<BR> <BR>

                OB Erwin wies angesichts von weltweit 50 Millionen blinden Menschen auf die
                Bedeutung von gutem Sehverm&ouml;gen hin. Corinna May w&uuml;rdigte die
                Veranstaltung als einen wichtigen Beitrag, um Sehende auf die Probleme
                blinder Menschen im Alltag aufmerksam zu machen.<BR> <BR>

                Standen Rede und Antwort bei der Pressekonferenz: (v.l.) Corinna May,
                Stefan Diepenbrock, Moderator&nbsp; vom Zentralverband der Augenoptiker
                und&nbsp; Andreas Pruisken, Woche des Sehens Sprecher und&nbsp; Mitarbeiter
                der Christoffel-Blindenmission. Erstmalig haben sich acht Organisationen
                bzw. Verb&auml;nde, die sich mit diesen Themen befassen, zusammen gefunden,
                um wirkungsvoll ihre Ziele in der &Ouml;ffentlichkeit zu
                kommunizieren.&nbsp;<BR> <BR>

                Dicht umlagert waren die Informationsst&auml;nde der&nbsp; acht beteiligten
                Organisationen und Verb&auml;nde. Allein in Deutschland leben rund 155.000
                Blinde und etwa 500.000 Sehbehinderte. Schirmherr dieser
                Gemeinschaftsaktion ist Bundespr&auml;sident Johannes Rau. Die
                Er&ouml;ffnungsveranstaltung in D&uuml;sseldorf stand unter anderem im
                Zeichen der weltweiten Kampagne "Vision 2020 - das Recht auf
                Augenlicht".<BR>
                 
              </TD>
            </TR>
          </TABLE>

          <H3>zur&uuml;ck zum Beitrag <A href="st_wds.html"><B>Startseite</B></A><BR>
          zur&uuml;ck zum Beitrag <A href="st_wds0.html"><B>Aktuelles</B></A><BR>
          zur&uuml;ck zum Beitrag <A href="st_wds1.html"><B>Ratgeber</B></A></H3>
          <A href="st_stx.html"><B>zur&uuml;ck</B> zum Frame</A> 
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

