<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Ein` hab ich noch...
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="st_einnoch.jpg" alt="st_einnoch.jpg" width="432" height="96">
          </CENTER>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <P>
            Sagt die Mutter beim Zahnarzt zu ihrer Tochter: "Nun sag sch&ouml;n AAHH damit der liebe Onkel Doktor seine Finger aus deinem Mund nehmen kann..."
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            "Ursel komm, wir fliegen nach Ibiza, Urlaub machen!" - "Peter, das geht doch nicht. Denk doch an unsere Schulden!"<BR>
             "Auf Ibiza k&ouml;nnen wir das doch auch...!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Na, wie war`s in Norwegen? Hast du auch einen Fjord gesehen?" - "Klar, aber die Vieher sind ziemlich scheu!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Der Adel unter sich. "Unser Geschlecht k&ouml;nnen wir bis Barbarossa zur&uuml;ck verfolgen. Wie alt ist denn ihre Familie?" - "Keine Ahnung. Die Unterlagen sind w&auml;hrend der Sintflut
            verloren gegangen!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Albert: "An die Nordsee fahre ich nie wieder!" - "Warum?"<BR>
             "T&auml;glich sollte ich Kurtaxe zahlen, dabei bin ich nicht einmal mitgefahren!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Und," fragt der Chef den neuen Mitarbeiter "wie sieht es denn mit Fremdsprachen aus?"<BR>
             "Ausgezeichnet. Au&szlig;er Deutsch sind mir alle Sprachen fremd!"<BR>
          </P>
          <HR align="center" width="100%">
          <BR>

          <P>
            Fragt ein Reporter eine f&uuml;r ihre Aff&auml;ren bekannte S&auml;ngerin: "Lieben sie Lessing?" - Haucht diese: "Schreiben Sie, dass wir nur gute Freunde sind."
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Als die F&auml;hre sinkt, rennt alles zu den Rettungsbooten. Da dr&auml;ngelt sich ein Mann nach vorne. Ruft der K&auml;pt`n: "Halt, wir nehmen erst die Frauen!"<BR>
             Sagt der Mann erstaunt: "Naja, wenn daf&uuml;r noch Zeit ist!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Die Mutter beim Mittagessen zu ihrem Sohn: "In ein paar Jahren wirst du einem M&auml;dchen bestimmt erz&auml;hlen, wie klasse deine Mutter kochen konnte. Jetzt ess gef&auml;lligst auf!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Eine Blondiene geht mit einer Angel und einem Eispickel bewaffnet &uuml;ber eine Eisfl&auml;che. Sie schl&auml;gt ein Loch in das Eis und h&auml;lt die Angelschnur in das Loch. Da
            ert&ouml;nt eine Stimme: "Da unten gibt es keine Fische!" - Die Blondiene: "Gott, bist du es?"<BR>
             "Nein," poltert die Stimme, "ich bin der Hausmeister in diesem Eisstadion!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Tag der Herr, ich bin der Klavierstimmer!" - "Aber ich sie doch nicht bestellt!"<BR>
             "Sie nicht, aber ihre Nachbarn."<BR>
          </P>
          <HR align="center" width="100%">
          <BR>

          <P>
            Die Frau zu ihrem Mann: "Heute Nachmittag mu&szlig; ich zum Friseur. Da gehe ich mit Grauen hin!"<BR>
             Ihr Mann: "So wie ich dich kenn, kommst du mit Blonden wieder..."<BR>
            <BR>
          </P>
          <HR align="center" width="100%">
          <BR>

          <P>
            Sagt der Patient nach der Blinddarm-OP zum Arzt: "Ich hoffe das sie mir nicht meine Stimme besch&auml;digt haben!"<BR>
             Darauf der Arzt: "Wieso denn ihre Stimme? Die ist doch im Hals!" - "Ja schon, aber ich bin Bauchredner!"
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            Albert geht in ein Lokal und setzt sich an einen Tisch. Dann packt er sein Br&ouml;tchen aus und bei&szlig;t mit Appetit davon ab. Kommt der Kellner und schimpft: "So nicht, sie
            m&uuml;ssen etwas bestellen!" - "Nagut," sagt Albert, "dann bestellen sie dem Koch einen sch&ouml;nen Gru&szlig;!"
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            "Hallo, sie da mit dem Cadillac!", ruft ein Polizist einem Mann hinterher, "ihr Auto verliert Oel!" - Sagt der Mann zum Polizisten: "Ein Cadillac verliert kein Oel, ein Cadillac markiert
            sein Revier!"
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            "Du siehst ja gar nicht gut aus mit der neuen Brille!" - "Ich habe doch keine Brille!" - "Aber ich!"
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            Fahren drei Programmierer im Sommer mit einem Auto zur Arbeit. Pl&ouml;tzlich ruckt der Motor und f&auml;llt dann aus. "Mist!" sagt der erste. "Das mu&szlig; ein Fehler im Betriebssystem
            sein!" sagt der zweite. Meint der dritte: "La&szlig;t uns alle Fenster schlie&szlig;en und einen Neustart versuchen..."
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            Nach den Ferien kommt Maria wieder in die Klasse und sagt: "Na, bin ich nicht sch&ouml;n braun geworden?" - Sagt eine Mitsch&uuml;lerin: "Ja, aber die hellste warst du ja noch nie!"
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            Der Sohn zur Mutter: "Wie hei&szlig;en denn diese Blumen dort?" - "Chrysanthemen!"<BR>
             "Wie schreibt man denn Chrysanthemen?" - "Ich glaube, das sind Nelken!"
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            Ein Feriengast steht am Strand und fragt einen Einheimischen: "Gib`s hier im Wasser See-Igel, Feuerquallen und so`n Zeug?" - "N&ouml;, hier ist alles sauber. Die Haie fressen alles wech!"
          </P>
          <BR>
          <HR align="center" width="100%">
          <BR>
          <P>
            In einem Hotel in den Alpen sagt der Feriengast zum Ober: "Warum bekomme ich den G&auml;nsebraten gleich doppelt?" - Sagt der Ober: "Bl&ouml;des Echo!"
          </P>
          <BR>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <CENTER>
            <IMG src="mitglieder/jojo.jpg" alt="JoJo" width="212" height="50"><BR>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

