<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Woche des Sehens</TITLE>
  </HEAD>

  <BODY bgcolor="#FFFFFF" topmargin="0" leftmargin="0">
    <TABLE border="0" cellpadding="8" width="100%" summary=
    "Seitenformat">
      <TR>
        <TD valign="top">
          <A href="st_stx.html"><B>zur&uuml;ck</B> zum Frame</A>
          <BR>
          <IMG src="st_wds00.gif" alt="Logo"><BR>
          <BR>
          <BR>
           

          <TABLE border="0" cellpadding="0" cellspacing="0" width=
          "100%" summary="&Uuml;berschriften">
            <TR>
              <TD width="2%">&nbsp;</TD>

              <TD width="98%">
                <H1><A name="na"></A>Aktuelles</H1>
              </TD>
            </TR>

            <TR>
              <TD>&nbsp;</TD>

              <TD><B>&bull; <A href="#lb">DBSV-Pr&auml;sident Lubnau: "Blindengeld ist
              Voraussetzung f&uuml;r Integration"</A></B><BR>
              <B>&bull; <A href="#ko">Keine Objekte der F&uuml;rsorge wieder
              werden</A></B><BR>
              <B>&bull; <A href="#dv">Mehr als doppelt so viele Veranstaltungen wie im
              Startjahr</A></B><BR>
              <B>&bull; <A href="#au">&Uuml;ber 1.000 Augenoptiker aktiv
              dabei</A></B><BR>
              <B>&bull; <A href="#ak">Woche des Sehens offiziell durch Anja Kruse
              er&ouml;ffnet</A></B><BR>
              <B>&bull; <A href="#pa">Eine Prominente, die durch ihre Authentizit&auml;t
              &uuml;berzeugte</A></B><BR>
              <B>&bull; <A href="#vo">VISION 2020 - das Recht auf Augenlicht</A></B><BR>
              <B>&bull; <A href="#dg">Dresdner Grundschulen er&ouml;ffnen Einblick in die
              Welt der Blinden</A></B><BR>
              <B>&bull; <A href="#gb">Gro&szlig;e Beteiligung an der Woche des
              Sehens</A></B><BR>
              <B>&bull; <A href="#wz">Wieczorek-Zeul: Nur gemeinsam kann Blindheit
              bek&auml;mpft werden</A></B> <BR>
              <B>&bull; <A href="#vi">Ein Schwerpunkt ist VISION 2020</A></B><BR>
              <B>&bull; <A href="#gs">Grauer Star - weltweit h&auml;ufigste Ursache
              f&uuml;r Blindheit</A></B><BR>
              <B>&bull; <A href="#dr">Woche des Sehens beginnt am Donnerstag in Dresden
              und endet am 15. Oktober in Berlin</A></B><BR>
              <B>&bull; <A href="#BP">Bundepr&auml;sident Johannes Rau &uuml;bernimmt
              erneut Schirmherrschaft</A></B><BR>
              <B>&bull; <A href="#WT">Vom Welttag des Sehens zum Tag des Wei&szlig;en
              Stocks</A></B><BR>
              <B>&bull; <A href="#sr">Schwerpunkt-Region 2003: die neuen
              Bundesl&auml;nder</A></B></TD>
            </TR>
          </TABLE>
        </TD>
      </TR>

      <TR>
        <TD>
          <H3><B>DBSV-Pr&auml;sident Lubnau: "Blindengeld ist Voraussetzung f&uuml;r
          Integration"</B></H3> <BR>
                     

          <P><B>Aktionswoche unter dem Motto "Blindheit verstehen, Blindheit
          verh&uuml;ten" nachbundesweit &uuml;ber 80 Veranstaltungen in Berlin
          beendet</B></P>

          <P><IMG src="st_wds1a.jpg" width="319" height="212" align="right"
          alt="Blindenstock">Mit einer Protestaktion und einer Lesung f&uuml;r Blinde
          ist die "Woche des Sehens" in Berlin am Tag des wei&szlig;en Stockes, dem
          Aktionstag der Blinden (15.10.), offiziell beendet worden. Dabei stand rund
          um die Kaiser-Wilhelm-Ged&auml;chtniskirche in Berlin alles im Zeichen der
          Blindheit.</P>

          <P>Schon am Vormittag versammelten sich zahlreiche Blinde, um gegen die vom
          Berliner Senat geplante K&uuml;rzung des Blindengeldes zu protestieren.
          Mittags las Gudrun Landgrebe vor blinden Besuchern, bevor an Computern
          dargestellt wurde, wie Blinde im Internet surfen.</P>

          <P>Vor der Kirche konnten sich Passanten auf einem bunten Info-Markt
          &uuml;ber die Angebote der Partnerorganisationen informieren: Vom Sehtest
          der Augenoptiker &uuml;ber Glaukom-Beratung der Augen&auml;rzte und
          Informationen der Blindenverb&auml;nde bis zum Erlebnisgang der
          Christoffel-Blindenmission, in dem Sehende die t&auml;glichen Probleme
          Blinder nachempfinden k&ouml;nnen.<BR>
          <A href="#na">nach oben</A></P>
          <BR clear="all">
          <A name="ko"></A>

          <P><B>Keine Objekte der F&uuml;rsorge wieder werden</B><BR>
          Thematisch bestimmt wurde der diesj&auml;hrige Tag des wei&szlig;en Stockes
          durch die Pl&auml;ne einiger Landesregierungen, das Blindengeld drastisch
          zu k&uuml;rzen. Der selbst blinde Pr&auml;sident des Deutschen Blinden- und
          Sehbehindertenverbandes J&uuml;rgen Lubnau dazu: "Blinde haben wegen ihrer
          Behinderung einen finanziellen Mehraufwand. Sie m&uuml;ssen sich
          beispielsweise Post vorlesen oder in Blindenschrift &uuml;bertragen lassen.
          Sie brauchen besondere Software und zus&auml;tzliche Hilfsmittel, um am
          Computer arbeiten zu k&ouml;nnen. Diese Mehrkosten, die Voraussetzung zur
          Integration in die Gesellschaft sind, wurden seit vier Jahrzehnten durch
          das Blindengeld ausgeglichen. Wir werden nicht zulassen, dass wir in die
          Zeit zur&uuml;ckfallen, als Blinde reine Objekte der F&uuml;rsorge
          waren!"<BR>
          <A href="#na">nach oben</A></P>
          <A name="dv"></A> 

          <P><B>Mehr als doppelt so viele Veranstaltungen wie im Startjahr</B><BR>
          Seit dem "Welttag des Sehens" am 9. Oktober hatten neun Organisationen und
          Verb&auml;nde mit bundesweit &uuml;ber 80 Veranstaltungen unter dem Motto
          "Blindheit verh&uuml;ten, Blindheit verstehen" auf die M&ouml;glichkeiten
          zur Verh&uuml;tung von Blindheit in den Entwicklungsl&auml;ndern und die
          Belange der Blinden in Deutschland aufmerksam gemacht. Damit konnte die
          Zahl der Aktionen gegen&uuml;ber dem Startjahr 2002 mehr als verdoppelt
          werden.<BR>
          <A href="#na">nach oben</A></P>
          <A name="au"></A> 

          <P><IMG src="st_wds1b.jpg" width="319" height="212" alt= "Gudrun Landrebe"
          align="right"> <B>&Uuml;ber 1.000 Augenoptiker aktiv dabei</B><BR> Auch die
          Zahl der teilnehmenden Augenoptiker stieg deutlich an. Nach 600 im
          vergangenen Jahr nahmen dieses Jahr &uuml;ber 1.000 Handwerker des guten
          Sehens teil. Schirmherr war zum zweiten Mal Bundespr&auml;sident Johannes
          Rau. Weitere prominente Unterst&uuml;tzer waren unter anderem die
          Bundesministerin Heidemarie Wieczorek-Zeul, die Ministerpr&auml;sidenten
          Dieter Althaus und Wolfgang B&ouml;hmer sowie die Schauspielerinnen Anja
          Kruse und Gudrun Landgrebe.Die Woche des Sehens ist eine gemeinsame Aktion
          vom Deutschen Blinden- und Sehbehindertenverband, dem Deutschen Verein der
          Blinden und Sehbehinderten in Studium und Beruf, der Pro Retina
          Deutschland, dem Berufsverband der Augen&auml;rzte, der Deutschen
          Ophthalmologischen Gesellschaft, dem Zentralverband der Augenoptiker, der
          Christoffel-Blindenmission, dem Deutschen Komitee zur Verh&uuml;tung von
          Blindheit und dem Hilfswerk der Deutschen Lions.<BR>
          <A href="#na">nach oben</A></P>
          <BR clear="all">
          <A name="ak"></A>

          <H3><B>Woche des Sehens offiziell durch Anja Kruse er&ouml;ffnet</B></H3>

          <P><IMG src="st_wds1c.jpg" width="319" height="266" align="right" alt="Anja
          Kruse"> Mit der symbolischen Verh&uuml;llung der
          K&ouml;nig-Johann-Reiterstatue vor der Semperoper in Dresden ist die zweite
          bundesweite Woche des Sehens am Donnerstag (9.) offiziell gestartet.
          Aufmerksam verfolgten zahlreiche Passanten und etwa 80 Kinder aus Dresdner
          Grundschulen, wie die bekannte Schauspielerin Anja Kruse zusammen mit dem
          Sprecher der Woche-des-Sehens, Andreas Pruisken, in einem Hubwagen in
          luftige H&ouml;hen transportiert wurden. Die Schauspielerin verband vor
          zahlreichen Vertretern von TV, Presseagenturen, Rundfunk und Tageszeitungen
          die Augen von K&ouml;nig Johann. Auf der gro&szlig;en Binde stand "Woche
          des Sehens".<BR>
          <A href="#na">nach oben</A></P>
          <A name="pa"></A> 

          <P><B>Eine Prominente, die durch ihre Authentizit&auml;t
          &uuml;berzeugte</B><BR>
          Anja Kruse ist eine Prominente, die authentisch und aus eigener Erfahrung
          berichten konnte: Im vergangenen Jahr war sie selbst Augenzeugin, wie in
          einem von der Christoffel-Blindenmission gef&ouml;rderten Hospital
          Menschen, die am Grauen Star erblindet sind, nach einer Operation wieder
          sehend nach Hause gehen k&ouml;nnen Gerne erinnert sie sich an den Moment,
          als dem Jungen, den sie in den OP begleitet hatte, der Augenverband
          abgenommen wurde und er wieder sehen konnte.<BR> <A href="#na">nach
          oben</A></P>
          <BR clear="all">
          <A name="vo"></A>

          <P><B>VISION 2020 - das Recht auf Augenlicht</B><BR>
          Weitere prominente G&auml;ste und Redner beim offiziellen Startschuss waren
          Staatssekret&auml;r Dr. Albin Nees und die Vertreter der beteiligten
          Woche-des-Sehens-Partner, die auf einem bunten Info-Markt vor der
          Semperoper &uuml;ber ihre Angebote informierten: Vom Sehtest der
          Augenoptiker &uuml;ber Glaukom-Beratung der Augen&auml;rzte bis hin zu
          Infos der Blindenverb&auml;nde und dem Hilfsprogramm "SightFirst" des
          Hilfswerks der Deutschen Lions.<BR>
          <A href="#na">nach oben</A></P>
          <A name="dg"></A> 

          <P><IMG src="st_wds1d.jpg" width="214" height="318" align="right" alt="Anja
          Kruse"> <B>Dresdner Grundschulen er&ouml;ffnen Einblick in die Welt der
          Blinden</B><BR> Zweiter H&ouml;hepunkt war die Pr&auml;mierung des
          Sch&uuml;lerwettbewerbs "Schau mal" durch den Dresdner OB Ingolf Rossberg
          und Andreas Pruisken. Der erste Preis, ein Klassenausflug in einen
          Freizeitpark, ging an die 117. Grundschule in Dresden. Die Kinder
          erarbeiteten eine Ausstellung zum Thema "Sehen und Blindheit in Deutschland
          und in Entwicklungsl&auml;ndern". Weitere Preise gingen u. a. an die 19.
          und die 77. Grundschule. Fachlich begleitet wurde der Wettbewerb von
          Mitarbeitern des Blinden-und-Sehbehinderten-Verbandes Sachsen und der
          Christoffel-Blindenmission.<BR>
          <A href="#na">nach oben</A></P>
          <A name="gb"></A> 

          <P><B>Gro&szlig;e Beteiligung an der Woche des Sehens</B><BR>
          Die Woche des Sehens beginnt stets mit dem Welttag des Sehens, der in
          diesem Jahr auf den 9. Oktober fiel und an dem auf die weltweite Kampagne
          "VISION 2020 &ndash; das Recht auf Augenlicht" aufmerksam gemacht wird.
          Offizielles Ende ist am Tag des wei&szlig;en Stocks, dem j&auml;hrlich am
          15. Oktober weltweit begangenen Aktionstag der Blinden. Die zentrale
          Abschlussveranstaltung der Woche des Sehens wird an diesem Tag rund um die
          Ruine der Kaiser-Wilhelm-Ged&auml;chtniskirche in Berlin stattfinden. Die
          Woche des Sehens lebt vorallem durch die vielen regionalen Veranstaltungen
          in Augenkliniken, Augenoptikergesch&auml;ften, Innenst&auml;dten und
          Berufsf&ouml;rderungswerken in allen Bundesl&auml;ndern. Dort erwartet die
          Besucher ein buntes Programm rund um das Motto der Woche des Sehens:
          Blindheit verstehen. Blindheit verh&uuml;ten.<BR>
          <A href="#na">nach oben</A></P>
          <BR clear="all">
           

          <P><A name="wz"></A></P>

          <H3><B>Wieczorek-Zeul: Nur gemeinsam kann Blindheit bek&auml;mpft
          werden</B></H3>

          <P><IMG src="st_wds1e.jpg" width="140" height="206" align="right"
          alt="Wieczorek-Zeul"> BERLIN. Alle f&uuml;nf Sekunden erblindet ein Mensch
          in den Entwicklungsl&auml;ndern. Diese Tatsache muss nach Einsch&auml;tzung
          von Entwicklungsministerin Heidemarie Wieczorek-Zeul dazu f&uuml;hren, dass
          alle Anstrengungen geb&uuml;ndelt werden, um diese dramatische Situation zu
          ver&auml;ndern.</P>

          <P>Die Ministerin begr&uuml;&szlig;t daher Initiativen wie das
          Aktionsb&uuml;ndnis "Woche des Sehens", in dem sich neun Partner
          (Blindenverb&auml;nde, Augen&auml;rzte, Augenoptiker und
          Hilfsorganisationen) unter dem Motto "Blindheit verstehen, Blindheit
          verh&uuml;ten" f&uuml;r augenkranke und blinde Menschen in Deutschland
          sowie in den Entwicklungsl&auml;ndern einsetzen.<BR>
          <A href="#na">nach oben</A></P>
          <A name="vi"></A> 

          <P><B>Ein Schwerpunkt ist VISION 2020</B><BR>
          Ein Schwerpunkt der Woche des Sehens ist das Aktionsprogramm "VISION 2020 -
          das Recht auf Augenlicht". Ziel dieser Kampagne ist es, bis zum Jahr 2020
          in Asien, Afrika und Lateinamerika die heilbare und vermeidbare Blindheit
          weltweit zu &uuml;berwinden. Ohne die Tr&auml;ger der Woche des Sehens, wie
          die Christoffel-Blindenmission (CBM) oder das Hilfswerk der Deutschen
          Lions, so die Ministerin vor der Presse in Berlin, h&auml;tte VISION 2020
          wenig Aussicht auf Erfolg. "Wenn VISION 2020 nicht umgesetzt wird, steigt
          die Zahl der Blinden bis zum Jahr 2020 von derzeit 45 bis 50 Millionen auf
          &uuml;ber 70 Millionen an", erkl&auml;rte dazu Martin Georgi, Direktor der
          Christoffel-Blindenmission.<BR>
          <A href="#na">nach oben</A></P>
          <A name="gs"></A> 

          <P><B>Grauer Star - weltweit h&auml;ufigste Ursache f&uuml;r
          Blindheit</B><BR>
          In den von den CBM-gef&ouml;rderten Augenkliniken wurden seit Mitte der
          sechziger Jahre bereits mehr als 5 Millionen Operationen am Grauen Star
          durchgef&uuml;hrt. Der Graue Star ist die weltweit h&auml;ufigste Ursache
          f&uuml;r Blindheit.</P>

          <P>Eine der konkreten M&ouml;glichkeiten in den Armutsl&auml;ndern vor Ort
          zu helfen, ist etwa die Partnerschaft von der Universit&auml;ts-Augenklinik
          in Dresden und dem landesweiten Blindheitsverh&uuml;tungsprogramm in
          Ruanda. Schwerpunkt dieser Partnerschaft ist laut Prof. Dr. Lutz E.
          Pillunat (Dresden) die Ausbildung einheimischer Augen&auml;rzte, denn in
          Afrika ist die augen&auml;rztliche Versorgung weitgehend nicht gegeben: Im
          Durchschnitt m&uuml;sste ein Augenarzt eine Million Menschen versorgen.<BR>
          <A href="#na">nach oben</A></P>
          <A name="dr"></A> 

          <P><B>Woche des Sehens beginnt am Donnerstag in Dresden und endet am 15.
          Oktober in Berlin</B><BR>
          Die am Donnerstag in Dresden offiziell beginnende Woche des Sehens
          verbindet zwei internationale Aktionstage: Den Welttag der Sehens, der am
          9. Oktober auf die Kampagne VISION 2020 aufmerksam macht, und den Tag des
          Wei&szlig;en Stocks, an dem seit &uuml;ber 30 Jahren traditionell am 15.
          Oktober die Blinden weltweit auf ihre Belange aufmerksam machen.</P>

          <P>Helga Neumann vom Pr&auml;sidium des Deutschen Blinden- und
          Sehbehindertenverbandes (DBSV) nannte als Schwerpunkt f&uuml;r dieses Jahr
          die Mediennutzung Blinder. Unter dem Motto "Lesen, Fernsehen, Surfen im
          Internet &ndash; k&ouml;nnen Blinde auch!?" werden die Blindenverb&auml;nde
          die Punktschrift, H&ouml;rfilme und spezielle Software f&uuml;r die Nutzung
          des Internets der &Ouml;ffentlichkeit vorstellen.</P>

          <P>Bei der zweiten Auflage der Woche des Sehens, die wieder unter der
          Schirmherrschaft von Bundespr&auml;sident Johannes Rau steht, gibt es mit
          80 Veranstaltungen mehr als doppelt so viele wie im ersten Jahr.
          Schwerpunktregion sind die neuen Bundesl&auml;nder mit Aktionen in Dresden,
          Magdeburg, Erfurt, Schwerin, Potsdam und Berlin.<BR>
          <A href="#na">nach oben</A></P>
          <BR clear="all">
          <A name="BP"></A>

          <H3><B>Bundespr&auml;sident Johannes Rau &uuml;bernimmt erneut
          Schirmherrschaft</B></H3>

          <P><IMG src="st_wds1f.jpg" width="200" height="246" alt= "Johannes Rau"
          align="right">Gutes Sehen ist nicht selbstverst&auml;ndlich. H&auml;ufig
          f&auml;llt das erst auf, wenn die eigene Sehleistung nachl&auml;sst oder
          sogar Erblindung droht. Um der &Ouml;ffentlichkeit die Bedeutung von gutem
          Sehverm&ouml;gen und die Ursachen von Blindheit n&auml;her zu bringen,
          findet vom 9. bis 15. Oktober 2003 unter der Schirmherrschaft von
          Bundespr&auml;sident Johannes Rau die zweite bundesweite &quot;Woche des
          Sehens&quot; statt.</P>

          <P>Tr&auml;ger ist eine gro&szlig;e Koalition aus Verb&auml;nden,
          Selbsthilfegruppen und international t&auml;tigen Hilfswerken, die sich
          daf&uuml;r einsetzt,</P>

          <BLOCKQUOTE>
            &middot; dass in Deutschland und der &quot;Dritten Welt&quot;
            Verh&uuml;tung und Heilung von Augenerkrankungen und Blindheit mehr
            beachtet werden: Blindheit verh&uuml;ten.<BR>
            &middot; dass den Mitmenschen, denen die Medizin nicht mehr helfen kann,
            mit R&uuml;cksicht, Einsicht und Hilfe ein gleichberechtigter Alltag
            erm&ouml;glicht wird: Blindheit verstehen.
          </BLOCKQUOTE>
          <A href="#na">nach oben</A><BR>
          <BR>
          <BR clear="all">
           <A name="WT"></A> 

          <P><B>Vom Welttag des Sehens bis zum Tag des Wei&szlig;en Stocks</B><BR>
          Die Woche des Sehens verbindet zwei internationale Aktionstage: Den Welttag
          des Sehens am 9. Oktober und den Tag des Wei&szlig;en Stocks, der seit
          &uuml;ber 30 Jahren traditionell am 15. Oktober stattfindet.</P>

          <P>Der Welttag des Sehens macht j&auml;hrlich auf das weltweite
          Aktionsprogramm &quot;VISION 2020 - das Recht auf Augenlicht&quot;
          aufmerksam. Ziel dieser Kampagne ist es, bis zum Jahr 2020 die heilbare und
          vermeidbare Blindheit zu &uuml;berwinden. Weltweit gibt es derzeit rund 50
          Millionen blinde Menschen.</P>

          <P>Am Tag des Wei&szlig;en Stocks wird weltweit auf die Belange Blinder
          f&uuml;r ein selbstst&auml;ndiges Leben in unserer Gesellschaft
          hingewiesen. Unter dem Motto &quot;Fernsehen, Lesen, Surfen im Internet
          -k&ouml;nnen Blinde auch?!&quot; werden die 155.000 Blinden in Deutschland
          dieses Jahr der &Ouml;ffentlichkeit H&ouml;rfilme vorstellen, die
          Blindenschrift erl&auml;utern und vorf&uuml;hren, wie Blinde das Internet
          nutzen.</P>

          <P>In Deutschland ist wieder eine Vielzahl von Veranstaltungen geplant.
          Angeboten werden unter anderem:</P>

          <BLOCKQUOTE>
            &middot; Informationsst&auml;nde in
            Fu&szlig;g&auml;ngerzonen<BR>
            &middot; Tage der offenen T&uuml;r in Augenkliniken und
            Berufsf&ouml;rderungswerken<BR>
            &middot; Leser-Telefonaktionen mit Tageszeitungen<BR>
            &middot; Fach- und Patientensymposien
          </BLOCKQUOTE>
          <A href="#na">nach oben</A><BR>
          <BR>
           <A name="SR"></A> 

          <P><IMG src="st_wds1g.jpg" width="200" height="119" align="right"
          alt="letztes Jahr"> <B>Schwerpunkt-Region 2003: die Neuen
          Bundesl&auml;nder</B><BR>
          <FONT color="#0000ff"><BR>
          <B>Auftakt in Dresden</B></FONT><BR>
          Zum Auftakt - am Welttag des Sehens (9. Oktober) - soll das
          K&ouml;nig-Johann-Denkmal auf dem Theaterplatz vor der Semper-Oper in
          Dresden mit prominenter Unterst&uuml;tzung symbolisch blind gemacht werden.
          Nach M&uuml;nchen und D&uuml;sseldorf (siehe Bild) ist dies die dritte
          Verh&uuml;llungsaktion am Welttag des Sehens.</P>

          <P>Danach geht die Woche des Sehens mit Infost&auml;nden und dem
          Erlebnisgang der Christoffel-Blindenmission auf Tournee (dabei kann man in
          drei Minuten erfahren, welche Probleme blinde Menschen bew&auml;ltigen
          m&uuml;ssen):</P>

          <TABLE width="100%" border="0" cellspacing="0" cellpadding="0" summary="">
            <TR>
              <TD>&nbsp;</TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Dresden</FONT><BR>
              <BR>
               </TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">9. Oktober</FONT></TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Theaterplatz</FONT></TD>
            </TR>

            <TR>
              <TD width="7%">&nbsp;</TD>

              <TD width="25%" align="left" valign="top"><FONT
              color="#0000ff">Erfurt</FONT><BR>
              <BR>
               </TD>

              <TD width="18%" align="left" valign="top"><FONT
              color="#0000ff">10.Oktober</FONT></TD>

              <TD width="50%" align="left" valign="top"><FONT
              color="#0000ff">Anger</FONT></TD>
            </TR>

            <TR>
              <TD>&nbsp;</TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Magdeburg</FONT><BR>
              <BR>
               </TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">11.Oktober</FONT></TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Ulrichplatz</FONT></TD>
            </TR>

            <TR>
              <TD>&nbsp;</TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Schwerin<BR>
              <BR>
              </FONT></TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">13.Oktober</FONT></TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Markt</FONT></TD>
            </TR>

            <TR>
              <TD>&nbsp;</TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Potsdam</FONT></TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">14.Oktober</FONT></TD>

              <TD align="left" valign="top"><FONT color=
              "#0000ff">Brandenburger Tor</FONT></TD>
            </TR>
          </TABLE>
          <BR>
          <B>Abschluss in Berlin</B><BR>
          Zum Abschluss der Woche - am &quot;Tag des Wei&szlig;en Stocks&quot; (15.
          Oktober) - soll vor der Kaiser-Wilhelm-Ged&auml;chtniskirche in Berlin mit
          prominenter Unterst&uuml;tzung vorgef&uuml;hrt werden, wie Blinde das
          Internet nutzen.<BR>
          <A href="#na">nach oben</A> <BR>
          <BR>

          <FONT color="#0000ff"><IMG src="st_wds1h.jpg" alt= "Logo Aktion Mensch"
          width="133" height="57" border= "0"></FONT>

          <H3>zur&uuml;ck zum Beitrag <A href="st_wds.html"><B>Startseite</B></A><BR>
          weiter zum Beitrag <A href="st_wds1.html"><B>Ratgeber</B></A><BR>
          weiter zum Beitrag <A href="st_wds2.html"><B>Dokumentation 2002</B></A></H3>
          <A href="st_stx.html"><B>zur&uuml;ck</B> zum Frame</A> 
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

