<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt 
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke" 
zusammengefasst. 

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@gmx.de


1. Erfahrungsbericht: Internetprovider Inetservice (von Michael Schaub)

»Inetservice


oder


Provider, die man sich besser nicht antun sollte!


Also, ich habe ja schon manche Provider kennengelernt, aber solch einen
chaotischen Verein h&auml;tte ich mir in meinen k&uuml;hnsten Tr&auml;umen nicht
vorzustellen vermagt.
Alles fing im Februar 1999 an. Ich las die Werbung von Inetservice:

          "Nur 5.-- DM Grundgeb&uuml;hr"
          "Ab 3 Pfennig pro Minute"
          "5 E-Mail Adressen      "
          "reichlich Newsgroups   "
          "...                    "

H&ouml;rte sich ja alles ganz vielversprechend an. Ich rief daher bei der
angegebenen Hotline an, wo ich nach Stunden auch mal jemanden erreichte.
Ich bat um ein Anmeldeformular, welches man mir umgehend zuschicken wollte.
Anfang April wartete ich immer noch auf das Formular, so da&szlig; ich mich
zu einem weiteren Anruf entschlo&szlig;. Nach einem "ups, das haben wir wohl
vergessen" bekam ich prompt ein Formular per Fax geschickt, welches ich
dann umgehend ausgef&uuml;llt zur&uuml;ckschickte. 
Nun r&uuml;ckte der 14.04.1999 (der Tag, an dem Inetservice ans Netz gehen
sollte) langsam n&auml;her und ich hatte noch immer keine Zugangsdaten
bekommen. Am 13.04.1999 rief ich also wieder einmal diese Hotline an,
und man erz&auml;hlte mir etwas von Problemen im Postversand. Zumindest bekam
ich nun m&uuml;ndlich die n&ouml;tigen Angaben. (Das Schriftliche kam auch ein
paar Tage sp&auml;ter).
Tags darauf wollte ich mich nun fr&ouml;hlich einloggen und ... nichts
passierte. Diese technischen Probleme waren gl&uuml;cklicherweise ein paar
Tage sp&auml;ter behoben worden und der Weg in das WWW war frei.
Aber was war mit den versprochenen Newsgroups? Nichts! Ein Anruf bei der 
Hotline brachte zumindest etwas Hoffnung. Wieder sprach man von
technischen Problemen, die aber in 2 - 3 Wochen behoben sein. Naja,
diese Frist wurde dann regelm&auml;&szlig;ig wieder verschoben; mal waren es
Softwareprobleme, mal welche mit der Hardware und bis heute (Mitte
Oktober) gibt es noch immer keinen Zugriff auf irgendwelche Newsgroups.
Irgendein Entgegenkommen f&uuml;r diese fehlende versprochene Leistung wurde
aber kategorisch ausgeschlossen.
Thema Rechnung:
Eine monatliche Rechnung wurde mir versprochen. Es verging der April,
der Mai zog ins Land und auch der Juni ging vorr&uuml;ber, aber keine
Rechnung kam. Ein Anruf bei der Hotline best&auml;tigte meine Bef&uuml;rchtung:
technische Probleme, die aber in K&uuml;rze behoben sein sollten. Diese K&uuml;rze
zog sich dann bis Mitte September hin, als auf einmal die Rechnungen f&uuml;r
April bis Juni in der Briefpost waren. Zu ersehen war die Gesamtsumme mit
einem Hinweis, da&szlig; die Einzelverbindungs&uuml;bersicht (EV&Uuml;) im Internet
einsehbar sei. Alle weiteren Rechnungen w&uuml;rden per E-Mail erfolgen.
Ich verglich die Rechnungssumme mit dem Betrag, den meine Software 
mir ausrechnete und mu&szlig;te feststellen, da&szlig; sich eine Differenz
von ann&auml;hernd 50% ergab, zu meine Lasten. Ich machte mir also die M&uuml;he,
die EV&Uuml;s von der Providerhomapage herunterzuladen und alles
nachzurechnen. Die Summe, die sich aus den EV&Uuml;s ergab best&auml;tigte das
Ergebnis, welches mir mein Computer berechnet hatte. Ich rief also mal
wieder die Hotline (24Pf/Min.) an und reklamierte die Rechnung.
Man sagte mir auch prompt, das man das technische Problem bei der
Rechnungserstellung schon bemerkt habe und die Rechnungen korrigieren
w&uuml;rde. Ebenfalls wurde mir zugesichert, den falschen Betrag nicht von
meinem Konto abzubuchen.
Tags darauf sah ich meine Kontoausz&uuml;ge und stellte fest, da&szlig; falsche
Betrag doch abgebucht worden war. Der obligatorische Anruf bei der
Hotline folgte. Man entschuldigte sich und versprach, mir den zuviel
abgebuchten Betrag umgehend zur&uuml;ckzu&uuml;berweisen. Naja, trotz mehrmaligem
Nachfragen meinerseits habe ich das Geld bis heute nicht zur&uuml;ckbekommen.
Immerhin bekam ich Anfang Oktober eine Mail, da&szlig; ich mir (auf meine
Kosten) die Rechnung f&uuml;r Juli (!) auf der Providerhomepage anschauen
k&ouml;nne. Das nennt sich dann also "Rechnung per E-Mail".
Thema Performance:
Von einer guten Permormance l&auml;&szlig;t sich leider nicht immer sprechen. Es
kann schon mal 1 - 2 Minuten dauern bis der Server von Inetservice alle
5 Email-Adressen auf neue Post &uuml;berpr&uuml;ft hat.
Thema E-Mail-Adressen:
Dieses Thema hat bei mir nun das Fa&szlig; zum &Uuml;berlaufen gebracht.
Mitte April konnte sich der Kunde von Inetservice auf der
Providerhompage in Eigenregie bis zu 5 Adressen einstellen. Gesagt,
getan. Ich richtete mir meine 5 Adressen und alles verlief wunderbar,
zumindest bis Anfang September. Auf einmal kam f&uuml;r eine Adresse (es war
die meiner Frau) keine Post mehr an. Bis dahin kamen t&auml;glich Briefe und
Newsletter aber auf einmal war tote Hose. Ich rief also abermals die
Hotline an und schilderte mein Problem. Man wollte das &uuml;berpr&uuml;fen. Naja,
nichts geschah und auch weitere Anrufe bei der Hotline ergaben keinen
Erfolg. Man teilte mir immer nur mit, das alles o.k. sei. Es w&uuml;rden wohl
keine Mails mehr an diese Adresse geschickt werden. Gestern machte sich 
dann endlich mal jemand die M&uuml;he, gr&uuml;ndlicher nachzuschauen. W&auml;hrend ich
mit ihm telefonierte (&uuml;ber 20 Minuten) stellte sich auf einmal heraus, da&szlig;
meine Adresse zwischenzeitlich an jemand anderen vergeben worden war,
und dieser Jemand seit Wochen die private Post meiner Frau bek&auml;me.
Er w&uuml;sse aber nicht wie es passiert sei, aber er w&uuml;rde sich darum
k&uuml;mmern. Nach 3 Anrufen heute bekam ich dann ganz lapidar als Antwort,
da&szlig; ich angeblich im April einen Fehler bei der Konfiguration gemacht
habe und sie keine Schuld tr&auml;fe. Ich m&uuml;sse mich halt mit der Situation
abfinden.

Also ich wei&szlig; ja nicht, aber ich denke mal die Bezeichnung "chaotischer
Sauhaufen" w&uuml;rde bei der Beschreibung dieses "Providers" noch untertreiben. 
Ich f&uuml;r meinen Teil w&uuml;rde niemanden empfehlen, dorthin zu wechseln und
bereue es heute auf`s &Auml;u&szlig;erste es selber getan zu haben!

Michael Schaub &lt;Guardian@inetmail.De&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
