<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

AmigaOS 3.5 - top oder Flop?

Es ist soweit - nach sechs Jahren wurde das AmigaOS 3.1 von der Nachfolger-
Version 3.5 abgel&ouml;st - und wieder einmal streitet die Amiga-Gemeinde &uuml;ber 
ein Softwareprodukt: Die Beurteilung des AmigaOS 3.5 in der &Ouml;ffentlichkeit 
reicht von 'hervorragend' bis 'zutiefst entt&auml;uschend'.

Aus meiner - pers&ouml;nlichen - Sicht kann man das AmigaOS 3.5 nicht bewerten, 
ohne folgende Fakten zu ber&uuml;cksichtigen:

* Das AmigaOS 3.5 ist bewusst nicht als "Major Update" konzipiert, deshalb  
  auch der vergleichsweise niedrige Preis.

* Es wurde innerhalb von nicht viel mehr als einem halben Jahr entwickelt.

* Die Zahl der beteiligten Programmierer war relativ klein.


Was will ich damit sagen? Etwa, dass ich der Ansicht bin, das AmigaOS 3.5 
sei nur Mittelma&szlig;, unter den gegebenen Umst&auml;nden jedoch nicht mehr 
erreichbar gewesen sei?

Nein, absolut nicht. Meine eigenen Erwartungen an das Update sind erf&uuml;llt 
und sogar &uuml;bertroffen worden, wobei ich mich an den offiziell angek&uuml;ndigten 
Spezifikationen (siehe AMIGA aktuell 7/99) orientiert habe. Nach dem 
Erscheinen des AmigaOS 3.5 muss diese Auflistung jedoch als unvollst&auml;ndig 
angesehen werden, mehr Aussagekraft f&uuml;r diejenigen, die sich noch nicht zum 
Kauf des Produkts entschlossen haben, bietet da schon die auf der 
AmigaOS3.5-CD-ROM enthaltene Liste der Verbesserungen:

»Die neuen Features von OS3.5:

Workbench

- Unterst&uuml;tzung der neuen icon.library (v44)
  Das hei&szlig;t:
  - Farbangepa&szlig;te und palettenunabh&auml;ngige Ikons.
  - Einstellbare Rahmen f&uuml;r jedes einzelne Ikon.
  - Kompatibel zu NewIcons und den alten Ikons.

- F&uuml;llstandanzeige, die den belegten Platz eines Datentr&auml;gers anzeigt.

- Besserer Benachrichtigunsmechanismus und dadurch k&uuml;rzere Antwortzeiten.

- Echtzeit-Scrollen in allen Fenstern.

- Erweiterte AppIcons

- Neues Informations Fenster.
  Wenn man auf das Gr&ouml;&szlig;e-Feld klickt wird die Gr&ouml;&szlig;e und Anzahl aller
  Dateien/Verzeichnisse in einer Schublade ermittelt.
  Ikons k&ouml;nnen &uuml;ber dem Bildbereich fallengelassen werden um das Ikonbild
  zu &auml;ndern (ohne die Tooltypes zu ver&auml;ndern). Weiterhin k&ouml;nnen Ikons       
  &uuml;ber dem Standardprogramm Eingabefeld fallengelassen werden um dessen     
  Eintrag zu ersetzen.

- Neuer Men&uuml;punkt Fenster-&gt;"Gr&ouml;&szlig;e anpassen".
  Neuer Men&uuml;punkt Fenster-&gt;"Markierungen l&ouml;schen".
  Viele verschiedene Sortierm&ouml;glichkeiten:
  spaltenweise, nach Namen, nach Datum, nach Gr&ouml;&szlig;e und nach Art(neu).

- Bessere Tastaturkontrolle bei allen Operationen.
  Z.B. k&ouml;nnen Ikons mit der Tastatus angew&auml;hlt werden (mit TAB/CURSOR),     
  durch Fenster bl&auml;ttern, Fenster schlie&szlig;en, &Uuml;bergeordnetes Fenster         
  &ouml;ffnen, usw.

- Verbesserte und erweiterte API um die Workbench aus einer Applikation zu  
  steuern.

- Eine sehr m&auml;chtige Arexx Schnittstelle.

- "L&ouml;schen" und "Kopieren" besitzen nun eine Fortschrittsanzeige und k&ouml;nnen
  abgebrochen werden.

- Ger&auml;te k&ouml;nnen versteckt (Anzeige unterdr&uuml;cken) werden.

- Die [Rechte Amiga] Taste l&ouml;st folgende Spezialfunktionen aus:
  - &Uuml;bergeordnetes Fenster wird geschlossen beim &Ouml;ffnen einer neuen         
    Schublade.
  - Dateien k&ouml;nnen auf demselben Datentr&auml;ger kopiert, anstatt verschoben    
    werden.
  - Alle Fenster werden geschlossen, wenn auf ein Schlie&szlig;symbol geklickt    
    wird.
  - Das Ziehen von Ikons wird auf eine Achse beschr&auml;nkt.

- Die [Ctrl] Taste wird zu Selektion und Deselektion von Ikons benutzt.
  Wenn auf ein angew&auml;hltes Ikon geklickt wird bleiben andere angew&auml;hlte     
  Ikons in ihrem angew&auml;hlten Zustand.

- Neue Dateierkennung und neue Vorgabe-Ikons.

- Der Workbenchhintergrund kann mit den Cursortasten gesteuert werden.

- Alle Voreinsteller benutzen nun die ReAction GUI. Drei neue               
  Voreinsteller:
  Workbench, CacheCDFS und Reaction um das Aussehen des Systems sowie       
  Applikationen die f&uuml;r OS3.5 geschrieben wurden zu beeinflussen. Zudem     
  ausgiebige Einstellm&ouml;glichkeiten des CD-ROM Dateisystems.

- Ein neuer Ikon-Editor mit vielen Features:
  - Handhabung zweier Ikon-Bilder: ein neues, und ein altes Ikon-Bild zur   
    Kompatibilit&auml;t.
  - Viele Zeichenwerkzeuge.
  - Optionen um Ikons transparent zu machen, ohne Rahmen zu zeichnen.
  - Drag & Drop Unterst&uuml;tzung mit den neuen Dropzones.
  - Kompatibel zu NewIcons durch die neue icon.library

- Bessere Unterst&uuml;tzung f&uuml;t RTG.


Internet

- Eingebauter TCP/IP Stack (Miami)

- Webbrowser (AWeb Spezialversion)

- Ein einfaches EMail Programm (AmigaMail)

- aml.library um emails aus Applikationen heraus zu versenden/empfangen


LoadWB

- Es gibt nun eine Option um alle Programme in der Schublade WBStartup zu
  &uuml;bergehen (SKIPWBSTARTUP) und einen Option SIMPLEGELS.


IPrefs

- Unterst&uuml;tzung f&uuml;r workbench.prefs und reaction.prefs

- Bessere Auffrisch-Methode, welche die Anordnung der Ikons nicht mehr      
  zerst&ouml;rt.


ShowConfig

- Der 68060 Prozessor wird erkannt.

- Der Name von Erweiterungskartenherstellern wird angezeigt, wenn m&ouml;glich.


icon.library

- Handhabung von Farbangepa&szlig;ten und palettenunabh&auml;ngigen Ikons.

- Ikons werden transparent, wenn sie &uuml;ber Bereiche gezogen werden &uuml;ber      
  denen sie fallengelassen werden k&ouml;nnen.

- Kompatibel zu NewIcons and zum alten Ikonsystem.

- Neue Hervorhebungsmethode: Abdunkeln.

- Das Ikon-System hat nun eine verbesserte und erweiterte API und neue Tags
  um die Gr&ouml;&szlig;e des Ikon-Bereichs zu kontrollieren oder um Ikons rahmenlos    
  zu machen.


Datatypes

- Neue Datatypes f&uuml;r jpeg, ilbm, gif, aiff, 8svx, sound. picture, animation  
  und amigaguide.

- der picture.datatype arbeitet nun in 24Bit. Man ben&ouml;tigt keine spezial
  picture.datatype f&uuml;r Grafikkarten mehr.
  Besseres Dithern und bessere Farbverwaltung.

- Eine neue Eingabequelle ist nun f&uuml;r datatypes m&ouml;glich: DTST_MEMORY:

- AddDatatypes arbeitet jetzt korrekt auch f&uuml;r die eingebauten datatypen    
  und kann alle Datatype Beschreiber die sich im Speicher befinden mit der  
  Option LIST/S auflisten.


Multiview

- Neue und bessere Unterst&uuml;tzung f&uuml;r V44 datatypes sowie einige             
  Verbesserungen.


printer.device

- Das Drucken in 24Bit wird nun unterst&uuml;tzt und es gibt
  Custom Voreinsteller.

- Schneller!

- Verbesserungen an fast jeder Stelle.


asl-Requester

- Die Cursortasten funktionieren nun sinnvoller in Asl-Dateiauswahlboxen.

- Verzeichnisse werden standardm&auml;&szlig;ig zuerst angezeigt. Es gibt eine         
  Menuoption um die Sortierreihenfolge einzustellen.

- Das Lesen von Verzeichnissen ist viel schneller geworden.

- Mit dem neuen Menupunkt "Erzeuge neue Schublade" k&ouml;nnen nun Verzeichnisse
  erzeugt werden.

- Neu API Funktionen


HDToolbox

- Die Handhabung ist wesentlich einfacher und komfortabler geworden.

- Es werden nun gro&szlig;e Partitionen &gt;4GB unterst&uuml;tzt.

- Die neue hdwrench.library findet Verwendung.


Commodities

- Neuer Bildschirmschoner, der auch auf Grafikkarten angezeigt wird.

- Neues FKey, Exchange, CrossDos. Alle mit ReAction Oberfl&auml;che.


Installer

- Der Installer kann nun auf einem eigenen Schirm ge&ouml;ffnet werden und       
  dieser kann noch ein Hintergrundmuster enthalten.

- Ein Zur&uuml;ckverfolgungsmechanismus wurde implemenitert um das Zur&uuml;ckgehen   
  in der Installation zu erm&ouml;glichen.

- Der Installer kann nun datatypes verwenden. Dazu stehen die neuen         
  Kommandos showmedia, setmedia und closemedia zur Verf&uuml;gung.

- Der Installer kann jetzt die Workbench mit den neuen Funktionen           
  openwbobject showwbobject und closewbobject ansprechen.


Kommandos und Verschiedenes

- Erneuerung einiger Kommandos in C: und System

    - Diskcopy
    - Format
    - Info
    - Join
    - List
    - Mount
    - Protect
    - SetPatch
    - Status
    - Type
    - Version

- Der "mounter" wurde zur einfachen Einbindung von ... Datentr&auml;gern         
  hinzugef&uuml;gt.

- Es gibt einen neuen Texteditor: EditPad. Dieser hat eine ReAction         
  Oberfl&auml;che und unterst&uuml;tzt die Zwischenablage.

- Das ReAction GUI-System wurde dem OS hinzugef&uuml;gt. Es ist eine             
  vollst&auml;ndinge Ansammlung von BOOPSI-Klassen. ARexx und Ikonifizierung     
  sowie moderne Anordnungsmechanismen f&uuml;r die &Ouml;berfl&auml;che werden             
  unterst&uuml;tzt. Das modulare Design verbessert die GUI (grafische            
  Benutzerschnittstelle) und erlaubt es ihr Aussehen zu beeinflussen.

- Viel &Auml;nderungen f&uuml;r SCSI und ATAPI Ger&auml;te, wie z.B. Unterst&uuml;tzung der
  NSD (New Style Devices, 64Bit trackdisk.device)

- Neue Version des Dateisystems.

- Viele Fehler wurden behoben. Ein Beispiel:
  Das Erzeugen einer neuen Schublade fragt zuerst nach dem Namen f&uuml;r die
  Schublade und erzeugt diese dann. In OS3.1 wurde zuerst eine Schublade     
  mit dem Namen "Namenlos" erzeugt welche dann umbenannte wurde. Dadurch     
  war der Abbruch Knopf ohne Funktion da bereits eine Schublade "Namenlos"   
  erzeugt wurde.«


Und in dieser Auflistung werden einige Verbesserungen - sicher 
versehentlich - gar nicht erw&auml;hnt: So wird jetzt beispielsweise beim &Ouml;ffnen 
einer Shell der Pfad des zuletzt aktivierten Workbench-Fensters &uuml;bernommen, 
ein, wie ich finde, sehr sinnvolles Feature, wenn man Workbench- und Shell-
Nutzung kombinieren will.

Aber wo Licht ist, ist naturgem&auml;&szlig; auch Schatten. So werden zumindest bei 
mir Dateien, die &uuml;ber kein eigenes Icon verf&uuml;gen, mit der Workbench 3.5 
wesentlich langsamer eingelesen und angezeigt als fr&uuml;her. Au&szlig;erdem gef&auml;llt 
mir nicht, dass bei der Sortierung nach Datum zuerst die &auml;ltesten Dateien 
angezeigt werden und nicht, wie noch unter AmigaOS 3.1, die neuesten.
Desweiteren ist derzeit unklar, ob es f&uuml;r Besitzer des AmigaOS 3.5 
tats&auml;chlich eine OEM-Version des TCP/IP-Stacks Miami geben wird, wie es in 
einer Lies_mich-Datei auf der CD-ROM versprochen wurde.
Dem OS-Update eine Special Edition, wie in Form von AWeb-II geschehen, 
mitzugeben, ist eine Sache. Ob es jedoch eines Betriebssystems w&uuml;rdig ist, 
lediglich die normale, zeitbeschr&auml;nkte Demoversion eines TCP/IP-Stacks 
beizulegen, wage ich zu bezweifeln, zumal gerade die Internetf&auml;higkeit des 
AmigaOS 3.5 immer wieder angepriesen worden ist. Nun ja, internetf&auml;hig ist 
es - aber nur 60 Minuten am St&uuml;ck. Wir werden abwarten m&uuml;ssen, ob Holger 
Kruse sich doch noch dazu entschlie&szlig;t, den K&auml;ufern des AmigaOS 3.5 eine 
OEM-Version seines Programms zur Verf&uuml;gung zu stellen.

Nichtsdestotrotz: Bereits wenige Stunden nach der Installation des AmigaOS 
3.5 stand f&uuml;r mich fest, dass ich es nie wieder hergeben m&ouml;chte. Es wurden 
wichtige Verbesserungen vorgenommen und eine Vielzahl neuer sinnvoller 
Funktionen implementiert, die ich nicht mehr missen m&ouml;chte.
Bleibt zu hoffen, dass der Verkaufserfolg des AmigaOS 3.5 nicht durch 
Raubkopien gef&auml;hrdet wird und (hoffentlich) m&ouml;glichst bald ein Major Update 
4.0 - inklusive neuem Kickstart-ROM - erscheinen wird. Denn dann wird 
endlich auch integrierter Grafikkarten- und vielleicht sogar schon erster 
nativer PowerPC-Support Einzug halten. Lassen wir uns &uuml;berraschen.

Und was haltet ihr vom AmigaOS 3.5? Sendet eure Erfahrungen bitte an 
aakt@gmx.de .


Damit bis n&auml;chsten Monat,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
