<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Review: The Prophet
----------------------

Von The Prophet gab es gar nicht soviel zu h&ouml;ren, wie man das vielleicht
von anderen Amiga Spielen her kennt. The Prophet wurde angek&uuml;ndigt und
prompt erschien es auch. Das Spiel kommt in der allseits bekannten CD-ROM
H&uuml;lle daher und ben&ouml;tigt ca. 30 Megabyte Platz auf der Festplatte. Hier
fragt man sich dann aber schon, warum das Spiel nicht von CD-ROM aus
spielbar ist. Auf der CD-ROM befindet sich ein ca. 5 Megabyte gro&szlig;es
LHA Archiv, welches dann auf die Festplatte entpackt wird und dort etwa
30 Megabyte in Anspruch nimmt. Das h&auml;tte doch sicherlich auch von
CD-ROM gel&ouml;st werden k&ouml;nnen. The Prophet kommt &uuml;brigens auf einem Rohling
daher, wie auch schon Moonbases. Das Spiel l&auml;uft auf jedem Amiga mit
2MB Speicher, Festplatte und CD-ROM.

Die Geschichte ist im Handbuch, welches als Programm dem Spiel
beiliegt und sehr schlecht zu bedienen ist, festgehalten. Die
Geschichte umfasst mehrere Bildschirmseiten (so um die 10) voller
Text ohne jegliche grafische Ausgestaltung und zu allem &Uuml;bel
ist sie auch noch komplett in englischer Sprache, was das
Verst&auml;ndnis nochmals beeintr&auml;chtigt. Ich versuche also mal, so
ungef&auml;hr wiederzugeben, wie ich die Geschichte verstanden habe:
Man spielt eine Person, dessen Mutter umgebracht wurde und
dessen Schwester verschleppt wurde und auch er nun auf der
Flucht ist. Er muss also irgendwie aus der Stadt entkommen.

Nach der Installation, die etwas umst&auml;ndlich gestaltet ist
(man muss erst das komplette Prophet-Verzeichnis auf die
Festplatte kopieren und es von dort aus starten...), findet
man drei verschiedene Programme auf seiner Festplatte
wieder. Zum einen einen Bootdisk Maker f&uuml;r Leute, die nicht
2MB Speicher frei haben, zum anderen das Handbuch und zum
letzten das eigentliche Spiel. Nachdem Start dieses werden
einige Bilder (viel zu kurz) angezeigt und man kann eigentlich
gar nicht erkennen, was diese zu bedeuten haben. Dies mag
an meinem Prozessor (68040 40mhz) liegen, da das Spiel in
AMOS geschrieben ist und dieses sich bekanntlicherweise nicht
sehr gut mit schnelleren Prozessoren vertr&auml;gt.

Im Hauptmen&uuml; des Spiels darf man nun zwischen zwei Punkten
w&auml;hlen: New Game und Load Game. Klickt man auf 'New Game'
darf man seinen Charakter erstmal konfigurieren, und nachdem
dies geschehen ist, findet man sich im Spiel wieder. Durch
die sehr kurz gehaltene Anleitung, muss man hier erstmal
herausfinden, was genau man eigentlich machen soll. Die
Grafik wirkt sehr eint&ouml;nig und man sieht egal wie man sich
auch dreht, oft genau dieselben Grafiken. Das ganze
erinnert einen eher an das alte Dungeon Master als an ein
Spiel vom Jahre 1999. Komischerweise ist auch die Festplatte
st&auml;ndig am Laden...Man l&auml;uft also durch die Stadt und
kann z.B. auch an verschiedenen T&uuml;ren klopfen. Dort
erscheint dann meistens eine Person, die mit irgendeinem
Spruch aufwarten, wie "The weather is nice" etc. Richtiger
Spielspa&szlig; mag hier nicht aufkommen, wobei ich dazu noch
erw&auml;hnen muss, dass ich kein Fan von RPG Spielen bin.
Aber ich denke, dass auch ein RPG Fan mit diesem Spiel
nicht sonderlich gut zurechtkommt.

Fazit: The Prophet ist ein wenig zeitgem&auml;&szlig;es Spiel mit
einigen guten Ans&auml;tzen, die aber durch viele negative
Sachen stark beeintr&auml;chtigt werden. Besonders negativ
f&auml;llt die schlechte Grafik auf, in der Animationen fast
nicht auftauchen, au&szlig;erdem wird der Spielspa&szlig; durch
die englische Sprache stark beeintr&auml;chtigt. Eine bessere
Anleitung w&uuml;rde ich mir dazu auch noch w&uuml;nschen, da
man durch die vorhandene kaum mitbekommt, worin die
Aufgabe des Spielers liegt. Dazu kommt noch, dass das
Spiel nur von Festplatte l&auml;uft, man nicht in die Workbench
zur&uuml;ckkommt und es teilweise zu schnell l&auml;uft, obwohl
auf der R&uuml;ckseite der CD-ROM steht, dass das Spiel f&uuml;r
bessere Prozessoren und mehr Speicher optimiert wurde.
Das kann ich kaum glauben, denn die Festplatte l&auml;dt
bei mir st&auml;ndig, obwohl ich 18 Megabyte freien Speicher
habe, in den das Spiel schon die H&auml;lfte der gesamten
Daten einladen k&ouml;nnte. Und auf meinem 040er laufen
einige Szenen dazu noch schneller ab, ob die Programmierer
das mit 'optimieren' verstehen? 
  
Screenshot:
<IMG SRC="../extra/TheProphet1.jpg" ALT="Screenshot">  
Screenshot:
<IMG SRC="../extra/TheProphet2.jpg" ALT="Screenshot">  
  
+-------------------------------------------------------------------------+
|  Name:          The Prophet                                             |
|  Hersteller:    Lost Legends, ver&ouml;ffentlicht von Alive Mediasoft,       |
|                 PO Box 940, Kirkby-In-Ashfield, Nottingham, NG17 7FA,   |
|                 England, Telefon oder Fax: +44 (0)1623 467579,          |
|                 E-Mail: jenniealive@innotts.co.uk                       |
|  Preis:         45 DM                                                   |
|  Datentr&auml;ger:   1 CD-Rohling                                            |
|  Genre:         RPG Abenteuer          | Spieler: 1                     |
|  Sprache:       englisch               | Anleitung: englisch            |
|  System:        OCS/ECS/AGA            | 2 MB RAM, CD-ROM, Festplatte   |
|                                                                         |
|  Fazit:         Nicht mehr zeitgem&auml;&szlig;es Spiel, welches besser als        |
|                 Public Domain h&auml;tte ver&ouml;ffentlicht werden sollen.       |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     5/10                            |
|                             Sound:      5/10                            |
|                             Handhabung: 3/10                            |
|                             Spielspa&szlig;:  3/10                            |
|                             GESAMT:      40%                            |
+-------------------------------------------------------------------------+

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
