<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
8. Interview mit Hyperion Software
----------------------------------

Dieses Interview wurde mit Thomas Frieden von Hyperion Software im Oktober
1999 gef&uuml;hrt.

AMIGA aktuell: Heretic II wird wohl das spektakul&auml;rste 3D Action-Spiel, das
               der Amiga je gesehen hat. Wie lange arbeitet ihr schon an    
               der Portierung des Spiels?

Hyperion: Wir arbeiten etwa 3 Monate daran. Das fertige Spiel sollte Mitte
          bis Ende November erh&auml;ltlich sein, falls keine "Komplikationen"
          auftreten.

AMIGA aktuell: Wieviele Personen arbeiten insgesamt an der Portierung       
               Spiel?

Hyperion: Zwei Leute arbeiten im Kern-Team, einer k&uuml;mmert sich um den
          Hardware-Renderer, und ein vierter implementiert die Sound-       
          Libraries...

AMIGA aktuell: Es ist keine Neuigkeit, dass sich Amiga Spiele immer         
               schlechter verkaufen lassen. Wieso habt ihr euch trotzdem    
               entschieden, Spiele f&uuml;r den Amiga zu bringen, die sich evtl.  
               relativ schlecht verkaufen?

Hyperion: Der Grundgedanke war, da&szlig; wenn jetzt niemand Spiele f&uuml;r PPC-      
          Amigas herausbringt, dann wird das auch in Zukunft nicht mehr     
          passieren, und das w&auml;re das Ende des Amigas. Also haben wir uns   
          dazu entschlossen, die Sache selbst in die Hand zu nehmen. Uns    
          ist nat&uuml;rlich klar, da&szlig; wir ein gro&szlig;es Risiko eingehen.

AMIGA aktuell: a) F&uuml;r welche PC-Spiele habt ihr schon Lizenzen erworben?
               b) F&uuml;r welche dieser Spiele habt ihr schon den kompletten
                  Quelltext sowie die Daten (Grafik, Musik...) erhalten?

Hyperion: Aktive Arbeit wird im Moment an Shogo und Heretic 2 geleistet.
          Der Lizenzvertrag f&uuml;r Worms ist zwar schon unterzeichnet, aber
          die Arbeiten daran haben noch nicht begonnen. Der Hauptgrund      
          hierf&uuml;r ist, da&szlig; die Arbeit an Shogo mehr Zeit in Anspruch        
          genommen hat, als es urspr&uuml;nglich geplant war.

AMIGA aktuell: Worms Armageddon habt ihr u.a. auch f&uuml;r den AmigaNG
               angek&uuml;ndigt; nun wird dieser aber nicht erscheinen.
               a) Hattet ihr schon mit Entwicklungen in Richtung AmigaNG    
                  begonnen? 
               b) Inwiefern trifft euch die Entscheidung, dass der AmigaNG
                  nun doch nicht erscheint?

Hyperion: Wir haben die Hoffnung auf einen Amiga NG noch nicht ganz
          aufgegeben. Da von unserer Seite noch keine Entwicklung f&uuml;r NG
          gestartet wurde (unser Hauptinteresse liegt nat&uuml;rlich an der
          Fertigstellung der aktuellen Titel f&uuml;r Classic Amigas) ist in
          dieser Hinsicht noch kein Schaden entstanden. Wir sind nat&uuml;rlich
          sehr betr&uuml;bt &uuml;ber die Entscheidung von Amiga, keine Hardware zu
          produzieren, werden aber nach wie vor deren Next-Generation-      
          L&ouml;sung mit Interesse verfolgen. Man kann hier einfach nur         
          abwarten und sehen, was die Zukunft bringt.

AMIGA aktuell: Wie seht ihr die Zukunft des Amigas?

Hyperion: Nun, der Classicmarkt ben&ouml;tigt, wie allgemein bekannt, neue       
          Impulse. Die Hardware ist nach heutigem Stand der Dinge &uuml;berholt.  
          Allerdings denke ich nicht, da&szlig; damit unbedingt das Ende erreicht  
          sein mu&szlig;. Die neuen G3/G4-Karten k&ouml;nnen meiner Meinung nach       
          wieder ein Schritt nach vorne sein.

AMIGA aktuell: Und abschlie&szlig;end:
               a) Wie lange benutzt ihr schon einen Amiga?
               b) Welches ist euer Lieblingsspiel?

Hyperion: Mein erster Amiga stammt aus dem Jahr 1989, gekauft Ende Oktober.  
          In diesem Monat habe ich also seit 10 Jahren einen Amiga. Mein    
          Lieblingsspiel: Dungeon Master (Amiga), Shogo (ja, wirklich!),    
          Half-Life (PC).

AMIGA aktuell: Danke f&uuml;r das Interview!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
