<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
12. Emulator-News
-----------------

Juan Antonio Gomez Galvez hat eine neue Version seines AmiMasterGear
Emulators auf seiner Webseite (http://www.arrakis.es/~joanant/)
ver&ouml;ffentlicht. In dieser aktuellen Version 0.62 gibt es jetzt eine
synchronisierte CPU Emulation, an der Juan Antonio schon lange
gearbeitet hatte. Durch diese Emulation kann man jetzt die Geschwindigkeit
direkt einstellen: Entweder volle oder echte Geschwindigkeit.
Die Ver&ouml;ffentlichung dieses Updates kam gewisserma&szlig;en &uuml;berraschend;
denn Juan Antonio hatte vor einigen Monaten bekanntgegeben, 
dass er sich komplett aus der Computerszene zur&uuml;ckziehen wolle.
Anscheinend ist er doch nicht vom Amiga losgekommen :-)

Auch von CoolNESs, dem NES Emulator von Fredik Olsson, wurde die
Version 0.77 ver&ouml;ffentlicht. In dieser Version wurden einige
Grafikfehler behoben und nat&uuml;rlich gab es auch wieder Fehlerbehebungen
beim Sound. Au&szlig;erdem gibt es jetzt eine polnische &Uuml;bersetzung
der Dokumentation.
 
Nach fast zweij&auml;hriger Pause gab es diesen Monat auch eine
neue Version von DarkNESs, n&auml;mlich Version 0.30. Diese Version
beinhaltet jetzt Soundunterst&uuml;tzung und es wurden einige
Fehler behoben. DarkNESs ist sehr kompatibel, l&auml;uft allerdings
noch etwas langsam. Vielleicht optimiert der Autor ja noch
ein bisschen in Richtung Assembler, Juan Antonio Gomez Galvez
hat ja bewiesen, dass es geht.

Ein neuer Spectrum Emulator namens ASp wurde im Aminet
ver&ouml;ffentlicht. Er liegt in der Version 0.63 vor und ist noch
nicht sonderlich schnell oder ausgereift, aber schlie&szlig;lich
ist es auch erst die Version 0.63.

Die PowerPC Versionen von Fusion und PCx sind scheinbar
doch nicht so sicher, wie vermutet. Von den &uuml;ber 600 Vorbestellungen
w&auml;ren noch nicht 500 bezahlt worden, so Blittersoft.
Hier kann man nur hoffen, dass dies bald geschieht; denn
eine PPC Version der Emulatoren w&auml;re sicher sehr
n&uuml;tzlich (zumindest f&uuml;r Fusion).

Auf der fMSX Homepage wurde eine neue Beta des Emulators
ver&ouml;ffentlicht, Version 2.3 Beta 2. In dieser neuen Version
wurden Grafikprobleme bei 060er Prozessoren behoben,
die Grafikausgabe um 30-40% beschleunigt und auch die
Ausgabe der Grafik im Workbench Modus extrem verbessert.
Die neue Version l&auml;sst sich von der fMSX Homepage
http://www.xs4all.nl/~roderick/fmsx/ laden.

Eine neue Version des SNES9x Ports von Jesper Svennevid
wurde ebenfalls ver&ouml;ffentlicht. Sie ist allerdings nur
f&uuml;r PowerUP oder WarpOS in Verbindung mit einer Grafikkarte.
Diese Version basiert auf den neuesten Quelltexten von
SNES9x (Version 1.26). Die Version kann aus dem Aminet
oder direkt von http://snes.amiga.tm/ geladen werden.

Der Autor des SNES Emulators MySNES Martin Johansson hat auf
seiner Homepage eine Stellungnahme &uuml;ber die Zukunft des
Emulators ver&ouml;ffentlicht. Darin hei&szlig;t es, dass er seit
einem halben Jahr Vollzeit arbeitet und sogut wie nie
Zeit f&uuml;r MySNES hat. Immer wenn er mal etwas Freizeit
hat, findet er doch irgendwas anderes, was er erledigen
muss. Er sieht MySNES zwar nicht als abgebrochen, aber man
sollte in naher Zukunft keine Updates erwarten. Wenn es
mal wieder ein Update gibt, wird er die Amiga User irgendwie
informieren. MySNES war besonders bei den 68k Usern sehr
beliebt, weil es ein SNES mit unschlagbarer Geschwindigkeit
emulierte.

Au&szlig;erdem wurde diesen Monat auch noch eine neue
Version eines Plus4 Emulators im Aminet ver&ouml;ffentlicht.


</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
