<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Review: Marblelous 2
--------------------

Marblelous 2 wurde schon vor einem Jahr ver&ouml;ffentlicht, jedoch nie
in dem AMIGA aktuell Spieleteil vorgestellt. Nun ist die Vollversion
auf der Aminet 33 vorhanden und das ist Anlass genug, es nun doch
noch einmal unter die Lupe zu nehmen. Marblelous 2 ist der Nachfolger
des Marblelous Geschicklichkeitsspiel, welches 1995 beim APC&TCP
erschien. Vom Prinzip her &auml;hnelt die Marblelous-Serie dem Klassiker
Rock`n`Roll. Marblelous 2 ben&ouml;tigt mindestens 1MB Ram und l&auml;uft
auf jedem Amiga; Grafikkarten werden auch unterst&uuml;tzt. Darauf komme
ich aber sp&auml;ter nochmal zu sprechen.

Marblelous 2 liegt in drei verschiedenen Versionen vor: Eine ECS/OCS
Version, eine AGA- und eine RTG Version. Die AGA und RTG Versionen
k&ouml;nnen direkt von der CD-ROM gespielt werden, f&uuml;r die ECS Version
ist eine Installation notwendig. Selbstverst&auml;ndlich k&ouml;nnen die
AGA und RTG Versionen auch installiert werden. Die Installation
l&auml;uft mit dem bew&auml;hrten Commodore Installer problemlos ab und
prompt findet man Marblelous 2 auf seiner Festplatte wieder, wo
es etwa 1,2 Megabyte in Anspruch nimmt.
 
Nach dem Start wird nur noch kurz das APC&TCP Logo eingeblendet
und schon findet man sich im Hauptmen&uuml; wieder. Da es sich bei
Marblelous 2 um ein reines Geschicklichkeitsspiel handelt, wurde
auch auf s&auml;mtliche Geschichte verzichtet. Im Hauptmen&uuml; kann man
sich die Highscores ansehen, Levelpassw&ouml;rter eingeben oder einfach
das Spiel starten, was mit einem Mausklick erledigt ist.

Nun befindet man sich direkt im Spiel und muss einer selbstrollenden
Kugel den Weg angeben, den sie rollen muss, um ins Ziel zu gelangen.
Auf diesem Weg muss die Kugel nat&uuml;rlich noch einiges einsammeln
und &uuml;ber Hindernisse hinwegkommen. Dies geht recht einfach los
wird aber relativ schnell schwerer zu bew&auml;ltigen. Zum Gl&uuml;ck gibt
es die M&ouml;glichkeit mittels Passw&ouml;rtern an sp&auml;terer Stelle wieder
weiterzuspielen. Wenn man die Steuerung von Marblelous 2 erstmal
kapiert hat, spielt es sich relativ gut. Die Grafik erscheint einem
allerdings alles andere als in 256 Farben. Sie sieht eher aus
wie in einem ECS Spiel. Deshalb wage ich hier mal gar nicht
zu vermuten, wie die Grafik auf einem ECS Amiga aussehen wird.
Die Musik und die SoundFX h&auml;tten auch besser ausfallen k&ouml;nnen,
besonders die Samples in der Musik klingen recht schlecht. Die
Grafikkarten Unterst&uuml;tzung scheint dazu auch misslungen: So
ben&ouml;tigt man laut Anleitung eine Cybervision 64/3D sowie einen
68040 Prozessor, um das Spiel in der Originalgeschwindigkeit
(sprich die Geschwindigkeit eines 68020 Amigas mit AGA) zu
spielen. Hier scheint wohl was daneben gegangen zu sein, denn
wer sich die Grafiken von Marblelous 2 ansieht, wird wohl
kaum verstehen, was hier soviel Grafikpower ben&ouml;tigt. Richtig:
Nichts. Die Grafik ist auf Amiga 500 Nivaeu.
  
Fazit: Trotz der schlechten Grafik kann man dem Spiel einen
netten Spielspa&szlig; nicht wegreden. Marblelous 2 ist ein gutes
Spiel f&uuml;r zwischendurch und f&uuml;r die Aminet CD-ROM 33 eine
gelungene Beigabe. Die Grafiken und die Sounds h&auml;tte man
jedoch noch verbessern m&uuml;ssen, denn sie kommen leider nicht
&uuml;ber Amiga 500 Niveau hinweg, auch wenn sie auf AGA und RTG
in 256 Farben vorhanden sind. Als kleines Extra findet man
&uuml;brigens auch noch einen Leveleditor bei dem Spiel. Dem
Langzeitspa&szlig; ist also nichts in den Weg gesetzt.

+-------------------------------------------------------------------------+
|  Name:          Marblelous 2                                            |
|  Hersteller:    Frank Otto, ver&ouml;ffentlicht von APC&TCP, Dortstra&szlig;e 17,  |
|                 D-83236 &Uuml;bersee, Tel. 08642/89995, Fax. 08642/895004,   |
|                 E-Mail: andreas@chiemgau.baynet.de                      |
|  Preis:         Frei auf der Aminet CD 33 sonst 45 DM                   |
|  Datentr&auml;ger:   1 CD-ROM sonst 2 Disketten                              |
|  Genre:         Geschicklichkeit       | Spieler: 1                     |
|  Sprache:       englisch, deutsch      | Anleitung: englisch, deutsch   |
|  System:        OCS/ECS/AGA            | 1 MB RAM                       |
|                                                                         |
|  Fazit:         Netter Spa&szlig; f&uuml;r zwischendurch, der durch schlechte      |
|                 Grafik und mittelm&auml;&szlig;igen Sound beeintr&auml;chtigt wird.     |
|                 F&uuml;r die Aminet CD-ROM allerdings genau richtig!         |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     5/10                            |
|                             Sound:      6/10                            |
|                             Handhabung: 7/10                            |
|                             Spielspa&szlig;:  7/10                            |
|                             GESAMT:      63%                            |
+-------------------------------------------------------------------------+

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
