<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Der Commodore-Untergang aus meiner Sicht - Teil 1 (von Rainer Benda)

Rainer Benda, bekannter Amiga-Anwender und ehemaliger Mitarbeiter von 
Commodore Deutschland, hat einer Ver&ouml;ffentlichung seiner - wie ich finde - 
sehr informativen Textreihe 'Der Commodore-Untergang aus meiner Sicht' in 
AMIGA aktuell zugestimmt. In dieser Ausgabe beginnen wir mit dem ersten 
Teil, die weiteren werden folgen.

»Ok, wo fange ich an.......

Ich habe Commodore in der Zeit von 1989 bis 30.09.1993 in Frankfurt live
erlebt (mit 4 Gesch&auml;ftsf&uuml;hrern: Peter Kaiser, Winfied Hoffmann, Helmut Jost
und Alwin Stumpf - P.K. und W.H. nur kurz) und bin auch froh dar&uuml;ber, ob-
wohl das Ende so nicht h&auml;tte sein m&uuml;ssen und auch vermeidbar gewesen w&auml;re,
wenn die Gesch&auml;ftsleitung auf ihre Mitarbeiter mehr geh&ouml;rt h&auml;tte. Man setzt
nicht voraus, da&szlig; die Gesch&auml;ftsf&uuml;hrung &uuml;ber den technischen Verstand 
verf&uuml;gt, um jede Entscheidung alleine treffen zu k&ouml;nnen, denn daf&uuml;r gibt es 
nunmal entsprechende Mitarbeiter. Werden diese &uuml;bergangen, hilft alles 
nichts. Sicherlich l&auml;uft in keinem Unternehmen alles rund, nur gab es hier 
einfach zuviele Ecken.

Wo Peter Kaiser herkam und wo er jetzt ist, weiss ich nicht (mehr). In 
einer letzten IT-Zeitung habe ich ein Bild von ihm gesehen. Wenn ich mich 
recht erinnere, managed er grade irgendein Unternehmen. Er war bei 
Commodore ca. 6 Monate und durfte dann gehen. Ich weiss nicht mehr, ob es 
ihm nicht gefallen hat, oder ob er gegangen wurde. Ich tippe auf letzteres, 
als ich ihn das Geb&auml;ude verlassen sah.

Winfried Hoffman ging nach seinem Ende zu ASI-Computer, die er meiner 
Erinnerung nach wohl auch gr&uuml;ndete. Der St&uuml;tzpunkt von ASI-Computer war 
(ist ?) das Atrium in Frankfurt Niederrad, nur wenige Meter vom ehemaligen 
Commodore Geb&auml;ude entfernt. Er ist als Manager bei Fujitsu besch&auml;ftigt und 
hat nun ein Joint-Venture mit Siemens angeleiert. Bei seinem Abgang von 
Commodore nahm er noch ein paar Commodore Leute aus dem PC-Bereich "mit".

Helmut Jost war schonmal bei Commodore (oder sogar zweimal !?) als 
Vertriebsmitarbeiter besch&auml;ftigt und wechselte Mitte der 80er zu Amstrad 
und kam von da dann als Gesch&auml;ftsf&uuml;hrer zu Commodore zur&uuml;ck. Mit ihm kam 
kurze Zeit sp&auml;ter auch einer unserer technischen Direktoren (Roland 
Bernschein). Seiner einer "f&uuml;hrte" das Commodore Volksmodem VM2400 "ein", 
welches ihn nach einigen Monaten aus Commodore "rausf&uuml;hrte".

Nach Commodore wechselte Helmut Jost (dessen Traum war, IBM zu managen) zu
Compaq. Wo er jetzt ist, weiss ich nicht (mehr).

Bleibt noch Alwin Stumpf, der ebenfalls Anfang der 80er Jahre schonmal bei
Commodore als Gesch&auml;ftsf&uuml;hrer war, dann zu Atari ging und zur 
"inoffiziellen" Abwicklung von Commodore wieder auftauchte. Nach seinem 
Abgang bei C= 1993/94 ging er in den Osten zu seinem Schwager, mit dem er 
irgendwelche PC-Multimedia Hardware entwickeln und auf den Markt bringen 
wollte.

Ich glaube, ihnen hat Commodore sicherlich nicht geschadet.

---------------------------------------------------------------------------

Gleich zu Anfang: ich kann die Meinung nicht teilen, da&szlig; der Untergang von
Commodore ausschlie&szlig;lich an den von Commodore vertriebenen PC's lag, oder
diese daran schuld hatten, da&szlig; Commodore Konkurs anmelden musste, auch wenn
sich diese Behauptung schon ewig h&auml;lt und auch von der Presse in fr&uuml;heren
Zeiten immerwieder so dargestellt wurde.

Commodore's Niedergang beruht auf der &Uuml;berheblichkeit f&uuml;hrender K&ouml;pfe, die
meinten, der Amiga verkaufe sich ganz von alleine und man m&uuml;sse nichts f&uuml;r
das Umfeld tun. Man br&auml;uchte nur warten, bis man die Teile aus der Hand
gerissen bek&auml;me. Daran h&auml;tte der Amiga auch dann nichts ge&auml;ndert, wenn
hundertmal soviele Ger&auml;te verkauft worden w&auml;ren, denn nicht jede Fehlent-
scheidung l&auml;sst sich ohne Konsequenzen ausb&uuml;geln.

Commodore hatte Anfang und Mitte der 80er Jahre brauchbare "IBM kompatible"
Rechner, die auch in Schulen Verwendung fanden. Modelle wie der PC10/PC20
verkauften sich um 1985 durchaus gut (bis dahin gab es ja auch noch keinen
Amiga und der Hauptumsatz kam eben &uuml;ber diese Schiene und durch den C64).

Manch eine Mark brachte auch der C128, aber nicht in dem Ma&szlig;e wie erwartet,
auch hatte Commodore Gro&szlig;kunden, wie die Deutsche Bahn AG im PC-Bereich und
das war sicherlich kein Gesch&auml;ft bei dem man drauflegte.

Bedauerlicherweise betrachteten einige Mitarbeiter bei Commodore ihren 
Arbeitsplatz als ganz normale Arbeitsstelle (Loyalit&auml;t ist schon ok, 
blinder Gehorsam und Gottvertrauen in alle Entscheidungen sind da fehl am 
Platz). Haupts&auml;chlich die Vertriebsmitarbeiter waren der Ansicht "es wird 
schon irgendwie weitergehen, Commodore hat schon andere schwere Zeiten 
&uuml;berstanden". Anderen war es eh "egal", denn sie nutzten Commodore als 
Sprungbrett f&uuml;r ihre Karriere.

Ich kann sicherlich ohne zu &uuml;bertreiben behaupten, da&szlig; es au&szlig;er mir keiner 
so richtig gewagt hat, so oft seinen Kopf zu riskieren um manches Unheil zu 
verhindern, oder immerhin zu verz&ouml;gern. Die Amiga-User wurden meiner 
Meinung nach nie als solche verstanden, sondern als einfache 
"Kunden".....etwas gekauft und Tsch&uuml;&szlig;.

Als Ausnahmen w&uuml;rde ich Peter Keshishian (damals Produktmanager Amiga) er-
w&auml;hnen, der, nachdem er seine Ziele (und somit auch unsere) nicht mehr 
durchsetzen konnte, da&szlig; Unternehmen ca. 1992 verlie&szlig;. Au&szlig;erdem noch (auch 
wenn es nicht deren Art war den Aufstand zu proben) Doc Peter Kittel 
(Leiter Dokumentation) und Wilfried H&auml;ring (manch einem noch als Autor der 
Amiga OS-B&uuml;cher von Markt & Technik ein Begriff), der Produktmanager Amiga-
Unix war (weiteres dazu sp&auml;ter), sowie Imke Gisch (Produktmanagerin CDTV - 
viele Ideen, viel geackert, unter'm Strich nichts erreicht, w&uuml;rde _ich_ 
sagen).

Bliebe noch Ralph Conway (verwantwortlich f&uuml;r Multimedia und 
Pr&auml;sentationen), der das Ende von C= bis heute sicherlich nicht verdaut 
hat......(wer hat das schon so richtig)....gelegentlich sieht/spricht man 
sich auch heute noch.....

In Frankfurt durften sich (zu meiner Zeit) 5-6 Leute f&uuml;r Commodore 
Deutschland und etwa die gleiche Anzahl in Braunschweig um den Amiga 
k&uuml;mmern. Das betraf die H&auml;ndler-Hotline, Endkunden-Hotline, und die 
Produktmanager, sowie Service (Gr&uuml;&szlig;e an Axel Kr&auml;mer und Andreas Steep - sie 
sind aktuell bei Amiga International, Braunschweig - vorher bei Amiga 
Technologies :-) ).

Amiga (ich spreche von mir) war immer eine Gef&uuml;hlssache und mehr als nur 
eine Kiste an der man seine Arbeit verrichtete. Um so schmerzlicher war es, 
da&szlig; man f&uuml;r viele Dinge kein Geh&ouml;r fand. Man kommt von dem Teil irgendwie 
nicht weg, auch wenn man versucht "wichtigeren" Dingen nachzugehen. Die 
Vergangenheit holt einen (mich zumindest) immerwieder ein.

Commodore Deutschland (eigentlich war das f&uuml;r uns als Mitarbeiter) hatte 
als Draht nach Amerika (wenn Not am Mann war) die Abteilung "ESCO" 
(European Support and Coordination Office), d.h. wir konnten unsere 
Probleme/Sorgen mitteilen und wenn wir "verstanden" wurden (nicht 
sprachlich gesehen) und die Sache seitens USA ernstgenommen wurde, kam auch 
etwas dabei raus (f&uuml;r mein Empfinden war das leider zu wenig, aber nicht 
die "Schuld" der dortigen Kollegen - einer von ihnen ist heute bei Amiga 
Inc. und heisst Dr. Allan Havemose, auch wenn ich ihn in Manchen Dingen f&uuml;r 
zu konservativ halte). Mag sein, da&szlig; alle Beteiligten an der kurzen Leine 
gehalten wurden. Er ging vor dem Ende Commodore's zur&uuml;ck nach USA. Wir 
konnten zwar auch direkten Kontakt mit USA aufnehmen (zu Dave Haynie, 
Carolyn Scheppner etc.), doch war das zumindest f&uuml;r mich eher die Ausnahme.

ESCO versorgte den deutschen Teil Commodore's zus&auml;tzlich mit Informationen 
zu neuen Produkten (Schaltpl&auml;ne, Beta-Software uvm.)

Die Hierachie bei Commodore war so aufgebaut, da&szlig; wir unserem technischen
Direktor (Anfangs gab es jeweils einen f&uuml;r die Amiga-Abteilung und f&uuml;r die
PC-Abteilung) Meldung machen durften, der es wiederum gefiltert oder unge-
filtert an die Gesch&auml;ftsleitung weitergab.

Durch den leider recht h&auml;ufigen Wechsel dieser Direktoren (habe in meiner
Zeit 4 oder 5 erlebt) und den &Auml;nderungen der Zust&auml;ndigkeit (sp&auml;ter gab es
nur noch einen f&uuml;r beide Bereiche) war er immer wieder schwer, 
Problematiken verst&auml;ndlich zu machen.

Ein techn. Direktor h&auml;tte am liebsten die Amiga-Abteilung komplett 
geschlossen, weil er mit "AMIGA" eh nichts anfangen konnte, kurze Zeit 
sp&auml;ter war er wieder weg. Dann kam ein anderer, dem konnte man das 
erkl&auml;ren, konnte sich aber bei der GL (Gesch&auml;ftsleitung) nicht richtig 
durchsetzen und man musste alles nochmal durchkauen etc.

Der Letzte meinte dann soviel Ahnung zu haben, da&szlig; er unsere schriftlichen
Mitteilung nochmal in eigene Worte fasste und am Ende etwas ganz anderes
rauskam. Commodore war auch zu sehr besch&auml;ftigt, unsere Abteilung irgendwo
"einzuordnen". Wir sollten Unterst&uuml;tzung bieten, Anlaufstelle f&uuml;r Probleme
sein, kosteten aber (so die Einstellung der Gesch&auml;ftsleitung) einfach nur
Geld. Wir h&auml;tten ja auch gerne Diensteistungen oder Produkte verkauft, 
durften wir nur nicht, weil wir keine Vertriebsabteilung waren. Einmal 
waren wir die "technische Support-Abteilung", dann einfach nur die "Amiga-
Division", dann wiederum "technisches Marketing" usw. (ich hatte manchmal 
das Gef&uuml;hl, Visitenkarten anzufertigen war wichtiger).

Daraus ergab sich dann leider auch, da&szlig; die Produktmanager ihrem Titel 
nicht mehr gerecht wurden. Sie hatten eigentlich nichts mehr zu managen. 
Produkte durften sie genau genommen auch nicht einf&uuml;hren (machte seinerzeit 
alles die Gesch&auml;ftsleitung mit/ohne Vorgabe von Commodore USA). Das schlich 
sich mit der Zeit leider so ein. Solange ein Gesch&auml;ftsf&uuml;hrer Umsatz 
vorweisen konnte, hatte er Narrenfreiheit. War der Umsatz mal nicht mehr 
da, wurde er gegangen (mit Bonus nat&uuml;rlich). Wer den meisten Umsatz 
brachte, durfte die Richtung vorgeben. Die Gesch&auml;ftsf&uuml;hrer anderer 
Niederlassungen (&Ouml;sterreich, Italien etc.) hatten eigentlich nichts zu 
sagen. Manch einer ist vor Wut innerlich sicher fast geplatzt.«

Fortsetzung folgt...

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
