<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>AmigaMall</b></font></td>
				</tr>
				<tr height="15">
					<p><td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu&nbsp;Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td></p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
						<tr>
							<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Uusia koneita odotellessa k&auml;y aika pitk&auml;ksi (pun intended - kymmenen vuotta t&auml;ss&auml; on jo kai odoteltu... :). Ehk&auml; Amiga huomasi saman, sill&auml; se avasi kotisivuilleen <a href="http://www.amiga.com/amigamall/" target="_blank">AmigaMall-nettikaupan</a>, josta voi tilata yht&auml; sun toista Amiga-aiheista rompetta. Tarjolla on paitsi Amiga OS&nbsp;3.9 ja AmigaSDK, my&ouml;s paljon erilaisia paitoja ja muita vaatteita sek&auml; sekalaista tavaraa:&nbsp;kahvimukeja, huopia, kelloja, CD-koteloita ja jopa Amiga-termosmuki. Uudessa <a href="http://saku.amigafin.org/keskustelu/index.html" target="_top">Saku-foorumissa</a> kysyttiin, onko kukaan tilannut sielt&auml; mit&auml;&auml;n ja miten se onnistuu, ja hetken kuluttua oli p&auml;&auml;(t&ouml;n)toimittaja Seilonen taas Visa vinkuen suomalaisen amigistin asialla...</font>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vaikka 240 dollaria (noin 1580 markkaa) maksava Amiga-nahkatakki p&auml;&auml;ll&auml; voisikin k&auml;vell&auml; rinta rottingilla, p&auml;&auml;tin silti tilata jotain hieman halvempaa - paitsi kalliin hinnan takia, niin siksikin ett&auml; tullikin tuollaiseen l&auml;hetykseen jo tarttuisi. Tullimaksut voi laskea tarkasti seuraavalla kaavalla:</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">X = tilauksen loppusumma (mukaan lukien postikulut) muunnettuna markoiksi<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Y = loppusumma tullin ja verojen j&auml;lkeen<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Z = tullimaksut<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">X * 1,035 * 1,22 = Y </font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">1,035 on kerroin tullimaksuille ja 1,22 viittaa 22 % arvonlis&auml;veroon, joka lasketaan viel&auml; tullimaksujen p&auml;&auml;lle.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Y - X = Z</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jos erotus Z on suurempi kuin 50 mk, joutuu t&auml;m&auml;n summan tullia ja veroja maksamaan yleens&auml; aina kun ostetaan tavaraa EU:n ulkopuolelta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">P&auml;&auml;dyin tilaamaan Jersey-mallisen paidan, jolla oli hintaa $25 ja postikulut siihen lis&auml;ksi. Tilasin paidan 6.3., ja toimitusajaksi ilmoitettiin 2-4 viikkoa tilauksesta. Visa-korttia oli veloitettu 21.3. ja samana p&auml;iv&auml;n&auml; sain vahvistuspostin siit&auml;, ett&auml; paketti on l&auml;htenyt. Arvio piti paikkansa, ja paketti oli perill&auml; 27.3. Paketin p&auml;&auml;lle oli merkitty tullausarvoksi vain paidan hinta $25, joten t&auml;m&auml; j&auml;i tullirajan alle, eik&auml; tulli puuttunut l&auml;hetykseen. Paketti minua hieman hymyilytti, sill&auml; se oli niin expressi&auml; ett&auml;, ja lis&auml;ksi viel&auml; eritt&auml;in kiireellisen&auml; l&auml;hetetty. No, viikossa perille, sainpahan paidan ajoissa tehd&auml;kseni siit&auml; jutun Sakuun. :) Kaiken kaikkiaan tilaus tuli maksamaan 280 markkaa ja pennej&auml; p&auml;&auml;lle - t&auml;t&auml; paitaa ei parane pest&auml; ensi pesussa pilalle...</font></p>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/paketti.jpg" width="400" height="324" border="0" alt=" "><br>
									<i>Pikakuljetus rapakon takaa. Huomatkaa alareunan teksti;<br>
										Amiga-tuotteet ovat eritt&auml;in kiireellist&auml; tavaraa!</i></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tilaamani paita on siis Jersey-mallinen (kuva alla), ja kokoa pitk&auml;&auml;n p&auml;hk&auml;ilty&auml;ni (jenkkil&auml;n koot ovat monesti v&auml;h&auml;n isompia kuin vastaavat koot Euroopassa) p&auml;&auml;dyin L-kokoon, ja se n&auml;ytt&auml;&auml; olevan varsin sopiva 170-senttiselle. Paita on 100% puuvillaa, konepesun (matala l&auml;mp&ouml;tila) ja kevyen rumpukuivauksenkin kest&auml;v&auml;. Materiaali tuntuu laadukkaalta, ompeluj&auml;lki on hyv&auml;&auml; ja Amigan logo vasemmassa rintapieless&auml; on laadukkaasti tikattu. Mukana tuli my&ouml;s kaksi Get Boinged! -tarraa, joten kaiken kaikkiaan ostos oli onnistunut. Ei tuolta postikulujen ja tulliriskin vuoksi kovin paljon tee mieli tilata, mutta tulipahan hieman uutta ihmetelt&auml;v&auml;&auml; t&auml;m&auml;n kirjastont&auml;din asiakkaille... </font></p>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"> <img src="kuvat/paita.jpg" width="400" height="428" border="0" alt="Amiga Jersey"><br>
									<i>P&auml;&auml;t&ouml;n ratsumies.</i></font></p>
						</div>
				</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		</center>
	</body>

</html>