<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Tee-se-itse Power Tower A1200:aan</b></font></td>
				</tr>
				<tr height="15">
					<p><td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Roni Ij&auml;s &lt;<a href="mailto:rNx@nick.fi">rNx@nick.fi</a>&gt;</font></td></p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
						<tr>
							<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuljettelen konettani paljon, ja Infinitiv-kotelon muoviseen olemukseen alkoi todellakin menn&auml; hermot. Jotain parempaa piti keksi&auml;. Power Tower tuntui asialliselta vaihtoehdolta. Torni on etupaneelia lukuunottamatta metallinen, joten heiver&ouml;isyydest&auml; p&auml;&auml;sisin ainakin eroon. Boogiella tornia katsellessa se tuntui my&ouml;s riitt&auml;v&auml;n tilavalta. Uutena torni olisi ollut minun budjetilleni ehdottomasti liian kallis, joten oli aika turvautua muihin vaihtoehtoihin. </font>
								<p><img src="kuvat/kotelo.jpg" width="181" height="300" border="0" alt=" " align="left"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tornin osto k&auml;ytettyn&auml; olisi ollut hyv&auml; vaihtoehto, koska olin sellaisen joskus n&auml;hnyt myyt&auml;v&auml;n 300 markalla Keltaisessa P&ouml;rssiss&auml;. Amigan torneja tosin myyd&auml;&auml;n todella harvoin, eli se siit&auml; vaihtoehdosta. Tornin tekeminen itse oli viimeinen vaihtoehto. Tornin mallia miettiess&auml;ni mieleen tuli MikroBitiss&auml; muutamia vuosia sitten ollut Octekin mainos, jonka kuvassa oli suurinpiirtein samanlainen torni kuin Power Tower.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kaivoin vanhat Bitit esille ja etsin kyseisen ilmoituksen. Ilmoitus oli Octekin maahantuojan BTMikron. Ilmoituksessa oli my&ouml;s nettiosoite (<a href="http://www.btmikro.com" target="_blank">www.btmikro.com</a>), jonne surffasin. Selasin verkkokaupan l&auml;pi ainakin pariin kertaan, mutta Octekin kloonitornia sielt&auml; ei l&ouml;ytynyt. Selasin takaisin p&auml;&auml;sivulle, ja huomasin linkin uusiin sekalaisiin tuotteisiin, joita verkkokauppaan ei ollut viel&auml; lis&auml;tty. Kotelot-kohdasta l&ouml;ytyi Octekin midi- ja t&auml;ystornikotelo. T&auml;yskotelon hinta on 990 mk ja siit&auml; l&ouml;ytyy viisi 5,25&quot; paikkaa, ja kyseinen torni on siis identtinen Power Towerin kanssa. Ostin kuitenkin miditornin, koska mit&auml;&auml;n mammuttitornia en tarvitse. Miditorni on yht&auml; 5,25&quot; paikkaa matalampi ja noin 5 cm kapeampi kuin t&auml;yskotelo. Tornin hinta oli 490 markkaa. Ei ihan halvimmasta p&auml;&auml;st&auml;, mutta varmasti laadukas.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kotelo saapui nopeasti parissa p&auml;iv&auml;ss&auml;. Nostettuani kotelon paketista huomasin, ett&auml; kaikki etupaneelin napit olivat violetteja! Napit voi kyll&auml; maalata, jos halutaan ihan t&auml;ysin ulkoisesti samanlainen torni kuin Power Tower. Tornin ty&ouml;st&auml;minen vaatii tarvikkeita ja ty&ouml;kaluja. N&auml;it&auml; ei v&auml;ltt&auml;m&auml;tt&auml; joka taloudesta l&ouml;ydy, joten ei sitten l&auml;hdet&auml; ostamaan, ellei todella ole kiinnostunut asiasta ja muutenkin omaa tee-se-itse-miehen tai -naisen vikaa.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tornista irtoavat kaiki muoviosat, joten ne on hyv&auml; ottaa pois ennen tornin ty&ouml;st&auml;mist&auml;. Ensimm&auml;isen&auml; vaiheena on kotelon takalevyn suunnittelu. Paras vaihtoehto on sahata koko vanha takalevy pois ja j&auml;tt&auml;&auml; j&auml;ljelle vain raamit. Sahaamiseen kannattaa k&auml;ytt&auml;&auml; pistosahaa. Sahaamisessa on hyv&auml; olla kaveri apuna, koska pistosahaa on vaikea hallita yhdell&auml; k&auml;dell&auml;. Ja otetaanpa viel&auml; huomioon, ett&auml; sahataan metallia.</font></p>
								<div align="center">
									<p><img src="kuvat/takaa.jpg" width="140" height="276" border="0"></p>
								</div>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Emolevylle on teht&auml;v&auml; oma levy, joka on sek&auml; uusi takalevy ett&auml; levy, johon emo tullaan kiinnitt&auml;m&auml;&auml;n. T&auml;h&auml;n levyyn my&ouml;s porataan tai sahataan porttien rei&auml;t. Porttien rei&auml;t saa hyvin piirretty&auml; k&auml;ytt&auml;en apuna esim. Infinitiv-kotelon emolevykehikkoa. Mutta sit&auml;h&auml;n on vaikea k&auml;ytt&auml;&auml;, jollei kehikkoa ole, joten porttien reikien piirt&auml;misess&auml; levyyn voi k&auml;ytt&auml;&auml; vaikkapa p&ouml;yt&auml;mallisen A1200:n koteloa j&auml;ljent&auml;m&auml;ll&auml; portit paperiin ja tekem&auml;ll&auml; siit&auml; kaava. Levy, jossa emo on, saadaan tuettua tornin pohjaan tekem&auml;ll&auml; kulmakappale, joka kiinnitet&auml;&auml;n pop-niiteill&auml; tornin pohjaan. N&auml;in levy ei p&auml;&auml;se heilumaan sivusuunnassa.</font></p>
								<center>
									<div align="center">
										<p><img src="kuvat/uusitaka.jpg" width="400" height="210" border="0" alt=" "></p>
									</div>
								</center>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Emolevyn sovittamisen kanssa tulee ongelmia, koska muuntaja on tiell&auml;. T&auml;h&auml;n l&ouml;ytyy helppo ratkaisu: k&auml;&auml;nnet&auml;&auml;n muuntaja pystyyn, ja n&auml;in tilaa j&auml;&auml; turbolle viel&auml; enemm&auml;n kuin Infinitiv-kotelossa, jossa turbon muistit hankasivat (ihan tosi) muuntajan kylkeen. Emolevy ei saa olla suoraan kosketuksessa metalliin, ettei tule oikosulkuja, jotka melkein varmasti hajottavat emolevyn. Siksi sit&auml; voidaan nostaa noin sentin verran pellist&auml; k&auml;ytt&auml;m&auml;ll&auml; ruuvien v&auml;liss&auml; vaikkapa muoviputken palasia.</font></p>
								<div align="center">
									<p><img src="kuvat/paalta.jpg" width="250" height="347" border="0"></p>
								</div>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Siirrytt&auml;ess&auml; tee-se-itse-tekniikalla p&ouml;yt&auml;mallista tornimalliin joudutaan ostamaan n&auml;pp&auml;imist&ouml;interface, jonka avulla voidaan k&auml;ytt&auml;&auml; esim. PC-koneiden PS/2-n&auml;pp&auml;imist&ouml;j&auml;. T&auml;ss&auml; tapauksessa Infinitiv-n&auml;ppisinterface oli paras ratkaisu, koska sellainen jo minulla oli ja n&auml;in ratkaistiin my&ouml;s virtaongelma. Interfaceja saa esim. Gentle Eyelt&auml;. Levykeaseman osala on kaksi vaihtoehtoa. Voi k&auml;ytt&auml;&auml; koneen vanhaa levykeasemaa, mutta t&auml;ss&auml; tapauksessa tornin etupaneelista tulee ruma ilman levarin maskia. Sopivan maskin saattaa l&ouml;yt&auml;&auml; esim vanhasta lis&auml;levarista. On my&ouml;s mahdollisuus ostaa Kylwada, jolla Amigassa voi k&auml;ytt&auml;&auml; PC:n levykeasemia ilman lis&auml;softaa tai hardware hackia. Kylwadaa myy Gentle Eye. Poraamalla levyyn muutaman ylim&auml;&auml;r&auml;isen rei&auml;n, sai Infinitiv-tornin n&auml;ppisinterfacen siihen suoraan kiinni. N&auml;in v&auml;ltet&auml;&auml;n liimapatentit eik&auml; tarvitse hajottaa mit&auml;&auml;n.</font></p>
								<div align="center">
									<table border="0" cellpadding="0" cellspacing="0">
										<tr>
											<td><img src="kuvat/valmista.jpg" width="146" height="320" border="0" alt=" "></td>
											<td><img src="kuvat/valmissi.jpg" width="280" height="320" border="0"></td>
										</tr>
									</table>
								</div>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhteenvetona voisi sanoa, ett&auml; hommaahan t&auml;ss&auml; on, mutta kustannuksissa p&auml;&auml;st&auml;&auml;n kyll&auml; halvemmalla kuin ostamalla tai tilaamalla Amigan oma Power Tower. On my&ouml;s hyv&auml; muistaa, ettei homma onnistu ilman muutamaa erikoisty&ouml;kalua, kuten pistosahaa ja ruuvin kierteiden tekoty&ouml;kaluja. My&ouml;s materiaalien hankinta saattaa olla hankalaa. Yleisen&auml; varoituksena on, ett&auml; n&auml;iss&auml; hommissa saattaa hajottaa koneensa. Ennen tornin k&auml;ytt&ouml;&ouml;nottoa kannattaa imuroida se hyvin, ettei metallip&ouml;ly ved&auml; emoa oikosulkuun.</font></p>
								<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tarvikkeet:</font></p>
								<ul>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">pistosaha ja metalliteri&auml;</font>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">rautasaha ja viiloja</font>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">r&auml;ll&auml;kk&auml; hiomater&auml;ll&auml;</font>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">kierteidentekov&auml;lineet</font>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">porakone ja teri&auml;</font>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">pop-niittipyssy ja niittej&auml;</font>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">levy s&auml;hk&ouml;sinkitty&auml; 0,75-millist&auml; pelti&auml;</font>
									<li><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">ruuveja</font>
								</ul>
				</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		</center>
	</body>

</html>