<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>Seiten-Layout</h2>
<p></p>
<hr>
        
<p>Worte sehen auf einem Computer-Bildschirm oft anders aus, als auf Papier
und viele empfinden es als schwerer, Text auf dem Bildschirm zu lesen, als
auf Papier. (Ich kenne einige Leute, die ihre Emails ausdrucken, um sie zu
lesen.) Die Aufl&ouml;sung ist am Bildschirm nicht so gut, wie auf dem
Papier, es gibt manchmal ein Flackern, die Buchstaben sind kleiner und/oder
die Buchstaben sehen schlecht aus. Das Programm des Empf&auml;ngers mag
auch das Layout Ihrer Email ver&auml;ndern und nicht die M&ouml;glichkeit
haben, die Ihre Email-Software hat. Das alles bedeutet, da&szlig; gutes
Layout bei Emails sich von gutem Layout auf Papier unterscheidet.</p>

<h3>K&uuml;rzere Abs&auml;tze</h3>

<p>Normalerweise werden Email-Nachrichten in einem Fenster mit
&quot;scrollbars&quot; (Laufleisten) dargestellt. Auch wenn Laufleisten
eine feine Sache sind, ist es doch schwieriger, lange Abs&auml;tze zu
erfassen. Erw&auml;gen Sie daher, Abs&auml;tze nur mit wenigen S&auml;tzen
zu erstellen.</p>

<h3>Zeilenl&auml;nge</h3>

<p>Die meisten Email-Programme brechen den Text nicht automatisch um. Wenn
also Ihr Programm und das Programm des Empf&auml;ngers unterschiedliche
Auffassungen dar&uuml;ber haben, wie und wann man Texte umbricht, kann eine
Nachricht z.B. so enden:</p>

<p><tt>Ich habe heute mit meinen Kollegen gesprochen. Sie meinen, Dein Vorschlag, <br>
bez&uuml;glich der Weiterentwicklung des Generators XY12/63 w&auml;re sehr interessan<br>
t, habe aber noch einige L&uuml;cken. Um diese L&uuml;cken zu schlie&szlig;en, solltest Du <br>
Dich mit Ihnen in Verbindung setzen. Ich hoffe, Du hast Zeit, dies in den n<br>
&auml;chsten Tagen zu tun.</tt></p>

<p>Dar&uuml;ber hinaus verursacht die &quot;quoted-printable&quot; -
Kodierung noch zus&auml;tzliche Probleme. Wenn eine Zeile l&auml;nger als
76 Buchstaben ist, wird nach 75 Zeichen ein Zeilenumbruch eingebaut und an
das Ende der Zeile ein Gleichheitszeichen gesetzt. Wenn der Empf&auml;nger
ein Programm hat, das &quot;quoted-printable&quot; unterst&uuml;tzt, werden
diese Zeilen wiederhergestellt - alle anderen sehen solch furchtbare
Ergebnisse:</p>

<p><tt>Ich habe heute mit meinen Kollegen gesprochen. Sie meinen, Dein Vorschlag, =<br>
bez&uuml;glich der Weiterentwicklung des Generators XY12/63 w&auml;re sehr interessan=<br>
t, habe aber noch einige L&uuml;cken. Um diese L&uuml;cken zu schlie&szlig;en, solltest Du =<br>
Dich mit Ihnen in Verbindung setzen. Ich hoffe, Du hast Zeit, dies in den n=<br>
&auml;chsten Tagen zu tun.</tt></p>

<p>Einige Programm schneiden die Zeile nach 80 Zeichen ab. Auf diese Art
gewinnt man keine Freunde.</p>

<p>Sie sollten versuchen, die Zeilen mit weniger als 70 Buchstaben zu
verwenden. Warum 70 Buchstaben und nicht, z.B. 76? Weil Sie etwas Platz
f&uuml;r Zeichen lassen sollten, die der Empf&auml;nger beim Zitieren
verwendet.</p>

<h3>Knappe Texte</h3>

<p>Wie oft hat man Ihnen in der Schule gesagt, da&szlig; Sie einen
20-seitigen Aufsatz schreiben sollen? Bestimmt h&auml;ufig - und ebenso
h&auml;ufig hat man Sie daf&uuml;r ger&uuml;gt, wenn der Text zu kurz war.
Dies ist kein gutes Training f&uuml;r das Schreiben von Emails. Fassen Sie
sich kurz. Wenn der Empf&auml;nger mehr Informationen m&ouml;chte, kann er
es Ihnen mitteilen. (Denken Sie auch daran, da&szlig; manche Anbieter den
Internet-Zugang nach Menge der &uuml;bertragenen Dateien abrechnen oder
Grenzen f&uuml;r die Gr&ouml;&szlig;e von Emails haben.)</p>

<p>Wenn Sie eine Nachricht an mehrere Personen schicken, m&uuml;ssen Sie
unter Umst&auml;nden etwas ausf&uuml;hrlicher sein, damit Sie nicht mit
Anfragen &uuml;berschwemmt werden. (Sie sollten &uuml;berlegen, ob wirklich
alle Personen auf Ihrer Liste stehen m&uuml;ssen.) </p>

<p>Je weniger Menschen auf Ihrer Empf&auml;nger-Liste stehen, um so
k&uuml;rzer kann die Nachricht sein. B&uuml;cher, die sich an tausend
Menschen richten, haben zehntausende von Worten. Reden, die an eine
gro&szlig;e Gruppe von Menschen gerichtet sind, haben tausende von Worten -
aber wenn Sie mit jemanden auf einer Party sprechen, brauchen Sie nur
hundert Worte!</p>

<p>Ich versuche, alles auf eine &quot;Seite&quot; zu bringen. In den
meisten F&auml;llen bedeutet das, da&szlig; der Text nur 25 Zeilen lang
sein darf. (Ja, diese Seite ist viel, sehr viel zu lang f&uuml;r eine
Email!)</p>

<h3>Zusammenfassung</h3>

<p>Zusammenfassend kann man sagen: fassen Sie sich kurz: kurze Zeilen,
kurze Abs&auml;tze, kurze Nachricht.</p>

<hr>

<p>Weiter zum Thema <a href="onl_email04.html">Ausdruck</a><br>
zur&uuml;ck zum Thema <a href="onl_email02.html">Textgestaltung</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a></p>

<hr>
        
<p>Bitte beachten Sie die <a href="onl_email00.html#Copyright">Copyright-Information</a>. </p>
<p>&nbsp;
</body>
</html>
