        <!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Matthias Puch">
<TITLE>Allgemeine Informationen</TITLE>
<BASEFONT SIZE="3">
</HEAD>
<BODY background="gfx/Back2.jpg">
<H2 align="CENTER">Allgemeine Informationen zu diesem Dokument</H2>
<HR noshade color="#00000"></P>
Urspr&uuml;nglich hatten wir unsere Amigah&auml;ndlerliste f&uuml;r den deutschsprachigen Raum im AmigaGuide&reg;-Format erstellt. Nach einigen Vorschl&auml;gen von Usern, die sich mit uns in Verbindung gesetzt hatten und etwas &Uuml;berlegung beschlossen wir, auch eine HTML-Version zu erstellen, da diese "Sprache" wesentliche Vorteile gegen&uuml;ber dem AmigaGuide&reg;-Format bietet:</P>
<OL>
 <LI><FONT COLOR="#3366CC">Plattformunabh&auml;ngigkeit</FONT><BR> 
HTML-Dokumente lassen sich auf praktisch jedem zeitgem&auml;&szlig;en Rechner lesen. Da die Portierung des UAE auf viele Rechnersysteme diese Liste auch f&uuml;r nicht-Amiga-User interessant machen k&ouml;nnte, ist dies ein wesentlicher Vorteil gegen&uuml;ber der AmigaGuide-Version.
<LI><FONT COLOR="#3366cc">Bessere Gestaltungm&ouml;glichkeiten</FONT><BR>
HTML bietet gegen&uuml;ber dem rein Text-basierten AmigaGuide-System weitreichende grafische Gestaltungsm&ouml;glichkeiten, die das Lesen dieser Liste wesentlich angehmer machen. Genannt seien hier insbesondere die praktischen Frames. 
<LI><FONT COLOR="#3366cc">Hyperlinks</FONT><BR>
Der wesentliche Vorteil und der letztendlich entscheidende Grund, warum wir eine HTML-Version in Angriff genommen haben, ist nat&uuml;rlich die Tatsache, da&szlig; HTML die "Sprache des WWW" ist. Wer in der Liste einen f&uuml;r sich interessanten H&auml;ndler ersp&auml;ht, kann (eine Internetverbindung vorausgesetzt) mit einem Mausklick auf die Homepage dieses H&auml;ndelers verzweigen, eine EMail schreiben oder die WWW-Adresse f&uuml;r die sp&auml;tere Verwendung in die Bookmark-Liste aufnehmen.<BR>Diese M&ouml;glichkeiten kann AmigaGuide&reg; leider nicht bieten.
</OL></P>
<HR width="80%" color="#00000" size=1"></P>
Eine kleine Anmerkung noch vom "Designer" dieses HTML-Dokuments :<BR>
Dies ist mein erstes HTML-Projekt und wird daher Design-Fehler enthalten, die sich auf gewissen Konfigurationen (Bildschirmaufl&ouml;sung-/tiefe, Browserzeichens&auml;tze usw.) in einer unsch&ouml;nen Darstellung &auml;u&szlig;ern werden.<BR>
Auf den getesteten Konfigurationen traten zwar keinerlei Probleme auf, wenn Sie aber auf Ihrer Rechnerkonfiguration derartige Probleme bemerken sollten, z&ouml;gern Sie bitte nicht, <A HREF="credit.html">mich davon wissen zu lassen</A>, damit ich den HTML-Code entsprechend &uuml;berarbeiten kann.</P>
<HR color="#000000" noshade></P> 
</BODY>
</HTML>