<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, annihilator, carnival diablos">
<title>Annihilator: Carnival Diablos</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Annihilator: Carnival Diablos</font></center></h1></P>
<p>Auch wenn das Cover eher die neueste Scheibe von Napalm Death oder Six Feet Under erahnen l&#228;sst, sind hier mal wieder Gitarrenhero Jeff Waters und der Rest von seiner Band Annihilator am Werke gewesen. Zum ersten mal steht &#252;brigens ex-Overkill Gitarrist Joe Comeau hinter dem Mikro und entpuppt sich als Gl&#252;cksgriff - er hatte zwar vor &#252;ber zehn Jahren schon auf dem Liege Lord Album &quot;Master Control&quot; schon eindrucksvoll unter Beweis gestellt, da&#223; er nicht nur Gitarre spielen kann, sondern auch an den Vocals eine prima Figur macht, aber das er derma&#223;en perfekt r&#252;ber kommt wie auf dieser Scheibe, h&#228;tte ich nun wirklich nicht gedacht: Seine leicht aggressive Stimme passt perfekt in die typischen Power / Trash Kompositionen von Jeff Waters, kann aber ebenso melodi&#246;s r&#252;berkommen und sogar Schreie der Marke Rob Halford finden sich auf &quot;Carnival Diablos&quot;. Aber nicht nur die Vocals k&#246;nnen begeistern, sondern auch die Songs: So sind Kompositionen wie &quot;The Perfect Virus&quot;, &quot;Battered&quot; oder &quot;The Rush&quot; absolute Highlight`s und 
brauchen sich auch hinter den bisherigen Meisterwerken der Band nicht verstecken. Neben der passenden Power kann vor allem das astreine Gitarrenspiel begeistern und zeigt einmal mehr, da&#223; Jeff Waters zu einem der begnadesten Gitarristen &#252;berhaupt geh&#246;rt - das Angebot, bei Savatage einzusteigen kam also nicht von ungef&#228;hr. Aber auch gem&#228;&#223;igtere Kompositionen wie &quot;Time Bomb&quot; oder der astreine Midtempo Titeltrack haben sicherlich ihren Reiz. Etwas verwundert hat mich allerdings die AC / DC Homage &quot;Shallow Grave&quot;, die zwar nicht so richtig zum Rest des Materials passen will, sich aber dennoch hervorragend auf der Scheibe macht und f&#252;r den einen oder anderen Schmunzler sorgt. Hervorhebenswert ist dann noch der trashige Rauskicker &quot;Hunter Killer&quot; an dessen Anschluss man noch einige musikalische Gags von den Jungs von Annihilator finden kann. Bleibt also unter dem Strich eine wirklich astreine Power / Trash Platte &#252;brig, die mit dem Opener &quot;Denied&quot; und dem meiner Meinung nach zu durchschnittlichem &quot;Liquid Oval&quot; nur zwei 
Kompositionen enth&#228;lt, die mich nicht gerade umgepustet haben. Davon abgesehen ist &quot;Carnival Diablos&quot; eine richtig geile Platte geworden, die alle begeistern wird, die mit dem momentanen Trend hin zum melodischem &amp; glattgeb&#252;geltem melodischem Power Metal / True Metal nichts anfangen k&#246;nnen.</P> 

<p>Fazit: 9 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P>
</Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
