<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, athena, twilight of days">
<title>Athena: Twilight Of Days</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Athena: Twilight Of Days</font></center></h1></P>

<p>Kann sich noch jemand an das `98er Album &quot;A New Religion?&quot; der italienischen Band Athena erinnern? Das via Rising Sun erschienene Album konnte mit seiner Mischung aus melodischem Power Metal und diversen Progressive Einfl&#252;ssen des Marke Dream Theater durchaus begeistern und nicht zuletzt durch ex-Labyrinth / Rhapsody / Vision Divine S&#228;nger Fabio Leone, der dieses Album eingesungen hat, respektabele Absatzzahlen vorweisen. Gut zweieimnhalb Jahre sp&#228;ter steht der Nachfolger namens &quot;Twilight Of Days&quot; in den L&#228;den. Besetzungstechnisch hat sich allerdings innerhalb dieses Zeitraums einiges getan: So sind mitlerweile nur noch Simone Pellegrini und Gabriele Guidi aus dem &quot;A New Religion?&quot; Line-up mit von der Partie - alle anderen Positionen wurden neu besetzt, was insbesondere bei der des S&#228;ngers schmerzhaft auff&#228;llt: So kann Franceso Neretti seinem Vorg&#228;nger zu keiner Sekunde das Wasser reichen, was sich insbesondere in den hohen Passagen bemerkbar macht, die zu kraftlos daherkommen. Aber auch musikalisch hat sich einiges getan: Die ehemals vorhandenen progressiven Einfl&#252;sse wurden komplett aus dem Soundbild von Athena verbannt, womit die Band nun beim lupenreinen melodischen Power Metal angelangt ist, den sich heutzutage nahezu jede x-beliebige Band auf die Fahnen geschrieben hat. Das soll jetzt nicht hei&#223;en, da&#223; Athena sich bewusst diesem Trend angegliedert haben, aber leider ist das neue Material auch bei weitem nicht so stark ausgefallen, als das man Athena aus der Masse der Band herausheben k&#246;nnte. So sind Songs wie der Opener und gleichzeitige Titeltrack &quot;Twilight Of Days&quot;, das eing&#228;ngige und f&#252;r meinen Geschmack st&#228;rkste St&#252;ck &quot;Touch My Heart&quot; oder auch das epische und mit einigen Tempowechseln versehene &quot;The Way To Heaven`s Gates&quot; zwar ganz nett zu konsumieren, aber die wahren Highlights fehlen auf &quot;Twilight Of Days&quot; ganz eindeutig. So hat man zu keinem Zeitpunkt das Gef&#252;hl, da&#223; wirklich etwas im Ohr h&#228;ngen bleibt, wenngleich die Band ihr Handwerk ganz sicher versteht. Auch die Story, die als Basis f&#252;r dieses Album dient, ist zu schwach und klischeebeladen ausgefallen. Ein letzter Kritikpunkt ist die in meinen Augen etwas schwache Produktion, der irgendwie der letzte Kick und der n&#246;tige Druck fehlt, was insbesondere den massiv in den Hintergrund ger&#252;ckten Gitarren geschadet hat. Alles in allem ist &quot;Twilight Of Days&quot; zwar kein schlechtes, aber eben auch kein wirklich rundherum gelungenes Album geworden, zumal die Masse an besseren Konkurrenten in diesem Bereich erdr&#252;ckend ist.</P> 

<p>Fazit: 6 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
