<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, freedom call, crystal empire">
<title>Freedom Call: Crystal Empire</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Freedom Call: Crystal Empire</font></center></h1></P>

<p>Im Sommer des Jahres 1999 erschien die Debut CD &quot;Stairway To Fairyland&quot;, die stilistisch nicht selten an die grandiosen Helloween Alben &quot;Keeper Of The Seven Keys - Part I und II&quot; erinnerte und durch die Mitwirkung von Drummer Daniel Zimermann von Gamma Ray eher den Eindruck eines Sideprojekts erweckte. So reagierte die Presse auch eher zur&#252;ckhaltend auf dieses, meiner Meinung nach grandiose Album. Mit der Zeit mauserten sich Freedom Call aber zu einer richtigen Band, was man nicht nur durch zahlreiche Konzerte, sondern auch mit der &quot;Taragon EP&quot; (die nur in Frankreich erschienen ist) eindrucksvoll unter Beweis stellte. Nun ist das neue Studioalbum erschienen, welches den auf dem Debutalbum eingeschlagenen musikalischen Weg nat&#252;rlich weiter geht und somit mit 10 einfach nachzuvollziehenden, melodischen Speed Nummern in alter Helloween Tradition aufwarten kann. Dabei ist &quot;Crystal Empire&quot; aber ganz sicher kein Abziehbild des Debutalbums geworden: Man 
pr&#228;sentiert sich einen Tick softer, bombastischer und pomp&#246;ser, so da&#223; stellenweise schon Vergleiche mit Queen wach werden k&#246;nnen. Auff&#228;llig ist diese Tatsache insbesondere bei Tracks wie dem f&#252;r Freedom 
Call Verh&#228;ltnisse unerwartetem &quot;Pharao&quot; oder dem abschlie&#223;enden &quot;The Wanderer&quot;. Nat&#252;rlich d&#252;rfen auch die typischen Uptempo Nummern der Marke Gamma Ray nicht fehlen, die in Form des Openers &quot;Freedom Call&quot;, &quot;Rise Up&quot; oder auch &quot;Heart Of The Rainbow&quot; auf &quot;Crystal Empire&quot; zu finden sind. Fans von epischen Kl&#228;ngen werden aber insbesondere das siebeneinhalb-min&#252;tige Werk &quot;Quest&quot; - eingeleitet &#252;brigens von einem Piano Solo von Ferdy Doernberg (u.a. Rough Silk, Axel Rudi Pell) - in ihr Herz schlie&#223;en, welches soetwas wie den musikalischen Mittelpunkt von &quot;Crystal Empire&quot; darstellt. Mich pers&#246;nlich konnte &quot;Crystal Empire&quot;, das mit Ohrw&#252;rmern geradezu durchsetzt ist, auf voller Linie &#252;berzeugen und ist insgesamt ein mehr als w&#252;rdiger Nachfolger zu &quot;Stairway To Fairyland&quot; geworden - meiner Ansicht nach gibt es nicht einen F&#252;lltrack auf dieser Scheibe. 
Ewige N&#246;rgler werden der Band zwar den zu platten Umgang mit Klischee`s vorwerfen und bezeichnen Freedom Call als den x-ten Clon von Helloween, aber ich bin mir ziemlich sicher, da&#223; die Band mit &quot;Crystal Empire&quot; durchaus ein eigenes Gesicht gewonnen hat und mit dieser neuen CD nicht nur Fans von Helloween begeistern wird. Melodic Metal Fans k&#246;nnen hier blind zugreifen!</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P>
</Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
