<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, iced earth, melancholy">
<title>Iced Earth: The Melancholy EP</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Iced Earth: The Melancholy EP</font></center></h1></P>

<p>Nachdem diese EP lange angek&#252;ndigt wurde und immer wieder nach hinten verschoben wurde, ist sie nun endlich erh&#228;ltlich. Mit gut 31 Minuten Spielzeit mag der Preis von 19 DM f&#252;r eine EP durchaus gerechtfertigt sein - k&#246;nnte man zumindest denken, denn von den insgesamt 7 Songs, d&#252;rften 3 jedem Iced Earth Fan vom letzten Studioalbum &quot;Something Wicked this Way Comes&quot; bekannt sein: &quot;Melancholy (Holy Martyr)&quot;, &quot;Watching Over Me&quot; und &quot;I Died For You&quot; sind auf dieser EP absolut identisch mit den jeweiligen Albumversionen. Bei den vier neuen St&#252;cken handelt es sich auch nur bedingt um neues Material, denn die Judas Priest Coverversion &quot;The Ripper&quot; wurde bereits vor einigen Jahren auf dem &quot;Tribute To Judas Priest&quot; Sampler aus dem Hause Century Media 
verbraten. Bleiben drei echte Neuheiten f&#252;r Fans: Da w&#228;re sicherlich erstmal die Bad Company Coverversion &quot;Shooting Star&quot; zu nennen, die Iced Earth von einer ungewohnt soften und unagressiven Seite zeigt.  Beim ersten h&#246;ren wirkt das vielleicht etwas merkw&#252;rdig, aber sp&#228;testens nach dem vierten oder f&#252;nften Durchlauf wird jeder Iced Earth Fan auch diese, bisher unbekannte Facette der Band zu sch&#228;tzen wissen. Auch die Coverversion des Black Sabbath Alltime-Classic &quot;Electric Funreal&quot; kann begeistern, da es sich eben nicht nur um ein nachgespieltes Original handelt. Vielmehr hat es die Band geschafft, dem Sabbath Klassiker ihre eigene Handschrift aufzudr&#252;cken. Last but not least w&#228;re da noch eine Liveversion von &quot;Colours&quot; aus den &quot;Alive In Athens&quot; Sessions - das St&#252;ck hatte es seinerzeit nicht mehr auf die Platte geschafft, wird aber jetzt nachgereicht. Insgesamt ist &quot;The Melancholy EP&quot; eine mehr als zwiesp&#228;ltige Angelegenheit: Entstanden ist die CD zwar nur auf ausdr&#252;ckliche Nachfragen vieler Fans (urspr&#252;nglich war diese EP eine reine Promo CD f&#252;r den amerikanischen Markt, die nur in geringer St&#252;ckzahl gefertigt wurde und zwischenzeitlich zu horrenden Preisen verkauft wurde) und ist auch nur f&#252;r diese gedacht (alle anderen, die mit dem Material von Iced Earth nicht vertraut sind, sollten den letzten Longplayer antesten). Das man sich als Fan dennoch &#252;ber die 20 Mark teure Investition aufregen kann, liegt an der billigen Aufmachung - statt eines kleinen Bookletts, gibt`s lediglich eine Inlay Card mit dem Cover auf der einen und einigen Infos auf der anderen Seite. Eine derma&#223;en billige Aufmachung gibt`s eigentlich nur bei Maxi CD`s, was f&#252;r die drei bis vier neuen St&#252;cke auch v&#246;llig ausgereicht h&#228;tte, zumal der Preis einer Maxi CD allemal humaner ist, als der einer EP. Sorry, aber da h&#228;tte man echt freundlicher mit den Fans umgehen k&#246;nnen.</P>

<p>Fazit: --- </P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
