<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Vorwort</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><u><b>Tach auch!</U></B><BR>
Sch&#246;n, da&#223; ich Euch alle wieder einmal zu einer neuen Ausgabe der Metal Corner begr&#252;&#223;en darf, die Euch hoffentlich zusagt. Allerdings muss ich an dies
er Stelle erstmal gewaltig Dampf ablassen:Es gibt offensichtlich Metal Fans, die den momentanen Aufwschwung des True Metals, Melodic Metals oder auch Melodic Power Metals (ist ohnehin egal, da das alles ohnehin zusammenh&#228;ngt und ich eigentlich kein Freund dieses Schubladendenkens bin) kritisch gegen&#252;berstehen bzw. diese Arten des Heavy Metal schlicht und ergreifend nicht m&#246;gen. Das ist f&#252;r mich als Fan dieser Musikrichtung v&#246;llig in Ordnung. Auch ich muss mich manchmal zusammenrei&#223;en, wenn ich Musik aus dem Death oder Black Metal Sektor h&#246;re - als Beispiel kann ich nur die neue Six Feet Under CD &quot;Graveyard Classics&quot; anf&#252;hren, die ausschlie&#223;lich Coverversionen enth&#228;lt und bei dessen &quot;Genuss&quot; ich mich beinahe &#252;bergeben h&#228;tte. Ok, das soll aber nicht das Thema an dieser Stelle sein - wenn jemand Probleme mit Musik (welcher Art auch immer) hat, kann er das ja sagen und das Thema ist gegessen. M&#228;chtig aufgeregt habe ich mich allerdings &#252;ber einen Artikel von Wolf R&#252;diger M&#252;hlmann, seines Zeichens Schreiber f&#252;r die Rock Hard (nachzulesen in Ausgabe 2 / 2001): Der gute Mensch zieht da derma&#223;en &#252;ber Acts wie HammerFall und Rhapsody her, da&#223; es schon nicht mehr lustig ist. Ob der gute Mann da &#252;berhaupt 
wei&#223;, was er schreibt? Als Beispiel sei nur ein Zitat angef&#252;hrt:<i> &quot;Und bei Dir Luca Turilli, setzen wir einfach einen Radiergummi an und entfernen ein paar Buchstaben aus Deinem total beschissenem Namen - als &quot;Luculi&quot; oder einfach &quot;Carl&quot; kannste dann Pizza ausfahren - aber bitte ohne Ges&#228;nge.&quot;</I> Das war noch eines der harmloseren Zitate aus dieser Kolummne. Wie gesagt, man kann Musik m&#246;gen oder nicht - das ist v&#246;llig ok. Sich aber &#252;ber Namen von K&#252;nstlern zu beschwehren, hat mit Kritik nichts mehr zu tun und wird eigentlich nur von Pseudo Journalisten der Marke Bravo betrieben - dem Rock Hard hatte ich bisher zugetraut, da etwas gr&#252;ndlicher zu arbeiten...<BR>
Tut, mir m&#228;chtig leid, da&#223; ich Euch hier mit meinem Geschwafele so aufrege, aber irgendwie musste ich einfach mal etwas Dampf ablassen. Deswegen verzichte ich auch auf gro&#223;artige weitere Worte, verweise noch schnell auf unsere <a href="http://in.germany.com/powerplant" target="_blank">Homepage</A> (http://in.germany.com/powerplant) und w&#252;nsche Euch viel Spa&#223; mit der vorliegenden Ausgabe!</P>

<p>Kilian<blink> &quot;The Bruce&quot;</Blink> Servais</P>

<p>P.S.: Kommentare / Meinungen - auch &#252;ber dieses Vorwort - k&#246;nnen auf unsere Homepage bald in einem Forum diskutiert werden (ab ca. Mitte Februar).</P>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
