<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - Hardware Grundlagen </TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Nadel&ouml;hr und Flaschenhals</H1><B>Hardware-Grundlagen /2</B><BR>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A><BR>
</DIV>
<H2>Vorwort</H2><BR>
Diese voraussichtlich dreiteilige Serie befa&szlig;t sich mit der (Amiga-)
Hardware und ihren Beschr&auml;nkungen. Ich m&ouml;chte die Beziehungen der
einzelnen Baugruppen untereinander erl&auml;utern und auf die resultierenden
Engp&auml;sse eingehen. Es soll dabei keine wissenschaftliche Abhandlung
werden, sondern im g&uuml;nstigen Fall eine Wissensgrundlage bieten, von der
aus man mit Verstand seinen Amiga erweitern und verbessern kann. Die
vorgesehenen Themen im Einzelnen:
<PRE><B>
           Teil 1: Prozessor, Takt und Speicher
           Teil 2: Bussysteme
           Teil 3: Peripherie
</B></PRE>
<H3>Was ist ein Bus?</H3>
<P>In der ersten Folge habe ich bereits etwas vorgegriffen und den Adress-
und Datenbus vorgestellt. Zur Erinnerung: Der Adressbus legt einen
bestimmten Ort, eine Adresse im System fest, an die eine bestimmte
Aktion gerichtet ist. Zum Beispiel kann dies eine Speicheradresse sein,
die gelesen oder beschrieben werden soll. Damit stellt sich die Frage,
wor&uuml;ber diese Adresse dann gelesen werden kann. Dazu dient der Datenbus,
der ein Datum (= Einzahl von &quot;Daten&quot;) dazu bereitstellt.</P><P>
Damit ist aber noch nicht alles geregelt. Zus&auml;tzlich gibt es noch einen
Steuerbus, der z.B. festlegt, ob die Daten nun gelesen, oder geschrieben
werden, der den Systemtakt &uuml;bertr&auml;gt, die Versorgungsspannungen
bereitstellt, usw..</P><P>
Typisch ist, da&szlig; alle Busse so aufgebaut sind, der auf dem Motherboard
genauso, wie z.B. die Verbindung zum Diskettenlaufwerk oder zur Festplatte.
Unterschiede gibt es vor allem in der Breite des Datenbusses und in der
Abschirmung des Busses. Vor allem letzteres wird deutlich, wenn man zwei
Busse vergleicht: Den IDE- und den SCSI-Bus.</P>
<H3>Der SCSI-Bus</H3>
<P>SCSI bedeutet soviel wie &quot;Small Computer System Interface&quot; und in der
Tat sitzt auf einem SCSI-Ger&auml;t immer ein kleiner Computer. Der Bus bietet
aufgrund dieser Tatsache auch die M&ouml;glichkeit zum Multitasking, um nicht
ein schnelles Ger&auml;t durch ein langsames auszubremsen. M&ouml;glich ist der
Anschlu&szlig; von sieben Ger&auml;ten, wie z.B. Festplatten, Scanner, Wechselplatten.
</P><P>
SCSI und FastSCSI sind 8 Bit-Bussysteme. Auf dem zugeh&ouml;rigen 50-poligen
Kabel ist also noch eine Menge Platz. Neben dem Steuerbus, der u.A. das
Multitasking erledigt, ist noch ein Datenbus integriert (8 Leitungen), die
das jeweilige SCSI-Ger&auml;t ausw&auml;hlen und Daten transportieren. Trotzdem ist
noch eine Menge an Kabeln frei. Oder doch nicht, denn zwischen jeder
Leitung, die ein Signal f&uuml;hrt, liegt noch eine andere Leitung, die auf
Masse liegt. Diese Konstruktion f&uuml;hrt dazu, da&szlig; St&ouml;rstrahlungen, wie sie
die hochfrequenten Signale im Computerbereich immer produzieren, effektiv
unterdr&uuml;ckt werden.</P><P>F&uuml;r das modernere WideSCSI mit 16 Bit-Datenbus werden einfach nur
breitere Kabel mit mehr Leitungen verwendet. B&auml;nde sprechen auch die
maximalen Leitungsl&auml;ngen. Mit normalem SCSI kann in einer unkritischen
Umgebung, also einem Raum mit wenigen, gut abgeschirmten elektrischen
Ger&auml;ten, durchaus eine Kabell&auml;nge bis 10 Meter erreicht werden. FastSCSI
verdoppelt den Bustakt, so da&szlig; sich auch die praktikable Leitungsl&auml;nge
mindestens halbiert. Mehr als drei Meter sollte man trotzdem nicht
benutzen.</P>
<H3>Und der IDE-Bus?</H3>
<P>Geschwindigkeitsm&auml;&szlig;ig sind sich die beiden Busse, gro&szlig;z&uuml;gig gerechnet,
ebenb&uuml;rtig. Der IDE-Bus kann mitunter sogar etwas schneller sein, da er
kein Multitasking zul&auml;&szlig;t, sich also nicht um ein Busprotokoll bem&uuml;hen mu&szlig;.
</P><P>Leider sind keine Masseleitungen zwischen den Signalen vorgesehen, so da&szlig;
die maximale Leitungsl&auml;nge bei einem halben Meter (genauer: 46 cm) liegt.
Somit ist der IDE-Bus nur f&uuml;r interne Ger&auml;te (Festplatten, CDROMs)
geeignet.</P><P>
Der IDE-Bus ist sogar von Haus aus ein 16 Bit-Bus, jedoch bremst auch hier
die fehlende Abschirmung. Bis n&auml;mlich ein Signal stabil am Bus anliegt,
mu&szlig; es sich erst &quot;einschwingen&quot;. Das hei&szlig;t nichts anderes, als da&szlig; man
nicht einfach ein Signal anlegen und der Empf&auml;nger es sofort auslesen
kann. Man braucht eine gewisse Wartezeit, bis man sicher sein kann, da&szlig;
das Signal auch so anliegt, wie man es haben m&ouml;chte. Resultat ist eine
langsamere &Uuml;bertragung, als m&ouml;glich w&auml;re.</P><P>
Aber auch der IDE-Bus bietet die M&ouml;glichkeit, maximal zwei Ger&auml;te
anzuschlie&szlig;en. Der Pferdefu&szlig; dabei ist, da&szlig; immer nur ein Ger&auml;t den Bus
belegen kann. Hat man ein Ger&auml;t, das den Bus dauernd voll auslastet, h&auml;lt
das andere solange an, bis er wieder frei ist.</P>
<H3>Die Praxis</H3>
<P>Der Amiga (1200, 4000) erlaubt mit einem schnellen Prozessor eine
&Uuml;bertragungsrate von fast 2.5 MByte pro Sekunde auf dem IDE-Bus. Leider
ist der Prozessor damit zu 100 Prozent ausgelastet. Betreibt man jetzt
eine moderne Festplatte, so verschenkt man gut die H&auml;lfte der m&ouml;glichen
Geschwindigkeit. Daran kann man leider nichts &auml;ndern, denn der Controller
im Amiga leistet nicht mehr. Auch die erh&auml;ltlichen Zorro2-Einsteckkarten
mit IDE-Anschlu&szlig; sind nicht schneller.</P><P>
Hat man eine Festplatte und einen CD-Brenner angeschlossen, so produziert
man fast pausenlos defekte CDs, weil die Festplatte die Daten mit
Maximalgeschwindigkeit liefert und so den Prozessor lahmlegt, der dem
CD-Brenner einen kontinuierlichen Datenstrom liefern mu&szlig;, damit die CD
ohne Fehler gebrannt wird. Selbst wenn man einen SCSI-Brenner einsetzt,
geht nichts, da der Prozessor noch genauso belastet ist.</P><P>
Selbst beim einfachen Kopieren von Dateien merkt man schnell, da&szlig; sich
das reine IDE-System ziemlich ruckelig verh&auml;lt. Wer jedoch nicht vorhat,
seinen Rechner aufzur&uuml;sten, kann damit leben. Irgendwann nervt es aber
trotzdem.</P><P>
Der SCSI-Bus dagegen bietet als FastSCSI eine angenehm lange Leitung,
gepaart mit hoher &Uuml;bertragungsrate (bis zu 10 MByte/s auf dem Bus) und
einem fl&uuml;ssigen System. Eine typische Prozessorlast liegt f&uuml;r SCSI bei
5 bis 10 Prozent pro Ger&auml;t. Es bleibt also selbst bei schnellen Ger&auml;ten
immer genug Rechenleistung frei, um andere, ebenfalls schnelle Ger&auml;te zu
bedienen.</P>
<H3>Die Exoten</H3>
<p>Ein Bus-Sonderling ist der Disketten-Port. Eigentlich ist es eine
einfache, serielle &Uuml;bertragung, also ein Datenbus mit einer einzigen
Leitung und ein paar Steuerleitungen. Egal, was man hier anschlie&szlig;t,
es bleibt langsam.</P><P>
Der Zorro2- und Zorro3-Bus ist eine Spezialit&auml;t des Amiga, und deswegen
hier ein Exot. Diese Busse findet man in den "gro&szlig;en" Amigas, wie A2000,
A3000, A4000 und den Towerumbauten der diversen Firmen.
</P><P> Zorro2 wurde dem MC68000-Prozessor auf den Leib geschneidert,
deswegen ist es ein 24 Bit-Adressbus mit 16 Bit-Datenbus. Die maximale
Geschwindigkeit liegt, wie beim IDE-Bus, bei etwa 2.5 MByte/s. F&uuml;r
Karten, die nur niedrige Datenraten zulassen, wie Schnittstellenkarten
und ISDN-Karten, ist dieser Bus wegen seiner relativen Einfachheit ideal.
</P><P>Dann kamen die vollwertigen 32 Bit-Prozessoren und (damals noch)
Commodore hatte ein Problem. Der Zorro3-Bus mu&szlig;te nun in den fast voll
belegten Zorro2-Bus eingezw&auml;ngt werden, um ein einfaches Plug And Play
zu erreichen. Einen neuen Bus schien man den Usern nicht zumuten zu wollen.
</P><P>Leider geht dies etwas auf Kosten der Geschwindigkeit. Da n&auml;mlich zu
wenig Platz im Slot ist, mu&szlig; der Zorro3-Bus seine Steuerung in zwei
Phasen vornehmen, einer Adress- und einer Datenphase. Dabei werden
manche Pins doppelt genutzt, zuerst als Adress-, dann als Datensignal.
Trotzdem ist die dabei erzielte Geschwindigkeit h&ouml;her als beim Zorro2-
Bus, so da&szlig; nun auch anspruchsvollere Einsteckkarten, wie Grafikkarten
mit 16 Mio. Farben und hoher Aufl&ouml;sung m&ouml;glich waren.
</P><P>Die au&szlig;erdem vorhandenen ISA-Slots sind eigentlich unn&uuml;tz. F&uuml;r Amiga-
Karten sind sie unerreichbar, nur sogenannte Br&uuml;ckenkarten - PC-Karten,
die gleichzeitig im Zorro- und im ISA-Slot stecken - nutzen sie. Richtig
ausgereift war diese Variante aber auch nie so recht. Eine Vernetzung
eines externen PCs &uuml;ber Ethernet ist einfacher und auf beiden Seiten
bequemer zu warten.
</P><P>Der Amiga 600 und 1200 hat au&szlig;erdem noch einen PCMCIA-Slot. Dieser
&quot;Scheckkarten-Anschlu&szlig;&quot; ist ein recht n&uuml;tzlicher 16 Bit-Bus, an den man
Ger&auml;te wie CDROMs, Schnittstellenkarten und andere Spezialanfertigungen
stecken kann. Spezialanfertigungen deshalb, weil ein Interface daf&uuml;r
sorgen mu&szlig;, da&szlig; das angeschlossene Ger&auml;t richtig angesprochen wird.
</P><P>Die einzigen direkt nutzbaren Ger&auml;te sind PCMCIA Memory Cards, also
Speichererweiterungen. Alle anderen L&ouml;sungen, wie z.B. externe CDROMs
setzen den PCMCIA-Bus einfach nur auf einen IDE-Bus um, um ein
preisg&uuml;nstiges Standard-CDROM benutzen zu k&ouml;nnen. Das Problem hierbei
liegt bei den Treibern, denn mit einer solchen L&ouml;sung macht man sich
von einem Hersteller abh&auml;ngig. Aber solange es funktioniert, warum
nicht. Man hat sowieso keine andere Wahl beim nicht so
anschlu&szlig;freudigen &quot;kleinen&quot; Amiga.</P>
<H3>Zweite Zwischenbilanz</H3>
<P>Auf die Dauer macht das gleichzeitige, reibungslose Zusammenspiel
mehrerer, auch langsamerer Komponenten mehr Sinn, als eine Highspeed-
Schleuder und das zwangsl&auml;ufige D&auml;umchendrehen, bis der Rechner wieder
bedienbar wird.</P><P>
Man sollte sich vorher im Klaren sein, ob man in absehbarer Zeit das
System erweitern will, oder nicht. Nur eine unbedacht gekaufte
Komponente kann den Einsatz einer zweiten ernsthaft behindern (IDE-
Platte &lt;-&gt; CD-Brenner). Am allerbesten l&auml;&szlig;t man sich beim Kauf ein
R&uuml;ckgaberecht zusichern, falls Probleme auftreten. Man mu&szlig; halt nur
einen H&auml;ndler finden, der dazu bereit ist...</P>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9806gs.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9806bas.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
