<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Hardware Grundlagen </TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Superdisk LS - 120 &amp; IDE-Fix</H1>von<BR><A HREF="mailto:GrafikArtStudio@t-online.de">J&uuml;rgen Rosch</A><BR>
</DIV>
<P>
Das <B>Diskettenlaufwerk LS-120</B> kommt mit einem ATAPI-(IDE-)Anschlu&szlig; und
einem sechssprachigem Bedienungshandbuch in gedruckter Form. Leider
fehlt im Lieferumfang ein passender Treiber, der durch den Zusatzkauf
von IDE-Fix, einem speziellen Treiberpaket f&uuml;r den HD-Controller
ausgeglichen werden kann. Auch mit der Demoversion aus dem Aminet
kann das Laufwerk betrieben werden.
</P><P>
<B>IDE-Fix</B> ben&ouml;tigt OS 2.04 oder besser. F&uuml;r den Betrieb des 4-Ger&auml;te-
Adapters ist Kickstart 3.0 oder besser Voraussetzung. Getestet wurde
auf einem Amiga 1200, Blizzard 1230IV, 32 MB Fast-Ram mit OS3.1 und
IDE-Fix.
</P><P>
Das LS-120 ist ein neuartiges Diskettenlaufwerk der besonderen Art. Es
verwendet sowohl die HD- als auch die DD-Disketten mit allen Formaten,
die der Amiga als Treiber in Devs:DosDrivers vorliegen hat. Zus&auml;tzlich
verwaltet das Laufwerk Disketten bis 120 MB Kapazit&auml;t.
</P><P>
Leider sieht das <B>Handbuch</B> keinerlei Tips f&uuml;r den Amiga-Anwender vor und
es ist immer die Rede vom PC. Die Mountdateien und die passenden Befehle
kommen von IDE-Fix (auch IDE-Fix-DEMO), so da&szlig; sich die Amiga-User nicht
davor f&uuml;rchten m&uuml;ssen, das LS-120 zu benutzen.
</P><P>
IDE-Fix besteht in der Vollversion aus einer Diskette. Das Handbuch liegt
in Form einer Readme-Datei vor und beschreibt alle M&ouml;glichkeiten von IDE-
Fix. Die Demo-Version beharrt alle 30 Minuten auf die Best&auml;tigung eines
Nerv-Requesters, ansonsten sind alle Funktionen aktiv.
</P><P>
IDE-Fix bietet viele <B>Extras</B>, wie z.B. das Autoparken der Festplatte,
Erkennung von Wechselplatten, Leistungssteigerung der Festplatte, CD32-
Emulator, PlayCD und erm&ouml;glicht ein Betreiben aller Ger&auml;te, die sich an
die ATAPI-Norm 1.2 oder besser halten.
</P><P>
Da das Laufwerk nicht mit einem eigenen Geh&auml;use ausgeliefert wird, ist der
erste Grund f&uuml;r einen kleinen Tower gegeben. Das LS-120 pa&szlig;t anstandslos
in einen 3,5 Zoll-Schacht und wird &uuml;ber das IDE-Kabel angeschlossen.
</P><P>
Sollten Sie jedoch schon eine Festplatte und ein CD-ROM am IDE-Port
betreiben, bleibt Ihnen nur noch das <B>IDE-FIX-Modul</B>. Das Modul f&uuml;gt der
IDE-Schnittstelle zwei weitere Ports hinzu. Damit ist es m&ouml;glich bis zu
vier Ger&auml;te am IDE-Port zu betreiben.
</P><P>
F&uuml;r den <B>Einbau</B> sind keinerlei L&ouml;tkenntnisse erforderlich und er ist
innerhalb von  ca. 20 Minuten erledigt. IDE-Fix sorgt f&uuml;r die Installation
der Mount-Dateien und meldet das Device auf Wunsch auch gleich an. Da das
Superlaufwerk LS-120 mit einem Medium ausgeliefert wird, steht dem Backup
auf einem dieser neuen Disketten nichts mehr im Wege. Die Medien sind
vorformatiert und k&ouml;nnen sowohl vom Amiga als auch vom PC gelesen werden.
</P><P>
Wenn das Laufwerk l&auml;nger als vier Sekunden keinen Befehl empf&auml;ngt,
schaltet es in den Stromsparbetrieb. Somit werden Motor und Laser
abgeschaltet und geschont. Die <B>&Uuml;bertragungsraten</B> (lt. Hersteller)
betragen zwischen 375 - 680 KBytes/s und die durchschnittliche
Zugriffzeit betr&auml;gt 70 Millisekunden.
</P><P>
Im Gegensatz zu den normalen Laufwerken arbeitet das LS-120 ca. 6x
schneller, da die Daten nicht &uuml;ber den Disketten-Controller geschickt
werden. Ein Backup mit einer Datenmenge von 42 MB ben&ouml;tigte 29 Minuten.
</P><P>
Das Laufwerk ist zudem im Stande normale DD und HD-Disketten zu
beschreiben, zu lesen oder zu formatieren. Allein durch die Tatsache,
da&szlig; ein normales HD-Laufwerk schon 100.- DM kostet ist ein Preis von
180.- incl. eines Mediums f&uuml;r das LS-120 angemessen. F&uuml;r ein weiteres
Medium mit einer Kapazit&auml;t von 120 MB sind 22,80 DM f&auml;llig.
</P><P>
Innerhalb der vierw&ouml;chigen Testphase gab es keinerlei Probleme, weder
mit der Hardware noch mit der Software. Die Daten wurden sehr schnell
gefunden und auch gelesen. Auch wenn die Diskette gewechselt wurde,
erkannte der Amiga diese v&ouml;llig anstandslos.
</P><P>
<B>Fazit:</B>
</P><P>
Jedem, der eine Datenflut an Bildern, Musikmodulen oder wichtigen
Programmen hat, ist das <B>LS-120</B> zu empfehlen. Die Daten k&ouml;nnen schnell
und sicher auf eine Diskette gespeichert werden. Leider ist nur durch
die Kombination mit IDE-Fix eine problemlose Integration in das
Amigasystem m&ouml;glich, da die Hersteller den Amiga nicht als
vollwertigen Computer ansehen.
</P><P>
<B>IDE-Fix</B> ist f&uuml;r alle von Interesse, denen zwei IDE-Anschl&uuml;sse nicht
ausreichen und neben Festplatten und CD-Roms auch andere ATAPI-Ger&auml;te
anschlie&szlig;en m&ouml;chten.
</P><P>
<TABLE BORDER=1>
<CAPTION>Bewertung:</CAPTION>
<TR>
    <TH>Produkt:</TH><TD>SuperDisk LS-120</TD><TH>Hersteller:</TH><TD>Imation</TD>
</TR>
<TR>
    <TH>Art:</TH><TD>Floppy</TD><TH>Version:</TH><TD>LKM-F434-1</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>180 DM</TD><TH>Bez.Quelle:</TH><TD><A HREF="http://www.dreieinhalb.de">DreiEinHalb</A></TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH>Leistungsf&auml;higkeit:</TH><TD ALIGN="CENTER">1</TD><TD ALIGN=CENTER ROWSPAN=4 COLSPAN=2><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TH>Benutzerfreundlich:</TH><TD ALIGN=CENTER>2</TD>
</TR>
<TR>
    <TH>Dokumentation:</TH><TD ALIGN=CENTER>1</TD>
</TR>
<TR>
    <TH>Preis-/Leistung:</TH><TD ALIGN=CENTER>1</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH COLSPAN="2">Gesamt:</TH><TD COLSPAN=2 ALIGN=CENTER>1</TD>
</TR>
</TABLE>
<br>
<TABLE BORDER=1>
<CAPTION>Bewertung:</CAPTION>
<TR>
    <TH>Produkt:</TH><TD>IDE-Fix</TD><TH>Hersteller:</TH><TD>Elaborate Bytes</TD>
</TR>
<TR>
    <TH>Art:</TH><TD>IDE-Treibr</TD><TH>Version:</TH><TD>97</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>60 DM (100 incl.Modul)</TD><TH>Bez.Quelle:</TH><TD>AmiNet+Handel</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH>Leistungsf&auml;higkeit:</TH><TD ALIGN="CENTER">1</TD><TD ALIGN=CENTER ROWSPAN=4 COLSPAN=2><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TH>Benutzerfreundlich:</TH><TD ALIGN=CENTER>1</TD>
</TR>
<TR>
    <TH>Dokumentation:</TH><TD ALIGN=CENTER>4</TD>
</TR>
<TR>
    <TH>Preis-/Leistung:</TH><TD ALIGN=CENTER>2</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH COLSPAN="2">Gesamt:</TH><TD COLSPAN=2 ALIGN=CENTER>2</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TD COLSPAN="4">Oliver Kastl, Am Westpark 5, 81373 M&uuml;nchen</TD>
</TR>
</TABLE>
</TD></TR></TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9809hw.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9809bb.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
