<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Hardware Grundlagen </TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Nadel&ouml;hr und Flaschenhals</H1><B>Hardware-Grundlagen /3</B><BR>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A><BR>
</DIV>
<H2>Vorwort</H2><BR>
Diese voraussichtlich dreiteilige Serie befa&szlig;t sich mit der (Amiga-)
Hardware und ihren Beschr&auml;nkungen. Ich m&ouml;chte die Beziehungen der
einzelnen Baugruppen untereinander erl&auml;utern und auf die resultierenden
Engp&auml;sse eingehen. Es soll dabei keine wissenschaftliche Abhandlung
werden, sondern im g&uuml;nstigen Fall eine Wissensgrundlage bieten, von der
aus man mit Verstand seinen Amiga erweitern und verbessern kann. Die
vorgesehenen Themen im Einzelnen:
<PRE><B>
           <A HREF="9803hw.htm">Teil 1: Prozessor, Takt und Speicher</A>
           <A HREF="9806hw.htm">Teil 2: Bussysteme</A>
           Teil 3: Peripherie
</B></PRE>
<H3>Die Peripherie</H3>
<P> Nachdem ich in den beiden ersten Folgen das eigentliche Herz eines
Computers beschrieben habe, widmet sich der letzte Teil den auf den
ersten Blick untergeordneten Funktionsgruppen eines PCs. Auf den
zweiten Blick mu&szlig; man erkennen, da&szlig; die Peripherieger&auml;te aber die
Schnittstelle zur Au&szlig;enwelt und vor allem zum User sind. Ohne
Druckeranschlu&szlig; kann man keine selbsterstellte Grafik ausdrucken
und an die Wand h&auml;ngen, ohne seriellen Anschlu&szlig; kein Modem und
Internetzugang betreiben, ohne Tastatur nicht einmal einen Brief
schreiben. Und ohne Grafikausgang g&auml;be es nicht einmal ein Bild
von dem, was man mit dem Computer fabriziert.
</P><P>
<B>Gute Sicht</B>
</P><P>
Der Hauptsinn des Menschen ist der Sehsinn. Wenn wir etwas sehen,
verstehen wir besser, als wenn wir uns etwas abstrakt vorstellen
m&uuml;ssen. Sehr wichtig ist deswegen der Monitor, und als Ansteuerung
desselben, die Grafik(-karte).
</P><P>
Der Ur-Amiga konnte bereits im HAM6-Modus 4096 Farben gleichzeitig
darstellen, damals eine Sensation, heute eigentlich l&auml;cherlich, da
moderne Grafikprozessoren mit vielen Millionen Farben wesentlich
schneller sind. Das Problem ist, da&szlig; so viele Pixel gar nicht auf
den Bildschirm passen. Selbst mit guter Grafikkarte und noch besserem
Monitor kann man nur etwa eine Dreiviertel Million Pixel in annehmbarer
Qualit&auml;t auf einmal darstellen, will man nicht ein total verflimmertes
Bild in Kauf nehmen.
</P><P>
Im Grunde geht es bei der Grafikausgabe auch nicht mehr um m&ouml;glichst
viele Farben auf einmal auf dem Bildschirm, sondern um m&ouml;glichst feine
Farbabstufungen, die bei einer 24-Bit-Grafik aber bereits so fein sind,
da&szlig; sie das menschliche Auge gar nicht mehr wahrnehmen kann. Noch
offensichtlicher ist das bei Graustufen: Das Auge kann nur etwa 100
Grauwerte tats&auml;chlich unterscheiden.
</P><P>
Am wichtigsten ist eine hohe Bildwiederholfrequenz und eine hohe
Aufl&ouml;sung, die man jedoch nicht dazu mi&szlig;brauchen sollte, mit
Miniaturfonts m&ouml;glichst viel auf den Bildschirm zu quetschen. Eine
h&ouml;here Aufl&ouml;sung sollte auch mit gr&ouml;&szlig;eren Schriften genutzt werden,
da diese dann nicht so eckig ausfallen und dadurch besser lesbar sind.
</P><P>
Die Bildwiederholfrequenz sollte zwischen 70 und 80 Hertz liegen,
mehr schadet nicht, aber es bringt auch nichts weiter als zus&auml;tzliche
Prozessorbelastung. Besonders mit der Raumbeleuchtung mu&szlig; man hier
aufpassen. Leuchtstoffr&ouml;hren und (leider) auch Energiesparlampen
haben in einem Zimmer, in dem ein Bildschirm steht, nichts verloren.
Diese Leuchten flackern n&auml;mlich mit 50 Hz vor sich hin und es bildet
sich, zusammen mit der Bildwiederholfrequenz, Interferenzflackern.
</P><P>
Als Beispiel: L&auml;uft der Monitor mit 75 Hz, so liegt der gr&ouml;&szlig;te
gemeinsame Teiler bei 25. Die Bildfrequenz &quot;vermischt&quot; sich also mit
der Leuchtstoffr&ouml;hre zu der sehr niedrigen Frequenz von 25 Hz, die dem
Auge nat&uuml;rlich nicht sehr gut tut. Gl&uuml;hlampen sind in dem Zusammenhang
unkritisch, da sie keine Lichtblitze erzeugen, wie Leuchtstoffr&ouml;hren,
sondern nur leichte Helligkeitsschwankungen.
</P><P>
<B>Was tun ?</B>
</P><P>
Die Bedingungen oben sind leichter gesagt, als erf&uuml;llt. Mit der
eingebauten Amigagrafik ist man weit von &quot;Ergonomie&quot; entfernt. Die
geforderten 70 Hertz kann man zwar mit einigen Screenmodi erreichen,
aber einen Monitor, der diese dann auch darstellt, ist schwer zu finden.
</P><P>
Haupts&auml;chlich wird die Bildausgabe durch zwei Gr&ouml;&szlig;en bestimmt: Die
Horizontalfrequenz und die Vertikalfrequenz (=Bildwiederholfrequenz).
Begrenzt werden diese haupts&auml;chlich durch den Monitor, beim Amiga
allerdings auch durch die Grafikchips. Auf jeden Fall ist eine
Grafikkarte zu empfehlen, wenn man seinen Augen etwas Gutes g&ouml;nnen
m&ouml;chte.
</P><P>
Schon die Horizontalfrequenz ist der erste Stolperstein. Ein neuerer
Amiga (1200, 4000) stellt von Haus aus nur Frequenzen von 15 kHz bis
31 kHz zur Verf&uuml;gung, die meisten Monitore im Handel fangen aber erst
bei 30 kHz an. Abhilfe schaffen z.B. Scandoubler, die die
Horizontalfrequenz einfach verdoppeln, also auf 30 kHz bis 54 kHz.
Warum nur 54 kHz ? Man kann sich sparen, die Frequenzen, die schon
&uuml;ber 30 kHz liegen, auch noch zu verdoppeln, da sie der Monitor ja
schon erkennt. Und die n&auml;chsten krummen Amigafrequenzen liegen bei
24 bis 27 kHz. Nur einen gravierenden Nachteil haben die Scandoubler:
Es lassen sich keine Super-Hires-Modi damit anzeigen, bei diesen fehlt
jeder zweite horizontale Pixel.
</P><P>
Die Vertikalfrequenz ist die, die das Auge als flimmern wahrnimmt,
z.B. beim Fernseher. Ausgeben kann der Amiga hier Frequenzen von 50
bis 70 Hz. Leider ist das f&uuml;r das Auge immer noch nicht flimmerfrei.
Deswegen ist eine Grafikkarte vielleicht ein Spa&szlig;killer, weil die
meisten Spiele darauf nicht laufen, aber sie ist wesentlich besser
f&uuml;r die Augen.
</P><P>
Mit den beiden Frequenzen verbunden sind auch die Bildaufl&ouml;sungen.
Die Horizontalfrequenz errechnet sich aus dem Produkt der vertikalen
Anzahl der Pixel und der gew&uuml;nschten Bildwiederholfrequenz, plus 5 %:
</P><P>
   Fh = PixV * Fv * 1,05
</P><P>
Will man also eine Aufl&ouml;sung von 800 mal 600 Pixel bei 75 Hz, so kommt
man auf folgendes:
</P><P>
   Fh = 600 * 75 Hz * 1,05
</P><P>
   <U>Fh</U> = 47250 Hz = <U>47,25 kHz</U>
</P>

<P>
<OL>
<LI>Folgerung: F&uuml;r die Amigagrafik ist das unerreichbar. </LI>
<LI>Folgerung: Der Monitor mu&szlig; mindestens 48 kHz Horizontalfrequenz verkraften.</LI>
</OL>

<P>Oft findet man auch die Bandbreite in MHz f&uuml;r einen Monitor in den
technischen Daten. Das ist nichts anderes, als die Anzahl der
horizontalen Pixel mal der Horizontalfrequenz plus 10 %. F&uuml;r unsere
Beispielrechnung braucht man also (...</P><P>

   BB = PixH * Fh * 1,1
</P><P>
   BB = 800 * 47,25 kHz * 1,1
</P><P>
   <U>BB</U> = 41580 kHz = <U>41,58 MHz</U>
</P><P>
...) einen Monitor, der mindestens 42 MHz Bandbreite hat. Aber Vorsicht
bei der Berechnung mit den Amiga-Werten: Super-Hires und Interlace sind
Tricks, die zwar die Aufl&ouml;sung erh&ouml;hen, aber nicht die Bandbreite.
Folglich geht immer einer der Frequenzwerte in den Keller, was sich mit
Flimmern bemerkbar macht.
</P><P>
Weiterhin wichtig ist auch der Bildr&ouml;hrendurchmesser des Monitors. Als
Faustregel gilt folgendes:
</P><P>
   Ein 14 Zoll-Monitor stellt 640 mal 480 Pixel noch sauber dar.
   Ein 15 Zoll-Monitor schafft noch 800 mal 600 Pixel.
   Ein 17 Zoll-Monitor ist gut f&uuml;r 1024 mal 768 Pixel.
   Ein 19 Zoll-Monitor ist f&uuml;r den Amiga eigentlich schon Verschwendung,
   wenn man nicht gerade eine PowerUp-Karte mit ad&auml;quater Grafikkarte
   besitzt.
</P><P>
Zum Abschlu&szlig; noch ein Appell an die Vernunft:
</P><P>
Man sollte in der Farbtiefe nicht &uuml;bertreiben. Sicher sieht eine
Workbench in 24 Bit toll aus, aber die Grafikkarte sitzt im Systembus
(meistens Zorro 3) und der kann nur begrenzt Daten anliefern. Eine
einfache Rechnung: 800 mal 600 Pixel Aufl&ouml;sung in 24 Bit (= 3 Byte
Daten f&uuml;r jeden Bildpunkt) und 75 Hz Wiederholfrequenz:
</P><P>
Datenmenge = 800 * 600 * 3 * 75 = satte 103 MByte pro Sekunde !!!
</P><P>
Das ist weniger schlimm, wenn sich nur kleine Teile des Displays
&auml;ndern, aber &ouml;ffnet man ein Workbenchfenster, das einen gr&ouml;&szlig;eren Teil
des Bildschirms einnimmt, handelt man sich massive Darstellungsfehler
und Flackereffekte ein.
</P><P>
<B>Maus und Tastatur</B>
</P><P>
Diese Eingabeger&auml;te sind die unproblematischsten: Sie warten die meiste
Zeit auf Eingaben des Benutzers, und der ist bekanntlich das langsamste
Peripherieger&auml;t am Computer. Zum Keyboard nur soviel: Es ist eine einfache
serielle &Uuml;bertragung, die pro gedr&uuml;ckter Taste ein Byte an Daten liefert.
Die individuelle Datenrate kann sich jeder anhand seiner Anschl&auml;ge pro
Minute ausrechnen.
</P><P>
An der Maus interessiert nur, da&szlig; es zwei Arten von M&auml;usetechnik gibt:
Die mit serieller &Uuml;bertagung (f&uuml;r den PC) und Busm&auml;use, wie sie der Amiga
und einige wenige PCs benutzen. Durch einen einfachen Zwischenstecker kann
man PC-Busm&auml;use auch am Amiga nutzen. Anleitungen dazu gibt's z.B. im
Aminet unter &quot;hard/hack&quot;. Genauso gibt es dort Treiber, die es erlauben,
eine serielle PC-Maus am Amiga einzusetzen. Der einzige Grund, dies zu
tun, w&auml;re der g&uuml;nstige Preis der PC-M&auml;use. Der einzige serielle Port des
Amiga ist dann aber blockiert. Au&szlig;erdem ist ein Amiga-Treiber f&uuml;r die
serielle Maus nur im Multitasking funktionsf&auml;hig - Spiele, die dieses
abschalten, schalten damit auch die Maus ab...
</P><P>
Die wichtigste Angabe bei der Maus sind allerdings die DPI (Dots Per Inch
= Punkte pro Zoll). Dieser Wert gibt an, wieviele Bildschirmpixel der
Mauszeiger zur&uuml;cklegt, wenn man ihn einen Zoll auf der Mausmatte bewegt.
Je h&ouml;her der Wert, umso &quot;lebendiger&quot; die Maus, bzw. umso kleiner mu&szlig; der
Platz f&uuml;r das Nagetier auf dem Schreibtisch sein. Umso schwerer f&auml;llt aber
auch das Zielen bei Malprogrammen und Spielen...
</P><P>
Gute Werte liegen bei 400 dpi und h&ouml;her; benutzt man kleine
Bildschirmaufl&ouml;sungen, tun es auch 200 dpi, wie sie die
mitgelieferte Amiga-Standardmaus hat.
</P><P>
<B>Die serielle Schnittstelle</B>
</P><P>
Diese Schnittstelle ist zum schw&auml;chsten Glied des Amiga geworden. Moderne
serielle Schnittstellen k&ouml;nnen bis &uuml;ber 400 kBit pro Sekunde &uuml;bertragen,
der Durchschnittsamiga (mit 68030 Prozessor) tut sich schon bei 100 kBit
sehr schwer. Der Grund daf&uuml;r liegt am Ein-Ausgabepuffer, bzw. daran, da&szlig;
die eingebaute serielle Schnittstelle des Amiga so etwas gar nicht hat.
</P><P>
Der Prozessor mu&szlig; nun die Schnittstelle so schnell abfragen, da&szlig; ihm kein
Bit entgeht, denn es wird ja nichts zwischengespeichert. In einem
Multitaskingsystem ist das nat&uuml;rlich t&ouml;dlich, denn entweder bleibt dann
kaum Prozessorzeit f&uuml;r andere Anwendungen &uuml;brig, oder es gehen ab und zu
ein paar Bits verloren, so da&szlig; Datenpakete neu angefordert werden m&uuml;ssen,
in der Hoffnung, da&szlig; beim n&auml;chsten Versuch alles r&uuml;berkommt.
</P><P>
Die dritte M&ouml;glichkeit ist einfach die, die Geschwindigkeit nicht so hoch
einzustellen, dann sind moderne Modems mit 33 kBit pro Sekunde aber nicht
bis zur vollen Geschwindigkeit ausgereizt. Pauschal kann man rechnen, da&szlig;
die m&ouml;gliche Datenrate des seriellen Ger&auml;ts mindestens die doppelte
Geschwindigkeit zum Computer hin verlangt. Ein 28.8 kBit Modem sollte
also mit mindestens 57.6 kBit an der seriellen Schnittstelle betrieben
werden.
</P><P>
Es empfielt sich, bei intensiver Nutzung der seriellen Schnittstelle
gleich eine zus&auml;tzliche Schnittstellenkarte einzusetzen, diese bietet
gen&uuml;gend Reserven f&uuml;r g&auml;ngige serielle Ger&auml;te.
</P><P>
<B>Die parallele Schnittstelle</B>
</P><P>
Viel mehr als einen Drucker wird man hier nicht anschlie&szlig;en wollen.
Zwar gibt es, vor allem im PC-Bereich, einige Ger&auml;te, die man an den
Parallelport anschlie&szlig;en kann, aber keines davon ist f&uuml;r den Amiga
geeignet, einfach, weil es keine Treiber gibt. Solche Ger&auml;te sind
meistens als Low-Cost-Ausf&uuml;hrungen f&uuml;r den Wintel-PC gedacht und da
mu&szlig; man schon Gl&uuml;ck haben, wenn &uuml;berhaupt Windows NT oder IBMs OS/2
unterst&uuml;tzt werden. An den Amiga braucht man da gar nicht denken.
</P><P>
Der Parallelport ist, wie die serielle Schnittstelle, vollst&auml;ndig
prozessorabh&auml;ngig. Je schneller der Prozessor, desto sicherer (nicht
besser). Der Unterschied ist nur, da&szlig; der Parallelport 8 Bit auf einmal
&uuml;bertr&auml;gt und ein etwas aufwendigeres Hardwareprotokoll besitzt.
</P><P>
An <A HREF="9803tint.htm">Druckern</A> gibt es mittlerweile eine riesige Auswahl an Ger&auml;ten f&uuml;r
spezielle Anwendungen und in jeder Preisklasse, z.B. Fotodrucker,
Universaldrucker, auf Text abgestimmte Drucker, einfarbig, vierfarbig,
mit getrennten Schwarz- und Farbtanks, sogar Farblaser. Am besten, man
liest die einschl&auml;gigen PC-Magazine und beachtet die einzige
Einschr&auml;nkung, die es f&uuml;r den Amiga gibt: Eigens f&uuml;r Windows (3.1)
konzipierte Drucker, sogenannte GDI-Drucker, funktionieren am Amiga
NICHT. &Uuml;brigens auch nicht mit Windows NT, OS/2, Linux oder am
Macintosh.
</P><P>
<B>Das Fazit</B>
</P><P>
Der Amiga ist in jeder Hinsicht ein besonderer Computer. Man kann nicht
einfach in den Laden gehen und das kaufen, was am PC problemlos (?)
pa&szlig;t. Man kann genausowenig erwarten, da&szlig; der Verk&auml;ufer im Laden &uuml;ber
den Amiga Bescheid wei&szlig;, dazu ist unsere Freundin einfach zu unbedeutend
geworden.
</P><P>
Am sichersten f&auml;hrt man, wenn man den Amiga zum Kauf mitnimmt, oder ein
R&uuml;ckgaberecht einger&auml;umt bekommt. Meistens funktioniert dies am besten
beim kleinen PC-Shop um die Ecke. Erfahrungsgem&auml;&szlig; kennen die H&auml;ndler das
Gejammere der Au&szlig;enseiter-Rechner-Besitzer schon und haben sich darauf
eingestellt; manche vermitteln sogar Kontakte zu anderen erfahrenen
Usern.
</P><P>
Wenn man dann selbst schon grob die M&ouml;glichkeiten und Beschr&auml;nkungen der
eigenen Hardware kennt, sollte ein Fehlkauf eigentlich ausgeschlossen
sein. Sicher ist man aber erst, wenn das gekaufte Ger&auml;t auch wirklich
funktioniert.</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9809ssi.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809ls.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
