<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/99 - Projektb&ouml;rse</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Projektb&ouml;rse</H1></DIV>

 <B>Allgemein:</B>
<P>
 Dieser Bereich ist dazu da Kontakte zwischen Entwickler-Teams/Firmen
 und Kreativen zu kn&uuml;pfen. Wenn Angeh&ouml;rige einer der beiden &quot;Seiten&quot;
 also Interesse daran haben, dann sollten sie einfach eine eMail mit
 dem Betreff &quot;Projektb&ouml;rse&quot; an <A HREF="mailto:AmZeiger@gmx.de">AmZeiger@gmx.de</A> senden.
</P><P>
 Wir brauchen noch die Angabe, wie lange die Anzeige geschaltet werden
 soll und auch die Information, wenn eine Anzeige gegebenenfalls wieder
 entfernt werden kann! Wenn beides nicht erfolgt, wird die Anzeige nach
 drei Ausgaben automatisch wieder entfernt.
</P><P>
 Der Service ist kostenlos. Eventuelle K&uuml;rzungen des Umfangs bzw.
 Umformatierung behalten wir uns vor.</P>

<hr>

<p align=center><b>-&#062;Zus&auml;tzlicher Musiker f&uuml;r PHOENIX gesucht-</b></p>

F&uuml;r die Mitarbeit an "PHOENIX", einem Science Fiction Spiel f&uuml;r
Amiga/Mac in der Tradition von "Wing Commander" suchen wir noch
einen zus&auml;tzlichen Musiker.
<BR>

<P>Gew&uuml;nschte Stilrichtung: orchestral, filmartig.</P>

<P>Wenn DU der Meinung bist, dass Deine Musik sich von anderen abhebt,
dann freuen wir uns &uuml;ber eine Mail von Dir.
<BR></P>

<P>Erste Kontaktaufnahme &uuml;ber: <A HREF="mailto:emmanuel@arcormail.de">emmanuel@arcormail.de</A>
<BR></P>

<P>CU,
<BR></P>

<P>Emmanuel</P>

<P>Digital Artist<BR>
Project: PHOENIX
<BR></P>

<hr width=80%>

<p align=center><b>-&gt; Computer-Musiker f&uuml;r Spieleprojekt gesucht &lt;-</b></p>

Hallo Developer, die Ihr Euch aufgrund niveauloser Kompositionen und
brachial schlechter Soundqualit&auml;t an der Vertonung aktueller Amiga-
Spiele st&ouml;rt und niedergeschmettert die Geh&ouml;hrg&auml;nge zu verstopfen
sucht...</p><p>
Ihr wollt, da&szlig; EUER Kind nicht SO abst&uuml;rtzt? :) ... Auf diesem
Wege m&ouml;chte ich noch einmal darauf hinweisen, da&szlig; ich gern mit
hochwertiger Audio-Erg&auml;nzung ein professionelles Amiga-Spieleprojekt
supporten w&uuml;rde, so da&szlig; das Baby nach allen Seiten gl&auml;nzt!
Denkt dran, denkt dran: die Audiowelt ist elementar und es z&auml;hlt
der Gesamteindruck! Ernstgemeinte Vorschl&auml;ge bitte an :
<BR>

<P><A HREF="mailto:headcleaningact@gmx.de">Frank Gutschow</A></P>

<hr width=80%>

2)
<p align=center><b>-&gt; Virtuelle BBS-Welt &lt;-</b></p>

<P>Hi an alle,</P>


<P>Neulich fiel mir beim Aufr&auml;umen eine alte Mappe in die H&auml;nde, in der ich
Pl&auml;ne, die ich mal f&uuml;r ein virtuelles Telefonsystem gezeichnet habe,
aufbewahre. Diese Pl&auml;ne enthalten 4 Welten mit insgesamt ca. 400 R&auml;umen
und ca. 100 Foren. Urspr&uuml;nglich war mal geplant, dieses System f&uuml;r so
viele Leute wie nur m&ouml;glich (ca.30) zug&auml;nglich zu machen und die
Rufnummer als eine 0190er zu schalten.</P>


<P>Zum besseren Verst&auml;ndnis, so ungef&auml;hr sollte die ganze Sache f&uuml;r den
User ablaufen:
<BR></P>

<OL type=1 start=1 >
  <LI VALUE="1">
  Einwahlprozess, der Rechner antwortet &uuml;ber Voice</LI>

  <LI VALUE="2">
  Abfrage des Accounts</LI>

  <LI VALUE="3">
  Der User landet im ersten Raum der virtuellen Welt. Von dort aus kann
  er sich &uuml;ber die Tastenkombinationen 52 (f&uuml;r vorn), 58 (f&uuml;r zur&uuml;ck),
  54 (f&uuml;r links) und 56 (f&uuml;r rechts) frei in der ganzen Welt bewegen.</LI>

</OL>

<P>Soweit, sogut. Leider wurden diese Pl&auml;ne nie realisiert. Das System
existierte zwar, aber nur als Testversion. Mittlerweile ist es wieder
vom Netz.</P>

<P>Jetzt kam mir die Idee, diese 4 Welten als eine Art <b>&quot;virtuelle BBS-Welt&quot;</b>
zu gestalten, in der jeder sich frei durch die R&auml;ume und Foren bewegen
kann. Sollten sich dann ein paar User im selben Raum befinden, k&ouml;nnen
diese untereinander chatten, nat&uuml;rlich zu den ganz normalen
Telefongeb&uuml;hren. (So meine Idee bis jetzt)</P>

<P>Der GROSSE Haken an der ganzen Sache ist nur, das ich nicht die n&ouml;tigen
Kenntnisse f&uuml;r ein solches Projekt habe. Aber vielleicht gibt es ja
unter Euch jemanden, der sich sowas zutraut. <b>Bei Interesse</b> E-Mail an
mich!</P>

<P>CU<BR></P>

<P>Micha</P>

<P><A HREF="mailto:fenris01@gmx.de">Michael Seibt</A>
<BR></P>

<hr width=80%>

3)

<p align=center><b>-&#062; Browser-Projekt &#060;-</b></p>

<P> Hi !</P>

<P> Wir (Deutsche Amiga Software Schmiede) sind ein Programmierer-Club
 und <B>suchen</B> noch weitere Leute, die an unserem Projekt mitarbeiten.</P>

 <P>Es handelt sich um einen weiteren <B>Amiga-Browser</B>.</P>

 <P>weitere Infos bei mir.</P>

 <P>Ren&eacute; Zimmerling (<A HREF="mailto:vyger@demigod.ruhr.de">vyger@demigod.ruhr.de</A>)</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../cc/9912bas.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9912poin.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

