<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/99 - Willkommen zur Coder's Corner!</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Willkommen zur Coder's Corner!</H1>von<BR>
<A HREF="mailto:empire_mm@t-online.de">Marco Miljak</A></DIV>

<P><b>Hallo</b> und willkommen zur neuen Coder's Corner (die nat&uuml;rlich viiiel 
besser
ist als die alte, hehe ;-). Da Carsten aus zeitlichen Gr&uuml;nden diese Rubrik
nicht mehr weiterf&uuml;hren konnte, habe ich mich von Gregor dazu &uuml;berreden
lassen, diese Arbeit zu &uuml;bernehmen.</P>

<P>Zun&auml;chst mal <b>ein paar Worte zu mir</b>: Meine Computerlaufbahn hat gegen das
Jahr 1987 begonnen, und zwar mit einem Schneider CPC 6128, auf dem ich
vorzugsweise in BASIC programmiert oder stupide Spiele gedaddelt habe.
1991 kam mein erster Amiga ins Haus, ein A500. Kurz danach noch ein
A2000, den ich bis heute benutze.</P>

<P>Von Anfang an hat mich das Programmieren fasziniert, und nach einigen
Abstechern zu Pascal und Assembler bin ich schlie&szlig;lich bei C gelandet,
meiner heutigen Lieblingssprache. Einfach deshalb, weil C alles in sich
vereint: sie ist leistungsf&auml;higer als Pascal oder Basic, aber leichter
zu durchschauen als Assembler.</P>

<P>In der Coder's Corner m&ouml;chte ich mein Wissen, das ich mir &uuml;ber die Jahre
angesammelt habe, an andere Interessierte weitergeben. <b>Ich w&uuml;rde mich
&uuml;brigens sehr &uuml;ber Zuschriften freuen</b>, einfach nur um zu erfahren, welche
Themengebiete besonders gefragt sind.</P>

<P>Noch <b>eine Bemerkung</b> zum Abschlu&szlig;: Der Schwierigkeitsgrad der einzelnen
CC-Artikel wird mehr oder weniger variieren, d.h. ich werde mich nicht
nur auf Anf&auml;ngerthemen beschr&auml;nken, ebenso wie ich nicht nur "Hohes C"
behandeln werde. Ich m&ouml;chte eine m&ouml;glichst breite Palette von Gebieten
behandeln und auch m&ouml;glichst vielen Programmierern interessanten Lesestoff
bieten.</P>

<P>So, diese Einf&uuml;hrung ist jetzt lang genug, denke ich :-). Ich hoffe, Ihr
habt Spa&szlig; an der neuen CC. Solltet Ihr Fragen oder Anregungen haben, ich
stehe Euch gerne unter folgender Adresse zur Verf&uuml;gung:</P>

<center> eMail: <a href="mailto:empire_mm@t-online.de">empire_mm@t-online.de</a>
<p>(Marco Miljak, Ulrichstra&szlig;e 2/3, 73235 Weilheim/Teck)</P></center>

<P>Mit amigianischen Gr&uuml;&szlig;en</P>


<P><b>Marco Miljak</b><BR>
Coder's Corner-Redakteur<BR></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../hw/9912maus.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9912pb.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
