<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues zum AmigaNG</H1>
<H2>1. Neues Executive Update von AMIGA-Pr&auml;sident Bill McEwen</H2>
<P>
&raquo;8. August 2000 - Ich gr&uuml;&szlig;e die weltweite Amiga-Familie
</P>
<P>
Die letzten Wochen waren recht hektisch und diese Woche bringt sogar noch
mehr Bewegung.
</P>
<P>
In den n&auml;chsten Tagen sind einige neue Ank&uuml;ndigungen zu erwarten, die jeden
interessieren werden, denn wir arbeiten hart daran, neue Mitglieder zur
Amiga-Familie hinzu zu gewinnen.
</P>
<P>
Ich m&ouml;chte gern ein kr&auml;ftiges &quot;Danke sch&ouml;n!&quot; all' denen sagen, die an der
Show in Sacramento. Kalifornien, teilgenommen haben, ein weiterer ganz
besonderer Dank an Euch, John und Jan Zacharius und an die &uuml;brigen
Mitgliedern der SACC-Gruppe. Sie haben gro&szlig;artige Arbeit geleistet.
</P>
<P>
Ich schreibe diese Zeilen als eine schnelle Antwort auf einige Fragen, die
ich in den letzten 48 Stunden erhalten habe.
</P>
<P>
Wie schon fr&uuml;her gesagt, fragen Sie, wenn Sie etwas h&ouml;ren, was best&auml;tigt
werden muss. Jeder Mitarbeiter der Amiga-Mannschaft ist &auml;u&szlig;erst gern bereit
Fragen zu beantworten. Es erm&uuml;det einen allm&auml;hlich, wenn uns immer wieder
Ger&uuml;chte mitgeteilt werden, die schon seit Tagen oder Wochen da drau&szlig;en die
Runde machen.
</P>
<P>
Hier sind die Antworten auf Fragen, die sofort angesprochen werden m&uuml;ssen:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">Sobald die &uuml;brigen A1200 verkauft sind, ziehen Sie sich aus&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Deutschland zur&uuml;ck.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort: Nein. Wir planen nicht, Deutschland zu verlassen. Tats&auml;chlich&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">suchen wir nach M&ouml;glichkeiten, unsere Pr&auml;senz in ganz Europa, Asien,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">S&uuml;d-Amerika und sogar hier in Nord-Amerika zu verst&auml;rken. Es liegen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">einige Vorstellungen auf dem Tisch und einige Namen sind damit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">verbunden. Weitere Mitteilungen dar&uuml;ber werden ver&ouml;ffentlicht werden,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">wenn diese Pl&auml;ne weit genug gediehen sind.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Ganz bestimmt vernachl&auml;ssigen wir auf keinen Fall die Gesch&auml;fte auf&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">diesen M&auml;rkten. Wir sind eine aufstrebende Gesellschaft und erwarten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">viel von der Zukunft.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2. Sie werden bald neue A4000 verkaufen und es werden bereits 1000 St&uuml;ck&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">dieser Rechner gebaut.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort: Wer hat nur diese Idee aufgebracht? Es werden keine neuen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Amigas hergestellt au&szlig;er den neuen Desktop-, Notebook- und Handger&auml;ten,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">die in Arbeit sind.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ich habe schon vorher darum gebeten und tue es nun wieder: Bitte bremsen
Sie diese Ger&uuml;chte. Wenn Sie eines h&ouml;ren, setzen Sie Sich direkt mit
irgendeinem Mitarbeiter bei AMIGA in Verbindung und wir werden Ihnen
antworten.
</P>
<P>
Danke f&uuml;r Ihre andauernde Unterst&uuml;tzung.
</P>
<P>
Beste Gr&uuml;&szlig;e von Bill McEwen und der &uuml;brigen AMIGA-Mannschaft&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
