<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. AMIGA und Red Hat vereinbaren Zusammenarbeit</H2>
<P>
&raquo;AMIGA und Red Hat arbeiten zusammen, um die Grundlage f&uuml;r spannende Spiele
und Anwender-Inhalte f&uuml;r die Desktop-, Set-Top-Boxen-, Spielmaschinen- und
Handheld-M&auml;rkte bereit zu stellen.
</P>
<P>
Spannende Spiele, rasend schnelles Java, neue Anwender-Umgebungen, all das
wird mit dem neuen Amiga SDK, das f&uuml;r $99.00 im Redhat.com Marketplace
erh&auml;ltlich ist, m&ouml;glich sein.
</P>
<P><B>Kontakt:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Melissa London&nbsp;</TD><TD VALIGN="TOP">Bill McEwen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">RedHat&nbsp;</TD><TD VALIGN="TOP">Amiga Incorporated&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">919.547.0012&nbsp;</TD><TD VALIGN="TOP">Tel.: 425-396-5660&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:bill@amiga.com">bill@amiga.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Snoqualmie, Washington, 21.August 2000 - AMIGA (www.amiga.com) gab heute
eine Vereinbarung mit Red Hat, Inc. (NASDAQ: RHAT), der f&uuml;hrenden
Gesellschaft bei Open-Source-Internet-Infrastruktur bekannt, um Multimedia
h&ouml;chster Leistung f&uuml;r die Linux-Plattform zur Verf&uuml;gung zu stellen. Die
Vereinbarung bietet der Redhat.com-Gemeinschaft den Zugang zu AMIGAs
Software Developer's Kit. Bill McEwen, AMIGA-Pr&auml;sident und CEO, sagte,
dass seine Gesellschaft Red Hat wegen ihrer f&uuml;hrenden Rolle und wegen
ihrer F&auml;higkeiten ausw&auml;hlte, bei der Entwicklung des neuen Amiga mit zu
arbeiten.
</P>
<P>
&quot;Die Amiga-Gemeinschaft hat schon wesentliche Dinge einschlie&szlig;lich Spielen
und erstaunlichen Java-Anwendungen mit dem Amiga SDK geschaffen. Aus den
Reaktionen, die wir von den Red-Hat-Mitarbeitern erfuhren, konnten wir
sehen, dass sie ganz genau wissen, was der Amiga f&uuml;r die Entwicklung der
Personalcomputer, wie wir sie heute kennen, bedeutete. Und noch wichtiger:
Sie sind sehr daran interessiert, die solide Grundlage, die wir geschaffen
haben, zu unterst&uuml;tzen und zu ihrem Ausbau bei zu tragen,&quot; sagte McEwen.
</P>
<P>
&quot;Wir freuen uns sehr, mit AMIGA zusammen arbeiten zu k&ouml;nnen,&quot; sagte Paul
McNamara, Vizepr&auml;sident f&uuml;r Produkte und Plattformen. &quot;Mit einem
Multimedia-Consumer-Layer, erh&auml;ltlich mit Red Hat als Grundlage, werden
neue M&auml;rkte und neue Kunden die Vorteile von Linux und der bei Redhat.com
bereit liegenden Software in Anspruch nehmen k&ouml;nnen.&quot;
</P>
<P>
&quot;Die strategische Zusammenarbeit und Partnerschaft mit der Tao Group in
Reading, England <www.tao-group.com>, die wir zu Beginn dieses Jahres
bekannt gaben, gibt dem neuen Amiga zusammen mit dieser Unterst&uuml;tzung
durch Red Hat einen sehr erfreulichen und realen Hintergrund,&quot; sagte
McEwen.
</P>
<P>
Das neue Amiga SDK ist die Verk&ouml;rperung der
Amiga-Multimedia-Computerpraxis. Mit Hilfsprogrammen (Tools),
Entwickler-Unterst&uuml;tzung und interessanten neuen Anwendungen, die schon f&uuml;r
den neuen Amiga in Arbeit sind, k&ouml;nnen Entwickler sofort anfangen, Spiele
und Multimedia-Anwendungen zu schaffen und k&ouml;nnen Java f&uuml;r noch mehr
M&ouml;glichkeiten einsetzen. Mit dem Kauf des SDK erhalten Entwickler in den
n&auml;chsten 12 Monaten freie Updates und den &quot;Scout Level&quot; in AMIGAs
Entwickler-Support-Programm.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<br>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
