<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Zusammenfassung der Ausgabe 3 von &raquo;Amiga World&laquo; (von Gernod Schomberg)</H2>
<H3>Amiga World Ausgabe 3 vom 14. August 2000</H3>
<P>
Mitte August erschien die Ausgabe Nr.3 der Amiga World auf der Website
<A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A> von AMIGA. Sie enth&auml;lt Vorstellungen von Amiga-
Mitarbeitern, Berichte &uuml;ber die neue Technik und von Partnergesellschaften
mit z.T. sehr interessanten Ausblicken. Der Inhalt dieser Ausgabe soll im
folgenden gek&uuml;rzt dargestellt werden.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">Words From The Top&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">(Worte von ganz oben)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die Einf&uuml;hrung schreibt diesmal Randall P. Hughes, VP Sales and Strategic
Business Development (Vizepr&auml;sident f&uuml;r Verkauf und strategische Gesch&auml;fts-
Entwicklung), der auch eine ausf&uuml;hrliche Beschreibung seines Werdeganges
gibt. Als Bankfachmann kam er &uuml;ber kanadische Banken zu QNX als Manager f&uuml;r
Verkaufs-Abrechnungen und war schlie&szlig;lich regionaler Verkaufleiter. Dort
lernte er Gateway und Amiga kennen und nachdem er bei der jungen Firma
Thinweb Technologies die Verkaufs- und Finanzabteilung eingerichtet hatte,
wurde er von Bill McEwen und Fleecy Moss gebeten, bei der &Uuml;bernahme von
Amiga in einer wesentlichen Position mit zu arbeiten. Er ist Mitbegr&uuml;nder
von AMIGA Inc. und damit, wie manche gern sagen, der &quot;Dritte Amiga&quot;.
</P>
<P>
Er sieht die bisherige Entwicklung als sehr erfolgreich an und erwartet,
dass das Amiversum einen &auml;hnlichen Einflu&szlig; auf die heutige Computertechnik
haben wird wie damals bei seinem Erscheinen der klassische Amiga.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">AMIGA Profile:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Dean Brown: Er macht Geschichte.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
AMIGA macht keine Hardware! Sie sind eine Software-Gesellschaft!
</P>
<P>
Plattform-Unabh&auml;ngigkeit, abstrakte Schichten, virtuelle Prozessoren, alles
ist Software!
</P>
<P>
Trotzdem eine Anmerkung: Wenn es &uuml;berhaupt wieder Amiga-Computer geben
soll, muss es Hardware-Pflichtenhefte geben - Regeln, was sie sein werden
und was in ihnen stecken soll. Idealerweise, wenigsten in den Vorstellungen
von AMIGA, sollte jemand mit Kenntnissen, Erfahrung und Visionen die
Philosophie fortf&uuml;hren, die urspr&uuml;nglich die Erfahrungen mit diesem Rechner
so wunderbar machte.
</P>
<P>
Dean Brown kam &uuml;ber andere Computer sehr fr&uuml;h zum Amiga und entwickelte die
ersten Peripherieger&auml;te (Speichererweiterungen) &uuml;berhaupt f&uuml;r den Amiga
1000 und begr&uuml;ndete damit seine Firma DKB Software. 1997 musste DKB
schlie&szlig;en. Durch sein weiteres Engagement f&uuml;r den Amiga kam er in Kontakt
zu Fleecy Moss und sie entdeckten viele Gemeinsamkeiten. So war es keine
&Uuml;berraschung, dass Fleecy Dean bat, f&uuml;r Amino/Amiga zu arbeiten. Nachdem
die ersten Produkte von AMIGA entworfen und entwickelt waren, wurde ihm ein
Vollzeit-Job angeboten und seit dem 5. Juni geh&ouml;rt Dean Brown zur
Mannschaft. Seine Position ist die eines Direktors f&uuml;r Hardware.
</P>
<P>
Dean beschreibt, dass seine Arbeit zun&auml;chst darin besteht, eine
Testplattform zu entwickeln, die den Firmen-internen Softwareteams zur
Verf&uuml;gung steht. Das Ergebnis wird zun&auml;chst heutigen Computern sehr &auml;hnlich
sehen. Diese oder eine &auml;hnliche Plattform wird dann den Hardware-Partnern
als Referenzsystem zur Verf&uuml;gung gestellt werden. Im weiteren Verlauf ist
eine neue Architektur zu erwarten, die auf die Dinge eingeht, mit denen
sich heutige Computer rumplagen m&uuml;ssen. Dinge, die mit unflexiblen
Operations-Systemen nicht in Ordnung gebracht werden k&ouml;nnen.
</P>
<P>
Nach Dean Brown's Meinung liegt ein Problem heutiger Computer darin, dass
alle Aufgaben durch einen zentralen Prozessor erledigt werden m&uuml;ssen und
tats&auml;chlich bei Verdopplung der Taktfrequenz nur ein
Geschwindigkeitszuwachs um etwa 20% eintritt, weil n&auml;mlich die Daten nicht
mit der erforderlichen Schnelligkeit bewegt werden k&ouml;nnen. &quot;Verteilte
Verarbeitung m&ouml;chte ich erreichen,&quot; sagt er. Und da habe Tao schon einen
Gro&szlig;teil der Probleme gel&ouml;st. Wenn geladen wird, &uuml;bersetzt der virtuelle
Prozessor aus dem VP-Code in den nativen Code, was bedeutet, dass derjenige
Prozessor arbeitet, dessen &Uuml;bersetzer-Code geladen wurde. Es k&ouml;nnen in
einem einzigen System also mehrere Prozessoren sein und der Code wird von
demjenigen verarbeitet, der am besten daf&uuml;r geeignet ist. Das entscheidet
sich beim Laden. Dazu kommt, dass bei einem System mit zentralem Prozessor
Daten mehrfach durchlaufen m&uuml;ssen, um eine Aktion auszuf&uuml;hren. In Tao's
verteiltem System ist es nur notwendig, das die Daten &uuml;berhaupt &uuml;bertragen
wurden. Das erlaubt den Einsatz mehrerer kleinerer, billiger Prozessoren,
die gemeinsam eine h&ouml;here Leistung bringen als eine &quot;schnelle&quot; CPU.
</P>
<P>
Verteilte Verarbeitung ist eine &auml;hnliche Philosophie wie beim klassischen
Amiga mit seinen Custom-Chips, aber es bestehen grunds&auml;tzliche
Unterschiede. Die Custom-Chips waren sehr spezialisiert und eng an das
Operationssystem gebunden. Deshalb musste bei jeder Hardware-&Auml;nderung das
OS umgeschrieben werden. Gerade deswegen und weil Commodore Code-Zugriffe
auf die Hardware unterst&uuml;tzte sowie forderte, alle lizensierten Programme
m&uuml;ssten auf allen OS-Versionen laufen, konnte der klassische Amiga nicht
auf neuere Technologien zugreifen.
</P>
<P>
Dean Brown arbeitet leidenschaftlich f&uuml;r eine &quot;R&uuml;ckw&auml;rts-Kompatibilit&auml;t&quot;,
die auf der Methodik der abstrakten Schichten (layers) beruht, die zentral
im der neuen Architektur stehen. &quot;Anwendungen, die versuchen diese
Schichten zu umgehen, sollen gezielt unterbrochen werden&quot;, sagt Dean.
</P>
<P>
Sobald die erste Hardware fertig ist, auf der das neue Operationssystem
nativ l&auml;uft, wird daneben eine Maschine stehen, deren Harware absolut
inkompatibel ist, auf der aber das gleiche OS eingerichtet ist.
Applikationen werden auf beiden Maschinen getestet. Wenn sie auf Beiden
laufen, ohne mit der Hardware zu kollidieren, wei&szlig; man, dass es ein OS-
legales Programm ist.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">AMIGA Main:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Bei Haage &amp; Partner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Amiga World f&uuml;hrte ein Interview mit Markus Nerding, dem Sprecher und
Webmaster von Haage und Partner. Hier eine Zusammenfassung der Aussagen.
</P>
<P>
Die Vorbereitungen f&uuml;r eine neue Generation von H&amp;P-Produkten begann vor
zwei Jahren. Damit hat die Gesellschaft eine f&uuml;hrende Position, wenn die
neue digitale Ausstattung von Amiga (Digital Environment), bezeichnet als
&quot;Ami&quot;, zur Verf&uuml;gung stehen wird.
</P>
<P>
Die Programmierer bei H&amp;P begr&uuml;&szlig;en vor allem den einmaligen Virtuellen
Prozessor, der das Herz des Ami darstellen wird. Der Programmierer braucht
sich nicht mehr um die Probleme einer bestimmten CPU zu k&uuml;mmern, da sein
bin&auml;res Programm auf einer sehr gro&szlig;en Menge von Computer-Plattformen
laufen wird - 40 verschiedenen nach der letzten Z&auml;hlung. Weitere St&auml;rken
des Ami sind seine schnelle Java-Einrichtung und seine unglaublich geringe
Gr&ouml;&szlig;e.
</P>
<P>
Das erste Erzeugnis von Haage &amp; Partner f&uuml;r den Neuen Amiga wird StormC
sein, eine komplette Entwicklungs-Ausstattung f&uuml;r Software. Die heutige
Version f&uuml;r den klassischen Amiga zeigt schon in diese Richtung mit
mehreren unabh&auml;ngigen Komponenten, die &uuml;ber ein ARexx-Interface
kommunizieren.
</P>
<P>
W&auml;hrend der letzten beiden Jahre wurden fast alle Komponenten von StormC
neu entworfen, um sie plattformunabh&auml;ngig, aber auch unabh&auml;ngig von einem
grafischen User-Interface (GUI) zu machen. Haage &amp; Partner verwendet daf&uuml;r
zur Zeit seinen eigenen Satz an BOOPSI-Erweiterungen (das &quot;Storm Wizard GUI
Development System&quot;). Damit kann die Storm IDE (Integrated Development
Environment) leicht auf andere Plattformen &uuml;bertragen werden.
</P>
<P>
Ein weiteres Produkt in Vorbereitung ist StormREXX, H&amp;P's eigene ARexx-
Version, da das Original nicht ohne weiteres auf ein f&uuml;r PowerPC-
Prozessoren geplantes AmigaOS umgesetzt werden konnte. StormREXX ist
kompatibel mit Original-ARexx und hat einige Objekt-orientierte
Erweitereungen. &quot;Wir sind dabei, das Projekt fertig zu stellen, damit wird
StormREXX sehr bald auf Ami laufen&quot; sagt Markus.
</P>
<P>
Nach Fertigstellung der Entwickler-Projekte wird Haage &amp; Partner beginnen,
die klassischen Anwendungsprogramme umzusetzen: Das Schreibprogramm &quot;Amiga
Writer&quot; (z.Zt. Version 2.2) und Grafikprozessor und Malprogramm &quot;ArtEffect&quot;
(jetzt in Version 4.0). Vor zwei Jahren wurde mit dem Gedanken an die
Portierung die &Uuml;berarbeitung beider Programme begonnen. Sie sind
vollst&auml;ndig in C oder C++ geschrieben, damit besteht die Hauptaufgabe in
der &Auml;nderung des GUI-Systems. Je nach den Charakteristiken von Ami und
seinen Tools kann das drei bis sechs Monate f&uuml;r jedes Produkt dauern.
</P>
<P>
Markus Nerding best&auml;tigt, das Haage &amp; Partner an der Entwicklung
vollst&auml;ndig neuer Programme interessiert sei. Die ersten Schritte h&auml;ngen
davon ab, welche Software andere Firmen f&uuml;r das neue System machen werden.
</P>
<P>
&Uuml;ber die Pl&auml;ne zur Umwandlung von WarpOS und PPC-Boards bez&uuml;glich des neuen
Amiga DE sagt Nerding, dass AMIGA/Tao Group noch nicht entschieden haben,
wie das am Besten zu bewerkstelligen ist. Aber wenn Tao eine Linux-PPC-
Version macht, sollte es kein Problem sein, sie auch auf PPC-Amiga zu
portieren.
</P>
<P>
&Uuml;ber die Emulation des alten AmigaOS auf das neue Amiga DE merkte Markus
an, dass verschiedene M&ouml;glichkeiten vorstellbar seien, eine w&auml;re eine
&quot;abstrakte&quot; Emulation wie UAE, womit AMIGA Inc. bereits experimentiert.
Eine andere M&ouml;glichkeit w&auml;re eine nativere Emulation unterhalb der Amiga-
Umgebung. H&amp;P arbeitet eng mit AMIGA Inc. zusammen, um die beste L&ouml;sung in
diesem wichtigen Bereich zu finden.
</P>
<P>
Bei Upgrades des klassischen Amiga-OS sieht Nerding eine Menge
M&ouml;glichkeiten. Es sei vielleicht in der &Ouml;ffentlichkeit nicht klar, aber die
Entwicklung des klassischen AmigaOS hat nie aufgeh&ouml;rt. &quot;Wir schlie&szlig;en zur
Zeit die zweite Ausgabe des BoingBags ab, die mehr Eigenschaften, mehr
Fehlerbeseitigungen und vielleicht auch einige neue Komponenten enthalten
wird.&quot; Das meiste davon ist derzeit im Betatest, die Freigabe ist bald zu
erwarten.
</P>
<P><B>Noch</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">AMIGA Main:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">AmiOpen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Wenn man in der Amiga-Gemeinschaft verwurzelt ist, entstehen gewisse
Konzepte im Denken. Eines dieser Konzepte ist die Idee des Sharing, der
gemeinsamen Benutzung, und das Wort &quot;Amiga&quot; ist fast ein Synonym f&uuml;r Dinge
wie Freeware, Shareware und Giftware. Die Amiga-Gemeinschaft besitzt eine
Unmenge an Shareware und die Fundgrube f&uuml;r diesen Schatz ist das Aminet.
Diese Einrichtung ist unbestreitbar einer der wichtigsten Gr&uuml;nde f&uuml;r das
&Uuml;berleben des Amiga als eigenst&auml;ndige Plattform.
</P>
<P>
Viele Programmierer schreiben ihre Programme f&uuml;r das geradlinige und
elegante AmigaOS aus reiner Freude und nur, &quot;weil sie es eben k&ouml;nnen&quot;.
Durch diese selbstlosen Beitr&auml;ge wurde das Aminet der Rettungsanker f&uuml;r die
Amiga-Gemeinschaft.
</P>
<P>
Es ist keine &Uuml;berraschung, dass AMIGA Inc. diesen Schwung in die Zukunft
weitertragen will. Das wird getan, indem Teile des neuen Amiga Digital
Environment, dem Amiversum (Amiverse), als Open Source (freie Quelldaten) -
oder AmiOpen, wie es genannt werden soll -, zur Verf&uuml;gung gestellt
werden. Dadurch sollen Innovationen angeregt und den Entwicklern erlaubt
werden, Zus&auml;tze, &Auml;nderungen oder Verbesserungen des Amiverse zu schreiben,
&quot;weil sie es eben k&ouml;nnen&quot;.
</P>
<P>
AmiOpen unterscheidet sich etwas vom Linux-Modell der &quot;freien Software&quot;
dadurch, dass AMIGA Inc. Open Source unter kommerziellem Besitz aufnehmen
wird. Die meisten Hilfsprogramme (Utilities), die wir als Digital
Environment brauchen, sind Open Source und leicht zu portieren. Damit
erhalten AmigaDE-Programmierer einen reichen Schatz an Erfahrungen.
</P>
<P>
Die Arbeiten f&uuml;r das AmiOpen-Projekt laufen gut. Wer wissen will, was
vorhanden ist, kann dies bei ftp.amiga.com/developers abrufen. Eigene
portierte Arbeiten k&ouml;nnen dahin &uuml;bertragen werden.
</P>
<P>
Nur die Kern-Eigenschaften des Amiverse werden intern von AMIGA bearbeitet
werden und nicht als AmiOpen gelten. Die &uuml;brigen Dinge wie Tools, Treiber,
Editoren, Interface-Schichten und mehr k&ouml;nnen durch die AmiOpen-Bewegung
ohne Schwierigkeiten verbessert und/oder entwickelt werden.
</P>
<P>
Zur Unterst&uuml;tzung hat AMIGA Initiativen eingerichtet, die erste davon ist
eine offene Mailing-Liste f&uuml;r Entwickler bei <A HREF="mailto:open-request@amiga.com.">open-request@amiga.com.</A> Es
wird bald ein Bulletin-Board-Nachrichtensystem eingerichtet. Anderes, wie
z.B. E-Mail-Unterst&uuml;tzung (durch einem Stab von Support-Technikern in
verschiedenen Zeitzonen in der ganzen Welt), CVS, Bugzilla und Entwickler-
spezifische Mitteilungen, wird mit der Zeit zur Verf&uuml;gung stehen.
</P>
<P>
Diese Web-basierte Unterst&uuml;tzung soll auch die kommerziellen Entwickler
ansprechen.
</P>
<P>
Aus der Mischung von Open Source und kommerziellen Aspekten erhofft sich
AMIGA die Erf&uuml;llung &quot;des Traumes&quot;, den alle tr&auml;umten, die in all den Jahren
ihren Glauben nicht verloren haben.
</P>
<P><B>Noch</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">AMIGA Main:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">AmiWest aus der Sicht eines Entwicklers.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ein Bericht &uuml;ber den Verlauf der AmiWest 2000. Es soll hier nur auf die
allgemein interessanten Dinge eingegangen werden.
</P>
<P>
Anti Gravity in Kalifornien hatte letztes Jahr die Rechte am BoXeR gekauft
und plant eine neue Linie der klassischen Amiga-Architektur mit einer weit
verbesserten Hardware-Gestaltung. Joe Torre, fr&uuml;her bei Amiga/Gateway,
wurde vor einiger Zeit von Anti Gravity eingestellt. Eine stark verbesserte
und schnellere Amiga-Platform f&uuml;r Leute, die mit der bestehenden
Architektur arbeiten, scheint deutlich n&auml;her ger&uuml;ckt zu sein.
</P>
<P>
Bill McEwen erw&auml;hnte in einer Ansprache, dass das Amiga SDK sich besser
verkaufe als erwartet. Amiga steht in Verbindung mit &quot;jeder f&uuml;hrenden
Gesellschaft f&uuml;r Spiele da drau&szlig;en&quot; und viele von ihnen haben bereits das
SDK.
</P>
<P>
Die Ver&ouml;ffentlichung von Amiga One, der Amiga-Referenz-Plattform der
n&auml;chsten Generation, ist f&uuml;r Dezember diesen Jahres vorgesehen. Dean Brown
stellt die Endw&uuml;rfe f&uuml;r verschiedene Musterger&auml;te her, die dann Dritten bei
der Herstellung als Referenzen dienen werden.
</P>
<P>
Ein Version des SDK f&uuml;r Windows wird n&auml;chsten Monat (in neuer,
ansprechenderer Verpackung) in den Verkauf kommen.
</P>
<P>
Das Problem mit der SDK-Lizenz wurde angesprochen (s. Amiga aktuell August
2000). Erg&auml;nzend dazu teilte Bill McEwen mit, dass f&uuml;r die Zertifizierung
eines Produktes, f&uuml;r die gemeinsame Vermarktung und f&uuml;r die offizielle
Amiga-Plakette ein Betrag von 5% oder gerade $1.50 je verkaufter Einheit zu
bezahlen w&auml;ren.
</P>
<P>
Einige weitere Leckerbissen: Red Hat verkauft ab n&auml;chster Woche (nach der
AmiWest!) das SDK. Sun hat angefangen, Amiga-Software zu verwenden, um
Java-Beispiele vorzuf&uuml;hren. AMIGA wird an die B&ouml;rse gehen. Paul Nolan
(Autor von PhotoGenics) macht Vertragsarbeiten f&uuml;r AMIGA in der Abteilung
f&uuml;r das Anwender-Interface. AMIGA wird User-Gruppen preiswerte Werbeartikel
anbieten. Eine von ARM gebaute (und von Mick Tinker entworfene) Touch-
Screen-Einheit (ber&uuml;hrungsgesteuerter Bildschirm) wurde vorgef&uuml;hrt und
zeigte Amiga/Elate im nativen Modus.
</P>
<P>
Eine f&uuml;r heutige Entwickler h&ouml;chst willkommene Nachricht: F&uuml;r die
R&uuml;ckw&auml;rts-Kompatibilit&auml;t des klassischen Amiga vom AmigaDE wird durch eine
Emulations-Schicht (Emulation Layer) gesorgt werden. Es wurde zwar auch UAE
auf das neue AmigaDE portiert, aber die Emulations-Schicht ist eine viel
transparentere Methode f&uuml;r derzeitige Amiga-Anwendungen zum Betrieb auf dem
AmigaDE.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">AMIGA Tech:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Mesa und der Amiga&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Fragt man einen seri&ouml;sen Grafik-Entwickler, wer der K&ouml;nig unter den 3D-
Grafik-Programmier-Interfaces ist, wird er wahrscheinlich &quot;Mesa&quot; sagen. Auf
der OpenGL-3D-Library von Silicon Graphics basierend, bietet die Mesa-3D-
Library die h&ouml;chsten Ebenen an Akzeptanz, Kompatibilit&auml;t und
Leistungsf&auml;higkeit auf einer gro&szlig;en Zahl von Plattformen.
</P>
<P>
AMIGA Inc. setzt bereits auf die umfassende F&auml;higkeit von Mesa bei der
Entwicklung des 3D-API (Application Programming Interface) f&uuml;r den Amiga
der n&auml;chsten Generation.
</P>
<P>
Jonas Gustavson, AMIGA's Leiter der 3D-Entwicklung, nennt Mesa &quot;eines der
am st&auml;rksten ansprechenden APIs, die es gibt,&quot; und f&uuml;gt hinzu, &quot;die
Tatsache, dass die meisten Gesellschaften f&uuml;r Spiele OpenGL (oder etwas
&auml;hnliches) verwenden, ist einer der Hauptgr&uuml;nde, warum AMIGA Mesa
ausgew&auml;hlt hat.&quot;
</P>
<P>
Das wird best&auml;tigt von John Carmack von id Software, einer lebenden Legende
im Bereich der Entwicklung von Videospielen, der mit der Erzeugung von
3D-Titeln  wie Wolfenstein 3D und Quake echtes Neuland betrat. Carmack ist
ein starker Bef&uuml;rworter von Alternativen zu Microsofts Direct3D (ein
geschlossenes, Nur-Windows-API) und hat sich recht deutlich &uuml;ber die
Ineffizienz von Direct3D gegen&uuml;ber OpenGL ge&auml;u&szlig;ert.
</P>
<P>
Carmack schrieb ein Programm, das Direct3D aufrief, eine einfache
3D-Operation auszuf&uuml;hren. Dann schrieb er ein Programm, das OpenGL aufrief,
das gleiche zu tun. Das Direct3D-Programm war um mehrere Gr&ouml;&szlig;enordnungen
umfangreicher, sowohl in der Form wie in der Funktion, als das OpenGL-
Programm. Das sind die Vorteile von Mesa.
</P>
<P>
Nat&uuml;rlich bestehen Schwierigkeiten bei der Portierung von Programmen, die
nicht OpenGL oder Mesa verwenden. Obwohl &Auml;hnlichkeiten zwischen Mesa und
Direct3D existieren, ist die Umsetzung von Direct3D wesentlich
komplizierter als die von OpenGL.
</P>
<P>
Auch Programmierer, die f&uuml;r ihr spezielles System Inline-Assembler
ben&ouml;tigen, m&uuml;ssen diese Programme nach VP umsetzen. Obwohl dies nicht ganz
leicht ist, sind die Vorteile von VP mehr als offensichtlich: Es ist die
freundlichste Assembler-Sprache, der man begegnen kann, und sie l&auml;uft
&uuml;berall, wo die Amiga-Betriebsumgebung l&auml;uft.
</P>
<P>
Jonas Gustavsson verweist auf die Anziehungskraft von Amiga auf Spiele-
Entwickler, besonders die, welche OpenGL oder Mesa f&uuml;r ihre Programmierung
benutzen. &quot;Die ganze Methode der VP-Technologie (kompiliere einmal und es
l&auml;uft &uuml;berall) ist sehr n&uuml;tzlich, aber es ist eine Tatsache, dass Desktop-
PCs gegen&uuml;ber den Konsolen auf verlorenem Posten stehen. Spielehersteller
z&ouml;gern immer mehr, Spiele f&uuml;r Computer anstatt f&uuml;r Konsolen zu schreiben.
Was Ami (der Kurzname f&uuml;r die neue digitale Amiga-Umgebung [Amiga Digital
Environment]) und Mesa den Entwicklern bieten, ist eine L&ouml;sung, bei der sie
das Spiel f&uuml;r Ami schreiben und eine CD oder DVD ausliefern, die die
aufgesetzte (hosted) oder nicht-aufgesetzte (non-hosted) Version des Spiels
enth&auml;lt. Der Anwender l&auml;dt das Spiel wie &uuml;blich.&quot;
</P>
<P>
Dieser Zugang kann f&uuml;r jede unterst&uuml;tzte Plattform verwendet werden -
aufgesetzte Plattformen wie Linux, Windows und WarpOS/klassischer Amiga
oder nicht-aufgesetzte Plattformen wie x86, PowerPC, Mips, Sparc usw. Das
wird wahrscheinlich auf die Video-Spielkonsolen erweitert werden, damit
braucht der Spieler nur eine Bin&auml;r-Datei f&uuml;r alle.
</P>
<P>
W&auml;hrend zus&auml;tzliche grafische Interfaces wie z.B. Renderware zuk&uuml;nftig f&uuml;r
den Amiga verf&uuml;gbar werden, tritt die Mesa-Library f&uuml;r den Amiga der
n&auml;chsten Generation in den n&auml;chsten Wochen in die geschlossenen Betatest-
Phase. Amiga-Entwickler k&ouml;nnen die 3D-Realisierung als Teil des n&auml;chsten
Software Development Kit erwarten.
</P>
<P><B>Noch</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">4.&nbsp;</TD><TD VALIGN="TOP">AMIGA Tech:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Die Digitale Umgebung des Amiga (Amiga Digital Environment)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Da dieser Abschnitt meiner Ansicht nach sehr interessant ist, will ich
versuchen, ihn vollst&auml;ndig zu &uuml;bersetzen.
</P>
<P>
Die neue Digitale Umgebung des Amiga (Amiga Digital Environment) DE mit
Kurznamen Ami (englische Aussprache &quot;emie&quot;) ist viel mehr als ein
Betriebssystem. Mit ihm wird die Trennung von der Hardware, Nachhaltigkeit,
Organisation, Multimedia, Vernetzung und Anwendererfahrung nahtlos in einer
verteilten Dienst-Architektur zusammengebracht. Am Besten betrachtet man
das Amiga-DE als ein Modell aus drei Schichten (Layers). Die unterste ist
die physikalische Schicht und dort befinden sich alle Hardware-Mittel.
Diese physikalische Schicht kann alles, vom Prozessor bis zu Speicher-
Ger&auml;ten, grafischen und Audio-Komponenten bis zu Lautsprechern,
Datenspeicher bis zu Druckern, sowohl lokal wie getrennt im Netz und auf
einzelnen oder mehrfachen Ger&auml;ten, sein.
</P>
<P>
&Uuml;ber der physikalischen Schicht und zust&auml;ndig f&uuml;r die Abtrennung dieser
Lage folgt der Amiga Foundation Layer oder AFL (Amiga-Basisschicht). Teil
des AFL ist die inTent JTE (Java Technologiy Edition) von der Tao Group.
Die inTent JTE besteht aus dem Elate RTOS (Real Time Operating System =
Echtzeit-Betriebssystem), des AVE (Audio Visual Environment) und der J-
Engine, einer von Sun anerkannten Personal-Java JRE (Java Runtime
Environment).
</P>
<P>
AMIGA ist zur Zeit dabei, den AFL zu verbessern und zu erweitern, Beispiele
sind das Amiga Object Model (AOM) und eine Portierung der 3D-Grafik-
Library, Mesa - ein gemeinsames Unterfangen von Amiga und Hyperion
Software. AMIGA arbeitet auch an einer Vielzahl von Diensten f&uuml;r den AFL,
in die die Nachhaltigkeit (persistence), Abfragen (query), Einstellungen
(set) und Zutritte (immigration) geh&ouml;ren. Zus&auml;tzlich arbeitet AMIGA an
einer revolution&auml;ren allgemein verwendbaren Computersprache, die die
M&ouml;glichkeiten zur Befehlszeileneingabe, f&uuml;r die Skriptkontrolle und f&uuml;r die
Entwicklung ernsthafter Anwendungen in sich vereinigt.
</P>
<P>
Alles das ist n&ouml;tig, damit die dritte Schicht existieren kann; jene dritte
Schicht ist das Amiverse (Amiga-Universum). Das Amiverse ist ein logischer
Satz von Objekten, der keine Ahnung von der Menge, Qualit&auml;t oder vom Ort
der Hardware hat, auf welcher er existiert. Ein Amiverse kann auf einem
einfachen digitalen Ger&auml;t existieren oder es kann sich &uuml;ber eine Vielzahl
davon ausbreiten. Das Amiverse &ouml;ffnet sich zun&auml;chst, dann haben die
Anwender Zugang. Einmal im Amiverse kann der Anwender mit den vorhandenen
Objekten arbeiten, digitale Inhalte erzeugen und verbrauchen, andere
Amiversen besuchen, Objekte importieren und exportieren, Objekte und
Dienste dem Amiverse hinzuf&uuml;gen und Organisation und Inhalt erzeugen.
</P>
<P>
Das Amiverse wird die Heimat des Digital Content Universe (Welt der
digitalen Inhalte): der vollst&auml;ndige Bereich von digitalem Audio, Video,
Grafik, Text, Anwendungsprogrammen und Diensten, die heute in
exponentiellem Ma&szlig;e in der Welt wachsen. Das Amiverse wird alle diese
entstehenden digitalen Technologien vorteilhaft verbinden und sie dem
Anwender zur Verf&uuml;gung stellen.
</P>
<P>
Das traditionelle Modell der Computerarbeit war Computer- und Anwendungs-
zentriert, wobei die digitale Welt auf Daten zur&uuml;ckgreifen musste, die in
der Peripherie sa&szlig;en. Die digitale Umgebung des Amiga stellt das Universum
der digitalen Einheit in die Mitte, umgeben von den vielen digitalen
Ger&auml;ten. Diese Ger&auml;te sind die Mittel, die Zugang zur digitalen Einheit
bieten. So wird T&auml;tigkeit und Anspruch auf ihre richtige Position im
Zentrum der Mensch-Maschine-Gleichung gehoben, anstatt dass der Anwender
der Sklave seines Programms und der Entscheidungen des OS sein muss.
Anwender m&uuml;ssen nicht l&auml;nger wie Maschinen denken, um auf digitale Welten
zuzugreifen und sie zu benutzen.
</P>
<P>
Die n&auml;chsten beiden Abschnitte sind auch im englischen Original f&uuml;r
Interessierte gut genug verst&auml;ndlich, deshalb spare ich mir die &Uuml;bersetzung
vollst&auml;ndig.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">5.&nbsp;</TD><TD VALIGN="TOP">AMIGA Resource Center&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Amiga-Presse (Gedruckt und Online)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">6.&nbsp;</TD><TD VALIGN="TOP">Nameplate Competition&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Titel-Tafel-Wettbewerb&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">7.&nbsp;</TD><TD VALIGN="TOP">Credits&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">(Impressum)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Herausgeber:&nbsp;</TD><TD VALIGN="TOP">Amiga&nbsp;Inc.&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">Kontaktadressen:&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Layout&nbsp;und&nbsp;Design:&nbsp;</TD><TD VALIGN="TOP">Ted&nbsp;Wallingford&nbsp;(HTML)&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">Amiga&nbsp;World:&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Fletcher&nbsp;Haug&nbsp;(PDF)&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">Redakteur:&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:amigaworld@amiga.com">amigaworld@amiga.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Redakteur:&nbsp;</TD><TD VALIGN="TOP">Fletcher&nbsp;Haug&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">Nachrichten-&nbsp;und&nbsp;Presse-Zentrum&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:resourcecenter@amiga.com">resourcecenter@amiga.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2.&nbsp;Redakteur:&nbsp;</TD><TD VALIGN="TOP">Robert&nbsp;Bryant&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">Ausgew&auml;hlter&nbsp;Grafiker&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:lowgun@ametro.net">lowgun@ametro.net</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Mitarbeiter:&nbsp;</TD><TD VALIGN="TOP">Robert&nbsp;Bryant&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Steve&nbsp;Folberg&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Bruce&nbsp;Lepper&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">AMIGA&nbsp;Inc.:&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Fleecy&nbsp;Moss&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Gary&nbsp;Peake&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">Allgemeine&nbsp;Nachfragen:&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:friend@amiga.com">friend@amiga.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Ted&nbsp;Wallingford&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Kermit&nbsp;Woodall&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">Entwickler-Nachfragen:&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:developer@amiga.com">developer@amiga.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Ausgew&auml;hlter&nbsp;Grafiker:&nbsp;</TD><TD VALIGN="TOP">Shawn&nbsp;Seals&nbsp;</TD><TD VALIGN="TOP">|&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die Beitr&auml;ge dieser Ausgabe stammen von:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Building Legends:&nbsp;</TD><TD VALIGN="TOP">Robert Bryant&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Inside Haage &amp; Partner:&nbsp;</TD><TD VALIGN="TOP">Bruce Lepper&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">AmiWest From the Developer s Ey:&nbsp;</TD><TD VALIGN="TOP">Kermit Woodall&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Mesa and The Amiga:&nbsp;</TD><TD VALIGN="TOP">Ted Wallingford&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">AmiOpen:&nbsp;</TD><TD VALIGN="TOP">Gary Peake&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Amiga Digital Environment:&nbsp;</TD><TD VALIGN="TOP">Fleecy Moss&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Amiga Resource Center:&nbsp;</TD><TD VALIGN="TOP">Steve Folberg&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Gernod Schomberg &lt;<A HREF="mailto:G.Schomberg@t-online.de">G.Schomberg@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
