<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Ruksun Software Technologies k&uuml;ndigt AmigaNG-Programme an</H2>
<P>
&raquo;Ruksun Software Technologies kooperiert mit Amiga
</P>
<P>
Snoqualmie, Washington, 22. August 2000 - AMIGA Inc. freut sich bekannt
geben zu k&ouml;nnen, dass eine &Uuml;bereinkunft mit Ruksun Software Technologies
getroffen wurde, ihre ausgezeichneten Produkte Messenger Force und IMAP
Force zum Amiga zu bringen. Ruksun Software Technologies ist eine der
f&uuml;hrenden Gesellschaften bei der Entwicklung von Software f&uuml;r Internet- und
Vernetzungs-Anwendungen f&uuml;r mobile und drahtlose Ger&auml;te, die auf Windows-
CE-, Palm-OS- und EPOC-Plattformen laufen. Als Schl&uuml;sselunternehmen der
Industrie f&uuml;r mobile und drahtlose Computeranwendungen umfasst Ruksuns
Gesch&auml;ftsbereich mobile Anwendungen f&uuml;r Endverbraucher, innovative auf
Internet beruhende Technologien, Realisierung von drahtlosen Clients und
drahtlosen Mitteilungsdiensten.
</P>
<P>
Die ersten beiden Programme, die Ruksun f&uuml;r Amiga entwickelt, beinhalten
die ausgezeichneten Anwendungen IMAP Force und Messenger Force.
</P>
<P>
Messenger Force ist Ruksuns ger&auml;teunabh&auml;ngiger Instant Messaging client
(Direkt-Mitteilungs-Steuerung), der auf den weitverbreiteten, mit Windows
CE betriebenen Handger&auml;ten, auf Psion-Ger&auml;ten, die EPOC OS verwenden, und
auf Palm-Handger&auml;ten, die mit Palm OS laufen, arbeitet. Eine in K&uuml;rze zu
erwartende Version wird Instant Messaging auf mobilen Telefonen erlauben.
</P>
<P>
Messenger Force erm&ouml;glicht wie andere bekannte Sofort-Mitteilungs-Programme
Meldungen an Ger&auml;te, wenn andere Teilnehmer der Kontaktliste online sind,
und sie k&ouml;nnen dann in Echtzeit miteinander &uuml;ber Instant Messages
kommunizieren. Messenger Force ist ein wenig aufwendiges, umfassendes
Benachrichtigungssystem, das den Zugang anerkannter Benutzer, automatische
Meldung, Verwaltung der Kontaktlisten, Status-Verwaltung und
Zugangserlaubnis unterst&uuml;tzt, genau so wie asynchrone und Echtzeit-
Benachrichtigung und -Meldungen.
</P>
<P>
IMAP Force wird das erste E-Mail-Programm f&uuml;r Amiga sein, welches das
IMAP4-Protokoll f&uuml;r den Online-Zugang zum Postversand unterst&uuml;tzt. IMAP
Force soll es mobilen Anwendern erm&ouml;glichen, schnell und selektiv ihre Post
durchzusehen, ohne dass sie die umfangreichen Mitteilungen oder gro&szlig;e
Beilagen herunter laden m&uuml;ssen. IMAP Force erlaubt es den Anwendern ihre
Post mit SMTP zu versenden und unterst&uuml;tzt &quot;Quoted Printable&quot;-Kodierung und
Nicht-ASCII-Texte in Nachrichtenk&ouml;pfen. IMAP Force schlie&szlig;t POP3-Funktionen
ein und erm&ouml;glicht den Anwendern Zugang zu ihren POP3-Konten und die
Erledigung einfacher eMail-Operationen.
</P>
<P>
&quot;Ich habe die Leistungen der Ruksun-Entwicklung seit vielen Jahren
verfolgt, und es ist wirklich eine Freude, ihre gro&szlig;en F&auml;higkeiten und
gro&szlig;artigen Produkte in die Amiga-Familie einschlie&szlig;en zu k&ouml;nnen,&quot; sagte
Bill McEwen, Pr&auml;sident/CEO von AMIGA, Inc. &quot;Die Ruksun-Erzeugnisse werden
ein gro&szlig;er Gewinn f&uuml;r unsere OEM-Partner und die Amiga-Gemeinschaft sein.&quot;
</P>
<P>
Randall Hughes, Vizepr&auml;sident f&uuml;r Verkauf und strategische Allianzen bei
AMIGA Inc., bemerkte: &quot;Wir sind begeistert, die besten Produkte ihrer Art
wie Messenger Force und IMAP Force f&uuml;r Amiga gewinnen zu k&ouml;nnen. Wir sind
ebenso gl&uuml;cklich, dass unsere Plattform durch einen Partner best&auml;tigt wird,
der sich selbst auf anderen Plattformen ausgezeichnet hat. Wir wissen, dass
Ruksun, ebenso wie unsere anderen Partner, seine Freude an der Vorgabe der
Bin&auml;rkompatibilit&auml;t des Amiga haben wird und weiterhin eher neue
Entwicklungen vornehmen wird als bestehende Anwendungsprogramme
umzuschreiben.&quot;
</P>
<P>
Rajkumar Chainani, CEO bei Ruksun Software, sagt: &quot;Ruksun freut sich, mit
AMIGA zusammenarbeiten zu k&ouml;nnen und dass wir unsere bekannten Produkte
erweitern k&ouml;nnen, um diese Plattform zu unterst&uuml;tzen. Wir glauben, dass das
Amiga OS sich f&uuml;r enorme M&ouml;glichkeiten bei verbundenen digitalen
Einrichtungen und Nicht-PC-Ger&auml;ten anbietet. Im Laufe der Zeit wird Ruksun
weiterhin revolution&auml;re Produkte f&uuml;r diese revolution&auml;re Plattform
schaffen,&quot;
</P>
<P><B>&Uuml;ber AMIGA:</B></P>
<P>
AMIGA Inc. bietet den Entwicklern die Technologie, um Anwendungsprogramme
f&uuml;r das neue Hardware-unabh&auml;ngige multimediaf&auml;hige Amiga OS zu schreiben
und zu &uuml;bertragen. Amiga-basierende Anwendungen k&ouml;nnen unver&auml;ndert auf den
Prozessoren x86, PowerPC, M Core, ARM, StrongARM, MIPS R3000, R4000, R5000,
SH 3, SH4 und NEC V850 laufen. Das Amiga OS kann aufgesetzt (hosted) auf
Linux, Embedded Linux, Windows 95, 98, 2000, NT, CE und QNX 4 betrieben
werden. AMIGA hat seine Hauptniederlassung in Snoqualmie, Washington, 28
Meilen &ouml;stlich von Seattle und betreibt weltweit weitere Gesch&auml;ftsstellen.
AMIGA kann erreicht werden &uuml;ber (425) 396-5660 oder im Web bei
www.amiga.com.
</P>
<P><B>&Uuml;ber Ruksun:</B></P>
<P>
Ruksun Software Technologies ist eine der Pionier-Gesellschaften bei der
Entwicklung von Software f&uuml;r Internet- und Vernetzungs-Anwendungen bei
mobilen und drahtlosen Ger&auml;ten. Ruksuns Gesch&auml;ftsbereich umfasst mobile
Anwendungen f&uuml;r Endverbraucher, innovative auf Internet beruhende
Technologien, Einrichtungen von drahtlosen Clients, drahtlose
Mitteilungsdienste und Technologie zur Integration von Servern am
Leitungsende (backend server integration technology). In K&uuml;rze zu
erwartende Produkte sind:
</P>
<UL>
<LI> Eine drahtlose Mitteilungsplattform, die bestehenden Einrichtungen
     eines Unternehmens &uuml;ber drahtlose Ger&auml;te die Verwendung von
     Anwendungs-Verbindungen erm&ouml;glicht.
</LI>
<BR><LI> Einen den Standard einhaltenden, &uuml;bertragbaren WAP-Browser (WAP =
     Wireless Application Protocol) mit Stack.
</LI>
<BR><LI> Eine Reihe von drahtlosen Spielen, auch f&uuml;r mehrere Spieler, die auf
     verschiedenen drahtlosen Ger&auml;ten zur Verf&uuml;gung stehen werden.
</LI>
<BR><LI> Zwischenprogramme (middleware) f&uuml;r IM-Client-Server (IM = Instant
     Messaging), die zahlreiche L&ouml;sungen beinhalten k&ouml;nnen, wie ortfeste
     (location-based) und zusammenarbeitende (collaboration) Dienste.
</LI>
<BR><LI> Drahtlose Direktbenachrichtigung - Bietet WAP-Ger&auml;ten Zugang zu
     popul&auml;ren IM-Diensten wie ICQ und MSN Messenger, dem Anwender wird
     direkter Kontakt zus&auml;tzlich zur F&auml;higkeit der Nachrichten&uuml;bermittlung
     gew&auml;hrt.
</LI>
</UL>
<P>
Weitere Informationen finden Sie bei www.ruksun.com&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<br>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
