<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. AMIGA schlie&szlig;t erstes Dritthersteller-OEM-Abkommen</H2>
<P>
&raquo;AMIGA Incorporated und Infomedia Network, Inc. melden Strategische
Verbindung f&uuml;r eine neue Serie von interaktiven Set-Top-Boxen
</P>
<P>
16. August 2000 - Snoqualmie, Washington - Houston, Texas -
AMIGA Incorporated und Infomedia Network, Inc. haben heute eine
strategische Verbindung zur Lieferung des Amiga mit allen Teilen f&uuml;r eine
neue Fertigungslinie von breitbandigen interaktiven Settop-Boxen bekannt
gegeben.
</P>
<P>
Infomedia Network ist sehr daran interessiert, die besten Produkte f&uuml;r ihre
neue Linie von Set-Top-Boxen zu beschaffen. Diese neuen Ger&auml;te enthalten
TVision, das erste in einer Familie interaktiver TV-Set-Top-Ger&auml;te, die dem
Anwender zu niedrigen Kosten ein leicht zu bedienendes Tor zum Internet und
zur Unterhaltung &ouml;ffnet. TVision verbindet zu kollektiven LANs ebenso wie
zu heimischen DSL-Anschl&uuml;ssen und Kabel-Modems durch einen Ethernet-Eingang
und bietet dem Anwender Internet-Zugang, anpassbare Echtzeit-
Videokonferenzen, interaktive Videospiele, Filme nach Wunsch (Movies-on-
Demand), Home-Banking, Online-Eink&auml;ufe und andere erfreuliche neue
M&ouml;glichkeiten, ohne einen PC zu ben&ouml;tigen.
</P>
<P>
AMIGA und die Amiga-Gemeinschaft sind ein wertvoller Zuwachs zu den
Produkten und Dienstleistungen, die f&uuml;r TVision geplant sind, sagte Patrice
Haftman, CEO von Infomedia Network. Nun werden den Kunden von TVision
gro&szlig;artige Werte von den besten Entwicklern der Welt geboten.
</P>
<P>
Wir freuen uns sehr &uuml;ber unsere Arbeit mit Infomedia, sagt Bill McEwen,
Pr&auml;sident/CEO bei AMIGA Incorporated. Amiga passt perfekt f&uuml;r die Produkte
und Dienstleistungen, die Infomedia ihren OEMs (Original Equipment
Manufakturers = Originalger&auml;tehersteller) und Kunden bieten will. AMIGA-
Entwickler arbeiten schon mit dem neuen Amiga-SDK, um neue Anwendungen,
Multimediatitel und interaktive Inhalte zu schaffen, die dieser neuen Linie
von Set-Top-Boxen angemessen sind.
</P>
<P>
Infomedia Network und AMIGA sind Gesellschaften in privater Hand und die
Bedingungen der Abwicklung des Gesch&auml;ftes wurden nicht freigegeben.
</P>
<P>
Weitere Informationen &uuml;ber beide Gesellschaften finden Sie auf ihren Web-
Sites: www.infomedia-network.com bzw. www.amiga.com
</P>
<P><B>&Uuml;ber AMIGA:</B></P>
<P>
AMIGA zielt hin auf die Schaffung einer multimedialen digitalen Umgebung,
die dem Entwickler ein echtes &quot;schreibe einmal, laufe &uuml;berall&quot;-Scenario
bietet. AMIGA blickt zur&uuml;ck auf eine fruchtbare 15-j&auml;hrige Geschichte der
Industrie-F&uuml;hrung bei der Entwicklung von dem, was wir als Multimedia
kennen.
</P>
<P><B>&Uuml;ber Infomedia Network:</B></P>
<P>
Infomedia Network, Inc ist eine Gesellschaft der Kommunikations-Technik mit
angemeldeten Patenten f&uuml;r neue digitale TV-Anwenderger&auml;te, die Fernseh-
Rundfunk, Telefondienste, Hochgeschwindigkeits-Internet, Video-Konferenzen
in TV-Qualit&auml;t, Spiele auf Anforderung (on-demand) und Unterhaltung bieten
und dabei die vorhandene Kupferverkabelung innerhalb des Hauses benutzen.
Infomedia ist gegenw&auml;rtig die einzige Gesellschaft, die schon heute
fortschrittliche TV/Multimedia-Set-Top-Boxen baut, die die Anforderungen
des Voll-Dienst-Netzwerks der n&auml;chsten Generation f&uuml;r jeden Typ der
Breitband-Infrastruktur erf&uuml;llen.
</P>
<P><B>Kontakt-Informationen:</B></P>
<P>
AMIGA Incorporated<BR>
Bill McEwen<BR>
Tel: 425-396-5660<BR>
Fax: 425-396-5671<BR>
e-mail: <A HREF="mailto:bill@amiga.com">bill@amiga.com</A><BR>
</P>
<P>
Infomedia Network<BR>
J.D. Ray<BR>
Tel: 281-218-0700 x 18<BR>
Fax: 281-218-0749<BR>
e-mail: <A HREF="mailto:jdray@infomedia-network.com">jdray@infomedia-network.com</A>&laquo;<BR>
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<br>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
