<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Diverse Amiga-News</H1>
<H2>1. Vorstellung: Amiga Club Berlin &amp; Brandenburg</H2>
<P>
Ihr m&ouml;chtet euren Computerclub bekannt machen? In AMIGA aktuell habt ihr
die Gelegenheit dazu. Diesmal geht es um den Amiga Club Berlin &amp;
Brandenburg.
</P>
<P>
&raquo;Der Amiga Club Berlin &amp; Brandenburg (acbb) stellt sich vor!
</P>
<P>
Nachdem er die ersten 100 Tage &uuml;berlebt hat, ist es Zeit, sich der
&Ouml;ffentlichkeit bekannt zu machen und ein Fazit zu ziehen.
</P>
<P>
Seit 6.2.2000 haben auch Berlin &amp; Brandenburg wieder einen Amiga-Club, den
acbb.
</P>
<P>
Nach einem intensiven Chat [dem von der AmigaOS, Ihr seid Schuld :-)]
zwischen den Gr&uuml;ndungsmitgliedern, traf man sich, um die Einzelheiten zu
besprechen.
</P>
<P>
Nach einer hitzigen Diskussion (eigentlich sollte es nur der Raum Berlin
sein) wurde dann beschlossen, einen Club f&uuml;r die ganze Region zu gr&uuml;nden
und soweit wie m&ouml;glich niemanden auszugrenzen!
Wir wollten den Club von Anfang an regional begrenzen, zum einen um keine
Konkurrenz f&uuml;r den AC-BTX zu sein, und zum anderen, weil uns ansonsten die
Gr&ouml;&szlig;e in Schwierigkeiten gebracht h&auml;tte.
</P>
<P>
Die Grunds&auml;tze des Clubs wurden wie folgt definiert:
1) Amiga only, PC und MAC nur in Form einer Emulation
2) Aufrechterhaltung der Amiga-Gemeinde in der Region
3) Wissensaustausch und Hilfestellung (nicht nur am Rechner)
4) Sozialer Zusammenhalt.
</P>
<P>
Nachdem die Grundlagen, F&uuml;hrung und Einteilung von Bereichen vereinbart
wurden, standen wir vor dem Problem des Kontaktes zu anderen Amiga Usern!
Dieses Problem wurde aber, dank AmigaNews und IRC, leicht gel&ouml;st.
</P>
<P>
Eh wir uns versahen, war der Club auf 30 Mitglieder angewachsen, eine Basis
die sich sehen lassen konnte!
</P>
<P>
Anfangs noch ohne Rechnertreffen, konnten wir dann im April, dank der
Unterst&uuml;tzung der &quot;Goethe Gesamtschule/Niederlehme&quot;, unser erstes
Rechnertreffen abhalten, dem noch viele folgen werden.
</P>
<P>
Mit dem Rechnertreffen hatten wir aber ein neues Problem:
Konnten unsere Mitglieder die &quot;normalen&quot; (was ist schon normal) Clubtreffen
mit dem &Ouml;PNV erreichen, war dieses mit ca. 30 Kilo Gep&auml;ck schon schwerer!
Aber auch dieses wurde schnell gel&ouml;st, jeder PKW-Besitzer sammelte einfach
jemanden auf.
</P>
<P>
Nach und nach wurde dieses Treffen zu einem festen Bestandteil des
Clublebens und ersetzten schlie&szlig;lich die normalen Treffen.
</P>
<P>
Reisen zu Clubtreffen (AC-BTX) und zu Messen wurden organisiert. Auf Messen
wurde clubm&auml;&szlig;ig eingekauft (XSurf) und auf den Rechnertreffen wurde eine
LAN eingerichtet.
</P>
<P>
Da der Vorstand bis dato nur kommissarisch agierte, beschlossen wir, eine
Vollversammlung abzuhalten. Diese fand am 6.8.2000 statt, und auf dieser
wurden dann ein fester Vorstand und ein Mitgliedsbeitrag (die Kosten der
Rechnertreffen sollten fest gedeckt sein) beschlossen.
</P>
<P>
Am 8.8.2000 erlebte der acbb einen Schock! Uns wurden zwei Webseiten
gestohlen, doch der immense Druck, den die restliche deutsche Amiga-
Gemeinde auf denjenigen aus&uuml;bte, verhalf uns zu unserem Recht! F&uuml;r die
Unterst&uuml;tzung m&ouml;chte ich mich hiermit im Namen aller Mitglieder des acbb
bedanken!
</P>
<P>
Soweit ein kleiner Einblick in den acbb, wir hoffen, dass wir alle uns noch
lange am Amiga erfreuen k&ouml;nnen und die Zukunft rosig aussieht.
</P>
<P><B>Der acbb</B></P>
<P>
i.S.d.V.
</P>
<P>
Thomas Nosutta &lt;<A HREF="mailto:nosutta@sonnet.de">nosutta@sonnet.de</A>&gt;<BR>
(PR des acbb)&laquo;<BR>
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
