<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Leider nahmen an der letzten Ausgabe des Gewinnspiels nur 26 Leser teil,
m&ouml;glicherweise l&auml;sst sich dies durch die Jahreszeit erkl&auml;ren.
</P>
<P>
Bitte denkt auch diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr
bereits mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P>Jetzt aber zur Aufl&ouml;sung:</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Vor kurzem ist der AmigaNG-Entwicklerrechner erschienen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Welchen Namen tr&auml;gt er?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Die richtige Antwort lautet &raquo;d'AMIGA&laquo;.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Welches Unternehmen stellt den AmigaNG-Entwicklerrechner f&uuml;r&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Gro&szlig;britannien und Nordirland her?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Es handelt sich um die Firma Eyetech Group Ltd.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Der erste Desktop-AmigaNG soll im Dezember 2000 bzw. im 1.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Quartal 2001 erscheinen. Glaubst du, dass dieser Zeitplan&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">eingehalten werden kann?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>Die Auswertung:</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Ja.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">19&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Nein.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">7&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Krister S. Skrtic setzt auf die Unterst&uuml;tzung bekannter Softwarehersteller:
&raquo;Ich hoffe, dass dieser neue Amiga das Feeling, das der Classic-Amiga bis
heute hat, besitzen wird. Ich mag meine &raquo;Miggy&laquo; einfach, und hoffe, dass
dieses neue Teil seine Konkurrenten hinwegfegen wird. Ich hoffe, dass der
Amiga One bald erscheint und viele Softwarehersteller, wie etwa Macromedia
und Adobe, ihre Programme f&uuml;r diese (hoffentlich) wundervolle Maschine
ver&ouml;ffentlichen werden.&laquo;
</P>
<P>
Oliver Hummel macht sich folgende Gedanken: &raquo;Ein neuer Amiga... Es klingt
fast zu sch&ouml;n um wahr zu sein! Den letzten Amiga-Prototypen durften wir ja
1996 zu Escom-Zeiten bewundern, und nun, fast 5 Jahre sp&auml;ter, soll ein
neuer Rechner, der den Namen &quot;Amiga&quot; tragen wird, das Licht der
Computerwelt erblicken. Meine Meinung dar&uuml;ber ist nach wie vor geteilt.
Wird die neue Maschine das Look and Feel unserer Classics vermitteln
k&ouml;nnen? Wird sie ebenso innovativ sein wie seinerseits der A1000? Und hat
ein neuer Amiga &uuml;berhaupt Chancen auf dem, von IBM-Kompatiblen dominierten,
Hardwaremarkt?
Aber auch hier hilft es nur einer alten Amiga-Tradition zu folgen:
Abwarten, abwarten, abwarten! Schlie&szlig;lich wurde so manche Sache bis zur
Prototypenreife gezeigt, um danach nicht realisiert zu werden. Eines
scheint diesmal jedoch anders zu sein: Was McEwen bisher ank&uuml;ndigte, trat
auch tats&auml;chlich ein! Also stehen die Chancen f&uuml;r ein Release des Amiga One
gar nicht sooooo schlecht!
Ich w&uuml;rde mich auf jeden Fall freuen.&laquo;
</P>
<P>
Dirk Wenk ist sich unschl&uuml;ssig: &raquo;Eine Aussage dar&uuml;ber zu machen, ob in der
kurzen Zeit ein vern&uuml;nftiger Rechner auf den Markt gebracht werden kann,
ist sehr schwer, denn noch gibt es zu wenig Informationen dar&uuml;ber, was denn
nun der Rechner &uuml;berhaupt leisten soll oder f&uuml;r was z.B. diese Amiga-Nicht-
Standard-Komponenten sein sollen.
</P>
<P>
Eines sollte allen jedoch klar sein - es kann passieren, dass der AmigaOne
einen x86-Prozessor hat!
Aber wir wollen den Teufel hier nicht an die Wand malen :), mich w&uuml;rde ein
Amiga One mit einer StrongArm- oder PowerPC-CPU gefallen, dazu eine
leistungsstarke Matrox-3dfx-Karte &gt;64MB RAM + &gt;20GB Platte, und nat&uuml;rlich
ein DVD-Laufwerk von der Stange...f&uuml;r komplett ca. ~2000 DM ist das mehr
als gut. :)
Wenn dann noch die angesprochene Amiga-Classic-Integration dazu kommt, die
ja angeblich keine Emulation sein soll, w&auml;re ich mehr als gl&uuml;cklich! =)&laquo;
</P>
<P>
Siegfried Pust erinnert daran, dass in der Vergangenheit bereits mehrmals
neue Amigas angek&uuml;ndigt wurden: &raquo;Ich hoffe, dass Bill die Pl&auml;ne einhalten
kann, und dass wir im 4. Quartal 2000 oder 1. Quartal 2001 einen neuen
Amiga sehen.
</P>
<P>
Denn uns Amiga-Freunden wurde schon zu oft ein neuer Amiga versprochen, der
dann aber nie erschien. Ich hoffe, dass Bill es besser macht. Denn ich habe
es satt, von Versprechungen von neuen Amigas zu lesen bzw. zu h&ouml;ren, die
dann aber nie erscheinen.&laquo;
</P>
<P>
Denis Zwornarz glaubt nicht an ein p&uuml;nktliches Erscheinen und antwortet mit
&raquo;(Leider) Nein. Sch&ouml;n w&auml;re es zwar, aber daran glauben tue ich erst, wenn
das Teil bei mir auf dem Schreibtisch steht.&laquo;
</P>
<P>
Wolf Zimmer antwortet mit &raquo;Ja, denn wenn nicht, kann Amiga Inc. auf ein
anderes Produkt wie die Herstellung von Bulldozern umsteigen, denn Computer
verkaufen die dann bestimmt keine mehr. Der Glaube ist weg und somit dann
auch die Kunden.&laquo;
</P>
<P>
Harald Nilgen w&uuml;nscht sich einen g&uuml;nstigen Verkaufspreis: &raquo;Ich hoffe
wirklich, da&szlig; der neue Amiga (&quot;AmigaOne&quot;) Ende des Jahres,bzw. Anfang des
n&auml;chsten Jahres erscheint. Er sollte dann ein gutes Preis-
/Leistungsverh&auml;ltnis haben, sonst wird er wohl nicht der Hammer werden, vor
allem da auf der PC-Seite die Rechner immer billiger werden und die
Prozessoren schneller.&laquo;
</P>
<P>
Gernod Schomberg ist optimistisch: &raquo;Meine Meinung (und Hoffnung): Auch wenn
die neuen Ger&auml;te mit einigen Spezial-Chips ausger&uuml;stet werden, sind es doch
im Grunde Maschinen des heutigen Standards. Hier war die Generationen-Folge
doch sehr schnell, wobei es ja nicht nur um das Einsetzen eines schnelleren
Prozessors ging. Auch andere IC mussten f&uuml;r die h&ouml;here Leistung ausgelegt
werden und erforderten sicher neue Platinen-Layouts. Das sollte also kein
Hinderungsgrund sein.
</P>
<P>
Und da bei AMIGA Inc. auch Kaufleute sitzen, die das Sagen haben, werden
die sich doch das Weihnachtsgesch&auml;ft nicht vermasseln lassen. Ich spare
jedenfalls schon f&uuml;r mein Weihnachtsgeschenk!
</P>
<P>
Auch wenn das neue AmigaOE in der Version 1.0 noch einige kleine Macken
hat, soll mir das den Spa&szlig; nicht verderben, der n&auml;chste Update kommt
bestimmt. :-)&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Optimismus hei&szlig;t die Devise: Eine deutliche Mehrheit der Teilnehmer glaubt,
dass der &raquo;Amiga One&laquo; sp&auml;testens Anfang 2001 erscheinen wird. Damit h&auml;tte
die (mittlerweile nicht mehr ganz) neue Amiga-F&uuml;hrung lediglich ein Jahr
ben&ouml;tigt, um den Amiga-Nachfolger auf den Markt zu bringen. In wenigen
Monaten wissen wir, ob der Zeitplan eingehalten werden konnte.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AFiloFaxPro&quot;: Thomas Krpic&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;MetaView&quot;: Dirk Neubauer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;ArtEffect v2.5.1&quot;: Andreas Wolf&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
