<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses8.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Schritt f&uuml;r Schritt zum AmigaNG
</P>
<P>
Vor kurzem hat AMIGA ein Abkommen geschlossen, das die Entwicklung einer
Version des neuen Amiga-Betriebssystems f&uuml;r die Ger&auml;te des amerikanischen
Unternehmens Infomedia Network, Inc. vorsieht. Diese Vereinbarung stellt
die erste ihrer Art &uuml;berhaupt dar und beweist, dass bereits vor Erscheinen
von &raquo;Ami&laquo; Interesse an dieser Entwicklung besteht.
</P>
<P>
F&uuml;r manche Amiga-User mag ein kleiner Sch&ouml;nheitsfehler sein, dass es sich
bei den von Infomedia Network hergestellten Produkten um interaktive Set-
Top-Boxen handelt - ein Begriff, der vielen seit VIScorp nicht unbedingt in
positiver Erinnerung ist -, doch sollte sich jeder Anwender drei Dinge
bewusst machen:
1. Set-Top-Boxen sind ein Anwendungsbereich f&uuml;r das neue OS unter vielen.
2. Set-Top-Boxen wird (zugegebenerma&szlig;en nicht von allen, aber von vielen
Experten) ein riesiger Zukunftsmarkt prophezeit.
</P>
<P>
3. Mit jedem Ger&auml;t, auf dem &raquo;Ami&laquo; l&auml;uft, wird das neue System insgesamt
gest&auml;rkt. Denn aufgrund seiner Hardwareunabh&auml;ngigkeit auf Bin&auml;rebene wird
es ohne Weiteres m&ouml;glich sein, eine Software, die beispielsweise auf dem
&raquo;Amiga One&laquo; entwickelt wurde, auch auf den Set-Top-Boxen von Infomedia
Network zu verwenden - sofern der Programmierer dies nicht bewusst oder
unbewusst ausgeschlossen hat. Denn eine Applikation, die zum Beispiel
zwingend 64 MByte RAM erfordert, wird auf Ger&auml;ten mit nur 32 MByte Speicher
nat&uuml;rlich nicht lauff&auml;hig sein - aber das ist ja nichts Neues.
</P>
<P>
Ein weiterer Schritt ist also getan, nun muss sich AMIGA bem&uuml;hen, mehr
Hardwarehersteller f&uuml;r sich und &raquo;Ami&laquo; zu gewinnen. Das mag sich jetzt, in
der Entwicklungsphase, m&ouml;glicherweise als nicht ganz einfach herausstellen,
aber sp&auml;testens nach Erscheinen des neuen OS sollte es nicht mehr schwierig
sein, potentielle OEM-Nutzer zu &uuml;berzeugen - immer unter der Voraussetzung,
das Betriebssystem h&auml;lt, was AMIGA und die Tao Group versprechen.
</P>
<P>
Ebenso wichtig ist es f&uuml;r AMIGA jedoch, auch bislang nicht auf dem Amiga-
Markt vertretene Softwarehersteller zu gewinnen, Programme f&uuml;r das OS zu
entwickeln. Ruksun Software Technologies kann hierbei nur ein Anfang sein.
</P>
<P>
Eine taktische Meisterleistung - wenn auch m&ouml;glicherweise unbewusst - hat
AMIGA &uuml;brigens bei der Vermarktung des Software Developer's Kit &uuml;ber Red
Hat vollbracht: Die entsprechende Presseerkl&auml;rung suggeriert den Lesern,
unter denen sich ganz sicher etliche Linux-Programmierer befinden, es gehe
vorrangig um einen Application-Layer f&uuml;r genau dieses OS. Doch wer mit dem
SDK entwickelt, erh&auml;lt Software, die nicht nur mittels der gehosteten
&raquo;Ami&laquo;-Version auf Linux, sondern auch auf allen anderen Varianten des neuen
Amiga-Betriebssystems lauff&auml;hig ist. Das hei&szlig;t: Wird diese Version des
AmigaNG-OS zum Standard auf Linux, bedeutet dies gleichzeitig den
Durchbruch f&uuml;r den AmigaNG insgesamt.
</P>
<P>
Lassen wir uns also &uuml;berraschen, mit welchen Partnern AMIGA in den n&auml;chsten
Wochen aufwartet.
</P>
<P><B>Bis n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
