<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Reviews</H2>
<H3>The Amiga Game Guide</H3>
<P>
Beim APC&amp;TCP ist eine neue CD-ROM mit dem Namen &quot;The Amiga
Game Guide&quot; erschienen. Bei dieser CD-ROM handelt es sich prim&auml;r
um ein Nachschlagewerk zu Infos, Tips &amp; Tricks und Cheats
f&uuml;r Amiga-Spiele. Au&szlig;erdem befinden sich auf der CD-ROM zahlreiche
Patches, HD-Installer, Spielst&auml;nde usw. Die CD-ROM l&auml;sst sich
sowohl am Amiga als auch am PC benutzen, da eine Version des
Guides im HTML Format vorliegt.
</P>
<P>
Die Amiga Game Guide CD-ROM kommt in der altbekannten CD-H&uuml;lle
auf einem Rohling daher. Cover und R&uuml;ckseite wurden allerdings
professionell gedruckt. Bevor man den Haupteil der CD zu
Gesicht bekommt, wird einem erstmal eine kleine Introduktion
gezeigt, die haupts&auml;chlich aus Bildern besteht. Danach kann
man ausw&auml;hlen, ob man das Amiga Game Guide im HTML Format
oder im AmigaGuide Format sehen m&ouml;chte. Als Amiga-Benutzer
zieht man hier nat&uuml;rlich letzteres vor.
</P>
<P>
Schon kurz danach &ouml;ffnet sich MultiView und zeigt das Amiga
Game Guide an. Hier gibt es jetzt die unterschiedlichsten
Informationen zu sehr vielen Amiga-Spielen. Von Cheats,
Tips &amp; Tricks, Komplettl&ouml;sungen, Kompatiblit&auml;tsinformationen
bis hin zu Originalnamen von Spielen findet man hier fast
alles interessante &uuml;ber die Amiga-Klassiker. Au&szlig;erdem gibt
es auch noch viele Bilder von Amiga-Spielen zu bestaunen,
darunter z.B. auch Karten f&uuml;r einige Spiele. Desweiteren
gibt es im Unterverzeichnis Amiga viele Patches, HD Installer,
Spielst&auml;nde, Demos, Addons und Tools f&uuml;r Amiga-Spiele. Die
Sammlung ist nachvollziehbar strukturiert und hinterl&auml;sst
einen ordentlichen Eindruck.
</P>
<P>
Fazit: Die Amiga Game Guide CD-ROM kann man f&uuml;r Interessierte
durchaus empfehlen, da auf ihr wirklich massenhaft interessante
Informationen vorhanden sind, die man als Amiga-User ganz
gut gebrauchen kann. Nat&uuml;rlich kann man eigentlich alle
Sachen der Amiga Game Guide CD-ROM im Aminet oder woanders
als Freeware wiederfinden, doch ist auf der Amiga Game Guide
CD-ROM alles in deutsch verfasst und auch die Downloadzeit
k&ouml;nnte man sich sparen. Der Preis von 29.95 DM ist auch
nicht zu hoch angesetzt. Die CD-ROM ist also durchaus
empfehlenswert, auch wenn es sich dabei 'nur' um eine Sammlung
von Informationen und kleineren Programmen handelt.
</P>
<TABLE><TR><TD BGCOLOR="#e0e0e0"><PRE>
+-------------------------------------------------------------------------+
|  Name:          The Amiga Game Guide CD-ROM                             |
|  Hersteller:    Stefan Martens und Stefan Instinke, Vertrieb &uuml;ber den   |
|                 APC&amp;TCP, <A HREF="http://www.apc-tcp.de/" TARGET="_top">http://www.apc-tcp.de/</A>                         |
|  Preis:         29.95 DM                                                |
|  Datentr&auml;ger:   1 CD                                                    |
|  Genre:         Informationssammlung   | Spieler: -                     |
|  Sprache:       deutsch                | Anleitung: -                   |
|  System:        Amiga, OS 3.0, CD-ROM oder PC mit CD-ROM und Browser    |
|                                                                         |
|  Fazit:         Interessante Zusammenstellung von Informationen.        |
|                                                                         |
|  Wertung:                                                               |
|                             Nutzen:           6/10                      |
|                             Zusammenstellung: 7/10                      |
|                             Handhabung:       5/10                      |
|                             GESAMT:            60%                      |
+-------------------------------------------------------------------------+
</PRE></TD></TR></TABLE>
<H3>Pictris</H3>
<P>
Ein weiteres neues Spiel im Sortiment vom APC&amp;TCP ist Pictris, einem
Knobelspiel f&uuml;r T&uuml;ftler. Auch Pictris wird in der Standard-CD-H&uuml;lle
auf Rohling geliefert. Zu den Features von Pictris geh&ouml;ren 240
verschiedene Puzzle in 3 Schwierigkeitsstufen, zuf&auml;llige Hintergrundbilder,
Multi-Channel Module und einiges mehr. Pictris ben&ouml;tigt mindestens
einen Amiga mit AGA oder Grafikkarte, 1.5 Megabyte freien Chip
Speicher sowie 4 Megabyte Fast Speicher.
</P>
<P>
Nach dem Einlegen der CD-ROM kann man erstmal verschiedene
Einstellungen festlegen, wie z.B. den Bildschirmmodus, Abspielfrequenz
f&uuml;r die Musikmodule sowie einiges mehr. Selbstverst&auml;ndlich
kann man Pictris auch auf Festplatte installieren. Wer das
nicht m&ouml;chte, der kann es auch direkt von CD-ROM starten. Pictris
unterst&uuml;tzt viele verschiedene Sprachen, die man hier auch
konfigurieren kann. Hat man alles eingestellt, startet das
Spiel wahlweise gleich automatisch. Es kann also losgehen....
</P>
<P>
Pictris startet auf einem normalen Amiga-Bildschirm mit 256
Farben. Nach einer kurzen Einf&uuml;hrung findet man sich prompt
im Hauptmen&uuml; wieder. Von hier kann man alles steuern, wie
z.B. Highscores ansehen, neues Spiel beginnen oder ein altes
Spiel laden. Wir entscheiden uns hier nat&uuml;rlich f&uuml;r ein
neues Spiel. Nach dem Dr&uuml;cken dieses Knopfes erscheint ein
erneuter Bildschirm, der einen auffordert, eine Runde
auszusuchen. Hier kann man zuerst nur Runde 1 ausw&auml;hlen.
Nun findet man sich im eigentlichen Spiel wieder. Bei
entspannender Musik kann man mit dem T&uuml;fteln so richtig
loslegen. Hier zeigt sich dann auch gleich, wer mathematisch
etwas hinter den Ohren hat; es gibt n&auml;mlich Hinweise
zum Finden der richtigen K&auml;stchen verschl&uuml;sselt in
Zahlen. Kurzum: Durch einfaches Probieren auf gut
Gl&uuml;ck kommt man bei Pictris nicht weit.
</P>
<P>
Fazit: F&uuml;r T&uuml;ftler ist Pictris sicher ein wunderbares
Spiel f&uuml;r lange Abende. Es ist schlicht aufgemacht,
spielt leise Entspannungsmusik im Hintergrund; das
richtige zum Nachdenken. Wer allerdings lieber auf schnelle
Action steht, der sollte von Pictris lieber die Finger
lassen, denn darauf trifft das Genre &uuml;berhaupt nicht
zu. Kurzum, Pictris ist ein gelungenes Spiel. Abwertend
wirken sich aber die Hintergrundbilder und -musik aus,
da sie einfach meistens aus dem Aminet o.&auml;. gezogen
und benutzt wurden. Hier h&auml;tte man besser selbst etwas
machen sollen. Aber bei einem solchen Spiel kommt es
auch nicht unbedingt auf Grafik und Musik an. Deshalb
z&auml;hlt der Spielspa&szlig; in der nachfolgenden Wertung doppelt,
w&auml;hrend alle anderen Punkte nur einfach gewertet werden.
</P>
<P>
<A HREF="img/Pictris1.jpg"><IMG SRC="thumb/Pictris1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Pictris2.jpg"><IMG SRC="thumb/Pictris2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<TABLE><TR><TD BGCOLOR="#e0e0e0"><PRE>
+-------------------------------------------------------------------------+
|  Name:          Pictris                                                 |
|  Hersteller:    Manta Soft, ver&ouml;ffentlicht von APC&amp;TPC,                 |
|                 <A HREF="http://www.apc-tcp.de/" TARGET="_top">http://www.apc-tcp.de/</A>        (Best. &uuml;. Internet m&ouml;gl.) |
|  Preis:         39.95 DM                                                |
|  Datentr&auml;ger:   1 CD                                                    |
|  Genre:         Geschicklichkeit       | Spieler: 1                     |
|  Sprache:       deutsch u.v.m.         | Anleitung: deutsch u.v.m.      |
|  System:        AGA oder Grafikkarte   | CD-ROM, 1.5MB Chip, 4MB Fast   |
|                                                                         |
|  Fazit:         Ein T&uuml;ftelspiel im klassischen Stil! F&uuml;r lange Abende   |
|                 im Herbst bestimmt geeignet.                            |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     4/10                            |
|                             Sound:      5/10                            |
|                             Handhabung: 7/10                            |
|                             Spielspa&szlig;:  8/10                            |
|                             GESAMT:      70%                            |
+-------------------------------------------------------------------------+
</PRE></TD></TR></TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
