<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Crystal Software stellt alle Classic Amiga Spiele ein
</LI>
</UL>
<P>
Diese Meldung auf der News-Seite von Crystal Software ging
diesen Monat irgendwie im Sommerloch unter. Konkret bedeutet
diese Meldung allerdings, dass &uuml;ber 10 angek&uuml;ndigte Spiele
definitiv eingestellt wurden. Schaut einfach mal in die
Release-Liste; dann werdet ihr sehen, wovon ich rede. Eine
kleine Hintert&uuml;r hat sich Crystal Software jedoch ge&ouml;ffnet
gehalten: Den neuen Amiga m&ouml;chte man noch unterst&uuml;tzen.
</P>
<UL>
<LI> Codename: Hell Squad erschienen
</LI>
</UL>
<P>
Digital Dreams Entertainment (DDE) hat diesen Monat die
endg&uuml;ltige Version von Codename: Hell Squad ver&ouml;ffentlicht.
Das Echtzeit-Adventure wurde urspr&uuml;nglich schon von
Vulcan Software ins Leben gerufen und von Digital Dreams
Entertainment fertiggestellt. Ein Review k&ouml;nnt ihr
voraussichtlich in der n&auml;chsten AMIGA-aktuell-Ausgabe
lesen.
</P>
<UL>
<LI> Falke Verlag st&ouml;&szlig;t Amiga Future ab
</LI>
</UL>
<P>
Der Falke Verlag, der seit einiger Zeit die Ver&ouml;ffentlichung des
einzigen gedruckten Amiga-Spielemagazins &uuml;bernommen hatte, wird
die Zeitschrift nicht mehr weiterf&uuml;hren. Allerdings bedeutet
das nicht die Einstellung der Zeitschrift; sie wird jetzt in
Eigenregie von Andreas Magerl herausgegeben. An der Redaktion
wird sich dadurch aber nichts &auml;ndern. Auch eine Leser-CD-ROM
soll es zu jeder Ausgabe geben.
</P>
<UL>
<LI> Sin von Hyperion Software
</LI>
</UL>
<P>
Die Portierung von Sin, einem vom PC bekannten 3D-Shooter,
geht laut Hyperion Software gut voran. Priorit&auml;t hat allerdings
momentan die Linux-Version von Sin. Die Amiga-Version soll
etwa im 4. Quartal 2000 ver&ouml;ffentlicht werden. Sie ist also
in absehbare N&auml;he ger&uuml;ckt.
</P>
<UL>
<LI> Joyride erschienen
</LI>
</UL>
<P>
Titan Computer hat diesen Monat die fertige Version von
dem 3D-Autorennen Joyride ver&ouml;ffentlicht. Joyride wurde
vor kurzem in dem Spieleteil von AMIGA aktuell vorgestellt,
und ich hoffe, euch n&auml;chsten Monat ein ausf&uuml;hrliches
Review pr&auml;sentieren zu k&ouml;nnen.
</P>
<UL>
<LI> Operation Counterstrike
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Seit langem gibt es mal wieder was Neues von Operation Counterstrike&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">zu berichten. Laut den Entwicklern von Blue Black Solution arbeitet&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">man nach wie vor an dem Spiel und es soll bald eine nicht spielbare&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Demoversion erscheinen. Der endg&uuml;ltige Erscheinungstermin d&uuml;rfte damit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">in weitere Ferne ger&uuml;ckt sein.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Nightlong kommt im Oktober
</LI>
</UL>
<P>
Laut clickBOOM ist Nightlong schon im Presswerk und soll sobald
wie m&ouml;glich ausgeliefert werden; sp&auml;testens jedoch im Oktober.
Ein ausf&uuml;hrliches Review k&ouml;nnt ihr dann auf jeden Fall in
AMIGA aktuell lesen.
</P>
<UL>
<LI> Desert Racing
</LI>
</UL>
<P>
Das Spiel Desert Racing, welches schon vor l&auml;ngerem hier im
Spieleteil von AMIGA aktuell vorgestellt wurde, hat einen
Herausgeber gefunden: Die Ver&ouml;ffentlichung des Spiels &uuml;bernimmt
der APC&amp;TCP. Es wird allerdings noch etwas dauern, da das
Spiel momentan komplett &uuml;berarbeitet wird.
</P>
<UL>
<LI> Gilbert Goodmate
</LI>
</UL>
<P>
Auch von dem legend&auml;ren Adventure Gilbert Goodmate and the Mushroom
Phungoria gibt es Neuigkeiten. So wird in K&uuml;rze die PC-Version des
Spiels ver&ouml;ffentlicht werden und eine Amiga-Version soll jetzt
nur noch folgen, wenn sich Dark Millenia gut verkauft.
</P>
<UL>
<LI> Pictris erschienen
</LI>
</UL>
<P>
Diesen Monat hat der APC&amp;TCP Computerclub sein neues Spiel Pictris
ver&ouml;ffentlicht. Ein ausf&uuml;hrliches Review k&ouml;nnt ihr in dieser
AMIGA-aktuell-Ausgabe lesen.
</P>
<UL>
<LI> CD32 Outside Nr. 2 erschienen
</LI>
</UL>
<P>
Die zweite und letzte Ausgabe des erst k&uuml;rzlich eingef&uuml;hrten
CD32-Onlinemagazins CD32 Outside ist diesen Monat erschienen.
Die Herausgeber, die CD32-Allianz, hatten sich vor kurzem
aufgel&ouml;st und diese Ausgabe nur noch pro forma ver&ouml;ffentlicht.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
