<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Auswertung der Leserumfrage</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="fd-hitparade2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Auswertung der Leserumfrage
</font>
</TD></tr>
</TABLE>
<BR>
<H2>AMIGA-aktuell-Umfrage: Die Auswertung</H2>
<P>
In AMIGA aktuell 06/2000 hatten wir eine kurze Umfrage veranstaltet, an der
142 Leser teilnahmen, und deren Ergebnisse im Folgenden kurz
zusammengefasst werden sollen.
</P>
<P>
Zun&auml;chst ein wichtiger Hinweis: All diejenigen, die in ihrer
Umfrageeinsendung die M&ouml;glichkeit einer Mitarbeit bei AMIGA aktuell nicht
ausgeschlossen hatten, aber keine Antwort erhielten, melden sich bitte noch
einmal per E-Mail (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>) bei mir.
</P>
<P>
Nun zur Auswertung der einzelnen Fragen:
</P>
<H3>1. Wie gef&auml;llt dir AMIGA aktuell?</H3>
1. Sehr gut<BR>
2. Gut<BR>
3. Weniger gut<BR>
4. &Uuml;berhaupt nicht<BR>
<P>
Ergebnis: Mit einer einzigen Ausnahme (&quot;Weniger gut&quot;) wurden ausschlie&szlig;lich
die Antworten 1 und 2 gegeben, ein, wie ich finde, sehr erfreuliches
Ergebnis. AMIGA aktuell scheint also bei euch &quot;anzukommen&quot;.
</P>
<H3>2. Welche Rubriken findest du am besten?</H3>
<P>
und
</P>
<H3>3. Auf welche Rubriken k&ouml;nntest du verzichten?</H3>
<P>
Ergebnis: Hier wurde die Uneinigkeit der Leserschaft deutlich, denn
praktisch jede Rubrik wurde sowohl unter Frage 2 als auch unter Frage 3
genannt. Dies betrifft insbesondere den Spieleteil, da es sowohl Leser
gibt, die &uuml;berwiegend spielen, als auch solche, die dies &uuml;berhaupt nicht
tun.
</P>
<P>
Viele Einsender sind zudem schlicht der Ansicht, dass keine Rubrik
&uuml;berfl&uuml;ssig ist, und so sollte es im Optimalfall ja auch sein.
</P>
<P>
Besonders gut kommen &uuml;brigens Interviews und Kommentare an, deshalb suchen
wir insbesondere in diesen Bereichen noch Verst&auml;rkung! Wer hat Lust, ab und
zu ein Interview zu f&uuml;hren oder einen Kommentar zu schreiben?
</P>
<H3>4. Hast du irgendwelche Verbesserungsvorschl&auml;ge f&uuml;r AMIGA aktuell?</H3>
<P>
Ergebnis: Hier kamen nur vereinzelt Anregungen, aber die Vorschl&auml;ge, die
umsetzbar sind, werden fr&uuml;her oder sp&auml;ter realisiert werden.
</P>
<H3>5. Kannst du dir vorstellen, bei AMIGA aktuell mitzuarbeiten, wenn ja, in
welchem/welchen Bereich(en)?</H3>
<P>
Ergebnis: Relativ viele Leser haben sich zu einer Mitarbeit bereit erkl&auml;rt
oder diese zumindest nicht ausgeschlossen. Leider jedoch hat sich bislang
nur ein Bruchteil derjenigen nochmals bei mir gemeldet (siehe einleitende
Worte).
</P>
<H3>6. Benutzt du einen Amiga-Computer?</H3>
1. Ja<BR>
2. Nein, nur Amiga-Emulation<BR>
3. Weder noch<BR>
<P>
Ergebnis: Wenig erstaunlich ist, dass eine &uuml;berw&auml;ltigende Mehrheit einen
echten Amiga-Computer benutzt. Allerdings gibt es auch einige, die nur noch
&uuml;ber eine Emulation (v.a. UAE) verf&uuml;gen, und selbst Leser, die das AmigaOS
momentan &uuml;berhaupt nicht mehr nutzen, sind anzutreffen.
</P>
<H3>7. Planst du, das von AMIGA angek&uuml;ndigte neue Betriebssystem zu verwenden?</H3>
1. Ja, auf jeden Fall<BR>
2. Ja, wahrscheinlich<BR>
3. Nein, wahrscheinlich nicht<BR>
4. Nein, auf keinen Fall<BR>
<P>
Ergebnis: Eine gro&szlig;e Mehrheit antwortete mit 1. beziehungsweise 2., Nein-
Stimmen kamen nur vereinzelt, wobei kaum jemand die Nutzung des neuen
AmigaOS vollkommen ausschloss (4.).
</P>
<H3>8. Wenn ja, voraussichtlich auf welcher Hardwarebasis?</H3>
1. 68k-Amiga mit PowerPC-Erweiterungskarte<BR>
2. PowerPC-Rechner<BR>
3. x86-Rechner<BR>
4. Andere<BR>
<P>
Ergebnis: Etwa gleich oft genannt wurde &quot;68k-Amiga mit PowerPC-
Erweiterungskarte&quot; und &quot;x86-Rechner&quot;, dicht gefolgt von &quot;PowerPC-Rechner&quot;.
Antwort 4. (&quot;Andere&quot;) kam weniger h&auml;ufig, dagegen gaben einige Leser an,
sich in der Frage der verwendeten Hardware noch nicht entscheiden zu
k&ouml;nnen.
</P>
<P>
Abschlie&szlig;end ist zu sagen, dass mir die Teilnehmer an der Umfrage wichtige
Erkenntnisse geliefert haben. So habe ich den Eindruck gewonnen, dass ihr
mit AMIGA aktuell, so wie es jetzt ist, grunds&auml;tzlich zufrieden seid. Was
kann sich der Herausgeber eines Magazins Sch&ouml;neres w&uuml;nschen (au&szlig;er mehr
Beteiligung...)?
</P>
<P ALIGN="RIGHT">
<A HREF="fd-hitparade2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
