<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P><B>Sommernachtstr&auml;ume</B></P>
<P>
In Deutschland wurden vor einigen Tagen die UMTS-Lizenzen f&uuml;r knapp 100
Milliarden DEM an sechs k&uuml;nftige Anbieter der sch&ouml;nen neuen Medienzukunft
versteigert.
</P>
<P>
Ob der Preis, den die Firmen zahlen mu&szlig;ten, nun zu gering, zu hoch oder
genau richtig war, ist eher relativ. Versteigerer Scheuerle hat, wie es f&uuml;r
einen Auktionator &uuml;blich ist, in einer sehr spannenden Weise ein
Allgemeingut (die Frequenzen) an den/die Mei&szlig;tbietenden verkauft.
</P>
<P>
Die Bieter haben, unter Abw&auml;gung wirtschaftlicher Interessen, den f&uuml;r ihr
kommerzielles Engagement notwendigen Preis (ihre Vorstellung des Preises)
geboten und gesiegt.
</P>
<P>
Diese klare und n&uuml;chterne Betrachtungsweise soll uns verstehen helfen,
wieso ein Produkt einen bestimmten Preis hat und ob bzw. wie der
potentielle K&auml;ufer bereit ist, diesen Preis zu zahlen.
</P>
<P>
Eine gerechte Sache, will man meinen. W&auml;re da nicht noch das St&uuml;ck Emotion,
das einen vernarrten Freak dazu bringt, viel Geld f&uuml;r ein nicht so gutes
Produkt auf den Tisch zu bl&auml;ttern.
</P>
<P>
Ein Software-Anbieter aus Redmond hat k&uuml;rzlich seine Idee einer k&uuml;nftigen
Programmier-Plattform pr&auml;sentiert. Dieses zeigt &Auml;hnlichkeiten mit der von
Amiga favorisierten VP-Struktur.
</P>
<P>
Es scheint sich ein Kampf anzubahnen, der einigen potentiellen
Verbrauchern/K&auml;ufern derzeit noch nicht so ins Bewu&szlig;tsein ger&uuml;ckt zu sein
scheint. Und wenn die Idee des Amiga aus emotionalen Gr&uuml;nden (sein bisher
gr&ouml;&szlig;tes Potential) scheitert, wird MS ein leichtes Spiel haben.
</P>
<P>
Amiga entwickelt nicht nur ein schn&ouml;des Betriebssystem. Es geht darum,
welche Idee in den K&ouml;pfen der Anwender eine Zukunft hat, und welche Idee
die technisch beste ist.
</P>
<P>
Microsoft hat das gr&ouml;&szlig;ere Anwenderpublikum, kann sich auf die bisherigen
(teils recht unbedarften PC-User) st&uuml;tzen. Linux hat noch immer nicht die
durchg&auml;ngige Bedienungsfreundlichkeit, die es n&ouml;tig h&auml;tte, um st&auml;rker
mitspielen zu k&ouml;nnen ... um Marktanteile in nennenswertem Umfang zu
ergattern.
</P>
<P>
Und was macht Amiga? Oder besser gesagt, was hat Amiga vor? Meldungen &uuml;ber
Partnerschaften mit anderen (erfolgreichen) Firmen haben so etwas Perverses
an sich.
</P>
<P>
Pragmatisch gesehen sieht es so aus: Die Entwicklerversion des neuen
AnigaOE ist verf&uuml;gbar. Eine Entwicklermaschine (d`Amiga) ist ebenfalls
verf&uuml;gbar. Programmierer/Entwickler sind verf&uuml;gbar. Partnerschaften mit
anderen Firmen wurden realisiert und bekannt gemacht.
</P>
<P>
Was fehlt, ist der K&auml;ufer. Und es bleibt zu hoffen, dass Amiga diesen mit
einer begeisternden Hard- und Software &uuml;berzeugt. Und das er diesen neuen
Amiga mit einer gro&szlig;en Show bekannt macht. Die Pr&auml;sentation des Amiga in
der Frankfurter Oper l&auml;&szlig;t gr&uuml;&szlig;en.
</P>
<P>
Und vielleicht gibt sich ja dieses Mal Bruce Willis (als Verk&uuml;nder eines
Armageddon f&uuml;r andere Plattformen) h&ouml;chstpers&ouml;nlich die Ehre? Jedenfalls
besser als Karl Moik mit seinem &quot;Musikantenstadl&quot;.
</P>
<P>
Macht's gut und ....
</P>
<P ALIGN=RIGHT> ....lebt lang und erfolgreich !!</P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
