<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Logitech-Tastatur
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <H2 align="center">
            <B>Logitech-Tastatur</B>
          </H2>
          <P>
            Heute will ich kurz &uuml;ber das <B>Logitech Deluxe Access Keyboard</B> berichten.<BR>
             Da bei meiner alten Tastatur eine Cursor-Taste ihren elektrischen Geist aufgab, kam die Zeit, einen passenden Nachfolger aufzu st&ouml;bern.<BR>
             Also flugs in die Filiale einer gro&szlig;en PC-Handelkette und schnell ein neues Keyboard kaufen.<BR>
             Was auff&auml;llt: Sechs verschiedene Tastaturen, f&uuml;nf davon haben <I>Multi-Media</I> im Vornamen.<BR>
             Ich w&auml;hlte die besagte Logitech-Tastatur.
          </P>
          <CENTER>
            <TABLE cellspacing="0" cellpadding="0" summary="">
              <TR>
                <TD>
                  <IMG src="mm_logikeyboard.jpg" alt="Logitech-Tastatur schwarz" width="284" height="194">
                </TD>
              </TR>
            </TABLE>
            <B>Logitech Tastatur in schwarz</B>
          </CENTER>
          <P>
            Die Tastatur kommt nicht in dem &uuml;blichen Computer-Einheitsbeige daher sondern in einem fast schon strahlendem hellen grau. Der Kunststoff der Tastatur f&uuml;hlt sich leicht rauh an
            und hat den Nachteil, durch seine helle Oberfl&auml;che jeden Staubfussel sichtbar zu machen.<BR>
             Das Tastatur-Geh&auml;use ist nicht rechteckig, sondern ist an jeder seiner Seiten mehr oder weniger schwungvoll gestaltet.<BR>
             Der Druckpunkt der Tasten ist fest und nicht zu leichtg&auml;ngig, es gibt kein schwammiges Gef&uuml;hl: ist die Taste an ihrem leisem Anschlag, ist der Tastendruck schon
            registriert.<BR>
             Da es sich hier ja um eine Multi-Media-Tastatur handelt, sind noch ein paar Tasten mehr auf dem Keyboard oberhalb der Funktions-Tasten vorhanden: Am auff&auml;lligsten sind zwei Tasten
            in dunklem Blau, mittig zusammengefasst in der gr&ouml;&szlig;e einer Euro-M&uuml;nze, gedacht als Lautst&auml;rkeregler.<BR>
             Links und rechts davon existieren hellgraue kleinere ovale Tasten f&uuml;r <I>E-Mail, Messenger, Webkamera,</I> genannt Kommunikations-Tasten. <I>Media, Startseite</I> und <I>Suchen</I>
            nennen sich Internet-Tasten. Dann gibt es noch ganz links eine mit <I>User</I> beschriftete Taste die komischer Weise eine Stand-by Funktion haben soll.<BR>
             Leider sind, wie k&ouml;nnte es anders sein, alle diese Zusatz-Tasten f&uuml;r Amiga-User v&ouml;llig unbrauchbar. Zwar wird eine Installations-CD mit geliefert, aber die hat
            nat&uuml;rlich nur Treiber f&uuml;r Windows-Betriebsysteme ab 95 aufw&auml;rts und f&uuml;r das Mac OS X.
          </P>
          Die unsinnigste Taste f&uuml;r mich aber ist die ganz kleine links neben der <I>ESC</I>-Taste. Die nennt sich <I>F Lock</I> und schaltet die F-Tasten ein. Ja, ein. Das muss man leider immer
          nach dem Einschalten des Rechners oder nach einem Restet machen. Daf&uuml;r gibt es dann aber auch ganz rechts neben der &uuml;blichen <I>Shift Lock</I> Kontrolle, die hier mit <I>A</I>
          beschriftet ist, eine <I>F</I> Kontrolle.<BR>
           Die Bereitschaftsanzeige der Tastatur zeigt eine <I>1,</I> dann gibt es noch einen Pfeil nach unten, aber bislang entzieht sich deren Funktion meiner Kenntnis.<BR>
           Das Kabel ist mit 150 cm f&uuml;r meinen Geschmack 50 cm zu kurz, reicht aber vom Schreibtisch nach unten an den Tower und besitzt einen PS/2 Anschlu&szlig;. Das Tastatur-Geh&auml;&uuml;se
          hat an der hinteren Seite unten noch zwei kleine Beinchen, die nach dem aufstellen die Tastatur um &uuml;ppige 9 mm anheben. Ansonsten ist die Tastatur auch mit aufgestellten Beinchen sehr
          rutschfest zu bedienen.<BR>
           <BR>

          <P>
            <B>Lieferumpfang:</B>
          </P>
          <UL type="disk">
            <LI>
              Installations-CD
            </LI>
            <LI>
              Mini-Handbuch (kaum zu gebrauchen)
            </LI>
            <LI>
              5 Jahre Garantie
            </LI>
            <LI>
              Preis: 19,95 Euro
            </LI>
          </UL>
          <P>
          </P>
          <B>Name:</B> Logitech Deluxe Access Keyboard<BR>
           <B>Adresse:</B> www.logitech.com
          <P>
            <B>Mein Fazit:</B> Eine gut verarbeitete Tastatur mit angenehmen Schreibkomfort f&uuml;r nicht zu viel Geld.<BR>
             F&uuml;r den PC-Nutzer Dank der (nicht getesteten) Zusatzfunktionen sicher eine lohnende Investition.
          </P>
          <HR>
          <BR>

          <CENTER>
            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC">
                  <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

