<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 2</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena
            Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0"
            summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>

                <TD><B>Christoph Kimna</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>

                <TD>PairsNG</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>

                <TD>http://www.def-con.net/pairs</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>

                <TD>pairs@def-con.net</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo Christoph,kannst Du
          bitte etwas &uuml;ber Dich und Deinem Amiga Werdegang
          erz&auml;hlen?</B></FONT><BR>
           Hallo, ich komme aus dem sauerl&auml;ndischen Menden
          (ca. 40 km von Dortmund) und bin gerade 27 Jahre alt
          geworden. Von Beruf bin ich examinierter Altenpfleger und
          Informationstechnischer Assistent.</P>

          <P>Meine Hobbys sind neben dem Amiga, schwimmen,
          DVD-Filme schauen, Modellraketen z&uuml;nden und
          Motorroller fahren.</P>

          <P>Ich begann 1985 mit dem C64 und kaufte mir 1991 meinen
          ersten Amiga, ein A500, sp&auml;ter dann A1200, A3000 +
          CD32, A4000D und jetzt A4000T mit PPC.</P>

          <P>Programmieren tue ich auch schon seit 1985. Und das
          abgesehen von meinem Fachabi in Informationstechnik
          ausschlie&szlig;lich unter AmigaOS bzw. fr&uuml;her
          C64!</P>

          <P><FONT color="#006000"><B>Mit "PairsNG" gibt es eine
          neue Version des Klassikers wie kamst Du auf die Idee und
          seit wann entwicklest Du an "PairsNG"?</B></FONT><BR>
           Nach meinem kompletten Umstieg auf RTG/Cybergraphics
          fehlte mir irgendetwas: es war Pairs :-) von Tobias Lenz,
          welches bei mir unter Cybergraphics den Dienst versagte.
          Also machte ich mich an die Entwicklung einer
          Nachfolgeversion, die zuerst bei weitem nicht solche
          Dimensionen haben sollte wie die aktuelle Version von
          PairsNG.</P>

          <P>Entwickeln tue ich es seit ca. 1 1/2 Jahren,
          allerdings mit mehreren l&auml;ngeren Pausen.</P>

          <P><FONT color="#006000"><B>In welchem
          Entwicklungsstadium befindet sich zur Zeit "PairsNG", und
          was denkst Du wird es eine erste &ouml;ffentliche
          Demoversion geben?</B></FONT><BR>
           PairsNG befindet sich im fr&uuml;hem Betastadium; die
          erste &ouml;ffentliche Demoversion gibt's in wenigen
          Tagen.</P>

          <P>Momentan arbeite ich noch an der Anleitung; diese wird
          ebenso wie die Katalogdateien zun&auml;chst in Deutsch
          und Englisch verf&uuml;gbar sein</P>

          <P><FONT color="#006000"><B>Welche Ideen oder Features
          hast Du in "PairsNG" schon umgesetzt,bez. worin wird sich
          "PairsNG" im wesentlchen von seinem Vorbild
          unterscheiden?</B></FONT><BR>
           Am wichtigsten ist im Vergleich zum Vorg&auml;nger,
          da&szlig; es auf Grafikkarten lauff&auml;hig ist, also
          auf jedem halbwegs aufger&uuml;stetem Amiga.</P>

          <P>PairsNG wurde komplett neu entwickelt, es hat nur vom
          Spielprinzip etwas mit dem originalen Pairs zu tun.</P>

          <P>Weitere Unterschied sind u.a.:<BR>
          - Jokerfelder<BR>
          - mehere Schwierigkeitsgrade -&gt; mehr Steine<BR>
          - Sound<BR>
          - State-Of-The-Art Grafikoberfl&auml;che<BR>
          - Lokalisierung<BR>
          - l&auml;uft auf der Workbench</P>

          <P>Dann waren mir noch andere Features wichtig, z.B. ist
          PairsNG so programmiert, da&szlig; es auch ohne
          Installationen in Systemordner und ohne Assigns
          auskommt.</P>

          <P><FONT color="#006000"><B>Wird es z.B. in Zukunft eine
          eigene Homepage geben, wo man seine Highscore eintragen
          kann oder wo weitere Spielgrafiken erh&auml;ltlich sein
          werden?</B></FONT><BR>
           Spielegrafiken wird es auf jeden Fall auch auf der
          PairsNG-Homepage geben; Geplant ist auch eine eigene
          Seite f&uuml;r von Usern gestaltete Sets. Die
          Spezifikationen k&ouml;nnen dann auf der Homepage
          nachgelesen werden.</P>

          <P>Highscores im Internet waren urspr&uuml;nglich
          geplant; die Idee habe ich aber wieder verworfen, da
          hierf&uuml;r ein CGI-Server mit eigenen Scripten
          n&ouml;tig ist; sprich ein eigener Webserver.</P>

          <P>Eine kleine Homepage mit den jeweils neuesten Updates
          wird es unter http://www.def-con.net/pairs geben.</P>

          <P><FONT color="#006000"><B>Hast Du weitere "Joker"
          Feartures in arbeit?</B></FONT><BR>
           Momentan sind keine weiteren geplant.</P>

          <P><FONT color="#006000"><B>Auf welchem System
          entwickelst Du "PairsNG", und welche Software verwendest
          Du dazu?</B></FONT><BR>
           Auf einem A4000T, CSPPC,CVPPC mit OS 3.5. Programmiert
          habe ich das Ganze unter StormC V3 mit Stormwizard2.2</P>

          <P><FONT color="#006000"><B>Welche Merkmale vermisst Du
          f&uuml;r die Entwicklung unter AmigaOS?</B></FONT><BR>
           Das sind im wesentlichen zwei Dinge:<BR>
           Einen neuen GUI-Editor, der die Schnelligkeit und
          Einfachheit von Stormwizard, aber die Flexibilit&auml;t
          und die Gadgetarten von MUI bietet.</P>

          <P>Ein vern&uuml;nftiges aktuelles Programmierhandbuch,
          es gibt neben uralten angestaubten B&uuml;chern so gut
          wie nichts. Die ARKRM's und diese Developer CDs kann mann
          auch nicht dazu z&auml;hlen, da diese im wesentlichen nur
          Funktionen grob oder unzureichend beschreiben. Neben
          einigen wenigen Internetseiten und Workshops in Magazinen
          bleibtnur noch die M&ouml;glichkeit, alles aus hunderten
          von Quelltexten aus dem Aminet zusammenzusuchen; und das
          kostet Zeit Tage - Wochen - Monate. Das h&auml;lt viele
          vom Programmieren ab - und User ohne Internet haben
          praktisch keine Chance es zu erlernen.</P>

          <P>Im AmigaOS selbst fehlen mir vor allem Mem-Protection
          bzw. Speicherschutz und nat&uuml;rlich ein PowerPC
          natives OS.</P>

          <P><FONT color="#006000"><B>Welche Systemvorrausetzungen
          werden n&ouml;tig sein um in den Genuss von "PairsNG" zu
          kommen?</B></FONT><BR>
           Eine Grafikkarte, 8MB freier Speicher und mindestens
          eine 68030er Turbokarte mit eigenem Speicher sollten
          reichen. PairsNG l&auml;uft auch unter WinUAE.</P>

          <P><FONT color="#006000"><B>Handelt es sich um eine
          Free/Shareware Entwicklung oder verfolgst Du Kommerzielle
          Ziele</B></FONT><BR>
          ? Es handelt sich um eine Shareware Entwickung. PairsNG
          wird gegen einen geringen Sharewarebeitrag direkt zu
          beziehen sein.</P>

          <P><FONT color="#006000"><B>Welche Motivation
          befl&uuml;gelt Dich um solch ein Spiel zu entwickeln,
          bez. glaubst Du es gibt noch ausreichend Spieler am
          Amiga?</B></FONT><BR>
           Meine Motivation ist die Hoffnung das meine Software von
          vielen Leuten genutzt wird und das die ganze Arbeit so
          nicht umsonst war.</P>

          <P>Ich hoffe doch das es noch genug Spieler gibt!</P>

          <P><FONT color="#006000"><B>Was glaubst Du ist der
          Grund,das es immer weniger Entwickler gibt, die Interesse
          haben Shareware/Freeware Spiele zu
          entwickeln?</B></FONT><BR>
           Das liegt auch an der mangelnden Resonanz seitens der
          User. Das gilt f&uuml;r Shareware genauso f&uuml;r Free-
          oder EMailware. Die einzige Motivation eine Software
          weiterzuentwickeln ist mal abgesehen von evtl.
          finanziellen Aspekten zu wissen, da&szlig; man nicht
          Monate daran f&uuml;r nur ein halbes Dutzend User
          gearbeitet hat.</P>

          <P>Ganz erschreckend finde ich die Ansichten von manchen
          Leuten, wie z.B. "in 68K Software investiere ich kein
          Geld mehr".</P>

          <P><FONT color="#006000"><B>K&ouml;nnen Wir mit weiteren
          Spielen bez.Programme von Dir rechnen in
          Zukunft?</B></FONT><BR>
           Ich da schon einige Ideen; au&szlig;erdem habe ich mich
          f&uuml;r eine Amiga-Port-Lizenz eines ehemals
          kommerziellen PC-Spieles beworben. Mehr verrate ich aber
          noch nicht :-) Hoffentlich klappt es!</P>

          <P><FONT color="#006000"><B>Welche Spiele bevorzugt Du
          noch heute am Amiga?</B></FONT><BR>
           Wipout 2097<BR>
          LucasArts Spiele (ScummWOS)<BR>
          Napalm<BR>
          Heretic 1</P>

          <P>Meine n&auml;chst Anschaffung wird, wenn ich mal
          irgendwann Zeit daf&uuml;r finde, wird Payback sein.
          Freuen tue ich mich auch auf die hoffentlich erscheinende
          Amiga Version von DN3D.</P>
          <BR>
          <BR>
          Mein Traum w&auml;re eine Amiga-Version von Commandos -
          Hinter den feindlichen Linien. </P>
          
          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback
          vom Amiga?</B></FONT><BR>
           Das wird nach der Einf&uuml;hrung von OS4 und MOS
          zeigen. Ich hoffe das die Zahlen der zu anderen Systemen
          wechselenden Usern nicht weiter zunehmen.</P>

          <P>Abh&auml;ngig ist das von der Kompatibilit&auml;t zum
          ClassicOS und vom Erscheinen eines einigerma&szlig;en
          aktuellen Webbrowsers mit Features wie CSS und
          vern&uuml;nftigem Java. IBrowse 2.3 war schon ein erster
          Schritt in diese Richtung.</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>
           Bleibt Eurem Amiga treu und unterst&uuml;tzt die aktiven
          Entwickler. Sie werden es Euch mit neuer und toller
          Software danken. Das Weiterbestehen ist entschieden davon
          abh&auml;ngig.</P>
          Herzliche Gr&uuml;&szlig;e an Euch alle ! </P>
          
          <P align="center">.... __ ------ &copy; Amiga Arena
          05/2003 ----- __ ....<BR>
           <B>aMIGA aRENA - fOR tHOSE wHO lOVE tHE cOMMODORE
          aMIGA</B></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

