<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE></TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Cord's
          Leserbriefe</B></FONT></H1>

          <H3><FONT color="#ffff00">An J&uuml;rgen
          Sperling</FONT></H3>

          <P>Huhu J&uuml;rgen,</P>

          <P>das hat mich schon immer gewurmt, dass die NoCover
          nicht "ehrenvoll" im Internet vertreten war. Zwar war sie
          auf der APC-TCP-Homepage schon prima zug&auml;nglich,
          aber ich denke auch, dass das Magazin mehr verdient hat,
          als nur auf einer Nebenseite versteckt zu sein. Ich war
          direkt ein wenig traurig, dass nat&uuml;rlich die Domain
          NoCover.de bereits l&auml;ngst vergeben war, aber da
          hilft alles Gejammere nichts - musste eben das
          N&auml;chstbeste her, was zu haben war. Ein Webserver ist
          nat&uuml;rlich nicht ganz billig, aber die NoCover wird
          auf unserem AS2-Chicago gehostet, der daf&uuml;r
          gl&uuml;cklicherweise ausreichend Ressouren zur
          Verf&uuml;gung stellt. Wir sponsorn &uuml;brigens noch
          weitere Projekte auf diesem Server - so auch
          http://www.blindzeln.de - ein Forenindex f&uuml;r Blinde
          und Sehgesch&auml;digte. Dadurch kam auch die gute
          Zusammenarbeit der beiden Gruppen zusammen. Die Blindzler
          lesen interessiert die NoCover und die NoCover-Leser
          profitieren davon, dass einige Blindzler hier Artikel in
          verschiedenste Themen schreiben.</P>

          <P>Das alles reicht mir aber noch nicht - wir brauchen
          dringend wieder mehr Schwung in der NoCover, damit das
          Magazin wieder interessanter wird. Da k&ouml;nnen alle
          hier mithelfen. Sprecht direkt Bekannte und Freunde an,
          ob sie nicht hier und da etwas f&uuml;r die NC schreiben
          m&ouml;chten. Viele machen sich schon Arbeit, notieren
          sich im Rechner Rezepte oder Kritiken zu B&uuml;chern und
          ihre DVD-Sammlung. Solche Dinge geh&ouml;ren nicht nur
          eingestaubt in ein Festplattenverzeichnis, sondern
          f&uuml;r viele Menschen hier in der NoCover
          ver&ouml;ffentlicht.</P>

          <P>Wolf und auch ich tun viel, damit die NoCover wieder
          mehr zu bieten hat und damit sie interessanter wird. Es
          ist beachtlich, was Wolf da an Ehrgeiz, Zeit und Geduld
          in das Magazin steckt - ohne ihn w&auml;re die NoCover
          l&auml;ngst schon am Ende angelangt. Aber Ehrgeiz, Zeit
          und Geduld sind kostbare Dinge, die irgendwann mal zu
          Ende gehen, wenn sie nicht aufgefrischt werden. Das
          Magazin muss sich wieder lohnen - nicht finanziell,
          sondern die Zeit und Arbeit, die hinein investiert wird.
          Es macht eben weit mehr Spa&szlig; ein Magazin monatlich
          auf die Beine zu stellen, die von Vielen gelesen wird und
          f&uuml;r das Viele schreiben.</P>

          <P>Hoffen wir alle das Beste f&uuml;r die NoCover und das
          die Artikel nach und nach wieder deutlich zahlreicher
          werden k&ouml;nnen.</P>

          <P>Herzliche Gr&uuml;&szlig;e<BR>
          Cord</P>
          <HR>

          <H3><FONT color="#ffff00">An Jo</FONT></H3>

          <P>Huhu Jo, - bin doch gespannt, ob Du auch bis hier in
          die Leserbriefe hervorkommst. Deine Rubrik "Literatur"
          macht sich Klasse hier in der NoCover. Ich hoffe sehr,
          dass Du am Ball bleibst und flei&szlig;ig weiter Deiner
          Kreativit&auml;t hier freien Lauf l&auml;sst. Deine Texte
          sind eine gute Bereicherung f&uuml;r dieses Magazin!</P>

          <P>Weiter so!<BR>
          Herzliche Gr&uuml;&szlig;e<BR>
          Cord</P>
          <HR>

          <H3><FONT color="#ffff00">An Matthias</FONT></H3>

          <P>Na ich wollte mich auf diesem Weg doch nochmal
          wenigstens herzlich f&uuml;r Deine Karte bedanken.
          W&auml;re doch klasse, auch in der NC mal wieder etwas
          mehr von Dir zu lesen! Lass es Dir gut gehen und bis zur
          n&auml;chsten Ausgabe?<BR>
          Herzliche Gr&uuml;&szlig;e Cord</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

