<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 15</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (15)</h3></font>
<p>
<dl>
<dt>Das Telefon klingelt, gerade als ich ich 'Top Gun' in der Maschine habe.
Ich pausiere das Video und klemm' mir den H&ouml;rer unter's
Kinn.<sub>&nbsp;</sub></dt>

<dd>"Ich f&uuml;rchte, ich habe eine schlechte Floppy Disk
gekauft."<sub>&nbsp;</sub><br>
 "Tats&auml;chlich?" Bin ich jetzt bei der Stiftung Warentest, oder
 was?<sub>&nbsp;</sub><br>
 "Naja, ich hab' da diese Disk und sie l&auml;&szlig;t sich nich'
formatieren. Aber alle anderen in der Schachtel gingen. Also mu&szlig; ich
wohl eine schlechte erwischt haben..."<sub>&nbsp;</sub><br>
 "Darf ich fragen, warum Sie deshalb bei MIR anrufen?"<sub>&nbsp;</sub><br>
 "Naja, auf der Schachtel steht was von Garantie; wo kann ich einen Ersatz
bekommen?"<sub>&nbsp;</sub></dd>

<dt>Ah! Alles klar!<sub>&nbsp;</sub></dt>

<dd>"Schaun' wir mal. Sind Sie ganz sicher, da&szlig; es an der Disk liegt
und nicht irgendwie mit statischer Aufladung zu tun hat?"<sub>&nbsp;</sub><br>
 "H&auml;h?"<sub>&nbsp;</sub><br>
 "Statische Aufladung, Sie wissen schon, statische Elektrizit&auml;t, die Sie
mit ihren Fingern auf das Ger&auml;t &uuml;bertragen."<sub>&nbsp;</sub><br>
 "Aber ich trage ein geerdetes Armband!"<sub>&nbsp;</sub></dd>

<dt>Sp&auml;testens jetzt wei&szlig; ich, wo ich bin: im tiefen Tal der
Super-Deppen. Geerdete Armb&auml;nder geh&ouml;ren in unseren Kreisen nicht
gerade zum Mode-Accessoire...<sub>&nbsp;</sub></dt>

<dd>"Nat&uuml;rlich, aber die Standard-Armb&auml;nder, wie Sie eins tragen,
haben einen 1 Megaohm Widerstand in Reihe geschaltet; eine ziemlich schlechte
Erdung also. Was Sie bauchen, ist eine direkte Erdverbindung. Am besten
fassen Sie mit einer Hand an ein Geh&auml;use, das richtig geerdet
ist."<sub>&nbsp;</sub><br>
 "&Auml;h, zum Beispiel unseren Stahl-Labortisch?"<sub>&nbsp;</sub><br>
 "Hervorragend. Jetzt, haben Sie etwas, um die Aufladung abzuleiten? Zum
Beispiel eine B&uuml;roklammer?"<sub>&nbsp;</sub><br>
 "Moment...ja."<sub>&nbsp;</sub><br>
 "Gut. Dann stecken Sie jetzt mit der ANDEREN Hand die B&uuml;roklammer durch
die Ventilationsschlitze auf der R&uuml;ckseite. Ber&uuml;hren Sie einfach
kurz das Ende des dicken roten Kabels. Dabei aber NICHT den Tisch loslassen.
Sie m&uuml;ssen immer gut geerdetbleiben..."<sub>&nbsp;</sub></dd>

<dt>&gt;raschel&lt; &gt;hantier&lt;<sub>&nbsp;</sub></dt>

<dd>"Meinen Sie das Kabel, das zum Netzteil f&uuml;hrt?"<sub>&nbsp;</sub><br>
 "Genau, halten Sie da drauf."<sub>&nbsp;</sub><br>
 "...Aber ist das nicht..." &gt;kzzzzzt&lt;
&gt;polter&lt;<sub>&nbsp;</sub></dd>

<dt>Und wieder ein Anruf erfolgreich beendet. Ich nehme den Brief&ouml;ffner
und schneide eine weitere Kerbe in das dicke gelbe Ethernetkabel, das
dekorativ hinter dem HELPDESK FROM HELL vorbeif&uuml;hrt.</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh14.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh16.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a>
 </p><br>
</body>
</html>
