<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 14</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (14)</h3></font>
<p>
<dl>
<dt>Ich komme zur Arbeit, aber ich bin nicht ausgeschlafen. Also klemme ich
ein St&uuml;ck Kupferschiene &uuml;ber die drei Phasen der Hauptversorgung
und werfe den Hebel herum. Als die Hauptsicherungen herauspfeifen, wird es
dunkel und endlich mal wird es still im Rechnerraum.<sub>&nbsp;</sub><br>
 Es gef&auml;llt mir.<sub>&nbsp;</sub><br>
 Ich schnippe den H&ouml;rer von der Gabel und schlie&szlig;e die
Vorh&auml;nge vor dem Beobachtungsfenster. Jetzt ist es WIRKLICH dunkel hier
drin. W&uuml;rde mich nicht wundern, wenn jemand einen Unfall
h&auml;tte...<sub>&nbsp;</sub><br>
 Ich taste mich in der Dunkelheit zum Eingang und entferne ein paar der
Bodenplatten, die die tiefen Kabelsch&auml;chte unter dem Rechnerraum
abdecken. Dann rufe ich unsere Service-Firma an und sage, da&szlig; der Mini
wieder mal die Hauptsicherung geschossen hat. Dann ersetzte ich die
geschossenen Sicherungen durch ein paar N&auml;gel und schlie&szlig;e die
Versorgungsleitungen gegen Masse kurz. Auf so was kann man nicht hoffen, man
mu&szlig; es MACHEN! 15 Minuten sp&auml;ter erscheint der Techniker und
fliegt in den Kabelschacht. Ich schiebe die Bodenplatten zur&uuml;ck an ihren
Platz, als der System-Manager - ein neuer, schrecklich gr&uuml;ndlicher Typ -
hereinkommt und mir sagt, ich solle mich vorsehen. In dieser Dunkelheit
k&ouml;nne jemand leicht einen Unfall haben...<sub>&nbsp;</sub><br>
 Ich nicke und sage ihm, da&szlig; wir uns diese Ausfallzeiten eigentlich
nicht leisten k&ouml;nnen und ob ich nicht einfach die Hauptsicherungen
wieder einschalten soll, in der Hoffnung, da&szlig; nicht Ernsthaftes
passiert sei. Nach einiger Meditation &uuml;ber die Negativ-Schlagzeilen, die
wir mit jeder verstreichenden Minute anh&auml;ufen, macht er die letzte
Entscheidung seiner steilen, aber kurzen Karriere: Er sagt, ich soll's
versuchen.<sub>&nbsp;</sub><br>
 Sp&auml;ter, nachdem sich der Rauch etwas gelichtet hat, untersuche ich die
brutzelnden Reste unseres Minis. Kein sehr sch&ouml;ner
Anblick...<sub>&nbsp;</sub></dt>

<dd>"Komisch, da&szlig; die Hauptsicherungen geklemmt haben,
nicht?"<sub>&nbsp;</sub></dd>

<dt>sage ich zum System-Manager, w&auml;hrend er seine pers&ouml;nlichen
Sachen einsammelt.<sub>&nbsp;</sub></dt>

<dd>"Eine Chance von 1 zu einer Million. Zu dumm, da&szlig; Sie jemand
beobachtet und die ganze Geschichte nach comp.misc geposted hat. Nach all der
schlechten Presse k&ouml;nnen Sie froh sein, wenn Sie einen Job finden, in
dem Sie einen Taschenrechner managen d&uuml;rfen..."<sub>&nbsp;</sub></dd>

<dt>Ich geh' zur&uuml;ck in den Kontrollraum und schalte die restlichen
Sicherungen wieder ein. Der Rechnerraum belebt sich wieder. An der Konsole
steht:<sub>&nbsp;</sub><br>
 'D.Usbotmbuhpo!G/Tdif-1-m!2::6' - ein letzter Gruss des verschollenen
Technikers aus der H&ouml;lle!<sub>&nbsp;</sub><br>
 Ich logge ein und beginne, User-Email zu l&ouml;schen. Dabei entdecke ich
eine interessanten sexuellen Antrag unseres Consultants an ein
m&auml;nnliches Mitglied der Schwimm-Mannschaft. Das gibt ein hervorragendes
motd ('motiv of the day'); deshalb kopiere ich es dorthin. Dann &auml;ndere
ich den root Account nach 'Winker' und das Passwort nach 'ljkadlkajflkj'. Dem
gro&szlig;en H&auml;uptling sage ich am Telefon, da&szlig; ich einen Einbruch
vermute. Bis wir das genauer untersucht haben (ein paar Stunden wird's schon
brauchen), bleiben die anderen Accounts gesperrt. Die Leute werden in der
Zwischenzeit die motd lesen...<sub>&nbsp;</sub><br>
 Zumindest einer hat's schon gelesen, denke ich, als wir einen Schu&szlig;
aus dem B&uuml;ro des Consultants h&ouml;ren.<sub>&nbsp;</sub><br>
 Inzwischen editiere ich die Online-Hilfe und &auml;ndere die Nummer der
Hotline - der System Manager wird sich &uuml;ber all die extra Anrufe freuen;
besonders in so einer traurigen Zeit...<sub>&nbsp;</sub><br>
 Ein zweiter Schu&szlig;, und mir wird klar, da&szlig; er heute wohl keine
Anrufe mehr annehmen wird.<sub>&nbsp;</sub><br>
 Ich bl&auml;ttere den Ausredenkalender um und lege den H&ouml;rer auf die
Gabel. "PROBLEME BEI DER STROMVERSORGUNG". Zu realistisch. "STATISCHE
AUFLADUNGEN". Immer noch ein wenig zu realistisch f&uuml;r meinen Geschmack,
aber ich lasse es gelten. Immerhin soll der Kalender noch bis zum Jahresende
reichen.<sub>&nbsp;</sub><br>
</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh13.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh15.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
