<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 9</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (9)</h3></font>
<p>
<dl>
<dt>Ich sitze wie &uuml;blich an meiner Konsole. Ein Benutzer ruft
an.<sub>&nbsp;</sub></dt>

<dd>"Hallo, Kontrollraum. Simon am Apparat. Wie kann ich Ihnen
helfen?"<sub>&nbsp;</sub></dd>

<dt>sage ich.<sub>&nbsp;</sub></dt>

<dd>"Ich komme nicht in meinen Account."<sub>&nbsp;</sub></dd>

<dt>nuschelt es am anderen Ende.<sub>&nbsp;</sub></dt>

<dd>"Wie lautet bitte Ihr Username?"<sub>&nbsp;</sub></dd>

<dt>frage ich.<sub>&nbsp;</sub><br>
 Er gibt mir seinen Usernamen. Ich schaue in seinen
Account.<sub>&nbsp;</sub></dt>

<dd>"Kein Problem, da war nur ein nicht-ausf&uuml;hrbares login file. Ich
hab's richtig gestellt. Jetzt sollten Sie ohne Probleme
'reinkommen."<sub>&nbsp;</sub><br>
 "Danke."<sub>&nbsp;</sub><br>
 "Kein Ursache. Sch&ouml;nen Tag noch!"<sub>&nbsp;</sub></dd>

<dt>H&Auml;&Auml;HH?! fragen Sie sich jetzt. Ist der BASTARD OPERATOR FROM
HELL endlich zum Guten bekehrt worden? Hat er aufgegeben?? REIF F&Uuml;R DIE
KLAPSM&Uuml;HLE???<sub>&nbsp;</sub><br>
 Naaah. Der BASTARD OPERATOR FROM HELL wird ab heute &uuml;berwacht. Alle
Aktionen im Mainframe werden automatisch protokolliert. UND WENN DAS PASSIERT
werde ich normalerweise auch abgeh&ouml;rt! Also mu&szlig; ich h&uuml;bsch
brav sein, bis ich die Bugs entdeckt habe. Sollte nicht allzu lange dauern -
vertrauen Sie mir!<sub>&nbsp;</sub><br>
 Ah. Da haben wir schon eins. Im Telefonh&ouml;rer, klar. Aber der Boss ist
einer von der witzigen Sorte. Ich wette, da sind noch mehr. Ahja, ein anderer
unter dem Telefon und ein dritter in meinem Keyboard. Zeit f&uuml;r eine
kleine Kaffeeschlacht. Drei auf einmal.... hmmm. Ich bringe mal besser die
ganze Kanne und warte auf Zeugen. Der System Manager kommt
herein.<sub>&nbsp;</sub></dt>

<dd>"Wo bleibt der Bericht, den ich gedruckt habe?"<sub>&nbsp;</sub></dd>

<dt>fragt er mit saurer Miene - er &auml;rgert sich offensichtlich, da&szlig;
ich mich am Telefon noch nicht ans Messer geliefert habe. Widersacher
identifiziert! Wie der Direktor der "BASTARD OPERATOR SCHOOL" (ich!) immer zu
sagen pflegt: "Es gibt kein Problem, das sich nicht l&ouml;sen
l&auml;&szlig;t, indem man die Benutzerprozesse killt, alle ihre Files
l&ouml;scht, ihre Accounts sperrt und ihre tats&auml;chlichen Einnahmen dem
Finanzamt zukommen l&auml;&szlig;t."<sub>&nbsp;</sub><br>
 Ich ziehe den Ausdruck unter der Kaffeekanne hervor, die ich plaziert hatte,
und die Kanne ergie&szlig;t sich &uuml;ber Telephone und Keyboard. Aus
irgendeinem Grund standen beide &uuml;bereinandergestapelt in der N&auml;he.
<sub>&nbsp;</sub><br>
</dt>

<dd>"Uuuups!"<sub>&nbsp;</sub></dd>

<dt>sage ich.<sub>&nbsp;</sub><br>
 Entsetzen malt sich auf meinem Gesicht. Sein Gesicht sagt mir, da&szlig; ich
richtig lag.<sub>&nbsp;</sub></dt>

<dd>"Glauben Sie ja nicht, da&szlig; Sie damit davonkommen, Simon" knurrt er
und stampft hinaus.<sub>&nbsp;</sub><br>
</dd>

<dt>Ich schalte den Ethernet Monitor ein und beobachte die Pakete, die aus
seinen PC kommen.<sub>&nbsp;</sub><br>
 Ah. Ein Memo geht an den Laser im B&uuml;ro des Direktors. Inhalt:
Beendigung meines Kontrakts, fristlos. Ich mache schnell ein paar notwendige
&Auml;nderungen an dem File, solange es im Spooldirectory liegt, und lasse es
dann an seine urspr&uuml;ngliche Adresse weitergehen. Ich starte mein
Programm 'endzeit', das -522 auf den PC knallt und der Mainframe macht sich
in die Hose. Sp&auml;ter beim Booten entferne ich das l&auml;stige Logging.
Als n&auml;chstes gehe ich in den Kabelraum und stecke meinen
Walkmankopfh&ouml;rer in den freien RS232-Port aus dem B&uuml;ro des
Direktors. Es ist erstaunlich, wie leicht man bugs ausstreuen kann, wenn man
wei&szlig;, wo die Datenleitungen laufen!<sub>&nbsp;</sub></dt>

<dd>Direktor: "Sind Sie sicher?"<br>
 SysMgr: "ABSOLUT SICHER!"<sub>&nbsp;</sub><br>
 Direktor: "Und Sie wollen es sich nicht nochmal &uuml;berlegen?"<br>
 SysMgr: "AUF KEINEN FALL!"<sub>&nbsp;</sub><br>
 Direktor: "Nun gut, ich werde es sofort an die Personalabteilung
weiterfaxen..."<br>
 SysMgr: "HERVORRAGEND!"<sub>&nbsp;</sub></dd>

<dt>Zwei Sekunden sp&auml;ter kommt der Systemmanager herein. Er
l&auml;chelt. Es sieht aus wie das L&auml;cheln eines gro&szlig;en, satten
Haifischs.<sub>&nbsp;</sub></dt>

<dd>"Tja, ich werde Sie vermissen, Simon..."<sub>&nbsp;</sub></dd>

<dt>beginnt, noch ganz erf&uuml;llt, von der eben geleisteten
Entscheidung.<sub>&nbsp;</sub></dt>

<dd>"Oh?"<sub>&nbsp;</sub></dd>

<dt>sage ich zuckers&uuml;&szlig; und heuchele Neugier.<sub>&nbsp;</sub></dt>

<dd>"Wohin gehen Sie denn?"<sub>&nbsp;</sub><br>
 "Nein, Simon"<sub>&nbsp;</sub></dd>

<dt>sagt er genu&szlig;voll,<sub>&nbsp;</sub></dt>

<dd>"Sie gehen:"<sub>&nbsp;</sub><br>
 "Eine BEF&Ouml;RDERUNG!"<sub>&nbsp;</sub></dd>

<dt>sage ich.<sub>&nbsp;</sub></dt>

<dd>"Sie haben endlich diesen Brief an den Direktor geschickt, da&szlig; er
ein gottverdammtes Arschloch ist und da&szlig; Sie
aufh&ouml;ren?"<sub>&nbsp;</sub><br>
 "Nein..."<sub>&nbsp;</sub><br>
 "Sind Sie sicher? Der ist aber viel besser als der &uuml;ber meine
Entlassung...<sub>&nbsp;</sub><br>
 "W..."<sub>&nbsp;</sub></dd>

<dt>Seine Pupillen weiten sich eine kleine Idee.<sub>&nbsp;</sub><br>
 Es ist, als ob man ein Walross mit dem Sofakissen erschlagen w&uuml;rde. Er
rast los, um das Fax zu stoppen. Nur, nachdem er gerade gek&uuml;ndigt hat,
&gt;klickediklackedi&lt; funktioniert sein card key nicht mehr...
Anf&auml;nger...<sub>&nbsp;</sub><br>
 Das Telephon klingelt. Es ist derselbe wie vorhin.<sub>&nbsp;</sub></dt>

<dd>"Ich komm' jetzt in meinen Account, aber ich hab' keinen Speicherplatz
mehr auf der Platte..."<sub>&nbsp;</sub><br>
 "Moment, ich schau, was ich tun kann."<sub>&nbsp;</sub></dd>

<dt>&gt;klickediklackedi&lt;<sub>&nbsp;</sub><br>
 rm -r *</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh08.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh10.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
