<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 12</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (12)</h3></font>
<p>
<dl>
<dt>Ich lege den H&ouml;rer auf die Gabel - das erste Mal heute nachmittag -
und sofort f&auml;ngt das Ding an zu rattern. ES REICHT! Um mein
Mittagsschl&auml;fchen zu retten, leite ich den Anschlu&szlig; auf 110 um.
Das wird ihnen eine Lehre sein!<sub>&nbsp;</sub><br>
 Ups, fast vergessen, den Ausredenkalender
umzubl&auml;ttern.<sub>&nbsp;</sub></dt>

<dd>"Statische Aufladung wegen Nylon-Unterw&auml;sche"<sub>&nbsp;</sub></dd>

<dt>Naaah, viel zu plausibel - obwohl, ich k&ouml;nnte die Unterw&auml;sche
von Fall zu Fall pers&ouml;nlich &uuml;berpr&uuml;fen... nee, lieber nicht,
wei&szlig; was dabei ans Tageslicht kommt. Ich bl&auml;ttere eins
weiter.<sub>&nbsp;</sub></dt>

<dd>"Statische Aufladung durch Plastik-Rechenschieber"<sub>&nbsp;</sub></dd>

<dt>Na, das ist doch mal was! Eine echte
Herausforderung!<sub>&nbsp;</sub><br>
 Ich hebe die Telefonumleitung auf und plaziere dann den Papierkorb unter dem
Druckerauswurf - endlich eine technisch fortgeschrittene L&ouml;sung!
W&auml;hrend ich noch mein Werk bewundere, l&auml;utet es. Das k&ouml;nnte
der gro&szlig;e Wurf werden!<sub>&nbsp;</sub></dt>

<dd>"Hallo?"<sub>&nbsp;</sub><br>
 "Hallo, &auml;hm, wie kann ich mein File auf Rechtschreibfehler
pr&uuml;fen?"<sub>&nbsp;</sub><br>
 "Ganz einfach. Tippen Sie 'spell' und den Filenamen."<sub>&nbsp;</sub><br>
 "Danke."<sub>&nbsp;</sub></dd>

<dt>Ich bin wieder mal h&ouml;llisch hilfsbereit heute morgen. Vor allem weil
ich wei&szlig;, da&szlig; meine spezielle Version von 'spell' Fehler erzeugt,
statt sie zu beseitigen. Aus 'Freund' wird 'Fruend' und umgekehrt. Ein
Augenschmaus!<sub>&nbsp;</sub><br>
 Das Telefon klingelt - sie sind's wieder.<sub>&nbsp;</sub></dt>

<dd>"Irgendetwas stimmt nicht mit dem 'spell' Programm."<sub>&nbsp;</sub><br>
 "Wie kommen Sie denn da drauf?"<sub>&nbsp;</sub><br>
 "Weil mein File pl&ouml;tzlich voll mit Fehlern ist!"<sub>&nbsp;</sub><br>
 "Hm, das klingt nicht gerade nach 'spell'. Sind Sie &uuml;ber Ihren PC
eingeloggt?"<sub>&nbsp;</sub><br>
 "Ja, aber ich..."<sub>&nbsp;</sub><br>
 "Bitte, &uuml;berlassen Sie die technische Diagnose mir! Also, ist da
irgendwo ein Rechenschieber auf oder in Ihrem
Schreibtisch?"<sub>&nbsp;</sub><br>
 "&Auml;hm &gt;klapper&lt; ja, aber..."<sub>&nbsp;</sub><br>
 "Aha. Haben wir's schon. Sie haben eine statische Aufladung auf Ihrer
Festplatte, verursacht von den wechselnden elektrostatischen Feldern, die der
Rechenschieber erzeugt - Sie wissen schon: so, wie er kleine Papierfiezel
anzieht, wenn sie ihn an Ihrem Pullover reiben..."<sub>&nbsp;</sub></dd>

<dt>DUMMY MODE ON<sub>&nbsp;</sub></dt>

<dd>"Oh. Was kann man da machen?"<sub>&nbsp;</sub><br>
 "Sie wissen doch, wie Sie solche l&auml;stigen Papierfiezel von Ihrem
Rechenschieber weg bekommen? Genau, Sie schlagen damit auf die Tischkante,
bis die elektrischen Felder sich im Erdmagnetfeld aufl&ouml;sen. Machen Sie
das gleiche mit Ihrem PC. Sagen wir, zwanzig mal - heben Sie ihn etwa
drei&szlig;ig Zentimeter &uuml;ber den Tisch und lassen ihn
fallen."<sub>&nbsp;</sub><br>
 "Ah, gut. Bleiben Sie kurz dran?"<sub>&nbsp;</sub><br>
 "Sicher."<sub>&nbsp;</sub></dd>

<dt>Das w&uuml;rde ich nicht mal f&uuml;r die Simpsons
verpassen!<sub>&nbsp;</sub><br>
 &gt;polter&lt;<sub>&nbsp;</sub><br>
 &gt;polter&lt;<sub>&nbsp;</sub><br>
 &gt;polter&lt;<sub>&nbsp;</sub><br>
 &gt;klirr&lt;<sub>&nbsp;</sub></dt>

<dd>"&Auml;h, hallo? Der Schirm ist pl&ouml;tzlich dunkel
geworden..."<sub>&nbsp;</sub><br>
 "Das ist ganz normal, das macht er immer; soll er sogar. Machen Sie weiter.
Und wenn Sie mit dem PC fertig sind, machen Sie sicherheitshalber das Gleiche
auch noch mit dem Schirm. Manchmal breitet sich die Aufladung &uuml;ber die
Kabel bis in den Schirm aus."<sub>&nbsp;</sub></dd>

<dt>&gt;polter&lt;<sub>&nbsp;</sub><br>
 &gt;polter&lt;<sub>&nbsp;</sub><br>
 &gt;polter&lt;<sub>&nbsp;</sub><br>
 &gt;schepper&lt; ..<sub>&nbsp;</sub><br>
 Ich lege auf. Sp&auml;ter gehe ich raus in den &ouml;ffentlichen CIP-Pool
und tr&auml;ufle unauff&auml;llig Honig in die Schlitze der Floppy Laufwerke,
als pl&ouml;tzlich ein Typ auftaucht, der verdammt wie Lee Harvey Oswald
aussieht, und mich &uuml;ber den Haufen schie&szlig;t. Aber der Knall kommt
aus dem Maschinenraum, und w&auml;hrend ich an einer blutbesudelten IBM
Maschine zusammensacke, h&ouml;re ich den Ex-System-Manger im Hintergrund
kichern...<sub>&nbsp;</sub><br>
 Noch sp&auml;ter, im Krankenwagen, wird mir klar, da&szlig; ich von dem
Typen nicht mal die Userkennung habe...<sub>&nbsp;</sub><br>
 Dann wird alles dunkel.<sub>&nbsp;</sub><br>
 Als der Krankenwagen das Ende des Tunnels erreichte, verschwand die
Dunkelheit wieder. Vielleicht war ich doch nicht so schwer verletzt.
Vielleicht aber doch! Egal, jemand w&uuml;rde daf&uuml;r
bezahl..<sub>&nbsp;</sub><br>
 In diesem Moment starb ich.<sub>&nbsp;</sub><br>
 F&uuml;r einen echten Bastard Operator from HELL sah die Sache
nat&uuml;rlich etwas anders aus: Mehr wie ein unerwarteter
Urlaub.<sub>&nbsp;</sub><br>
 F&uuml;nf Sekunden sp&auml;ter bekomme ich 15 kV durch die Brustwarzen
gejagt. Unverd&uuml;nnt und ohne Eis! (Echte Sanit&auml;ter wissen eben, wie
man eine todlangweilige Party belebt!) DER BASTARD OPERATOR FROM HELL
LEBT!<sub>&nbsp;</sub><br>
 Drei Wochen sp&auml;ter bin ich wieder auf den Beinen, hochgep&auml;ppelt
von s&uuml;&szlig;en Krankenschwestern, die um ihre Pensionsanspr&uuml;che
f&uuml;rchten. Voller Energie sitze ich hinter meiner Konsole. Alles in
allem, gar nicht so schlecht, die Zeit im Hospital; ich k&ouml;nnte
B&auml;ume ausrei&szlig;en! Ich gehe rasch durch die angeh&auml;ufte Usermail
der letzten Wochen (nur damit ich nichts verpasse!), dann lasse ich die
Studenten wissen, da&szlig; ich wieder auf dem Posten bin. Ein nicht
angek&uuml;ndigter Wartungszyklus, mitten in der Haupt&uuml;bungszeit; ich
flippe den Restart-Schalter. Ein wohliges Gef&uuml;hl breitet sich in mir
aus. Sie werden mich daf&uuml;r lieben! Ich bl&auml;ttere den
Ausredenkalender um.<sub>&nbsp;</sub><br>
 "TREIBHAUSEFFEKT"<sub>&nbsp;</sub><br>
 JA!!! Willkommen zu Hause!</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh11.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh13.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
