<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 8</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (8)</h3></font>
<p>
<dl>
<dt>Ich finde, so ein verantwortungsvoller Posten wie meiner sollte mit einer
angemessenen Mittagspause verg&uuml;tet werden. F&uuml;r die paar Stunden
setze ich den Hausmeister auf meinen Stuhl, damit es nicht so aussieht, als
wir unsere Pflichten vernachl&auml;ssigen w&uuml;rden (sic!). Ich
erkl&auml;re ihm, da&szlig; er nur darauf achten mu&szlig;, da&szlig; der
H&ouml;rer nicht aus Versehen auf der Gabel landet. Er ist einverstanden und
ich verschwinde.<sub>&nbsp;</sub><br>
 Zuerst die Bank. Ich lasse 20 Mark in Zehnpfenningst&uuml;cke wechseln und
frage dann nach meinem Kontostand. W&auml;hrend der Angestellte noch tippt,
ziehe ich unauff&auml;llig den Netzstecker von seinem Endger&auml;t. Es
stirbt nat&uuml;rlich und ich sage da&szlig; ich in Eile bin und da&szlig;
ich gerne den Manager von diesem Sauladen sehen
m&ouml;chte.<sub>&nbsp;</sub><br>
 Er walzt durch die T&uuml;r wie ein gut gef&uuml;ttertes Riesenbaby und
fragt mich, ob es ein Problem g&auml;be. Ich sage, alles, was ich wolle, sei
mein Kontostand und ob das denn zuviel verlangt sei und da&szlig; ich immer
noch in Eile sei. Dann kreuze ich die Finger.<sub>&nbsp;</sub><br>
 JA! Er findet das herabh&auml;ngende Netzkabel steckt es wieder rein und
loggt sich ein MIT DEM MANAGER ACCOUNT.<sub>&nbsp;</sub><br>
 Ich stolpere wie zuf&auml;llig an den Schalter und stosse aus Versehen 200
Zehnpfenningst&uuml;cke hinunter. Der Manager beachtet mich nicht, aber alle
anderen tauchen nach den M&uuml;nzen. Ich beobachte ungest&ouml;rt, wie er
sein Passwort eintippt - mit der halsbrecherischen Geschwindigkeit von einem
Zeichen pro Sekunde! Gar kein Problem, der Hardliner macht es mir sogar noch
leichter, indem er ein semantisches Wort als Passwort gew&auml;hlt hat:
ZINSEN. So ein Scherzkeks! Ich verziehe keinen Gesichtsmuskel. Nicht ganz
einfach, wenn ich an meine &uuml;berschuldete Hypothek denke. Heute Nacht
werde ich da einiges richtigstellen...<sub>&nbsp;</sub><br>
 Ein Benutzer den ich noch vom D(eletion)-Day '94 kenne n&auml;hert sich, um
mich anzuquatschen. Sogar der Manager sch&uuml;ttelt abwehrend den Kopf, aber
es ist zu sp&auml;t. Er h&auml;lt direkt vor mir und richtet das Wort an
mich!<sub>&nbsp;</sub></dt>

<dd>"&Auml;hm, Entschuldigung. K&ouml;nnten Sie mir einen Tip geben, welchen
Computer ich am besten f&uuml;r meine Diplomarbeit
kaufe?"<sub>&nbsp;</sub></dd>

<dt>?! Genau.<sub>&nbsp;</sub></dt>

<dd>"Schon mal vom neuen Pentium geh&ouml;rt?"<sub>&nbsp;</sub></dd>

<dt>frage ich.<sub>&nbsp;</sub><br>
</dt>

<dd>"Ja..."<sub>&nbsp;</sub><br>
 "Meiden Sie den wie die Pest! Kaum jemand wei&szlig; das, aber man handelt
sich f&uuml;rchterliche Probleme ein, wenn man ein Betriebssystem so schnell
laufen l&auml;&szlig;t. Manche von den Kisten machen &uuml;ber 100 Millionen
obstructions per second. Sie k&ouml;nnen sich ja vorstellen, da&szlig; da
eine solch billige Kiste aus dem Takt kommen mu&szlig;, nicht? Die
Katastrophe ist praktisch vorprogrammiert!"<sub>&nbsp;</sub><br>
 "Oh!"<sub>&nbsp;</sub><br>
 "Nehmen Sie lieber was Sicheres und Bew&auml;hrtes. Ein ZX81 mit dem
doppelten Cassettenlaufwerk, wenn Sie das kriegen k&ouml;nnen. Im Vertrauen:
Die sind nicht mehr leicht zu bekommen, weil alle Leute, die wirklich was
davon verstehen, nat&uuml;rlich nur bew&auml;hrte Technik kaufen. Kaufen Sie
blo&szlig; keine Harddisk dazu. Sie haben doch sicher schon geh&ouml;rt wie
oft die kaputtgehen? Cassetten dagegen halten ewig!"<sub>&nbsp;</sub><br>
 "Danke, super!"<sub>&nbsp;</sub><br>
 "Keine Ursache! Wie war doch noch gleich Ihr
Username?"<sub>&nbsp;</sub></dd>

<dt>Er sagt ihn mir. Gerade noch rechtzeitig f&uuml;r D-Day 96. Man sollte
meinen, da&szlig; sie's irgendwann lernen!<sub>&nbsp;</sub><br>
 Zur&uuml;ck an meinem Arbeitsplatz finde ich den Hausmeister - eingeschlafen
vor dem Terminal. Ich frage ihn, ob er nicht lieber hier arbeiten
m&ouml;chte, aber er lehnt dankend ab. Hier hat er nicht die
M&ouml;glichkeit, Leute in der Toilette
aufzuschrecken...<sub>&nbsp;</sub><br>
 Ich lege den H&ouml;rer zur&uuml;ck auf die Gabel und sofort klingelt es.
Ich hasse es, wenn es das tut. Ich brauche immer eine Ewigkeit, die Earphones
nachher wieder reinzupfriemeln.<sub>&nbsp;</sub><br>
 Diesmal ist es anders. Die hei&szlig;este Mieze auf dem Campus ist dran -
und sie hat ein Computerproblem! Ich liebe solche Augenblicke. Sie machen den
Job erst dazu, was er ist.<sub>&nbsp;</sub><br>
</dt>

<dd>"Wie ist Ihr Username?"<sub>&nbsp;</sub></dd>

<dt>frage ich - als ob ich es nicht auswendig
w&uuml;&szlig;te.<sub>&nbsp;</sub><br>
 So schnell ich kann &uuml;berfliege ich ihre pers&ouml;nliche email - das
meiste nur todlangweiliges Zeug - und grepe die gesamte User email nach ihrem
Usernamen. Nichts - vortrefflich!<sub>&nbsp;</sub></dt>

<dd>"Wie kann ich Ihnen helfen?" fl&ouml;te ich charmant.<sub>&nbsp;</sub><br>
 "Ich kann mein Dokument nicht abspeichern. Es sagt etwas mit zuwenig
Speicherplatz."<sub>&nbsp;</sub><br>
 "Das werden wir gleich haben"<sub>&nbsp;</sub></dd>

<dt>sage ich und l&ouml;sche alle anderen Files auf ihrer Platte -
au&szlig;er den ihrigen nat&uuml;rlich.<sub>&nbsp;</sub></dt>

<dd>"Jetzt sollte alles funktionieren..."<sub>&nbsp;</sub><br>
 "Oh, vielen, vielen Dank"<sub>&nbsp;</sub></dd>

<dt>haucht sie ins Mikrophon.<sub>&nbsp;</sub><br>
 Ich notiere mir, da&szlig; ich morgen wieder etwas an ihren Account
herumdoktere.<sub>&nbsp;</sub><br>
 Das Telephon l&auml;utet, fast bevor ich es wieder auf der Gabel
habe.<sub>&nbsp;</sub></dt>

<dd>"Meine Daten sind alle weg!"<sub>&nbsp;</sub></dd>

<dt>schreit jemand am anderen Ende.<sub>&nbsp;</sub></dt>

<dd>"Wann war das?" frage ich.<sub>&nbsp;</sub><br>
 "Gerade eben..."<sub>&nbsp;</sub></dd>

<dt>sagt er schluchzend.<sub>&nbsp;</sub></dt>

<dd>"Aha. Tja, Kopf hoch. Es sind noch drei Tage bis zum Semesterende. Wenn
Sie Tag und Nacht dran bleiben, werden Sie schon noch eine Drei minus
schaffen."<sub>&nbsp;</sub></dd>

<dt>Er schluchzt noch zwei-dreimal leise und legt auf.
Schw&auml;chling!<sub>&nbsp;</sub><br>
 Das Telephon l&auml;utet schon wieder!<sub>&nbsp;</sub></dt>

<dd>"Der Bildschirm an meinem PC ist so schwach. Ich kann kaum die Buchstaben
erkennen. Soll ich den Helligkeitsregler hochdrehen?"<sub>&nbsp;</sub><br>
 "NEIN!" schreie ich. "Fassen Sie den Knopf nicht an! Haben Sie auch nur die
leiseste Ahnung, was da f&uuml;r eine Strahlung 'rauskommt, wenn Sie den
Knopf ganz zum Anschlag drehen?!"<sub>&nbsp;</sub><br>
 "Also ich .."<sub>&nbsp;</sub></dd>

<dt>sagt sie verunsichert.<sub>&nbsp;</sub></dt>

<dd>"H&Ouml;REN SIE AUF MEINEN RAT!" sage ich. "Es gibt nur einen SICHEREN
WEG, ein schwaches Display aufzum&ouml;beln, und das ist: Nadelenergieimpulse
in die Treiber geben!"<sub>&nbsp;</sub></dd>

<dt>Die Worte 'Nadelenergieimpulse ' und 'Treiber' sind zuviel f&uuml;r sie.
Wenn Leute solche Ausdr&uuml;cke h&ouml;ren, gehen sie automatisch in 'dummy
mode' und machen ALLES, was ich sage. Ich k&ouml;nnte ihr jetzt vorschlagen
nackt nur mit einem Netzkabel bekleidet &uuml;ber den Campus zu sprinten und
sie w&uuml;rde es wahrscheinlich machen... Hmmmm.<sub>&nbsp;</sub></dt>

<dd>"Haben Sie zuf&auml;llig ein &uuml;briges Netzkabel
'rumliegen?"<sub>&nbsp;</sub><br>
 "Nein..."<sub>&nbsp;</sub><br>
 "Oh, naja. Dann m&uuml;&szlig;en wir das mit den Nadelimpulsen probieren...
Also, Sie schalten jetzt so schnell Sie k&ouml;nnen Ihren PC ein und aus.
Einfach den Kippschalter hin und herflippen, verstehen Sie? Etwa
drei&szlig;ig mal."<sub>&nbsp;</sub><br>
 "Soll ich vorher meine Disketten 'rausnehmen?"<sub>&nbsp;</sub><br>
 "NEIN! Wollen Sie alle Ihre Daten verlieren?!"<sub>&nbsp;</sub><br>
 "Oh. Nein, nat&uuml;rlich nicht. Also..."<sub>&nbsp;</sub></dd>

<dt>Ich lausche gespannt.<sub>&nbsp;</sub><br>
 ..klick klack klick klack klick klack klick klack klick klack kl BUMM!
Erstaunlich! 27 oder 28. Normalerweise macht sich das Netzteil schon nach dem
achten oder neunten Mal in die Hose!<sub>&nbsp;</sub></dt>

<dd>"MEIN COMPUTER! ER RAUCHT!"<sub>&nbsp;</sub></dd>

<dt>schreit sie an anderen Ende.<sub>&nbsp;</sub></dt>

<dd>"Wirklich?? Da mu&szlig; ein Fehler im Netzteil gewesen sein! Gut,
da&szlig; wir das gekl&auml;rt haben! Haben Sie noch Garantie auf die
Maschine?"<sub>&nbsp;</sub><br>
 "NEIN!"<sub>&nbsp;</sub><br>
 "Du liebe G&uuml;te! Was f&uuml;r ein Pech! Tja, dann hilft nur reparieren
lassen. Haben Sie wenigstens Ihre Daten gesichert?"<sub>&nbsp;</sub><br>
 "Ja, ins System, gestern erst. Aber die ganze Arbeit von heute morgen ist
futsch!"<sub>&nbsp;</sub><br>
 "Sie &Auml;rmste! Wie war Ihr Username? Ich will gleich mal checken, ob Ihre
Backups ok sind..."<sub>&nbsp;</sub></dd>

<dt>Sie sagt ihn mir...<sub>&nbsp;</sub><br>
 Tglof Gnuztestrof!!!</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh07.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh09.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
