<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 13</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (13)</h3></font>
<p>
<dl>
<dt>Es ist Monatsende. In K&uuml;rze werden diese ganzen unn&ouml;tigen
automatischen mailing lists das Netz &uuml;berschwemmen. Ich korrigiere die
Systemuhr um 7 Tage nach hinten, um mir die Performance nicht zu versauen und
wechsele das neue Druckerband gegen mein Spezialband - drei Jahre alt, mit
vielen h&uuml;bschen L&ouml;chern. Ich grabe mich durch den Stapel snail
mail, der sich angeh&auml;uft hat, und st&uuml;rze mich als erstes auf das
BOFH Journal "kill -9".<sub>&nbsp;</sub><br>
 Ein h&uuml;bscher Artikel ist dabei, wie man Windows 95 grausam langsam und
h&ouml;llisch langweilig machen kann. Irgendwie schaut der Artikel aus, wie
die normale Installationsanleitung f&uuml;r Windows 95 ... naja, wer
wei&szlig;. Ich bl&auml;ttere mich durch bis zur BOFH Expertenrubrik und
schaue, ob irgendwelche Artikel von mir hineingekommen sind. Alle!!! Sogar
der &uuml;ber den C++ Compiler, der per Zufall Klassen umbenennt und dies
sogar im Sourcecode &auml;ndert!<sub>&nbsp;</sub><br>
 Das Telephon klingelt. (Irgendwie habe ich fast darauf
gewartet!)<sub>&nbsp;</sub></dt>

<dd>"Mein Bildschirm ist dunkel!!!"<sub>&nbsp;</sub><br>
 "Netzkabel!" sage ich.<sub>&nbsp;</sub><br>
 "Nein, das hab' ich schon &uuml;berpr&uuml;ft. Wenn ich einschalte, passiert
einfach nichts!"<sub>&nbsp;</sub><br>
 "Netzkabel!" sage ich.<sub>&nbsp;</sub><br>
 "Nein! Das Netzkabel steckt richtig drin. Auch die Leuchtdioden am Keyboard
leuchten nicht!"<sub>&nbsp;</sub><br>
 "Das Netzkabel!" sage ich.<sub>&nbsp;</sub><br>
 "Oh, Moment mal. Das Kabel ist nicht richtig
 eingesteckt!"<sub>&nbsp;</sub><br>
 "Das Netzkabel?" frage ich.<sub>&nbsp;</sub><br>
 "Ja... Sch....."<sub>&nbsp;</sub><br>
 "Macht ja nix", sage ich, "Funktioniert jetzt alles
 wieder?"<sub>&nbsp;</sub><br>
 "Ja, ich glaub' schon. Tut mir leid. Sie haben nat&uuml;rlich recht
gehabt."<sub>&nbsp;</sub><br>
 "Tja, wir bekommen das h&auml;ufig in letzter Zeit. Der Grund liegt
wahrscheinlich am zunehmenden Treibhauseffekt. Die globale Erw&auml;rmung
verursacht stark statistisch variierende thermale Kontraktionen, welche
wiederum temperaturinduzierte Bewegungen hervorruft, deren
Reibungskoeffizienten zu Adh&auml;sion am Plastikteilen f&uuml;hren
kann..."<sub>&nbsp;</sub></dd>

<dt>Ich lausche aufmerksam. Nichts. Mit anderen Worten,<sub>&nbsp;</sub><br>
 &gt;DUMMY MODE ON&lt;...<sub>&nbsp;</sub></dt>

<dd>"Sie k&ouml;nnen sich zuk&uuml;nftig davor sch&uuml;tzen, wissen
Sie..."<sub>&nbsp;</sub><br>
 "Wirklich? Wie denn?"<sub>&nbsp;</sub><br>
 "Es reicht im Prinzip schon, eine schwach basische Minerall&ouml;sung auf
die Metallkontakte aufzubringen."<sub>&nbsp;</sub><br>
 "Oh!"<sub>&nbsp;</sub></dd>

<dt>&gt;IRREVOCABLE DUMMY MODE ON&lt;<sub>&nbsp;</sub></dt>

<dd>"Ganz einfach. Alles was Sie machen m&uuml;ssen, ist den Stecker vom
Ger&auml;t abziehen und eine schwach basische Salzl&ouml;sung in die Schlitze
zu tr&auml;ufeln. Haben Sie eine schwach basische L&ouml;sung zur Hand? So
etwa pH 7?"<sub>&nbsp;</sub><br>
 "&Auml;h... nein?"<sub>&nbsp;</sub><br>
 "Macht auch nichts. Stecken sie den Stecker einfach in den Mund und lassen
Sie Speichel hineinlaufen. Speichel ist schwach basisch, und er hat
Mineralsalze. ABER wischen Sie den Stecker vorher sorgf&auml;ltig sauber,
wegen Keimen und so. Und, SCHALTEN SIE UM GOTTES WILLEN VORHER DEN MONITOR AB
- wir wollen doch nichts riskieren!"<sub>&nbsp;</sub><br>
 "Oh. Gut!"<sub>&nbsp;</sub> <sub>&nbsp;</sub></dd>

<dt>&gt;FZZZZT&lt; &gt;POLTER&lt;<sub>&nbsp;</sub><br>
 Als der H&ouml;rer auf den Boden knallt, lege ich auf. Speicherplatz ist
viel zu gut f&uuml;r die!</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh12.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh14.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
