<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 16</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (16)</h3></font>
<p>
<dl>
<dt>Mein neues Login Skript nimmt allm&auml;hlich Formen an. Tatsache, es ist
fast schon idiotensicher. Zum Beispiel erscheint beim Login folgender Prompt
auf dem Bildschirm: "Yes means No and No means Yes. Delete all files? [Y]"
Ich mach' mir n&auml;mlich wirklich Sorgen &uuml;ber die vielen
Einbr&uuml;che ins System in letzter Zeit...<sub>&nbsp;</sub><br>
 Dem Systemmanager macht das nichts aus - seltsamerweise. Er jammert immer
nur &uuml;ber die hohe Zahl von computerverursachten Todesf&auml;llen auf dem
Campus. Die Welt wird immer verr&uuml;ckter!<sub>&nbsp;</sub><br>
 Ich bl&auml;ttere den Ausredenkalender um. "DOPPLER EFFEKT" Klingt so
idiotisch, da&szlig; es schon wieder realistisch wird - wenn man etwas
nachhilft, nat&uuml;rlich.<sub>&nbsp;</sub><br>
 Das Telephon, der Fluch meines Lebens, l&auml;utet.<sub>&nbsp;</sub></dt>

<dd>"Hallo, Kontrollraum", sage ich hilfsbereit.<sub>&nbsp;</sub><br>
 "Ist dort die Technik?"<sub>&nbsp;</sub><br>
</dd>

<dt>fragt er.<sub>&nbsp;</sub><br>
 Erstaunlich, wieviel stocktaube User wir haben, und warum sie dannnoch
Telefonieren, statt mir eine email zu schicken. Zum Teufel, es &ouml;det mich
schon wieder an...<sub>&nbsp;</sub><br>
</dt>

<dd>"Jawohl",<sub>&nbsp;</sub><br>
</dd>

<dt>l&uuml;ge ich (Nixon h&auml;tte noch von mir lernen
k&ouml;nnen).<sub>&nbsp;</sub><br>
</dt>

<dd>"Ich hab' ein Problem mit meinen Floppy Laufwerk. Es scheint manchmal
nicht zu lesen."<sub>&nbsp;</sub><br>
 "Hmm. Wie alt ist das Laufwerk?"<sub>&nbsp;</sub><br>
 "Etwa ein Jahr..."<sub>&nbsp;</sub><br>
 "Und es geht manchmal nicht, aber manchmal funktioniert's. Und die
Ausf&auml;lle werden immer h&auml;ufiger?"<sub>&nbsp;</sub><br>
 "JA, GENAU!"<sub>&nbsp;</sub><br>
 "Aha, ein klarer Fall von magnetischem Dopplereffekt..."<sub>&nbsp;</sub><br>
 "Ich dachte, das gibt es nur mit Licht- und
Schallwellen?"<sub>&nbsp;</sub></dd>

<dt>&gt;BULLSHIT MODE ON&lt;<sub>&nbsp;</sub><br>
</dt>

<dd>"Schon. Aber man hat k&uuml;rzlich entdeckt, da&szlig; sich die
magnetische Bindung von Partikeln auf schnell rotierenden Oberfl&auml;chen
&auml;ndern kann, vor allem wenn der Kopf relativ dazu feststeht und ganz
leichtmagnetisiert."<sub>&nbsp;</sub><br>
 "Ah. Oh."<sub>&nbsp;</sub><br>
 "Also m&uuml;ssen Sie dringend den Kopf entmagnetisieren. Haben Sie eine
Floppy-Disk-Entmagnetisier-Schleife?"<sub>&nbsp;</sub><br>
 "&Auml;h... nein?"<sub>&nbsp;</sub><br>
 "Na sch&ouml;n. Dann m&uuml;ssen wir es auf die direkte Methode probieren.
Haben Sie die Orginal-Disketten Ihrer Software greifbar?"<sub>&nbsp;</sub><br>
 "Ja."<sub>&nbsp;</sub><br>
 "Ok. Stecken Sie sie in Ihr Laufwerk und formatieren Sie
 sie."<sub>&nbsp;</sub><br>
 "WAS?!"<sub>&nbsp;</sub><br>
 "Keine Sorge, es passiert nichts - das Laufwerk funktioniert ja nicht, ok?
Was passiert, ist folgendes: die unverdorbenen magnetischen Felder auf den
Orginal-Disketten &uuml;berlagern die magnetischen St&ouml;rungen im
Schreib-Lesekopf, einfach weil diese Disketten mit einem Laufwerk geschrieben
wurden, das keinen Dopplereffekt hat."<sub>&nbsp;</sub><br>
 "Ah, verstehe."<sub>&nbsp;</sub><br>
 "Also. Und wenn ein Schreib-Fehler gemeldet wird und das Programm fragt, ob
es weitermachen soll, tippen Sie ein 'yes'. Machen Sie das mit allen
Orginal-Disketten, die Sie finden k&ouml;nnen - je mehr, desto besser. Dann
lassen Sie eine normale Reinigungsdiskette durchlaufen. Die entfernt dann die
freien magnetischen Partikel, die noch auf dem Kopf
kleben."<sub>&nbsp;</sub><br>
 "Oh. Ok, vielen Dank."<sub>&nbsp;</sub><br>
 "Keine Ursache - ICH MACH' NUR MEINEN JOB."<sub>&nbsp;</sub></dd>

<dt>Ich lege auf, und sofort l&auml;utet es wieder. Es ist der Boss. "Simon,
k&ouml;nnten Sie mal in mein B&uuml;ro kommen?"<sub>&nbsp;</sub><br>
 &gt;ALARM ROT&lt;<sub>&nbsp;</sub><br>
 So schnell ich kann, dr&uuml;cke ich den Panik-Knopf am LAN-Analyser,
genauer gesagt, den
'Generiere-90%-Zufallspakete-Knopf'.<sub>&nbsp;</sub></dt>

<dd>"Aber sicher. Soll ich gleich kommen oder..."<sub>&nbsp;</sub></dd>

<dt>Das andere Telephon l&auml;utet. Ich klemme es mir unters
Kinn.<sub>&nbsp;</sub></dt>

<dd>"Hallo, Computer Kontrollraum. Simon am Apparat. Wie kann ich Ihnen
helfen?"<sub>&nbsp;</sub><br>
 "DAS NETZ IST WEG. ALLE UNSERE PCs H&Auml;NGEN!"<sub>&nbsp;</sub></dd>

<dt>kreischt die Stimme aus dem einen Telefon ins Mikrophon des
anderen.<sub>&nbsp;</sub></dt>

<dd>"Aha",<sub>&nbsp;</sub><br>
</dd>

<dt>sage ich ruhig und souver&auml;n.<sub>&nbsp;</sub><br>
</dt>

<dd>"Ja, ich kann's auf unserem Monitor sehen. Schaut aus wie ein schlechtes
Thinwire-Segment - warten Sie, ich versuche, es
'rauszunehmen."<sub>&nbsp;</sub></dd>

<dt>Ich dr&uuml;cke den 'Bef&ouml;rderungsknopf' (AKA 'Stop Traffic
Generation') am LAN-Analyser, und fast sofort schreit der
User:<sub>&nbsp;</sub></dt>

<dd>"Phantastisch. Es geht alles wieder. Danke."<sub>&nbsp;</sub><br>
 "Keine Ursache. Sch&ouml;nen Tag auch."<sub>&nbsp;</sub></dd>

<dt>Der Boss hat alles mitgeh&ouml;rt. Also, sch&auml;tze ich, wird der
Besuch bei ihm nicht allzu schlimm ausfallen. Ich sage ihm, da&szlig; ich
sofort 'runter komme, sobald ich das Netz wieder stabil habe, und lege auf.
Auf dem Weg nach unten erfinde ich ein neues Blendwort - das macht das
Management immer gl&uuml;cklich. 'Vollst&auml;ndige
&Uuml;bertragungstrennung'. Klingt viel besser, als 'Stecker-Ziehen'. Wie
'Master-Reset' besser klingt als 'Ausschalten'.<sub>&nbsp;</sub><br>
 Ich komme in sein B&uuml;ro und der Personal-Chef ist auch da.
Ah-oh.<sub>&nbsp;</sub></dt>

<dd>"Simon, h&auml;tten Sie Lust unser System-Manager zu
werden?"<sub>&nbsp;</sub><br>
 "?!!! &Auml;h...ich wei&szlig; nicht. Eigentlich mach' ich
 lieber..."<sub>&nbsp;</sub><br>
 "Zehn Tausender extra im Jahr, Porsche als
 Firmenwagen..."<sub>&nbsp;</sub><br>
 "Roter Carrera Cabrio?"<sub>&nbsp;</sub><br>
 "Ok."<sub>&nbsp;</sub><br>
 "Gebongt!"<sub>&nbsp;</sub></dd>

<dt>....und so endet die Story, wie sie schon fr&uuml;her h&auml;tte enden
sollen.</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh15.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
</a>
 </p><br>
</body>
</html>
