<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 6</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (6)</h3></font>
<p>
<dl>
<dt>Die dauernde Langeweile bringt mich um. Also lese ich User-Email, um die
Zeit totzuschlagen. Allerdings mu&szlig; ich zugeben, da&szlig; die heutige
Lieferung auch nur zum G&auml;hnen anregt. Nicht eine wirklich gute Nachricht
darunter. Nicht mal versteckte Andeutungen &uuml;ber Fummeln im Supermarkt,
wie sonst. Gar nichts. Statt dessen mu&szlig; ich mir den &uuml;blichen
Sch... zu Gem&uuml;te f&uuml;hren:<sub>&nbsp;</sub><br>
 Welcher Verwandte wann welche Art von Operation &uuml;ber sich ergehen
lassen mu&szlig; und welche es nicht &uuml;berlebt haben, wie das Wetter auf
der anderen Seite des Erdballs ist, die Sorte von Redundanzmails, die nur
unsere Queues vollknallen! Um die Sache etwas aufzulockern, hole ich eine
pers&ouml;hnliche Party-Einladung aus einer Mailbox, poste sie unter dem
Namen des Senders in alt.singles.with.severe.social.dysfunctions im USENET
und mache eine Notiz in meinem Kalender, damit ich rechtzeitig dort bin - mit
meiner Videokamera. K&ouml;nnte was werden!<sub>&nbsp;</sub><br>
 Was steht als n&auml;chstes an? Ah ja, die medizinische Datenbank, in der
die Vertrauens&auml;rzte der Uni die Krankheitsgeschichten der Angestellten
speichern. Ich grepe schnell mal durch nach 'Herpes' und 'Syphilis' und
verkaufe die Ergebnisse an die lokale Boulevardpresse.<sub>&nbsp;</sub><br>
 Um meine Spuren zu verwischen, gehe ich in den Account des Oberarztes und
f&uuml;ge dort folgenden Eintrag in sein Online-Tagebuch ein: DM 500, Med.
Daten an Zeitung.<sub>&nbsp;</sub><br>
 Sollte ausreichen!<sub>&nbsp;</sub><br>
 Ich schichte ein paar B&auml;nder aus den Regalen auf den Laborwagen und
zur&uuml;ck, damit es so aussieht, als ob wir sie tats&auml;chlich verwenden.
Dann gehe ich in Archie und suche nach einem bestimmten verborgenen X-GIF
Server, von dem ich geh&ouml;rt habe. Als ich ihn finde, starte ich einen
Batch unter einem User-Account, um die Bildchen 'runter zu laden -
nat&uuml;rlich auf seine Kosten. Gerade noch rechtzeitig f&auml;llt mir ein,
ob auch genug Speicherplatz f&uuml;r die Bilder frei
ist.<sub>&nbsp;</sub><br>
 Um ganz sicher zu gehen, entferne ich alle Dateien auf der Platte, die nicht
direkt mit dem Batch zu tun haben. Zum Beispiel die ganzen LaTeX Dokumente
"diss*.*"; die sind in letzter Zeit sowieso schon wieder viel zu gro&szlig;
geworden.<sub>&nbsp;</sub><br>
 Zur&uuml;ck in User email schaue ich, ob sich inzwischen was getan hat.
Naaah. Schlie&szlig;lich grepe ich alle files nach 'schwanger', 'Scheidung'
und 'Therapie' und poste sie anonym in eine lokale Klatsch-Newsgroup. Dann,
bevor ich auch nur piep sagen kann, ist der Strom weg! In der n&auml;chsten
Sekunde l&auml;utet schon das Telefon.<sub>&nbsp;</sub></dt>

<dd>"Hallo?"<sub>&nbsp;</sub></dd>

<dt>sage ich, w&uuml;tend - der Coyote hat den Roadrunner gerade fast am
Wickel gehabt!<sub>&nbsp;</sub></dt>

<dd>"Was ist mit dem Comp..."<sub>&nbsp;</sub></dd>

<dt>Ich h&auml;nge auf. Jetzt geht's um Leben oder Tod. So schnell ich kann,
rei&szlig;e ich das Stromkabel des Mainframes aus der Notstromversorgung und
schlie&szlig;e fieberhaft mein TV daran an. Verdammt! Der Roadrunner war
wieder schneller!<sub>&nbsp;</sub><br>
 Inzwischen fangen &uuml;berall die Warner an zu jaulen, weil die
Hauptplattenspeicher 'runterfahren. Aber was soll's? Mein Mac und mein
Terminal sind sowieso fest mit der Notstromversorgung verbunden, und ich bin
im Beer Factory Level in Dark Castle.<sub>&nbsp;</sub><br>
 Das Telefon klingelt schon wieder. Also lasse ich die
Kommunikationssicherung am Notstromschaltkreis herausschnappen, und endlich
ist Ruhe. Um ganz sicher zu gehen, hole ich den Hockeyschl&auml;ger aus dem
Spind und &uuml;be ein bisschen Einer-gegen-die Wand. Durch das Glasfenster
schaut das aus, als ob ich wie ein Wahnsinniger nach dem Fehler suche - wie
&uuml;blich. 10 Minuten sp&auml;ter ist der Strom wieder da und die Diagnose
meldet zwei Hard Disk Crashs auf dem Main Level, zum Teufel damit! Ich habe
keinen Mann verloren, bin kurz vorn letzten Level und im TV kommen noch mehr
Cartoons!<sub>&nbsp;</sub><br>
 Das andere Telefon l&auml;utet, ein User (welch
&Uuml;berraschung!).<sub>&nbsp;</sub></dt>

<dd>"Kontrollraum!"<sub>&nbsp;</sub></dd>

<dt>sage ich, so richtig im Stress.<sub>&nbsp;</sub></dt>

<dd>"Wann wird der Computer..."<sub>&nbsp;</sub></dd>

<dt>Ich lege auf.<sub>&nbsp;</sub><br>
 Im Moment komme ich ganz gut voran. Nur noch ein Wizard, der unabl&auml;ssig
Bannfl&uuml;che schleudert, steht zwischen mir und dem letzten Bild. Gleich
bin ich drin!<sub>&nbsp;</sub><br>
 Das Telefon l&auml;utet schon wieder! Mit einem raschen Hieb schalte ich auf
Freisprechen.<sub>&nbsp;</sub></dt>

<dd>"Kontrollraum!"<sub>&nbsp;</sub></dd>

<dt>br&uuml;lle ich, voll involviert.<sub>&nbsp;</sub></dt>

<dd>"Ich hab' meine Files gel&ouml;scht. Meine Daten sind
weg..."<sub>&nbsp;</sub></dd>

<dt>winselt ein User &uuml;ber den Lautsprecher.<sub>&nbsp;</sub></dt>

<dd>"Aber sicher doch!"<sub>&nbsp;</sub></dd>

<dt>sage ich, weil ich mich nicht erinnern kann. Diese Bemerkung gen&uuml;gt,
um mich den Bruchteil einer Sekunde abzulenken. Der Wizard nagelt mich in den
Boden und schmei&szlig;t mir noch einen Feuerball hinterher. GAME
OVER.<sub>&nbsp;</sub></dt>

<dd>"Wie war Ihr Username?"<sub>&nbsp;</sub></dd>

<dt>sage ich mit Honig gesalbter Stimme. Er sagt es mir. Ich schaue nach -
und er hat recht. Sch...., dabei war ich es nicht mal!<sub>&nbsp;</sub><br>
 Um meinen guten Ruf zu wahren, wechsele ich sein Login Directory nach
/dev/null, setzte seinen Pfad auf '.' und einen alias auf sein 'news'
Kommando, welches ein scheu&szlig;liches kleines Skript in seinem
fr&uuml;heren Home Directory startet. Das Skript schickt eine nicht mehr ganz
politisch korrekte email an die Beauftragte f&uuml;r
Gleichberechtigungsfragen der Uni und l&ouml;scht sich anschlie&szlig;end
selbst.<sub>&nbsp;</sub><br>
 Wohl bekomm's!</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
 <p align="center">
<A href="li_bofh05.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh07.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
