<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 1</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (1)</h3></font>

<p>
<dl>
<dt>Heute ist Backup-Tag. Mein Lieblingtag! Andererseits hat es
nat&uuml;rlich gewisse Vorteile, der Operator zu sein. Ich linke das tape
device nach /dev/null - viel &ouml;konomischer. Zumindest, was meine
Arbeitszeit angeht, weil ich nicht alle 5 Minuten B&auml;nder wechseln
mu&szlig;. Au&szlig;erdem dauert das Backup nur noch etwa 12 Minuten, also
kann es nicht ganz schlecht sein!<sub>&nbsp;</sub></dt>

<dt>Ein Benutzer ruft an.<sub>&nbsp;</sub></dt>

<dd>"Wissen Sie, warum das System so langsam ist?"<sub>&nbsp;</sub></dd>

<dt>fragt er.<sub>&nbsp;</sub></dt>

<dd>"Wahrscheinlich liegt's an..."<sub>&nbsp;</sub></dd>

<dt>Ich schaue nach, was heute dran ist:<sub>&nbsp;</sub></dt>

<dd>" ...der Taktfrequenz."<sub>&nbsp;</sub><br>
 "Ah."<sub>&nbsp;</sub></dd>

<dt>Wenn sie nicht wissen, wovon man redet, sind sie meistens
zufrieden.<sub>&nbsp;</sub></dt>

<dd>"Wissen Sie, wann das repariert wird?"<sub>&nbsp;</sub></dd>

<dd>"Repariert? Es sind 275 Benutzer auf deiner Maschine, einer davon bist
du. Nun sei ein braver Junge und lass mal ein paar andere ran. Log aus,
Egoist!"<sub>&nbsp;</sub><br>
 "Aber... aber die Ergebnisse m&uuml;ssen morgen abgegeben werden. Ich
brauche nur noch eine Seite auf dem Laserdrucker..."<sub>&nbsp;</sub><br>
 "Aber klar doch! Erz&auml;hl das mal deiner Omama,
Bruder!"<sub>&nbsp;</sub></dd>

<dt>Ich h&auml;nge auf. Hundertausend H&ouml;llenhunde! Man sollte meinen,
da&szlig; sie endlich lernen, NICHT mehr anzurufen!<sub>&nbsp;</sub><br>
 Das Telefon klingelt wieder. Ich wei&szlig;, da&szlig; er es ist. So was
nervt mich. Ich veringere meine Stimmlage um 2 Oktaven.<sub>&nbsp;</sub></dt>

<dd>"HALLO, LOHNBUCHHALTUNG!"<sub>&nbsp;</sub><br>
 "Ah .. oh. Tut mir leid. Ich habe die falsche
Nummer..."<sub>&nbsp;</sub><br>
 "SOOO? Wie ist denn Ihr Name, Freundchen? Wissen Sie, wieviel Geld uns
solche falschen Anrufen kosten? WISSEN SIE DAS? Ich h&auml;tte gute Lust,
Ihre vergeudete Zeit, meine vergeudete Zeit und die Kosten dieses Anrufs von
Ihrem Monatsgehalt abzuziehen! TATSACHE, DAS WERDE ICH AUCH! Wenn ich mit
Ihnen fertig bin werden SIE UNS Geld schulden! WIE IST IHR NAME - UND KEINE
L&Uuml;GEN! WIR HABEN ISDN!"<sub>&nbsp;</sub></dd>

<dt>Ich h&ouml;re wie der H&ouml;rer 'runterf&auml;llt und sich jemand in
Trab setzt - er will sich im Sekretariat des Dekans ein Alibi besorgen. Ich
tippe seinen Benutzernamen ein und rufe im Sekretariat des zugeh&ouml;rigen
Dekanats an.<sub>&nbsp;</sub></dt>

<dd>"Hallo?"<sub>&nbsp;</sub><br>
 "Hallo, Simon, Operator hier. Passen Sie auf! Wenn er in etwa 10 Sekunden in
Ihr B&uuml;ro st&uuml;rmt k&ouml;nnen Sie ihm was
ausrichten?"<sub>&nbsp;</sub><br>
 "Ich denke schon..."<sub>&nbsp;</sub></dd>

<dt>sagt sie unsicher.<sub>&nbsp;</sub></dt>

<dd>"SAGEN SIE IHM: ER KANN RENNEN, ABER ER ENTGEHT MIR
NICHT!"<sub>&nbsp;</sub><br>
 "&Auml;hm, gut."<sub>&nbsp;</sub><br>
 "Und nicht vergessen. Es w&auml;re doch schade, wenn jemand Ihre Datei mit
den einschl&auml;gigen S+M Tips in Ihrem Account finden
w&uuml;rde..."<sub>&nbsp;</sub></dd>

<dt>Ich h&ouml;re ihre langen Fingern&auml;gel panikartig &uuml;ber die
Tastatur klappern...<sub>&nbsp;</sub></dt>

<dd>"Sparen Sie sich die M&uuml;he - ich hab' bereits 'ne Kopie. Nun seien
Sie ein gutes M&auml;dchen und richten Sie's ihm aus!"<sub>&nbsp;</sub></dd>

<dt>Sie verspricht es heulend.<sub>&nbsp;</sub><br>
 Das Schlimme an der Sache ist: die S+M Sache war nur geraten. Trotzdem hole
ich mir rasch eine Kopie davon. K&ouml;nnte mal ganz gut sein, wenn ich nicht
einschlafen kann...</dt>
</dl>

</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh02.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
