<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 5</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (5)</h3></font>
<p>
<dl>
<dt>Es ist Donnerstag und ich bin guter Laune. Es ist Zahltag. Ich denke, ein
paar Anrufe k&ouml;nnen nicht schaden. Also lege ich den H&ouml;rer
zur&uuml;ck auf die Gabel. Es l&auml;utet.<sub>&nbsp;</sub></dt>

<dd>"Seit Stunden versuche ich, Sie zu erreichen!"<sub>&nbsp;</sub></dd>

<dt>schreit eine Stimme am anderen Ende.<sub>&nbsp;</sub></dt>

<dd>"Nanana, STUNDEN k&ouml;nnen's gar nicht gewesen
sein!"<sub>&nbsp;</sub></dd>

<dt>sage ich, w&auml;hrend ich 'Blade Runner' ins Cover zur&uuml;ckstecke und
mir die R&uuml;ckseite anschaue.<sub>&nbsp;</sub></dt>

<dd>"Allenfalls 114 Minuten. Ich hatte einen langen Chat mit dem gro&szlig;en
Boss. Versuchte bessere Technik f&uuml;r unsere Benutzer
herauszuschlagen."<sub>&nbsp;</sub></dd>

<dt>Eins, zwei, drei...<sub>&nbsp;</sub></dt>

<dd>"Oh, tut mir leid."<sub>&nbsp;</sub><br>
 "Macht nix. Ich bin nicht nachtragend."<sub>&nbsp;</sub></dd>

<dt>Ich nehme mir vor, sein Passwort in den n&auml;chsten Tagen etwas
abzu&auml;ndern, in etwas, worauf er nicht so schnell kommen
d&uuml;rfte.<sub>&nbsp;</sub></dt>

<dd>"&Auml;hm, ich wei&szlig; nicht, wie ich ein File umbennen
kann!"<sub>&nbsp;</sub></dd>

<dt>sagt er.<sub>&nbsp;</sub><br>
 Oh, Gott... Moment, es ist ja Zahltag, nicht? Also bin ich guter
Laune.<sub>&nbsp;</sub></dt>

<dd>"Aber klar. Tippen Sie nur 'rm' und den Filenamen."<sub>&nbsp;</sub><br>
 "Vielen Dank."<sub>&nbsp;</sub><br>
 "Keine Ursache."<sub>&nbsp;</sub></dd>

<dt>(Jetzt bin WIRKLICH guter Laune. Vielleicht sollte ich heute das Skript
fertigschreiben, das Abspeichern zu bestimmten, zuf&auml;llig gew&auml;hlten
Zeiten unm&ouml;glich macht.) Das Telephon l&auml;utet
wieder.<sub>&nbsp;</sub></dt>

<dd>"Hallo?"<sub>&nbsp;</sub><br>
 "Hallo, ebenfalls..."<sub>&nbsp;</sub></dd>

<dt>sage ich.<sub>&nbsp;</sub></dt>

<dd>"Ist das der Kontrollraum?<sub>&nbsp;</sub><br>
 "Aber klar doch!"<sub>&nbsp;</sub></dd>

<dt>sage ich zuckers&uuml;&szlig;.<sub>&nbsp;</sub></dt>

<dd>"K&ouml;nnten Sie mir bitte meine Ausdrucke herausbringen? Ich brauche
sie dringend und der Ausdruck m&uuml;&szlig;te schon seit f&uuml;nf Minuten
zu Ende sein."<sub>&nbsp;</sub><br>
 "Ihr Username?"<sub>&nbsp;</sub></dd>

<dt>frage ich.<sub>&nbsp;</sub><br>
 Er gibt ihn mir und ich notiere ihn f&uuml;r
 sp&auml;ter.<sub>&nbsp;</sub></dt>

<dd>"Kein Problem. Moment."<sub>&nbsp;</sub></dd>

<dt>sage ich und gehe 'r&uuml;ber zu den Druckern. Ein RIESEN Haufen von
Ausdrucken liegt auf dem Boden. Und tats&auml;chlich, sein Dokument liegt
ganz oben auf. Ich breite es &uuml;ber dem Haufen aus und spr&uuml;he
gro&szlig;z&uuml;gig unser Spezialfleckenwasser in die Gegend. Dann fahre ich
den schweren Bandwagen ein paar Mal dar&uuml;ber und klemme es zum
kr&ouml;nenden Abschlu&szlig; vier, f&uuml;nf Mal in die schwere
Safet&uuml;re ein, wo wir die Backup-B&auml;nder aufbewahren sollten.
H&uuml;bsch.<sub>&nbsp;</sub></dt>

<dd>"Hier sind Ihre Ausdrucke,"<sub>&nbsp;</sub></dd>

<dt>sage ich<sub>&nbsp;</sub></dt>

<dd>"Tut mir leid, da&szlig; es solange gedauert hat. Wir haben ein paar
kleinere Probleme mit dem Drucker."<sub>&nbsp;</sub></dd>

<dt>Ein Blick und er macht sich fast in die Hose.<sub>&nbsp;</sub></dt>

<dd>"Oh, Gott! Kann ich es nochmal drucken?"<sub>&nbsp;</sub></dd>

<dt>fragt er besorgt.<sub>&nbsp;</sub></dt>

<dd>"Aber klar doch!"<sub>&nbsp;</sub></dd>

<dt>sage ich.<sub>&nbsp;</sub></dt>

<dd>"Aber wie gesagt, unser Printer ist nicht besonders gut drauf
heute."<sub>&nbsp;</sub><br>
 "&Auml;h, kann ich es auf dem Laser drucken - funktioniert
 der?"<sub>&nbsp;</sub><br>
 "Nat&uuml;rlich, aber das kostet eine Kleinigkeit"<sub>&nbsp;</sub></dd>

<dt>sage ich. Mitgef&uuml;hl verstr&ouml;mend.<sub>&nbsp;</sub></dt>

<dd>"Egal, was es kostet! Das ist hyper-dringend!"<sub>&nbsp;</sub></dd>

<dt>Ich schleiche zur&uuml;ck in den Druckerraum und suche die Tonerkassette,
die wir f&uuml;r spezielle F&auml;lle aufbewaren - die mit den dicken
schwarzen Streifen in der Mitte und den blassen R&auml;ndern. Ich habe auch
ziemlich lange gebraucht, bis sie so gut funktionierte. Der Ausdruck kommt
raus und ich bringe ihn sofort nach vorne. Blo&szlig; nichts
verpassen.<sub>&nbsp;</sub></dt>

<dd>"W-w-w-was ist den jetzt passiert?"<sub>&nbsp;</sub></dd>

<dt>winselt mich der Geck an.<sub>&nbsp;</sub><br>
 Gut, da&szlig; ich den Usernamen notiert habe - Geistige Folter ist
vielleicht doch etwas, wof&uuml;r ich mich l&auml;ngerfristig begeistern
k&ouml;nnte.<sub>&nbsp;</sub></dt>

<dd>"&Auml;h, nichts. Ich meine, klar: Es ist nicht perfekt. Aber der Toner
hat auch schon 47 Tausend Seiten drauf und wurde 17mal nachgef&uuml;llt. Ich
finde, es ist noch gut gegen das, was wir sonst so
bekommen."<sub>&nbsp;</sub></dd>

<dt>Der Geck zahlt und beginnt zu wimmern.<sub>&nbsp;</sub></dt>

<dd>"Na, kommen Sie. Kein Grund zum Heulen. Haben Sie die Arbeit auf
Disketten?"<sub>&nbsp;</sub></dd>

<dt>Er gibt mir eine kleine Plastikbox mit Disketten. Ich h&uuml;pfe schnell
rein und lege sie kurz auf den L&ouml;sch-Magneten. Ich gehe wieder
hinaus.<sub>&nbsp;</sub></dt>

<dd>"Tut mir so leid, aber mir f&auml;llt gerade ein, da&szlig; unser
Leseger&auml;t hin&uuml;ber ist. Sie m&uuml;ssen damit zu dem Druckerraum U
am anderen Ende des Campus - kennen Sie den? - und es dort ausdrucken. Dort
sollte es klappen. Die haben gestern einen neuen Toner
bekommen."<sub>&nbsp;</sub><br>
 "SUPER!"<sub>&nbsp;</sub><br>
 "Gern geschehen. Und denken Sie daran: Immer die Disketten hoch &uuml;ber
den Kopf halten. Das Erdmagnetfeld ist heute wieder extrem
stark."<sub>&nbsp;</sub><br>
 "H&auml;h???"<sub>&nbsp;</sub><br>
 "Keinen langen Reden. Machen Sie's."<sub>&nbsp;</sub></dd>

<dt>Er marschiert los, die Disketten hoch &uuml;ber dem
Kopf...<sub>&nbsp;</sub><br>
 Manchmal hasse ich mich selbst!</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh04.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh06.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
