<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 10</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (10)</h3></font>
<p>
<dl>
<dt>Ich fahre zur Arbeit und klebe hinter diesem alten Trottel, der
klassische SLOW DRIVER FROM HELL. Sein Tacho hat bei 20 die rote Linie und
kommt ins Schlingern, wenn er die Kurven mit mehr als 5 nimmt. Ich verbrauche
ein halbes Kilowatt in meiner Hupe, aber sein H&ouml;rger&auml;t ist
anscheinend auf Fl&uuml;stern eingestellt. Keine Chance,
vorbeizukommen!<sub>&nbsp;</sub><br>
 Ich memoriere sein Kennzeichen. Genau genommen tue ich das seit
f&uuml;nfzehneinhalb Minuten sechzigmal in der Minute.
Mannomannomann...<sub>&nbsp;</sub><br>
 Ich denke, da ist wieder mal ein Anruf in Flensburg f&auml;llig. Vielleicht
k&ouml;nnte man auch den Wagen als gestohlen registrieren. Gestohlen von
Waffenh&auml;ndlern aus den vorderen Orient.
Gef&auml;hrlich...<sub>&nbsp;</sub><br>
 Endlich in der Arbeit bl&auml;ttere ich als erstes den Ausredenkalender um.
"ELEKTROMAGNETISCHE ST&Ouml;RSTRAHLUNG VON FUNKTIONSUNT&Uuml;CHTIGEM
SATELLITEN".<sub>&nbsp;</sub><br>
 Klingt gut; vielleicht wird es doch noch ein netter
Tag.<sub>&nbsp;</sub><br>
 Ich logge mich als "FUCKYOU" ein (der Kummerkasten-Account f&uuml;r die
Benutzer) und rufe die mail auf. Drei Nachrichten sind drin. Die erste hat
117 Zeilen, eine Plaudertasche offensichtlich. Sch.... ich hasse das! Anstatt
einfach zu sagen: "Der und der Account braucht mehr Speicherplatz" fangen sie
an zu erz&auml;hlen &uuml;ber was f&uuml;r einen Mist sie f&uuml;r welchen
idiotischen Dozenten zu forschen haben und da&szlig; es schon gestern
h&auml;tte fertig sein sollen und da&szlig; sie's auch geschafft h&auml;tten,
aber dann hatte die Kusine dritten Grades pl&ouml;tzlich einen
Magendurchbruch und einen riesigen Blutverlust und mu&szlig;te ins
Krankenhaus gebracht werden... usw usw. Ich l&ouml;sche die Mail
unbesehen.<sub>&nbsp;</sub><br>
 Die zweite Mail stammt offensichtlich von jemandem, der nicht mit dem
Mailprogramm umgehen kann. Da ist nur der Header, aber keine Nachricht. Ich
antworte mit direktem Reply: "Keine Sorge wir k&uuml;mmern uns darum am
n&auml;chsten Dienstag."<sub>&nbsp;</sub><br>
 Hoffentlich war's was Wichtiges!<sub>&nbsp;</sub><br>
 Die dritte Mail hebe ich mir f&uuml;r morgen auf. Samstag w&auml;re ein gar
zu langweiliger Tag - sollte ich jemals am Samstag arbeiten m&uuml;ssen! Das
Telephon klingelt. Ich dachte, das h&auml;tte ich
'repariert'!<sub>&nbsp;</sub><br>
 Ich klemme mir den H&ouml;rer unters Kinn, damit ich gleichzeitig die Pizza
in die Mikrowelle schieben kann.<sub>&nbsp;</sub><br>
</dt>

<dd>"Ja?" rufe ich hektisch.<sub>&nbsp;</sub><br>
 "Irgendetwas stimmt nicht mit meiner Bootdisk. Ich kann den Server nicht
erreichen."<sub>&nbsp;</sub><br>
 "Haben Sie das Laufwerk dabei?"<sub>&nbsp;</sub><br>
 "Klar!"<sub>&nbsp;</sub></dd>

<dt>Ich hole mir die Disk und stecke sie zusammen mit der Pizza in die
Mikrowelle. F&uuml;nf Minuten ULTRA-NUKE!<sub>&nbsp;</sub><br>
 Sechs Minuten sp&auml;ter ruft er wieder an.<sub>&nbsp;</sub><br>
</dt>

<dd>"Es funktioniert immer noch nicht, aber jetzt h&ouml;re ich auch noch
komische Ger&auml;usche aus dem Laufwerk und es riecht irgendwie
angebrannt."<sub>&nbsp;</sub></dd>

<dt>Angebrannt? Ich untersuche den Boden meiner Pizza. Naaah, nix angebrannt.
Dem Jungen geht nur die Phantasie durch!<sub>&nbsp;</sub></dt>

<dd>"Oh, Sch...." sage ich, "das sind wieder diese St&ouml;rstrahlungen von
ausgemusterten Satelliten."<sub>&nbsp;</sub><br>
 "Tats&auml;chlich? Davon hab' ich auch schon
 geh&ouml;rt..."<sub>&nbsp;</sub><br>
 "Wow!"<sub>&nbsp;</sub><br>
 "Aha! Tja, ich sch&auml;tze, Sie m&uuml;ssen sich 'ne neue Bootdisk
zulegen..."<sub>&nbsp;</sub><br>
 "Oh."<sub>&nbsp;</sub><br>
 "Naja, macht auch nix. Die alte h&auml;tte es sowieso nicht mehr lange
gemacht. Danke."<sub>&nbsp;</sub><br>
 "Keine Ursache. Und denken Sie immer daran, den Virenchecker FDISK ab und zu
laufen zu lassen, wenn Sie wichtige Daten auf Ihrer Disk
haben..."<sub>&nbsp;</sub><br>
 "Werd' ich machen. Danke!"<sub>&nbsp;</sub><br>
 "Alles klar - ist nur mein Job!"<sub>&nbsp;</sub><br>
</dd>

<dt>Racing l&auml;uft viel zu langsam f&uuml;r einen erfahrenen Spieler; also
kille ich eben mal alle Database Prozesse, die sich den L&ouml;wenanteil an
CPU holen und gebe Racing Priorit&auml;t -10. Besser, viel
besser.<sub>&nbsp;</sub><br>
 Verdammt hart, so an der vordersten Front: Immer nur Arbeit, Arbeit,
Arbeit...<sub>&nbsp;</sub><br>
 Ich g&ouml;nne mir einen schnellen 2-Stunden-Snack in der Cafeteria. In der
Cafeteria sind immer alle ganz reizend zu mir. Zumindest seit es mal diesen
dummen Computerfehler gegeben hat, der ihre K&uuml;che als
Organ-Aufnahme-Station registrierte - ziemlich l&auml;stig! Ich schnappe mir
noch ein paar Cokes und Crackers und mach' mich auf den R&uuml;ckweg, diesmal
durch die Anf&auml;nger-Labs. Informatik, erstes Semester. Ich schaue durch
das Guckloch an der T&uuml;r: Ein ganzer H&ouml;rsaal voller Frischlinge ohne
Dozenten. Das kann nicht angehen! Ich sto&szlig;e energisch die
Schwingt&uuml;re auf und marschiere zur Tafel.<sub>&nbsp;</sub><br>
</dt>

<dd>"Es geht los, Herrschaften! Ich darf um Ruhe bitten. Sie dahinten, ja
Sie, Sie sorgen daf&uuml;r, da&szlig; uns niemand st&ouml;rt. Blockieren Sie
einfach den Eingang. Wer zu sp&auml;t kommt, soll sich das f&uuml;r's
n&auml;chste Mal merken. Also, ich bin ihre Vertretung heute und wir wollen
jetzt mal den &uuml;blichen Kram, den Sie sonst machen, beiseite lassen und
uns &uuml;ber ein paar fundamentale Befehle aus der Praxis unterhalten. Wir
beginnen mit einer der wichtigsten Funktionen &uuml;berhaupt dem
REMARK-Befehl oder wie er allen Kenner bekannt ist 'rm *'
..."<sub>&nbsp;</sub></dd>

<dt>Ich h&auml;tte vielleicht doch besser Professor werden sollen - ich hab'
den richtigen Draht zu den jungen Leuten, wissen Sie...<sub>&nbsp;</sub><br>
 Grundverhaltensregeln f&uuml;r Dekane:<sub>&nbsp;</sub><br>
</dt>

<dd>(1). VERSTECKEN!<sub>&nbsp;</sub><br>
 (2). Wenn sie dich finden L&Uuml;GEN!!<sub>&nbsp;</sub></dd>

<dt>Father Damian C. Fandal</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh09.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh11.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
