<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Bastard Operator from Hell: Seite 4</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="nc_bg2.jpg" text="Black" link="Blue" vlink="Red" alink="#FF9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>
<td><font face="" color="Green"><h3 align="center">Bastard Operator from Hell (4)</h3></font>
<p>
<dl>
<dt>Mein Job ist so eine Hetze, da&szlig; ich kaum dazu komme, kurz mal ins
Kino zu fahren, bevor die Leute ihre Ausdrucke abholen kommen. Die Queue ist
sowieso viel zu voll, als da&szlig; ich alles rechtzeitig ausgedrucken (und
sortieren) k&ouml;nnte. Also kille ich alle die kleineren Jobs bis auf zwei
und die lassen sich im Nu sortieren.<sub>&nbsp;</sub><br>
 Nach dem Film (einer von diesen Endlos-Bertoluccis, wo der Held nach drei
Stunden endlich in grandiosen Visionen zugrunde geht) komme ich zur&uuml;ck,
um die Ausdrucke auszugeben. Etwa f&uuml;nfzig Leute warten drau&szlig;en und
ich habe zwei Ausdrucke. Stimmt ziemlich gut mit meinem Durchschnitt
&uuml;berein. Andererseits h&auml;tte ich mehr killen sollen. Egal, ich lasse
die beiden Ausdrucke elegant auf den Tisch gleiten, drehe mich um und gehe
betont langsam zur&uuml;ck in meinen Glaskasten. Dabei halte ich deutlich sichtbar
das Clipboard in der Hand, das mit den gro&szlig;en roten Buchstaben 'ACCOUNTS TO
REMOVE' auf der R&uuml;ckseite. Keiner sagt ein Wort. Wie
immer.<sub>&nbsp;</sub><br>
 Ich sitze wieder gem&uuml;tlich im Operator Sessel und beobachte den
&Uuml;berwachungs-Monitor, der zuf&auml;llig mit dem Videoplayer aus der
medizinischen Optik verbunden ist (zur Reparatur hier; gesch&auml;tzter Termin
der R&uuml;cklieferung irgendwann in 2001). Pl&ouml;tzlich klingelte das
Telefon. Das mu&szlig; heute schon das zweite Mal sein, und es beginnt mir
auf die Nerven zu gehen.<sub>&nbsp;</sub></dt>

<dd>"Ja?"<sub>&nbsp;</sub></dd>

<dt>sage ich und halte das Bild an.<sub>&nbsp;</sub></dt>

<dd>"Ich hab' aus Versehen meinen Lebenslauf
gel&ouml;scht..."<sub>&nbsp;</sub></dd>

<dt>sagt die Stimme am anderen Ende.<sub>&nbsp;</sub></dt>

<dd>"Tats&auml;chlich? Wie war Ihr Username?"<sub>&nbsp;</sub></dd>

<dt>Er sagt es mir. Sch.... wie langweilig.<sub>&nbsp;</sub></dt>

<dd>"Ah, nein. Nicht Sie haben ihn gel&ouml;scht - ich 
war's."<sub>&nbsp;</sub><br>
 "Was?"<sub>&nbsp;</sub><br>
 "Ich hab' ihn gel&ouml;scht! Er war voll mit Sch...! In keinem einzigen Fach
was Besseres als 'ne zwei!"<sub>&nbsp;</sub><br>
 "H&auml;h?"<sub>&nbsp;</sub><br>
 "Und der Mist mit dem Austauschstudium - das war Ihre Freundin, und wir
beide wissen das!"<sub>&nbsp;</sub><br>
 "H&auml;h??"<sub>&nbsp;</sub><br>
 "Na, Ihre Studienangaben. Ich hab's nachgepr&uuml;ft. Sie haben
gelogen."<sub>&nbsp;</sub><br>
 "Wie haben Sie..."<sub>&nbsp;</sub></dd>

<dt>Es klickt deutlich h&ouml;rbar.<sub>&nbsp;</sub></dt>

<dd>"Oh, nein. SIE sind's! Der BASTARD OPERATOR FROM
HELL!"<sub>&nbsp;</sub><br>
 "Leibhaftig, am Telephon und in Ihrem Account. Es w&auml;re wirklich besser
gewesen, nicht anzurufen, wissen Sie. Vor allem h&auml;tten Sie Ihren
Usernamen lieber f&uuml;r sich behalten sollen..."<sub>&nbsp;</sub></dd>

<dt><strong>klickediklackediklick</strong>...<sub>&nbsp;</sub></dt>

<dd>"Tja, und dann h&auml;tten Sie dem System Manager keine so b&ouml;se Mail
schicken d&uuml;rfen. Eine Mail, die ausdr&uuml;ckt, was Sie von ihm halten -
in h&uuml;bschen Bildern!"<sub>&nbsp;</sub><br>
 "Ich habe keine..."<sub>&nbsp;</sub></dd>

<dt><strong>klickediklackediklick</strong>... <strong>klick</strong><sub>&nbsp;</sub></dt>

<dd>"So? Haben Sie nicht? Wer kann das noch sagen heutzutage? Keine Sorge, es
bald wird alles vor&uuml;ber sein...."<sub>&nbsp;</sub></dd>

<dt><strong>klickediklackediklick</strong>...<sub>&nbsp;</sub><br>
 ...noch den Usernamen zur&uuml;ck&auml;ndern...<sub>&nbsp;</sub><br>
</dt>

<dt><strong>klickediklackediklick</strong>...<sub>&nbsp;</sub></dt>

<dd>"B-b-b-b"<sub>&nbsp;</sub></dd>

<dt>blubbert er wie eine desynchronisierte PDP-11.<sub>&nbsp;</sub></dt>

<dd>"Leben Sie wohl"<sub>&nbsp;</sub></dd>

<dt>sage ich &uuml;berfreundlich.<sub>&nbsp;</sub></dt>

<dd>"Ich denke, Sie sollten jetzt besser packen. Viel Spa&szlig; beim
Neubeginn."<sub>&nbsp;</sub></dd>

<dt>Ich lege auf.<sub>&nbsp;</sub><br>
 Zwei Sekunden sp&auml;ter l&auml;utet das rote Telefon. Es ist der Boss. Er
knurrt den Usernamen - von wem wohl? - und etwas &uuml;ber eine schweinische
Mail.<sub>&nbsp;</sub></dt>

<dd>"Sie wissen, was Sie zu tun haben..."<sub>&nbsp;</sub></dd>

<dt>mit den Punkten und allem.<sub>&nbsp;</sub><br>
 Sp&auml;ter, im Abrechnungscomputer der St&auml;dtischen
Elektrizit&auml;tswerke, w&auml;hrend ich die n&auml;chste Rechnung des armen
Schweins um ein paar Nullen korrigiere, wundere ich mich wieder einmal
&uuml;ber diesen hartn&auml;ckigen und unglaublichen Mangel an
Urteilsverm&ouml;gen - welche Bl&ouml;dheit kosmischen Ausma&szlig;es treibt
sie immer wieder dazu, bei mir anzurufen. Noch sp&auml;ter, als ich im FBI
Computer sein Photo von der WWW Page in die Gesuchtenliste kopiere (die mit
dem Label 'Dringend gesucht, bewaffnet und gef&auml;hrlich, sofort
schie&szlig;en'), komme ich zu dem Schlu&szlig; da&szlig; ich es wohl niemals
wissen werde - aber das Leben geht weiter.<sub>&nbsp;</sub><br>
 Ein paar Stunden sp&auml;ter sehe ich die GSG 9 sein Apartment umstellen und
mir wird klar: F&uuml;r ein paar von uns wird es das nicht. Aber morgen ist
ein neuer Tag.</dt>
</dl>
</p>
</table>
<TABLE border="5" cellspacing="1" cellpadding="5" align=
    "center">
      <TR>
        <TD>Rainer Wrieden</TD>

        <TD>E-Mail: <A href=
        "mailto:spezis@terra.es">spezis@terra.es</A></TD>
      </TR>
    </TABLE>
	<p align="center">
<A href="li_bofh03.html"><IMG border=0 height=15 src="pfeil_l.gif" width=30 alt="zurück"></a>
<A href="li_bofh05.html"><IMG border=0 height=15 src="pfeil_r.gif" width=30  alt="weiter"></a> </p><br>
</body>
</html>
