<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta name="generator" content="Handmade on Amiga using GoldEd">
<meta name="author" content="Chris Hodges (hodges@in.tum.de)">
<link rev=made href="mailto:hodges@in.tum.de">
<title>Winterschlaf</title>
</head>
<body bgcolor="#ceb9ae" text="#000000" link="#0000ff" vlink="#990099"
alink="#00ffff" background="bubbleback.png">

<table border=0 cellpadding=8 width=100% summary="">
<tr><td>
<center><img src="b1c.png" width=288 height=48 alt="The Messages"><br>
<img src="b1_4.png" width=144 height=24 alt="Publications">

<p><font size="+2">Winterschlaf</font><br>
<font size="+1">Autor: Chris Hodges
&lt;<a href="mailto:hodges@in.tum.de">hodges@in.tum.de</a>&gt;
</font></center>

<p>An einem wundersch&ouml;nen, aber frostigen Morgen wachte der kleine
B&auml;r unerwartet aus seinem Winterschlaf auf. Er sperrte seine
gro&szlig;e Schnautze auf und g&auml;hnte ein langes, erschauerndes
"Earl!". Dann blinzelte er mit seinen Augen, und lie&szlig; sie
schlie&szlig;lich offen, damit sie sich wieder an die Helligkeit
gew&ouml;hnen konnten. W&auml;hrend er noch die letzten, s&uuml;&szlig;en
Tr&auml;ume von einem Ausflug zum Fluss mit einem festlichen Lachsmahl aus
seinem Kopf sch&uuml;ttelte, blickte er zum hellen Lichtschein am Ausgang
seiner H&ouml;hle.

<p>"Na, zum Gl&uuml;ck ist es wieder soweit", freute sich der B&auml;r,
"der Fr&uuml;hling ist endlich gekommen." Und dann streckte und reckte er
sich noch einmal, bevor er aufstand, um sich auf den Weg nach drau&szlig;en
zu machen. Er hatte n&auml;mlich einen B&auml;renhunger, an dem bestimmt
nicht nur seine Tr&auml;ume schuld waren.

<p>Doch irgendetwas stimmte nicht.

<p>W&auml;hrend er auf das Licht zuging, konnte er den Wind heulen
h&ouml;ren und sein Atem stieg in gro&szlig;en, grauen Dampfwolken vor
seine Augen auf. Und pl&ouml;tzlich war ihm klar geworden, warum ihn das
Schneegest&ouml;ber und das helle, wei&szlig;e Land so verwirrte.
"Brrrrummmm, es ist ja noch gar nicht Fr&uuml;hling!", emp&ouml;rte er
sich. "Da hat mir wohl jemand einen Streich gespielt."

<p>Aber wie konnte das nur passieren? Unentschlossen, was er nun tun
sollte, ging er ein wenig im Schnee spatzieren. Er sah und h&ouml;rte keine
V&ouml;gel zwitschern, keine Schmetterlinge fliegen oder auf Blumen sitzen,
denn Blumen gab es keine. Der Boden war mit einer tiefen Schicht Schnee und
Eis bedeckt und die B&auml;ume trugen schwer an ihrer wei&szlig;en Last.
Sein dicker Pelz sollte ihn vor der K&auml;lte sch&uuml;tzen, aber an
seinen Tatzen frierte er trotzdem.

<p>Er begann zu &uuml;berlegen. Und zwar zuerst mit seinem Bauch, denn er
schien ihm doch ziemlich leer zu sein. "Wo bekomme ich jetzt etwas zu essen
her?", fragte er sich. Hinter ihm begannen die Spuren bereits zu verwehen
und sein Unterschlupf war auch nicht mehr zu sehen. Und so ging er weiter
auf der Suche nach Nahrung und W&auml;rme.

<p>Hatte er denn nicht genug gefressen, bevor er sich zum Schlafen
hingelegt hatte? Er erinnerte sich nicht richtig. "Vielleicht war ich nicht
flei&szlig;ig genug?", &uuml;berlegte er, verdr&auml;ngte diesen Gedanken
aber schnell wieder, denn auch wenn er &ouml;fters im Sommer auf der faulen
Haut lag und es sich gutgehen lie&szlig;, war er doch im Herbst sehr lange
gejagt und sich ausgiebig den Magen vollgeschlagen.

<p>Er gr&uuml;belte vor sich hin und begann langsam zu verzweifelten, wie
er denn jetzt in diesem Winter &uuml;berleben sollte. Er hatte sich so viel
f&uuml;r den Sommer vorgenommen, wollte neue M&ouml;bel in seiner
H&ouml;hle einrichten und eine l&auml;ngere Reise machen, an einen Ort, wo
es viel Honig gab und man es sich richtig gut gehen lassen konnte. An
diesem Ort war er schon vor ein paar Jahren gewesen. Zwar sprachen die
B&auml;ren dort eine andere Sprache, aber daran hatte er sich schnell
gew&ouml;hnt.

<p>Und w&auml;hrend er so vor sich hin trottete und ihn Schritt um Schritt
das tr&uuml;be Licht der Sonne und seine Kr&auml;fte ihn verlie&szlig;en,
sah er in der Ferne einen kleinen, rot-schimmernden Fleck. Aber der
B&auml;r war schon m&uuml;de und die K&auml;lte drang nun tief in seinen
K&ouml;rper. "Ich muss mich kurz ausruhen... etwas schlafen...
schlafen...", murmelte er noch, bevor er langsamer wurde und stehen blieb.

<p>Der kleine B&auml;r legte sich hin, als winziger brauner Fleck in einer
scheinbar endlosen Schnee- und Eisw&uuml;ste. Schlie&szlig;lich fielen ihm
seine sanften, braunen Augen zu und er begann zu tr&auml;umen...

<p>Der Himmel war blau, als er nach oben blickte und er h&ouml;rte den
Fluss rauschen, der so lebhaft und sprudelnd in ein paar Metern Entfernung
vorbeifloss. Die warmen Strahlen der Sonne &uuml;berfluteten das Tal, das
so bunt war von all den bl&uuml;henden Pflanzen und all den Tieren, die auf
der weiten Flur vergn&uuml;gt spielten. Der B&auml;r atmete tief ein und
all die s&uuml;&szlig;en und w&uuml;rzigen Ger&uuml;che von Nektar und
frischem Gras erf&uuml;llten ihn mit einer solchen Freude, dass er sofort
aufstand und wild herumtollte. "Es ist so sch&ouml;n hier!", sagte er zu
sich selbst.

<p>Auf der anderen Seite des Flusses sa&szlig;en ein paar andere
B&auml;ren, die sich gerade gen&uuml;sslich ihre Tatzen voller Honig
abschleckten. Als sie ihn kommen sahen, riefen sie ihm freundlich etwas zu,
dass er im ersten Augenblick nicht verstand. "Mon petit ours aimé!", hallte
es wieder her&uuml;ber. Und da erkannte er, dass er in seinem Land seiner
Jugend war.

<p>"Das muss ein Traum sein!", rief er und lachte laut los. Aber das Lachen
blieb ihm im Halse stecken. Denn das war es tats&auml;chlich. "Es
<i>ist</i> ein Traum!", begann er zu schluchzen. "Und wenn ich nicht sofort
aufstehe und weitergehe, wird es f&uuml;r immer ein Traum bleiben", sprach
er weiter.

<p>Das wollte er nicht. Er wollte zur&uuml;ck in dieses wunderbare Land. Er
wollte den Fluss &uuml;berqueren. So einfach konnte er nicht aufgeben.
Nicht f&uuml;r dieses Ziel. Er war vielleicht gescheitert, aber die
Schlacht war noch nicht entschieden.

<p>Als er aufwachte, war er fast schon v&ouml;llig vom Schnee eingeschneit
worden. Aber der kleine B&auml;r richtete sich auf und sch&uuml;ttelte
sich, bis er wieder der braune B&auml;r war, den alle kannten. Er hatte das
Gef&uuml;hl, jetzt sogar etwas gr&ouml;&szlig;er zu sein!

<p>Er lief auf das rote Licht zu und kam endlich an eine H&uuml;tte. Mit
letzter Kraft klopfte er gegen die T&uuml;r, bevor ihm schwindlig wurde und
er ohnm&auml;chtig zu Boden sank.

<p>Als er wieder die Augen &ouml;ffnete, sah er das Feuer des Kamins vor
sich, aber er war zu m&uuml;de, viel zu m&uuml;de und schlief wieder ein.

<p>Am n&auml;chsten Morgen wachte der B&auml;r vor der T&uuml;r auf. Vor
ihm lagen ein paar gro&szlig;e Lachsfische, die er ohne lange zu
z&ouml;gern verschlang. Er machte sich auf den Weg zum See, um noch mehr
Fische zu fangen. Er w&uuml;rde noch mehr Nahrung brauchen, bevor er diesen
besonders langen, harten Winter &uuml;berwinden w&uuml;rde. Und so fing und
verschlang er einen Fisch nach dem anderen, fast den ganzen Tag lang.

<p>Nach dieser anst&auml;ndigen Mahlzeit, begab er sich wieder zur&uuml;ck
in seine H&ouml;hle, wo er sich wieder zusammenrollte, um die letzten
kalten Monate zu verbringen. Und dieses Mal war er sich sicher, er
w&uuml;rde vom s&uuml;&szlig;en Geruch von Nektar geweckt werden. <br>

<p><font size="-1">&copy;1999-2003 <a href="mailto:hodges@in.tum.de">Chris
Hodges</a>. Last time updated on 09-Mar-03 20:26:13.</font>
</td></tr></table>
<br>
</body>
</html>

