<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta name="generator" content="Handmade on Amiga using GoldEd">
<meta name="author" content="Chris Hodges (hodges@in.tum.de)">
<link rev=made href="mailto:hodges@in.tum.de">
<title>Sternschnuppen</title>
</head>
<body bgcolor="#ceb9ae" text="#000000" link="#0000ff" vlink="#990099"
alink="#00ffff" background="bubbleback.png">

<table border=0 cellpadding=8 width=100% summary="">
<tr><td>

<center><img src="b1c.png" width=288 height=48 alt="The Messages"><br>
<img src="b1_4.png" width=144 height=24 alt="Publications">

<p><font size="+2">Sternschnuppen</font><br>
<font size="+1">Autor: Chris Hodges
&lt;<a href="mailto:hodges@in.tum.de">hodges@in.tum.de</a>&gt;
</font></center>

<p>Philipp stieg in die Eisen seines Fahrrades. 'In f&uuml;nf Minuten bin
ich zuhause', dachte er, 'dann kann ich endlich ins Bett und vielleicht
sogar mal ausschlafen'. Es war erst kurz nach Mitternacht und er erinnerte
sich an den Abend zuvor, als er erst um f&uuml;nf Uhr morgens die Party
verlies. Es war Connys Geburtstagsfeier gewesen und sie hatten lange Poch
gespielt, nachdem die meisten G&auml;ste gegen 2 Uhr gegangen waren. Auch
wenn Philipp st&auml;ndig schlechte Karten bekam und als erster seinen
Kreditrahmen sprengte, so hatte er doch eigentlich viel Spa&szlig; gehabt.
Und auch heute schien sein Kartengl&uuml;ck ihn wieder verlassen zu haben,
als der Schafkopfabend einem geh&ouml;rigen Minus endete.

<p>"Tja, Pech im Spiel...", m&uuml;rmelte er vor sich hin, w&auml;hrend er
auf die alte Bahnhofstra&szlig;e abbog, auf die das fahle Licht der
Stra&szlig;enlaternen schien. Ja, aber wo war sie, die Liebe, nach der er
sich so sehr sehnte? Im Gegensatz zu seinen Mitspielern w&uuml;rde er heute
Nacht das Kopfkissen mit niemandem teilen. Er blickte kurz hinauf zum
Himmel, sah hoch in die wolkenlose Finsternis, in der die Sterne wie
kleine, einsame Diamanten funktelten.

<p>Er beschleundigte die Fahrt noch etwas als er den Ort verlie&szlig; und
die Stra&szlig;e zur Schnittlinie zwischen den Feldern wurde. Das
Frontlicht seines Rades war defekt, aber die Laternen spendeten
gen&uuml;gend Licht, so dass er sich auf dem Weg sicher f&uuml;hlte. Links
auf der Wiese bemerkte er einen gro&szlig;en Schatten: Dort stand ein Pferd
und graste am Rande des Elektrozauns.

<p>Philipp hielt sein Rad an; das wollte er sich genauer ansehen. In seiner
Jugend hatte er nie etwas mit Pferden zu tun gehabt und irgendwie hatte er
immer noch das Bed&uuml;rfnis, einiges aus dieser Zeit nachzuholen. Das
Fahrrad stellte er an den Rand und bewegte sich ein paar Meter in Richtung
Zaun, um das braun-wei&szlig; gefleckte Tier zu n&auml;her betrachten. Es
lies sich kaum st&ouml;ren, blickte nur einmal kurz auf. Das Pferd schaubte
laut mit seinen N&uuml;stern, als er seine Hand zwischen die beiden
Leitungen des elektrischen Zaunes steckte, um sie beschnuppern zu lassen.
Dann streichelte er vorsichtig den Kopf und fl&uuml;sterte "Ja... Du bist
ein gutes, braves Tier". Er war erstaunt: Das Fell war unerwartet rau. Er
schaute ihm tief in seine dunkelen braune Augen und glaubte, dass das Pferd
ihn verstand, ihn und sein Innerstes erkennen w&uuml;rde. Der Funke Angst,
den er vorher empfand, wurde l&ouml;ste sich auf zu einem seltsamen
Gef&uuml;hl des Vertrauens.

<p>So standen sie beide noch ein paar Sekunden da, bis er schlie&szlig;lich
zur&uuml;ck zu <i>seinem</i> Drahtesel ging und weiter fuhr. Er f&uuml;hlte
sich komisch, aber auch irgendwie zufrieden mit sich. 'Wieder eine neue
Erfahrung', dachte er sich. Er erreichte die Br&uuml;cke, die &uuml;ber die
Schnellstra&szlig;e f&uuml;hrte und oben angelangt blickte er nach oben zum
Firmament. Ein schneller, wei&szlig;-gl&uuml;hender Strahl schoss quer
&uuml;ber dem Horizon herab. F&uuml;r diese Sternschnuppe, dachte er,
d&uuml;rfte er sich ja etwas w&uuml;nschen. Die letzten Male hatte er sich
immer etwas f&uuml;r andere gew&uuml;nscht. Z.B. dass sie ihre Klausuren
bestehen und gl&uuml;cklich werden w&uuml;rden. Aber diesmal, meinte er,
dieses Mal sollte es etwas f&uuml;r sich sein. Und so sprach er die
tonlosen Worte in seinen Gedanken aus.

<p>Einen kurzen Moment sp&auml;ter schien ihm das absurd: ging es ihm denn
nicht schon gut genug? Hatte er nicht bereits Erfolg, war gesund und hatte
viele und sehr gute Freunde? Er hatte einiges geleistet in den letzten
Monaten, bekam auch viel Best&auml;tigung von anderen Menschen um ihn
herum. Das tat gut, erinnerte er sich. Und die langen Gespr&auml;che, der
Gedankenaustausch mit seinen Freunden, denen er helfen konnte und die ihm
daf&uuml;r dankbar waren.

<p>Und sein Studium lief doch auch gut, oder? Besser zumindest, als bei
vielen anderen, die tats&auml;chlich nichts anderes taten, als sich dem
Stoff zu widmen. Wo hatte Philipp schon &uuml;berall seine Nase drin und
alles mitgekriegt, was es zu erfahren gab? Wieviele Studenten aus allen
Jahrg&auml;ngen kannten ihn schon pers&ouml;nlich?

<p>Und Geld? Damit hatte er auch kein Problem. Es war nicht richtig viel,
aber er konnte damit leben und sich einen Teil seiner W&uuml;nsche
erf&uuml;llen. Zum Gl&uuml;ck war er nicht davon abh&auml;ngig und konnte
doch eigentlich so viel in seiner Freizeit vollbringen, was ihm
tats&auml;chlich Spa&szlig; machte.

<p>Und Maria. Eine zauberhafte, wundervolle Frau, intelligent und sensibel,
in die er sich gerne verlieben w&uuml;rde und mit der er bis in die
sp&auml;te Nacht hinein telefoniert hatte. Sie verstand es, ihm
zuzuh&ouml;ren, aber auch er war einfach nur von ihr begeistert, zum
Beispiel, welche seltsamen Seufzger&auml;usche sie von sich geben konnte.
Sie brachten sich gegenseitig zum Lachen, wussten aber auch &uuml;ber die
ernsten Dinge offen zu reden. Und auch wenn es keine Liebe werden
k&ouml;nnte, so gab es nur sehr, sehr wenig, was er bereit gewesen
w&auml;re, f&uuml;r die Freundschaft einzutauschen. Und auch eine
platonische Liebe und N&auml;he, das war f&uuml;r ihn auch etwas
Wertvolles, dass er ihr bereitwillig anbot und dass ihn gl&uuml;cklich
machte, es ihr zu schenken.

<p>Er dachte an seine anderen Freunde. Daran, wieviele Erlebnisse und
Gef&uuml;hle er mit ihnen geteilt hatte. Vieles von dem w&uuml;rde nie
wieder kommen. Aber in ihm drin w&uuml;rde es immer ein Teil seines Lebens
bleiben. Ein Schatz, der im Grunde nur ihm allein geh&ouml;rte, den er
immer wieder hervorkramen k&ouml;nnte, wenn es ihm schlecht ging.

<p>"Eigentlich... eigentlich gehts mir doch richtig gut!", murmelte er, als
die Ampel von Rot auf Gr&uuml;n sprang und ihm die Weiterfahrt erlaubte.
"Und wenn das einzige, was mir fehlt, eine Beziehung ist", sprach er laut
aus, "wie bl&ouml;d muss ich dann sein, um mich allein deswegen
ungl&uuml;cklich zu machen?" Irgendwie w&uuml;rde es sich irgendwann schon
ergeben. Kein Grund, sich jetzt den Kopf oder das Herz dar&uuml;ber zu
zerbrechen. Er l&auml;chelte. Irgendwie wurde am Ende alles einen Sinn
ergeben. Und er dachte zur&uuml;ck an das Pferd und wie es ihm in die Augen
geschaut hatte.

<p>Als er sein Rad in den Keller sperrte und das Tor schloss, fiel ihm
pl&ouml;tzlich etwas auf. Er begann herzhaft zu lachen und sprach zu sich
selbst: "Ich wusste gar nicht, dass Sternschnuppen so schnell wirken!" <br>

<p><font size="-1">&copy;1999-2003 <a href="mailto:hodges@in.tum.de">
Chris Hodges</a>. Last time updated on 09-Mar-03 18:49:41.</font>
</td></tr></table>
<br>
</body>
</html>

