<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta name="generator" content="Handmade on Amiga using GoldEd">
<meta name="author" content="Chris Hodges (hodges@in.tum.de)">
<link rev=made href="mailto:hodges@in.tum.de">
<title>Glosse f&uuml;r Impulsiv Ausgabe 70</title>
</head>
<body bgcolor="#ceb9ae" text="#000000" link="#0000ff" vlink="#990099"
alink="#00ffff" background="bubbleback.png">

<table border=0 cellpadding=8 width=100% summary="">
<tr><td>
<center><img src="b1c.png" width=288 height=48 alt="The Messages"><br>
<img src="b1_4.png" width=144 height=24 alt="Publications">

<p><font size="+2">Oger sind wie Zwiebeln...</font><br>
<font size="+1">Autor: Chris Hodges
&lt;<a href="mailto:hodges@in.tum.de">hodges@in.tum.de</a>&gt;
</font></center>

<p>Dass Oger nicht nur stinken und h&auml;sslich sind, sondern vor allem
auch Schichten haben, wissen wir seit Shrek. Dass mein Zimmer auch wie eine
Zwiebel aka Shrek ist, wei&szlig; ich seit gut zwei Wochen. Ich habe
n&auml;mlich renoviert und dabei Schale um Schale in Form von drei
Schichten Tapete und zwei Schichten Farbe entfernt. Dabei ist mir
aufgefallen, wie gut sich Kinderzimmer als Erinnerungsspeicher eignen.
Sozusagen wie ein Flash-ROM. Da findet man Signaturen in krakeliger Schrift
(nicht, dass sich das gebessert h&auml;tte), auf der ersten Farbschicht
hier und da ein Diagramm mit X/Y-Achse und einer Funktion, die man am
ehesten mit sin(1/x) beschreiben kann. Fr&uuml;h &uuml;bt sich! Doch das
ist nun alles Vergangenheit, wegradiert und &uuml;berstrichen mit Farbe,
die an Homogenit&auml;t zu w&uuml;nschen &uuml;brig l&auml;sst (dummerweise
konvergiert der Farbton beim Mischen erst im Unendlichen).

<p>Und was lernen wir aus der Vergangenheit? Nichts. Immer dann, wenn
schreckliche Katastrophen passieren, die so surreal sind, wie die
Anschl&auml;ge auf das World Trade Center, neigen wir dazu, emotional zu
reagieren. Und wo Emotionen sind (die grunds&auml;tzlich nichts Schlechtes
sind), setzen zwangsweise der Verstand und die Vernunft aus (also f&uuml;r
die Pr&uuml;fung merken: versuchen, m&ouml;glichst wenig Angst davor zu
haben). Und so ist die erste Reaktion der USA, die Diplomaten
zur&uuml;ckzuziehen, den Kontakt abzubrechen und den Krieg zu erkl&auml;ren
(zum Zeitpunkt meines Schreibens ist dies noch nicht offiziell der Fall und
ich hoffe, dass es auch nie eintreten wird) und das Leben weiterer
zehntausender <i>Menschen</i> zu risikeren. Ist das denn irgendwie besser?
Eskalation ist der <i>stairway to heaven</i>.

<p>Ich bitte hier um f&uuml;nf Gedenkminuten f&uuml;r die 17.100
unschuldigen Toten des Erdbebens in der T&uuml;rkei von 1999. Nein,
Terrorismus und Naturkatastrophen sind nicht vergleichbar. Au&szlig;er,
dass sie unvorhersehbar sind, gewaltige, sinnlose Zerst&ouml;rungen
verursachen (k&ouml;nnen), Ursachen haben, die man auf den ersten Blick
nicht sieht oder bek&auml;mpfen kann (oder will) und dass sie oft nicht
greifbar und zur Verantwortung ziehbar sind. Aber einen Schuldigen, einen
S&uuml;ndenbock brauchen wir jetzt. Und der muss dann gekreuzigt,
gevierteilt, erschossen und gek&ouml;pft werden, und danach muss man ihm
wirklich weh tun. Auge um Auge, Zahn um Zahn. Wenn es nur so leicht
w&auml;re, unser Leid, unsere Wut und unseren Hass loszuwerden. So einfach,
wie sich mit der Medienwelle mittragen zu lassen und die Gedankenkonserven
als seine eigenen anzunehmen.

<p>Aber wieso spreche ich dauernd von <i>unseren</i> Emotionen? Was ist uns
denn passiert? Wir sprechen uns zu Solidarit&auml;t mit den Opfern der
Katastrophe aus, klar, aber noch weiter, wir versichern den in ihrem
Nationalstolz getroffenen USA sogar milit&auml;rische Unterst&uuml;tzung,
de facto f&uuml;r einen Angriffskrieg. Webseiten gehen offline oder
pr&auml;sentieren sich in schwarz.[1] Das Zuwanderungsgesetz muss neu
diskutiert werden, denn es haben sich v&ouml;llig neue Sachverhalte
ergeben. Trittbrettfahren, auch emotionales, ist mindestens genauso
gef&auml;hrlich wie S-Bahn-Surfen. Diese Katastrophe wird dazu benutzt, um
eine rigide Ausl&auml;nderpolitik salonf&auml;hig zu machen, um
Abh&ouml;rma&szlig;nahmen zu etablieren, die einem &Uuml;berwachungsstaat
&auml;hneln. Haltet mich f&uuml;r kaltherzig, wenn ich so ehrlich bin, aber
ich bringe nicht die Emotionen auf f&uuml;r 10.000 Verstorbene. Der Tod
eines Menschen, den ich nicht einmal kannte, Douglas Adams, hat mich da
deutlich mehr ber&uuml;hrt.

<p>Die Wahrheit ist, ebenso wie Oger, eine vielschichtige Angelegenheit.
Au&szlig;en liegen nur die Symptome, erst unter der Schale findet man die
Ursachen. Um so n&auml;her man dem Kern kommen will, desto ganzheitlicher
muss man denken (mathematisch also eine Kugelspiegelung). Daraus folgt,
dass die absolute Wahrheit, genau wie meine Wandfarbe, im unerreichbaren
Unendlichen liegt. Was aber nicht bedeutet, dass die Suche nach der
Wahrheit sinnlos ist: Man muss es zumindest versuchen. Und f&uuml;r die
meisten Leute ist meine Wand auch tats&auml;chlich hellblau.

<p align=right>Chrisly

<p>[1] PostScriptum: Und die Steuern m&uuml;ssen erh&ouml;ht werden. Wann
hat man sonst Gelegenheit dazu?<br> <br>

<p><font size="-1">&copy;1999-2003 <a href="mailto:hodges@in.tum.de">
Chris Hodges</a>. Last time updated on 12-Oct-02 19:47:58.</font>
</td></tr></table>
<br>
</body>
</html>

