<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta name="generator" content="Handmade on Amiga using GoldEd">
<meta name="author" content="Chris Hodges (hodges@in.tum.de)">
<link rev=made href="mailto:hodges@in.tum.de">
<title>Das Geheimnis der Wolken</title>
</head>
<body bgcolor="#ceb9ae" text="#000000" link="#0000ff" vlink="#990099"
alink="#00ffff" background="bubbleback.png">

<table border=0 cellpadding=8 width=100% summary="">
<tr><td>
<center><img src="b1c.png" width=288 height=48 alt="The Messages"><br>
<img src="b1_4.png" width=144 height=24 alt="Publications">

<p><font size="+2">Das Geheimnis der Wolken</font><br>
<font size="+1">Autor: Chris Hodges
&lt;<a href="mailto:hodges@in.tum.de">hodges@in.tum.de</a>&gt;
</font></center>

<table>
<tr><td> Es war einmal ein kleiner B&auml;r, der schon lange sehr grummelig
war, und irgendwann einmal dachte sich der B&auml;r: "Warum bin ich
eigenlich immer so grummelig? Wenn ich zum Himmel blicke, sehe ich nur
sch&ouml;ne wei&szlig;e Wolken; die sind &uuml;berhaupt nicht grummelig."
Und so beschloss der B&auml;r, dass er die Wolken fragen wolle, warum sie
nicht grummelig sind. </td></tr>

<tr><td> <img src="tn_f08_013_11.jpg" align=right valign=top width=192
height=128 alt="Mt. Ngauruhoe"> Am n&auml;chsten Morgen stand der B&auml;r
ganz fr&uuml;h auf. Doch zu seiner Verwunderung waren alle Wolken
verschwunden. Kein einziges W&ouml;lkchen war am Himmel zu entdecken! Der
kleine B&auml;r war ratlos. Da kam ein Vogel mit lustigen gelben Streifen
an seinen Fl&uuml;geln vorbeigeh&uuml;pft. "Huhu Vogel", rief der B&auml;r,
"sag mir bitte, wo ich die Wolken finde." Der Vogel sah ihn etwas verwirrt
an, zwitscherte dann aber: "Siehst Du diesen hohen Berg da dr&uuml;ben? Den
musst Du bis zur Spitze hochklettern, dort verstecken sie sich meistens."
Der B&auml;r grummelte kurz, dann machte er sich auf den langen Weg.
</td></tr>

<tr><td> <img src="tn_f08_014_12.jpg" align=right valign=top width=192
height=128 alt="Soda Springs"> Er kam an einem sch&ouml;nen Wasserfall
vorbei, an dem das Wasser nur so fr&ouml;hlich herumtanzte, der B&auml;r
aber beachtete ihn nicht weiter. Er stieg h&ouml;her und weiter und der Weg
war grau von Asche und voller spitzer Steine. Seine F&uuml;&szlig;e
begannen zu schmerzen, aber das machte ihm nichts aus. "Ich will auf den
Berg, um die Wolken zu fragen, warum sie nicht grummelig sind", brummte er
wannimmer sich seine B&auml;rentatzen grummelnd bei ihm meldeten.
</td></tr>

<tr><td> <img src="tn_f08_035_33.jpg" align=right valign=top width=192
height=128 alt="Red Crater"> Er kam an einem Loch vorbei, das tief war und
dunkel und drumherum war alles ganz komisch rot. "Nein, das ist wohl nicht
der Weg zum Gipfel", grummelte er und ging weiter. </td></tr>

<tr><td> <img src="tn_f08_036_34.jpg" align=right valign=top width=192
height=128 alt="Emerald Lakes"> Dann erreichte einen See, der ganz seltsam
hellblau war. Der B&auml;r hatte schon lange Hunger und sein Magen
grummelte, doch da war kein Fisch, den er nach dem Weg h&auml;tte fragen
und danach auffressen k&ouml;nnen. Und so ging der B&auml;r
weiter.</td></tr>

<tr><td> <img src="tn_f08_033_31.jpg" align=right valign=top width=192
height=128 alt="Looking back"> Die Landschaft wurde immer kahler und der
Wind biss ihm kalt in seine Schnauze. Selbst durch sein dickes Fell
sp&uuml;rte er die frostige K&auml;lte. Zum Gl&uuml;ck hatte er wenigstens
seinen Schal dabei. Und so stieg er weiter, vorbei an kleinen
Schneefeldern, die den Sommer wohl &uuml;berdauert hatten. Jetzt war der
Gipfel schon ganz nah und auch die Sonne stand schon hoch im Firmament. Und
als er nach oben blickte, da begannen sich pl&ouml;tzlich ein paar Wolken
zu bilden. Er rief ihnen zu, aber sie h&ouml;rten ihn wohl nicht, denn eine
Antwort blieb aus. "Hmpf, dann muss ich wohl wirklich hinauf bis zur
Spitze!", brummte der B&auml;r und kletterte weiter. </td></tr>

<tr><td> <img src="tn_f08_028_26.jpg" align=right valign=top width=192
height=128 alt="The secret"> Und schlie&szlig;lich war er oben. Noch weiter
hinauf ging es nicht. Er sah die Wolken neben oder gar unter sich
vorr&uuml;berschweben. Sie waren zum Greifen nahe, aber er griff nicht nach
ihnen. Er fragte auch nicht danach, wieso sie nicht grummelig waren. Nein,
denn als er den Gipfel erreichte und nicht mehr nach oben schauen musste,
blickte er nach unten auf das Land ringsherum. Da war es ihm klar geworden:
Dieses wundervolle Land, seine Heimat, sein Zuhause, wenn man es aus den
Augen verliert, f&auml;ngt man an zu grummeln. Der kleine B&auml;r stand
auf dem hohen Gipfel und lie&szlig; sich von der Sonne w&auml;rmen, die bis
in sein Herz drang. Und dann l&auml;chtelte er und war von nun an nie mehr
grummelig, denn nun kannte er das Geheimnis der Wolken. </td></tr></table>

<br>

<p><font size="-1">&copy;1999-2003 <a href="mailto:hodges@in.tum.de">
Chris Hodges</a>. Last time updated on 10-Mar-03 00:12:11.</font>
</td></tr></table>
<br>
</body>
</html>

