<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta name="generator" content="Handmade on Amiga using GoldEd">
<meta name="author" content="Chris Hodges (hodges@in.tum.de)">
<link rev=made href="mailto:hodges@in.tum.de">
<title>Glosse f&uuml;r Impulsiv Ausgabe 67</title>
</head>
<body bgcolor="#ceb9ae" text="#000000" link="#0000ff" vlink="#990099"
alink="#00ffff" background="bubbleback.png">

<table border=0 cellpadding=8 width=100% summary="">
<tr><td>
<center><img src="b1c.png" width=288 height=48 alt="The Messages"><br>
<img src="b1_4.png" width=144 height=24 alt="Publications">

<p><font size="+2">Im Auftrag ewiger Jugend und Gl&uuml;ckseligkeit</font><br>
<font size="+1">Autor: Chris Hodges
&lt;<a href="mailto:hodges@in.tum.de">hodges@in.tum.de</a>&gt;
</font></center>

<p>Ist Ihnen schon einmal aufgefallen, wieviele Leute, die vorher noch ganz
ruhig und gelassen gewirkt haben, beim Einfahren der S-Bahn, wie von einer
unsichtbaren Macht getrieben, beginnen in Fahrtrichtung den Bahnsteig
entlangzueilen? Als ob es ein tief in der Erbsubstanz verwurzelter, innerer
Drang und unvermeidlich w&auml;re. Ich f&uuml;hle mich immer ganz schlecht,
wenn reihenweise wehrlose (?) Passanten beinahe gegen meinen statischen
K&ouml;rper rennen, weil sie nicht erwartet haben, dass jemand nicht dem
"Ruf der S-Bahn" folgt. Aber das passiert mir nur dann, wenn ich in der
Mitte einsteigen muss. Dass der MVV sehr mit der Mutter Natur verbunden
ist, zeigt sich n&auml;mlich daran, dass genau der ein Meter lange Stein
dunkel und feucht ist (damit den etwas aufmerksameren Stammfahrern
auffallen k&ouml;nnte), den Haltepunkt der zweiten T&uuml;r im vordersten
Wagen markiert -- den optimalen Einstiegspunkt, wenn man am Hauptbahnhof in
die U-Bahn wechseln m&ouml;chte.

<p>Aber nicht nur der MVV nutzt die latent sexuelle Ausstrahlung ihrer
Verkehrsmittel. Ja, Sie denken jetzt bestimmt an die <i>Calgon</i>-Werbung
mit den verkalkten Heizst&auml;ben. Nicht? Die meine ich sowieso nicht.
Auch nicht die pathetische <i>"Ich war Deutschlands gro&szlig;er
Tennisspieler, seht was AOL aus mir gemacht hat! Ich darf noch drei
mal!"</i>-Antiwerbung. Welche Werbung suggeriert denn unbegrenzte Potenz?
Na? Richtig. <i>Pringels</i>. Auf der Website[1] der f&uuml;r die
Werbekampagne verantwortlichen Firma findet man u.A. dieses: <i>"Durch den
Claim 'Einmal gepoppt -- nie mehr gestoppt!'[2] wird der Spa&szlig;-Faktor
mit dem unverwechselbaren Geschmackserlebnis verbunden."</i> Ach, so ist
das.[3]

<p>Vielleicht ist es auch nur ein Trend. Mit Trends verh&auml;lt es sich
folgenderma&szlig;en: Irgend ein Produkt wird auf den Markt geworfen und
dann kommt entweder eine wahnsinnige PR-Maschinerie und verkauft die Leute,
n&auml;mlich f&uuml;r dumm. Oder aber der Hype zieht sich wie Phoenix
selbst aus der Asche. Beiden gemeinsam ist allerdings, dass die Opfer sich
tats&auml;chlich drehen wie Fahnen im Wind, ohne auch nur eine Sekunde
&uuml;ber die Sinnigkeit nachzudenken. Beispiele hierf&uuml;r mag damals
Windows, jetzt Linux sein. Finden Sie diese v&ouml;llig &uuml;berteuerten
<i>Kick-Boards</i> (als ich noch jung war, hie&szlig;en die noch
Tretroller) nicht auch total hip? Nach einem b&ouml;sen Unfall mit solchen
high-speed Gef&auml;hrten kann es dummerweise zu einem <i>"total hip
replacement"</i>[4] kommen.

<p>Seit der Kindheit wird man dieser Gehirnw&auml;sche unterzogen. Das ist
so unvermeidlich, wie diesen Satz hier gelesen zu haben. Dass das Einreden
von Schwachsinn funktioniert, beweist neben der Ferrero Kinder GmbH mit
Anaphern, Neologismen und sonstigem Sprachm"ull wie dem <i>K&uuml;hlschrank
im Auto</i>, der <i>saftigen Milchschnitte</i>, dem <i>Milchjieper</i>, dem
<i>Milchburger</i> und dem <i>Snack im Handy-Format</i> auch ein
wissenschaftliches Experiment. Man zeige einer Gruppe von Menschen ein
Zufallsmuster und lasse sie dann selbst erkl&auml;ren, was man dort
"richtigerweise" erkennen m&uuml;sse. Die Teilnehmer unterwerfen sich
demjenigen mit der "brillianteren", aber ebenso sinnlosen Deutung. Sollte
man sich f&uuml;r das Berufsleben unbedingt merken.

<p>Werfen wir noch einen letzten Blick auf eine der meines Erachtens
widerw&auml;rtigsten Beispiele von Suggestion. <i>Die
Weihnachts-Cola-Cola-Werbung.</i> Wenn Sie dieses Heft in den H&auml;nden
halten wird sie schon tausende Male &uuml;ber den flimmernden
Denkprothesenapparat gelaufen sein. Weihnachten, das kommt aus Amerika und
ist eine Erfindung der <i>Coca Cola Company</i>. Ohne Coca Cola keine
gl&uuml;cklichen Familien, keine Onkel die ihren Neffen abends Geschichten
vorlesen, vielleicht sogar kein Schnee! So siehts aus. Zu den unartigen
Kindern kommt der Gilb. Wenn Edith Piaf gewusst h&auml;tte, dass sie
sp&auml;ter f&uuml;r Werbebotschaften missbraucht wird, h&auml;tte sie es
vielleicht doch bereut.

<p>Trotz der neuen transparenten S-Bahnen mit immer noch denselben
Binsenweisheiten an freien Werbetafeln, lohnt es sich vielleicht, sich
gerade zur Besinnungszeit tats&auml;chlich einen Moment lang auf die
wichtigen und wahren Dinge des Lebens zu besinnen und zu fragen, ob man
sich nicht doch einen Vortrag aus der Ringvorlesung "Neue Denkhorizonte"
anh&ouml;rt. In diesem Sinne, nehmen Sie sich die Zeit zum kritischen
Hinterfragen der t&auml;glichen Berauschung der Medienwelt und denken Sie
die eigenen Gedanken. Lassen Sie sich von niemandem etwas einreden!...
verdammt, erwischt!

<p align=right>Chrisly

<p>
[1] <a href="http://www.grey.de/kunden/pringels/pringels_main.htm">
http://www.grey.de/kunden/pringels/pringels_main.htm</a><br>
[2] Die Informatiker unter den Lesern wissen, dass ein Programm tats&auml;chlich
manchmal nicht gestoppt werden kann, wenn die Anzahl der PUSHes nicht denen
der POPs entspricht ;)<br>
[3] &Uuml;brigens ist es auch sehr interessant, was man sonst noch im Internet
findet: <i>"I don't have any stats for Pringels in #Herzschmerz,
sorry".</i> Ja, tut uns auch leid. Oder <i>"Eine Anleitung f&uuml;r nen Bong aus
ner Pringels-Dose"</i> -- sind die deswegen bei manchen so beliebt?<br>
[4] Ich bedanke mich herzlich bei der Kommilitonin mit Nebenfach Medizin
f&uuml;r die Inspiration dieses Wortspiels!<br>

<br>

<p><font size="-1">&copy;1999-2003 <a href="mailto:hodges@in.tum.de">
Chris Hodges</a>. Last time updated on 12-Oct-02 19:50:39.</font>
</td></tr></table>
<br>
</body>
</html>
