<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta name="generator" content="Handmade on Amiga using GoldEd">
<meta name="author" content="Chris Hodges (hodges@in.tum.de)">
<link rev=made href="mailto:hodges@in.tum.de">
<title>Die Kette</title>
</head>
<body bgcolor="#ceb9ae" text="#000000" link="#0000ff" vlink="#990099"
alink="#00ffff" background="bubbleback.png">

<table border=0 cellpadding=8 width=100% summary="">
<tr><td>
<center><img src="b1c.png" width=288 height=48 alt="The Messages"><br>
<img src="b1_4.png" width=144 height=24 alt="Publications">

<p><font size="+2">Die Kette</font><br>
<font size="+1">Autor: Chris Hodges
&lt;<a href="mailto:hodges@in.tum.de">hodges@in.tum.de</a>&gt;
</font></center>

<p>Er hatte Schwierigkeiten, die &Ouml;se zu &ouml;ffnen. Endlich schaffte
er es, die beiden Glieder zu trennen und nahm die goldene Kette ab, die er
zwei Wochen lang getragen hat.

<p>Das letzte Mal nahm er sie ab, nachdem er sich einige Wochen zuvor von
seiner Freundin getrennt hatte. Sie hatte ihm diese Kette zu seinem
Geburtstag geschenkt und er wollte sie erst wieder tragen, wenn er wieder
verliebt sei. Eine Kette mit einem flachen, goldenen,
Sternzeichenanh&auml;nger. Steinbock. Auf der R&uuml;ckseite: "Bussi,
Wilma".

<p>Philipp hatte versucht, ihr Herz zu &ouml;ffnen und Gef&uuml;hle
f&uuml;r ihn zu wecken. Wie so oft im Leben war er bei dieser Aufgabe
gescheitert und hatte schlie&szlig;lich kapituliert. Nat&uuml;rlich gab es
einige Hinweise darauf, dass Dagmar sich f&uuml;r ihn interessierte und sie
lie&szlig; sich auch an der Hand nehmen, wenn man sie nahm. Und auch
dr&uuml;cken, wenn man sie dr&uuml;cken wollte. Aber nichts, das von ihr
ausging lies auf irgendwelche Emotionen schlie&szlig;en, die &uuml;ber die
schon langj&auml;hrig bestehende Freundschaft hinausgehen w&uuml;rden. Und
jetzt hatte er keine Lust mehr, sich von dieser qu&auml;lenden Ungewissheit
kaputt machen zu lassen.

<p>Am Sonntag Nachmittag zuvor waren sie einen Kaffee trinken gegangen.
Lange hatten sie sich unterhalten &uuml;ber Gott und die Welt und viel
gelacht. Sie redeten auch &uuml;ber Beziehungen und Liebe; &uuml;ber die
Schwierigkeiten, das zu sagen, was man denkt, dar&uuml;ber, dass es
meistens in die Hose geht, wenn man aus einer langen Freundschaft mehr
machen will.

<p>Philipp war sich selbst nicht sicher, was er f&uuml;hlte. Er wollte
ehrlich sein. Aber er wollte auch wieder lieben. So lieben, wie er es
fr&uuml;her bereit gewesen war. Ohne Einschr&auml;nkungen mit ganzem
Herzen. Das Kribbeln im Bauch fehlte und das machte ihm Angst. Vielleicht
war er gar nicht verliebt? Die Sehnsucht jedoch, wenn er an sie dachte, war
da. Die unbeschreibliche Freude, sie zu sehen, war auch da. Er hoffte, wenn
sie bereit war, seine Liebe anzunehmen und zu erwidern, w&uuml;rde sie
g&auml;nzlich in ihm erwachen und jener Angst weichen, die ihn davor
hinderte, sich seinen Gef&uuml;hlen voll und ganz zu ergeben.

<p>Nat&uuml;rlich wusste Dagmar, dass Philipp mehr von ihr wollte.
Zumindest ging er davon aus, denn sie war intelligent und sie verstand
seine Andeutungen. Aber es blieb nicht nur bei den versteckten Hinweisen,
die er fr&uuml;her immer ganz gern verstreut hatte und von denen sich
niemand die M&uuml;he machte, sie zu finden.

<p>"Dagi," sprach er z&ouml;gernd, als sie durch den dunklen Englischen
Garten &uuml;ber matschige Pfade wanderten und den unz&auml;hligen
Pf&uuml;tzen versuchten auszuweichen. Er gab sich einen Ruck. "Dagi, ich
hab Dich lieb".

<p>
"Ich hab Dich auch lieb, Phil", folgte nicht einmal eine Sekunde
sp&auml;ter.

<p>Ermutigt durch diese Worte sprach er weiter. "Ich hab Dich sogar
<i>sehr</i> lieb."

<p>"Das... das ist mir eine gro&szlig;e Ehre", war alles, was sie darauf
antwortete.

<p>Sie lie&szlig; sich bei der Hand nehmen, um ihre eisigen Fingerchen zu
w&auml;rmen. Er steckt sie in seine Manteltasche und hielt sie fest, rieb
ab und zu an ihren Gelenken. Aber selbst Philipp hatte nicht genug
W&auml;rme, um das zu schaffen. <br>

<p><font size="-1">&copy;1999-2003 <a href="mailto:hodges@in.tum.de">Chris
Hodges</a>. Last time updated on 09-Mar-03 18:49:49.</font>
</td></tr></table>
<br>
</body>
</html>

