<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta name="generator" content="Handmade on Amiga using GoldEd">
<meta name="author" content="Chris Hodges (hodges@in.tum.de)">
<link rev=made href="mailto:hodges@in.tum.de">
<title>Glosse f&uuml;r Impulsiv Ausgabe 71</title>
</head>
<body bgcolor="#ceb9ae" text="#000000" link="#0000ff" vlink="#990099"
alink="#00ffff" background="bubbleback.png">

<table border=0 cellpadding=8 width=100% summary="">
<tr><td>

<center><img src="b1c.png" width=288 height=48 alt="The Messages"><br>
<img src="b1_4.png" width=144 height=24 alt="Publications">

<p><font size="+2">Der Stadteurotiker</font><br>
<font size="+1">Autor: Chris Hodges
&lt;<a href="mailto:hodges@in.tum.de">hodges@in.tum.de</a>&gt;
</font></center>

<p>Na, das hatte ich mir aber anders vorgestellt. Am 7. Januar ist nur ganz
knapp (zweifacher Mond-Erde-Abstand) ein gr&ouml;&szlig;erer Asteroid an
der Erde vorbeigeschrammt, den man wenige Tage zuvor (an meinem Geburtstag)
entdeckt hatte. Gut, er h&auml;tte sicher nicht jegliches Leben
ausgel&ouml;scht, trotzdem macht man sich schon ein paar Vanitas-Gedanken.
Und wie peinlich das wohl gewesen w&auml;re, wenn so kurz nach der
Einf&uuml;hrung des Euro-M&uuml;nzgeldes, dieses sich wieder in eine
klumpig-klebrige Masse zur&uuml;ckverwandelt h&auml;tte, mit dem man wohl
kaum am n&auml;chsten Kondomautomaten bezahlen h&auml;tte k&ouml;nnen.
Komisch ist es schon, dass zwar einige die M&uuml;nzen als Spielgeld
bezeichnen, der Gro&szlig;teil der Europ&auml;er das neue Zahlungsmittel
aber mit einer solchen opportunistischen Euphorie umarmt haben, dass man
fast an Hexerei denken m&ouml;chte.

<p>Zwar erwartet niemand, dass die Spanische Inquisition bei den Eurotikern
einf&auml;llt[1], vorsichtig sein sollte man schon. Und wo man jetzt
wei&szlig;, dass mindestens ein Viertel aller verbrannten Hexen
m&auml;nnlich waren, ist auch das <i>starke</i> Geschlecht nicht mehr
sicher. Seltsam erscheint einem auch, dass mit der Zeit den Frauen
Intelligenz und Charme wichtiger als Sch&ouml;nheit wird (so eine
Umfrage[2] mit 35.000 Frauen). Nein, nein, keine Angst, mir ist das
nat&uuml;rlich auch viel wichtiger. Sch&ouml;n zu sehen, dass nur noch drei
Prozent der Frauen sich f&uuml;r andere Leute h&uuml;bsch machen.

<p>Bevor ich jetzt mit langen, hasserf&uuml;llten E-Mail<b>I</b>ns von
schlipsbetretenen Feminist<b>I</b>nnen bombadiert werde: Achtung, auf
vielen B&uuml;roservern wird jetzt Firewallsoftware installiert, die die
Mails auf Viren scannen, aber auch nebenbei unartige, schmutzige und
schimpfwortlastige Mails blocken, diese automatisch an den Boss
weiterleiten und so virtuelles Mobbing und L&auml;sterlichkeiten verhindern
sollen[3]. Naja, wenn der Chef nicht schon gen&uuml;gend Spam bekommt...
Big Boss is watching you! Da sage noch einer einmal, <i>ich</i> sei
paranoid! Alle anderen sind einfach nur unvorsichtig.

<p>Oder dumm. Das beweist doch eindeutig die Pisa-Studie. Was erwartet man
denn, wenn man die Sch&uuml;ler zwar tausend tolle Sachen beibringt, ihnen
aber nicht erkl&auml;rt, wie man selbst lernt und die Informationen in
Wissen umsetzt. <i>`Fakten, Fakten, Fakten!'</i> bringen einem nichts, wenn
man diese nicht interpretiert und vernetzt. Klar, schuld sind bestimmt auch
die Medien, die die Jugendlichen vor der Flimmerkiste verbl&ouml;den lassen
(wissenschaftlich <i>nachgewiesen</i>), sowie diese ganzen Ego-Shooter und
anderen Produktivit&auml;tskiller (nicht direkt nachgewiesen), die die
Sch&uuml;ler davon abhalten, ihre Nasen lieber aus eigener Initiative in
B&uuml;cher zu stecken. Die Lust am Lesen und am Kreativsein, das ist es,
was zu den schlechten Ergebnissen gef&uuml;hrt hat. Hauptsache, man kann
den Lehrern die Schuld in die Schu(l/h)e schieben.

<p>Da k&ouml;nnen ruhig amerikanische M&uuml;tter ihren erwachsenen
T&ouml;chtern die Augen vor dem Anblick der kupfernen, aber v&ouml;llig
un(an)gezogenen Statuen in der Arcisstra&szlig;e zuhalten. Ja, das gibts
wirklich! Und nach fast 24 Stunden ohne Schlaf und impulsivem Gewerkel
braucht man mir auch nicht mehr die Augen zudr&uuml;cken.

<p>Aber ich bin sehr froh, dass der Asteroid selbiges getan hat und ich den
Euro (in) voller Bl&uuml;te(n) genie&szlig;en kann. Ja, jetzt habt ihr mich
entlarvt: Ich bin bekennender und leidenschaftlicher Eurotiker.
Schlie&szlig;lich ist es mein Geld.

<p align=right>Chrisly
<p>
[1] Nobody expects the Spanish Inquisition!<br>
[2] <a href="http://www.3sat.de/nano/news/27673/index.html" target="_top">
http://www.3sat.de/nano/news/27673/index.html</a><br>
[3] <a href="http://www.heise.de/tp/deutsch/inhalt/te/11436/1.html" target="_top">
http://www.heise.de/tp/deutsch/inhalt/te/11436/1.html</a><br>
<br>

<p><font size="-1">&copy;1999-2003 <a href="mailto:hodges@in.tum.de">
Chris Hodges</a>. Last time updated on 12-Oct-02 19:48:07.</font>
</td></tr></table>
<br>
</body>
</html>

