<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="LITERAPUR - Lesestoff und Schreibanregung">
<meta name="author" content="Johannes Weidner">
</head>
<body bgcolor="#c0c0c0" text="#000000" background="nc_bg2.gif">

<table border="0" cellspacing="0" cellpadding="10" width="100%" summary="">
<tr>
<td>
<h3 align="center">Hanno Erdwein </h3>
<h2 align="center">Der irdische Krieg findet nicht statt</h2>
<h4 align="center">(nicht nach Jean Giraudoux trojanischer Version)</h4>

<p>Der Himmelsk&ouml;rper ist uns seit langem bekannt. Die Aufzeichnungen
&uuml;ber ihn reichen einige tausend Galaxen-Umdrehungen weit zur&uuml;ck.
Und er ist eines jener seltenen Wunder, die der Kosmos hervorgebracht hat.
Jenes Juwel von einem Planeten versteckt sich im abgelegensten Arm unserer
Galaxie. Dabei w&auml;re es wert, im Blickpunkt aller seinen Platz
einzunehmen. </p>

<p>Seine Entwicklung begann vielversprechend. Zur st&auml;ndigen
Beobachtung richteten wir auf der r&uuml;ckseite seines einzigen Mondes die
st&auml;ndig besetzte Station ein. Ich verweile nun seit knapp einer
Umdrehung auf dem nicht sonderlich begehrten, weil einsamen Posten. Habe
die Fortschritte dieser hoffnungsvollen Spezies von ihren Anf&auml;ngen in
den Urwaldb&auml;umen bis zur Kernspaltung voll Spannung begleitet. Sicher
gab es - wie &uuml;beralll so auch hier - immer wieder
Auseinandersetzungen. Dunkelphasen, die jedem intelligenten Lebewesen nicht
erspart bleiben. Hier sind es Zweibeiner wie wir, die den Keim des Wissens
tragen und an jede nachfolgende Generation weitergeben. Aber auch die
Aggression wurde weiter tradiert, was mich im Laufe der Entwicklungszeit
doch sehr beunruhigte. Viel Zeit und Raffinesse wurde auf immer
t&ouml;dlichere Waffen verwendet. Dabei w&auml;re beides dringlicher
vonn&ouml;ten gewesen, Not und Elend dauerhaft zu bek&auml;mpfen. Ich
sagte mir, da&szlig; die Spezies wohl noch nicht reif genug sei, das zu
erkennen und &uuml;bte mich in Geduld. </p>

<p>Schreckliches entstand im Maschinenzeitalter. Das Vernichtungspotential
in einem Teil der Welt nahm derart &uuml;berhand, da&szlig; ich schon
geneigt war, Einhalt zu gebiten. Motorisierter Massenmord zu Lande, zu
Wasser und in der Luft. St&auml;dte und ihre Einwohner, die binnen kurzer
Zeit vom Feuersturm dahingerafft wurden. Kriege, die sich nicht mehr auf
eng umgrenzte Territorien beschr&auml;nkten, die nun weltweit um sich
griffen. Einer davon wurde mit der f&uuml;rchterlichsten Waffe beendet, die
jemals in den H&auml;nden intelligenter Wesen entstanden war: Der
Kernspaltung. </p>

<p>Sollte, konnte, durfte ich da noch tatenlos zuschauen? Meine Aufgabe
bestand im Observieren. Jegliches eingreifen in die nat&uuml;rliche
Entwicklung einer Spezies stand unter einem strengen Verbot. Aber war das
noch eine nat&uuml;rliche Entwicklung? allzu rasch wurden auf den beiden
Gro&szlig;kontinenten so viele Kernwaffen entwickelt, um damit das Leben
auf dem gesamten Planeten mehrfach zu vernichten. Und es war abzusehen,
da&szlig; die Masse von spaltbarem material ausreichen w&uuml;rde, den
globus in eine Minisonne zu verwandeln. Mu&szlig;te ich es so weit kommen
lassen? </p>

<p>Die j&uuml;ngste Auseinandersetzung ging um fossile Rohstoffe. Ein
Wahnwitz, dieses begrenzt vorkommende Material weiterhin zum Verbrennen und
Betreiben von Fahrzeugen und Flugmaschinen zu vergeuden und damit das
atmosph&auml;rische Gleichgewicht des Planeten zu gef&auml;hrden. Mit
fadenscheinigen Argumenten wurde ein machthaber, der &uuml;ber reichliches
Vorkommen des begehrten Stoffes verf&uuml;gte, &uuml;berfallen und sein
Land besetzt. Die folge war ein allm&auml;hlich ausufernder Krieg, worin
immer mehr Nationen verwickelt wurden. Wieder drohte die massive Gewalt
derart zu eskalieren bis hin zu einer nuklearen Auseinandersetzung. </p>

<p>Jetzt konnte ich nicht mehr an mich halten. </p>

<p>Auf allen Seiten des Erdballs starteten Raketen mit
Kernsprengk&ouml;pfen. Auch ich startete. Und ich griff entscheidend ein.
</p>

<p>Nach meiner f&uuml;nften Erdumrundung war die Erde nicht mehr
wiederzuerkennen. Es gab keine Waffen mehr. Es gab keine Technik mehr. Es
gab nichts mehr, was in irgendeiner Weise etwas mit Metall zu tun hatte.
Die Steinzeit war zur&uuml;ckgekehrt. </p>

<p>Der irdische Krieg hatte nicht stattgefunden. </p>

<p>So dachte ich. Aber ich hatte meine Rechnung ohne die Schlauheit dieser
Spezies gemacht. Gut, sie war samt und sonders ohne jeglichen Verlust in
das vorindustrielle Zeitalter zur&uuml;ckversetzt worden. Aber war sie
deswegen waffenlos? </p>

<p>Es brauchte eine Weile, bis sie sich auf die fr&uuml;heren
F&auml;higkeiten besann. Steinwerkzeuge. Steinmesser. Stein&auml;xte.
Messer? &Auml;xte? Waffen! </p>

<p>Alles begann wieder von vorn. marodierende Horden. Zusammengetrommelte
Heere. Eroberungskriege. Hingemetzelte v&ouml;lker, Pl&uuml;nderungen.
Vergewaltigte Frauen. </p>

<p>Der irdische Krieg ging weiter, wenn auch auf einer primitiveren Ebene.
Aber nichts desto weniger blutig. </p>

<p>Ich konnte es nicht mehr ertragen und bat um Versetzung. Lie&szlig; 

einen zwar wundersch&ouml;nen Planeten zur&uuml;ck, auf dem leider
babarische V&ouml;lker den tod regierten. </p>

<p>Nun beobachte ich einen W&uuml;stenplaneten. Auf ihm entwickelt sich das
Leben zwar sehr langsam und es wird noch ein oder zwei Galaxen-Umdrehungen
dauern, bis auch hier intelligentes Leben Fu&szlig; fassen kann. Aber ich
habe die Hoffnung, da&szlig; es friedliche Wesen sein werden, die um ihr
nacktes Dasein ringen m&uuml;ssen. </p>

<p>(c) HE April 2003<br>
</p>
</td>
</tr>
</table>
<br>
</body>
</html>
