<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      BackClock
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <H2 align="center">
            <B>BackClock</B>
          </H2>
          <P>
          </P>
          <CENTER>
            <TABLE cellspacing="0" cellpadding="0" summary="">
              <TR>
                <TD>
                  <P>
                    In den UpLoads auf den Amiga-News f&uuml;r das Aminet ist mir Ende April das Uhren-Programm BackClock aufgefallen, (Transparent clock. You must try this!!!), das ich ausprobieren
                    wollte.<BR>
                     Der Grund daf&uuml;r: Auf der WB 3.9 gibt es das Uhren-Programm WBClock. Eine Uhr mit transparentem Hintergrund, die aber nur sehr, sehr stockend auf meinem System l&auml;uft.
                  </P>
                  <P>
                    Zur&uuml;ck zu BackClock.<BR>
                     Also, das Archiv runterladen, entpacken und dann das Installations-Script starten. W&auml;hlbar sind Standartm&auml;&szlig;ig Einsteiger, Ge&uuml;bter Nutzer und Experte. Leider
                    tritt hier schon die erste Macke dieses Programm`s zu Tage: nach dem anw&auml;hlen des Installationsmodus und dem ausw&auml;hlen des Verzeichnisses bricht das
                    Installations-Programm mit einem Fehler in Zeile 46 ab. Auch das w&auml;hlen einer anderen "Nutzerfertigkeit" &auml;ndert nichts an dem Fehler.
                  </P>
                  <P>
                    So ist also Handarbeit angesagt. Was auch nicht weiter schlimm ist. Falls jemand das gleiche Problem bekommt, hier eine Beschreibung der Hand-Installation:<BR>
                     Das Archiv besteht aus acht Verzeichnissen, wovon f&uuml;r uns Normal-User (Nicht-Programmierer) nur sechs interessant sind. Hier nur die Dateien aus dem Quell-Verzeichnis in das
                    ( <FONT color="#DF1045">--&gt;</FONT>) Ziel-Verzeichnis kopieren.
                  </P>
                  <UL type="disk">
                    <LI>
                      bin/backclock + backclock.info <FONT color="#DF1045">--&gt;</FONT> WBStartup (<I>mein Vorschlag</I>)
                    </LI>
                    <LI>
                      c/defconf <FONT color="#DF1045">--&gt;</FONT> C:
                    </LI>
                    <LI>
                      docs/backclockD.guide + BackClock.Guide.info <FONT color="#DF1045">--&gt;</FONT> Mein_Guide_Verzeichnis. Dazu backclockD.guide in BackClock.guide umbenennen.
                    </LI>
                    <LI>
                      libs/led.image + popupmenu.lib.- + quickhelp.lib.- rtracker.lib. <FONT color="#DF1045">--&gt;</FONT> Libs:
                    </LI>
                    <LI>
                      prefs/BackClockDesigner + BackClockPrefs und deren .info`s <FONT color="#DF1045">--&gt;</FONT> Prefs:
                    </LI>
                    <LI>
                      presets/BackClock <FONT color="#DF1045">--&gt;</FONT> Prefs:presets
                    </LI>
                  </UL>
                  <BR>
                   Die Datei led.image wird nur zur Anzeige der Digital-Uhr ben&ouml;tigt.
                  <P>
                    So, das war`s schon. Es ist kein Assign-Befehl n&ouml;tig.<BR>
                     Nun komm der erste Start: WBStart-Schublade ge&ouml;ffnet und gleich f&auml;llt das im New-Icon Disign gehaltene Icon auf. Draufgeklickt und schon erschein eine Analog-Uhr mit
                    Stunden- und Minuten-Zeiger links oben auf der Workbench.<BR>
                     Geht doch!<BR>
                     Das Programm ist ein Commodity und kann mit dem Programm ExChange beendet werden.
                  </P>
                  <P>
                    Nun zum konfigurieren der BackClock.<BR>
                     Falls eine andere Position oder Gr&ouml;&szlig;e der Uhr gew&uuml;nscht wird, einfach innerhalb eines gedachten Vierecks (die Begrenzungen der Uhr) klicken und die Uhr auf die
                    neue Position schieben oder die Gr&ouml;&szlig;e &auml;ndern. Die Greifpunkte sind an den gleiche Positionen wie an sichtbaren Fenstern. Beim n&auml;chsten Start erscheint die Uhr
                    dort wieder.<BR>
                     In das Prefs-Verzeichnis wurden zwei Programme und ein Verzeichnis kopiert: BackClockPrefs, BackClockDesigner und BackClock-Presets ins Presets-Verzeichnis.<BR>
                     Letzters sind verschiedenartig geformte Zeiger-s&auml;tze f&uuml;r die Analog-Uhr. Dazu gleich mehr.
                  </P>
                  <P>
                    BackClockPrefs ist der Voreinsteller f&uuml;r die Uhr. Gleich beim Start wird auf die (richtige) Version von BackClockPrefs und BackClockDesigner hingewiesen und das Ergebnis
                    kundgetan.
                  </P>
                  <DIV align="CENTER">
                    <IMG src="tl_backclock1.jpg" alt="BackClock-Prefs" width="489" height="395">
                  </DIV>
                  <BR>

                  <DIV align="CENTER">
                    <B>BackClock-Prefs</B>
                  </DIV>
                  <BR>
                   <BR>
                   BackClockPrefs hat den Vorteil, das alle Ver&auml;nderungen in Echtzeit, also ohne auf den <I>Use</I>-Knopf zu dr&uuml;cken, ausgef&uuml;hrt werden. Alle &Auml;ndernugen wie Farbe
                  der Zeiger, Stundenmarkierungen, Schattenwurf und sogar der Zeigermittelpunkt werden &uuml;ber dieses Programm gesteuert. Des weiteren kann im Ziffernblatt noch eine (nicht gut
                  ablesbare) Digital-Uhr eingeblendet werden.<BR>
                   &Uuml;ber zwei Schieberegler kann besagter Schattenwurf in der X- und Y-Achse in einem weiten Bereich verschoben werden und mit einer Sprechblasen-Hilfe wird auch noch gedient.
                  Alles ist auch ohne die ausf&uuml;hrliche Deutsche Anleitung Intuitiv zu bedienen.<BR>
                   Nun zum vorher angesprochenen Programm BackClockPrefs.<BR>
                   Das ist ein Mini-Zeichen-Programm zum Gestalten eigener Zeiger. Einfach vom wei&szlig;en Punkt ausgehend nach oben einen oder mehrere Punkte mit einer Linie verbinden, dann Save
                  dr&uuml;cken, den Zeigertype ausw&auml;hlen und den n&auml;chsten Zeiger entwerfen. Einfacher geht es nicht.<BR>
                   <BR>

                  <DIV align="CENTER">
                    <IMG src="tl_backclock2.jpg" alt="BackClockDisigner" width="352" height="274">
                  </DIV>
                  <DIV align="CENTER">
                    <B>BackClockDisigner</B>
                  </DIV>
                </TD>
              </TR>
            </TABLE>
          </CENTER>
          <P>
            Irgend etwas vergessen? JA.<BR>
             Toolstyps. Toolstyps gibt es drei: Einen, der den Hotkey des Prefs-Programms festlegt, einen der die Priorit&auml;t des Hotkeys &auml;ndert. Der dritte Tooltyps bewirkt eigentlich nur
            ein Verz&ouml;gern beim Start der Uhr falls sich der Hintergrund, auf dem die Uhr erscheinen soll (z.B. Workbenchhintergrundbild), noch nicht fertig dargestellt wird.
          </P>
          <P>
            Und da ich in Sachen Programme, die st&auml;ndig im Hintergrund laufen und vielleich viel CPU-Zeit brauchen, immer etwas vorsichtig bin, habe ich mal mit Scout nachgemessen: Auf meinem
            040 Amiga braucht BackClock in der Vorgabegr&ouml;&szlig;e mit Sekunden-Zeiger nur 1.8 % der Rechenzeit. Ohne Sekunden-Zeiger praktisch nichts. Das ist wenig und spricht f&uuml;r diese
            Uhr.
          </P>
          <P>
            <B>Die Installation:</B> mit Installer (im Test ohne Erfolg, manuell ohne Schwierigkeiten machbar)<BR>
             BackClock unterst&uuml;tzt folgende <B>CPU`s</B>: Minimum einen 68020<BR>
             <B>Ben&ouml;tigtes OS:</B> 3.0 oder besser<BR>
             <B>BackClock</B> V3.22 ist <B>Freeware</B> und zu beziehen im Aminet <B>/util/time/backclock.lha</B><BR>
             <B>Das Archiv</B> hat eine Gr&ouml;sse von ca. 132 KByte.<BR>
             <B>Programm</B> in Englisch, Amiga Guide`s in Englisch, Franz&ouml;sisch und Deutsch<BR>
             <B>Autor:</B> <A href="mailto:davidb@snakes.ath.cx">David BARBION</A>
          </P>
          <P>
            <B>Mein Fazit:</B> Leicht zu bedienende Uhr. Durch die M&ouml;glichkeit, eigene Zeiger zu entwerfen, an jeden Geschmack und jede Workbench anpassbar.<BR>
             Ich kann die BackClock nur weiter empfehlen.
          </P>
          <HR>
          <BR>

          <CENTER>
            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC">
                  <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

