<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Biosph&auml;re - Der zauberhafte Tropengarten in
    Potsdam</TITLE>
  </HEAD>

  <BODY background="wolf1.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P><A href="st_stx.html"><FONT size="+1"><B>zur&uuml;ck
          zum Frame</B></FONT></A></P>

          <P align="center"><FONT color="#000080" size=
          "7"><B>Biosph&auml;re<BR>
          Der zauberhafte Tropengarten in Potsdam</B></FONT></P>

          <TABLE border="0" summary="" align="left" width="240">
            <TR>
              <TD><IMG src="st_bio00.jpg" width="233" height="343"
              alt="siehe Unterschrift"> </TD>
            </TR>

            <TR>
              <TH>Eintrittskarte</TH>
            </TR>
          </TABLE>
          Dieser Tropengarten liegt inmitten von Potsdams
          gr&uuml;ner Lunge -dem BUGA-Park unweit vom Schlo&szlig;
          Sansssouci, dem Ruinen- und Pfingstberg mit dem
          Schlo&szlig; Belvedere und unweit vom Schlo&szlig;
          Cecilienhof. Die Biosph&auml;re ist ganzj&auml;hrig,
          t&auml;glich von 09.00 - 20.00 Uhr ge&ouml;ffnet. Der
          Eintritt kostet 9,50 EUR f&uuml;r Erwachsene, 6,50 EUR
          f&uuml;r Kinder und Erm&auml;&szlig;igt 8,00 EUR.<BR>

          <TABLE border="0" summary="" align="center" width="365">
            <TR>
              <TD><IMG src="st_bio01.jpg" width="360" height="240"
              alt="siehe Unterschrift"> </TD>
            </TR>

            <TR>
              <TH>Eingang zur Biosph&auml;re Potsdam</TH>
            </TR>
          </TABLE>
          <BR clear="all">
          <BR>
          <BR>
           

          <H3><B>Die Biosph&auml;re gliedert sich in drei
          Abschnitte: Zu Lande, zu Wasser und in der Luft.</B></H3>

          <P>Die Biosph&auml;re wird in einem Rundgang besichtigt.
          Dabei bekommt jeder Besucher ein kleines Ger&auml;t mit
          Kopfh&ouml;rer ausgeh&auml;ndigt. &Uuml;ber dieses wird
          dann in den einzelnen R&auml;umen automatisch Wissen zu
          den Dingen, die man gerade sieht, vermittelt. Besonders
          im Tropengarten kann man an vielen verschiedenen
          Forschungsstationen selbst experimentieren und so sein
          Wissen erweitern.</P>

          <P>Am Beginn des Rundganges kommt man in einen Raum der
          dem Leben des F&uuml;rsten P&uuml;ckler von Muskau
          gewidmet ist, der von 1785-1871 lebte und als
          Schriftsteller und Gartengestalter arbeitete. Besonders
          bekannt wurde er durch seine Gartenanlagen in Branitz und
          Muskau bei Cottbus, Brandenburg. Man sieht dort
          Gegenst&auml;nde aus seinem Besitz sowie
          Anschauungstafeln und Reiseutensilien die seine Reisen in
          ferne L&auml;nder veranschaulichen. Danach gelangt man in
          einen kleinen, mit Sitzb&auml;nken ausgestatteten,
          verdunkelten Saal, der das Studierzimmer des F&uuml;rsten
          P&uuml;ckler von Muskau darstellen soll. Dort wird er mit
          Hilfe einer Lasershow wieder zum Leben erweckt. Er
          erz&auml;hlt dann aus seinem Leben und Wirken,
          insbesondere &uuml;ber seine Reisen, sowie seine Park-
          und Gartengestaltung. Zum Schlu&szlig; l&auml;dt er dann
          zu einem Besuch seines tropischen Gartens ein.</P>

          <TABLE border="0" summary="" width="100%">
            <TR>
              <TD align="center"><IMG src="st_bio02.jpg" width=
              "360" height="288" alt="siehe Unterschrift"> </TD>

              <TD align="center"><IMG src="st_bio03.jpg" width=
              "360" height="272" alt="siehe Unterschrift"> </TD>
            </TR>

            <TR>
              <TH>Ausstellung zur Biographie des F&uuml;rsten
              P&uuml;ckler-Muskau</TH>

              <TH>Eingang zum Tropengarten</TH>
            </TR>
          </TABLE>

          <P>&nbsp;</P>

          <TABLE border="0" summary="" align="left" width="364">
            <TR>
              <TD><IMG src="st_bio04.jpg" width="360" height="240"
              alt="siehe Unterschrift"> </TD>
            </TR>

            <TR>
              <TH>Erster Blick in den nebligen, feuchtwarmen
              Tropengarten</TH>
            </TR>
          </TABLE>
          Im tropischen Garten sind ca. 20.000 Pflanzen sowie mehr
          als 150 Gro&szlig;b&auml;ume von &uuml;ber 14 Metern zu
          sehen. Der &auml;lteste ist gar mehr als 400 Jahre alt.
          Der Tropengarten ist sehr sch&ouml;n gestaltet und man
          kann die verschiedenen Pflanzen nicht nur sehen, man kann
          sogar ihren Duft riechen. Ein tropisches Gewitter kann
          man beim Rundgang durch den Regenwald miterleben. Zur
          Beruhigung sei noch angemerkt, das man dabei selbst
          trocken bleibt. <BR>
          <BR>
           

          <TABLE border="0" summary="" align="right" width="245">
            <TR>
              <TD><IMG src="st_bio05.jpg" width="241" height="360"
              alt="siehe Unterschrift"> </TD>
            </TR>

            <TR>
              <TH>Blick zum Wasserfall</TH>
            </TR>
          </TABLE>
          Vom Tropengarten kommt man auf dem Rundgang auch in die
          Unterwasserwelt. In einem Raum, der als U-Boot gestaltet
          ist, kann man hinter Glas die verschiedendsten
          Unterwasserlebewesen und Pflanzen entdecken. <BR>
          <BR>
           

          <P>Nach dem Verlassen dieser Unterwasserwelt gelangt man
          wieder in den Tropengarten. Der Weg f&uuml;hrt einen dann
          noch oben. Von da hat man einen herrlichen Blick
          &uuml;ber die Baumwipfel und einen &Uuml;berblick
          &uuml;ber den gesamten Tropengarten.</P>

          <TABLE border="0" summary="" align="left" width="244">
            <TR>
              <TD><IMG src="st_bio14.jpg" width="240" height="360"
              alt="siehe Unterschrift"> </TD>
            </TR>

            <TR>
              <TH>Engelstrompete</TH>
            </TR>
          </TABLE>
          Im Anschlu&szlig; daran wird die Welt aus der
          Vogelperspektive mit einem simulierten Flug in einem
          Zeppelin erkundet. Da die Gondel in der Luft schaukelt
          und der Boden unter den F&uuml;&szlig;en leicht vibriert
          sowie &uuml;ber mehrere Projektoren ein Blick aus
          gro&szlig;er H&ouml;he projeziert wird, kann man den Flug
          fast real erleben. <BR>
          <BR>
           

          <P>In der Biosph&auml;re selbst befindet sich das
          Restaurant Luncheon und am Ende des Rundganges das
          Restaurant Camp mit einer Au&szlig;enterasse von der man
          einen herrlichen Blick auf den Pfingst- und Ruinenberg
          hat.<BR clear="all">
          </P>

          <TABLE border="0" summary="" align="right" width="364">
            <TR>
              <TD><IMG src="st_bio19.jpg" width="360" height="240"
              alt="siehe Unterschrift"> </TD>
            </TR>

            <TR>
              <TH>Ausgang: "Es war mir ein Vergn&uuml;gen Sie zu
              erfreuen, vielleicht zu bezaubern. Mein Garten steht
              Ihnen jederzeit offen. Ihr erlesener F&uuml;rst
              P&uuml;ckler-Muskau"</TH>
            </TR>
          </TABLE>
          In der Biosph&auml;re finden auch Sonderausstellungen
          statt. So fand vom 21.03.-25.04.03 die Sonderausstellung
          "Schmetterlinge - Zauberhafte K&uuml;nstler"statt. <BR>
          <BR>
           

          <P>Vom 20.09. - 25.10.03 wird die Sonderausstellung
          "Bionical experience - Was der Mensch von der Natur
          lernt" und vom 03.11. - 13.12.03 "Sex Sells - Die Welt
          der Lockungen und Reize in der Natur" gezeigt.</P>

          <P>F&uuml;r Fotointeressierte kann ich noch folgenden
          Hinweis geben: In den tropischen Bereichen der
          Biosph&auml;re kann man bei Sonnenschein noch mit einem
          200/24 und bei bedecktem Himmel besser mit einem 400/27
          Film fotografieren. In den &uuml;brigen Bereichen ist es
          sehr dunkel und es gelingt ohne Blitz kaum noch ein Bild,
          (Blitz nicht erlaubt) au&szlig;er man hat eine sehr
          ruhige Hand (siehe das Foto mit der Reisekiste und der
          gerahmten Landkarte an der Wand und das Foto Eingang zum
          Tropengarten) und fotografiert mit 1/15 sek.aus der
          Hand.</P>

          <P>Ich kann zum Abschlu&szlig; meines Berichtes vom
          Besuch der Biosph&auml;re allen Berlin und Potsdam
          Touristen nur empfehlen auch einen Ausflug in die
          tropische Natur der Biosph&auml;re Potsdam mit
          einzuplanen.<BR clear="all">
          </P>

          <P>Auf der <A href="st_bio1.html"><B>Folgeseite</B></A>
          habe ich noch einige Stimmungen zusammengestellt.</P>

          <P>Mathias Klingner<BR>
          E-Mail: Tschandru.Shing@berlin.de</P>

          <P><A href="st_stx.html"><FONT size="+1"><B>zur&uuml;ck
          zum Frame</B></FONT></A></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

