<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<META http-equiv="Content-Type" content=
"text/html; charset=iso-8859-1">

<TITLE>Das ist der Herr Bush</TITLE>
</HEAD>

<BODY background="st_bush01.jpg" text="black" link="#0000EE" vlink="#551A8B" marginheight="0">
<TABLE border="0" width="100%" cellpadding="8" summary="">
<TR>
<TD>
<P><A href="st_stx.html"><FONT size="+1"><B>zur&uuml;ck mit Frame</B></FONT></A><BR>
Dies ist eine erlaubte Spiegelung der URL: <B>http://www.jwdt.com/~paysan/bush</B></P>

<H1>Das ist der Herr Bush (Satire)</H1>

<P><EM>Im Ton der "Sendung mit der Maus" vorzutragen</EM></P>

<P><IMG alt="President George W. Bush" align="left" width="108"
height="137" src="st_bush1.jpg"> Das ist der Herr Bush. Sieht eigentlich
ganz nett aus. Isser aber <IMG alt="Maus" align="right" width="63"
height="177" src="st_bush1a.gif"> nicht. Is'n Massenm&ouml;rder. Muss er
auch sein. Der Herr Bush ist n&auml;mlich aus Texas, und war dort
Gouverneur. Das ist der Chef von der Regierung. Und wenn in Texas jemand
umgebracht wird, h&auml;ngt man den n&auml;chstbesten Neger auf. So einfach
ist das. So was macht der Herr Bush nat&uuml;rlich nicht selber, dazu hat
er seine Leute. Da hat er Richter und Geschworene, die den Neger
verurteilen. Und &Auml;rzte, die spritzen dem Neger dann Gift. Ganz sauber,
und B&auml;ume braucht man dann auch nicht. Die gibt's in Texas
n&auml;mlich gar nicht mehr. Macht aber nichts, daf&uuml;r hat Texas ja
Bohrt&uuml;rme.</P>

<P>Der Herr Bush ist jetzt Pr&auml;sident von Amerika. Ob er gew&auml;hlt
worden ist, wei&szlig; man noch nicht, weil die Stimmen noch nicht alle
gez&auml;hlt worden sind. Is ihm aber auch egal. Der Herr Bush hat da
n&auml;mlich auch seine Leute daf&uuml;r. Im obersten Gericht. Die hat sein
Vater da 'reingebracht. Und die entscheiden so was. Deshalb ist der Herr
Bush Pr&auml;sident, und wohnt jetzt in Washington.</P>

<P><IMG alt="Elefant" align="left" width="76" height="66"
src="st_bush1b.gif"> Da ist ihm aber langweilig, weil man in Washington
keine Neger h&auml;ngen darf. Das ist aber nicht so schlimm. Da wirft der
Herr Bush einfach ein paar Bomben auf den Saddam. Das hat sein Vater auch
schon so gemacht, wenn ihm langweilig war. Der Herr Bush macht
&uuml;berhaupt alles so, wie sein Vater, nur schlechter.</P>

<P>Und wie's mit dem Herr Bush weitergeht, das erfahrt ihr beim
n&auml;chsten Mal.</P>

<P><EM>Anmerkung:</EM> Die Stimmen sind jetzt gez&auml;hlt, und der Herr
Bush hat nicht gewonnen. Macht aber nichts, weil das keinen mehr
interessiert.</P> <HR>

<H2>Herr Bush und Herr bin Laden</H2>

<P><IMG alt="Herr Bush ist grantig" align="left" width="100" height="144"
src="st_bush2a.jpg"> Das ... <EM>God bless America</EM> ... ist der Herr
Bush. Schaut ziemlich grantig aus. Isser auch, weil ihm der Herr bin Laden
seinen Turm <IMG alt="WTC" align="right" width="210" height="157"
src="st_bush2b.jpg"> umgeworfen hat. Das war gar nicht nett, da waren
n&auml;mlich noch Leute drin. Deshalb macht der Herr Bush jetzt Krieg gegen
den Herr bin Laden. Und weil der Herr Bush nicht so helle ist, redet er
jetzt ziemlich dummes Zeug. So von "Kreuzzug" und "Krieg 'Gut gegen
B&ouml;se'" und von Plakaten aus Texas, wo man die Verbrecher am liebsten
gleich tot haben will. Dabei ist das doch dem Herr bin Laden sein Text.
Macht aber nichts, weil der Herr Bush ja sowieso nur vorliest, was man ihm
aufschreibt, und da werden halt mal die Zettel vertauscht.</P>

<P>Jetzt wirft der Herr Bush jedenfalls erst mal Bomben auf Afghanistan.
Macht aber nichts, da ist eh schon alles kaputt, weil in Afghanistan seit
30 Jahren Krieg ist.</P>

<P>In Afghanistan regiert gerade die Taliban. Das hei&szlig;t auf Deutsch
"Schuljunge", kann aber nicht sein. Die Taliban k&ouml;nnen n&auml;mlich
weder lesen noch schreiben. Ist aber auch egal, weil die sowieso alle
B&uuml;cher verbrennen - au&szlig;er dem Koran, und den k&ouml;nnen sie
auswendig. Au&szlig;erdem gibt's in Afghanistan keine Fernseher mehr, kein
Radio, und auch keine Musikinstrumente. Kein Wunder, dass dem Herr Bush die
Musik von der Taliban nicht gef&auml;llt.</P>

<P><IMG alt="Herr bin Laden" align="left" width="110" height="144"
src="st_bush2c.jpg"> Das ... <EM>Allah hu akbar</EM> ... ist der Herr bin
Laden. Er hat sich schon mal vorsorglich einen Verband um den Kopf gemacht,
falls ihm da 'was drauf f&auml;llt. W&auml;r' aber nicht so schlimm, weil
der Herr bin Laden eh so redet als ob ihm da schon mal 'was draufgefallen
ist. Der Herr bin Laden hat so einen wilden Bart, weil's in Afghanistan
auch keine Rasierapparate gibt. Man k&ouml;nnte sich jetzt sowieso nicht
rasieren, weil der Herr Bush den Strom abgeschaltet hat.</P>

<P>Macht aber nichts, weil damit hat der Herr bin Laden n&auml;mlich
gerechnet. Der Herr bin Laden kennt die Amis n&auml;mlich ganz gut.
Schlie&szlig;lich haben die dem eine Menge beigebracht. Damals war das ja
auch noch ok, denn damals ging das ja gegen die Russkis. Die waren
n&auml;mlich damals die B&ouml;sen. Jetzt sind sie die Guten, und der Herr
bin Laden ist der B&ouml;se. Ist ihm aber egal, f&uuml;r ihn ist der Herr
Bush der B&ouml;se.</P>

<P>Und wer beim n&auml;chsten Krieg der B&ouml;se ist, dass erfahrt ihr ein
anderes Mal.</P> <HR>

<H2>Herr Scharon und Herr Arafat</H2>

<P><IMG alt="Herr Scharon besucht den Tempelberg" align= "left" width="180"
height="118" src="st_bush3a.jpg"> Das in der Mitte ist der Herr Scharon.
Sieht aus wie ein Mafioso. Isser aber nicht, is'n Bulldozer. Der Herr
Scharon walzt alles platt, was ihm im Weg ist. Den Herrn Arafat, Gaza,
Ramallah, den Friedensprozess und das Lager in Dschenin. Da sind
n&auml;mlich Terroristen drin. Die binden sich eine Bombe um den Bauch und
sprengen dann in Israel eine Disko in die Luft. Das findet der Herr Scharon
gar nicht toll, auch wenn ihm die Musik in den Diskos nicht
gef&auml;llt.</P>

<P><IMG alt="Herr Arafat ist w&uuml;tend" align="right" width="180"
height="146" src="st_bush3b.jpg"> Das ist der Herr Arafat. Sieht aus wie
ein Alt-68er mit Arabertuch. Isser aber nicht. Der Herr Arafat ist ein
Terrorist. Macht aber nichts, denn der Herr Scharon ist ein
Kriegsverbrecher. Der hat n&auml;mlich vor 20 Jahren tausende von
Pal&auml;stinensern im Libanon plattgemacht. Das tut ihm aber nicht leid,
leid tut ihm nur, dass der Herr Arafat nicht dabei war. Der Herr Scharon
ist n&auml;mlich &uuml;berhaupt nur in den Libanon gegangen, um den Herr
Arafat plattzumachen. Der hat da n&auml;mlich gerade einen fetten
B&uuml;rgerkrieg angefangen, nachdem ihn der K&ouml;nig von Jordanien
'rausgeschmissen hat.</P>

<P>Sauer ist der Herr Scharon auch dar&uuml;ber, dass er als Nazi
beschimpft wird. Dabei ist er als Jude doch Opfer der Nazis, und hat das
Recht f&uuml;r sich gepachtet, andere als Nazi zu beschimpfen - und das
macht er auch mit allen, die Israel kritisieren, wo sie doch jetzt nur bei
Krieg gegen den Terror mitmachen. Dabei war der Staatsgr&uuml;nder von
Israel ja auch mal 'n Terrorist.</P>

<P>Der Herr Arafat will auch Staatsgr&uuml;nder werden. Von Pal&auml;stina.
Schlie&szlig;lich halten die Israelis das Rest-Pal&auml;stina seit 35
Jahren besetzt. Und weil er nichts besseres gelernt hat, versucht er das
mit Terror. Au&szlig;erdem hei&szlig;t das ja "Freiheitsk&auml;mpfer", wenn
man f&uuml;r eine gerechte Sache k&auml;mpft. Und was gerecht ist, steht
bei den Israelis in der Thora, und bei den Pal&auml;stinensern im Koran. Da
steht dann auch drin, dass sie sich gegenseitig die K&ouml;pfe einschlagen
sollen, weil sie das schon immer so gemacht haben.</P>

<P>Ja, dann ist ja alles in Ordnung. Was f&uuml;r ein Bl&ouml;dsinn sonst
noch geschrieben wird, das erfahrt ihr beim n&auml;chsten Mal.</P> <HR>

<H2>Das Internet und die Verschw&ouml;rungstheorien</H2>

<P><IMG alt="Mulder und Scully" align="left" width="202" height="189"
src="st_bush4.jpg"> Das sind Mulder und Scully. Schaun irgendwie
geheimnisvoll aus. Sind sie auch. Mulder und Scully sind n&auml;mlich
hinter allen m&ouml;glichen Verschw&ouml;rungen her. Und da sind sie nicht
allein. W&auml;hrend Mulder und Scully ihre Verschw&ouml;rungstheorien im
Fernsehen zeigen, schreiben andere Leute Internetseiten voll. M&uuml;ssen
sie auch, weil's in Amerika keine Pressefreiheit mehr gibt, sondern nur
noch AOL und Walt Disney. Macht aber nichts, weil den Bl&ouml;dsinn, der im
Internet steht, glaubt auch niemand.</P>

<P>So behaupten die Leute etwa, dass es Bielefeld gar nicht gibt. Oder dass
der Bert aus der Sesamstra&szlig;e b&ouml;se ist. Und dass die Politiker
alle Au&szlig;erirdische sind, vor allem die in Amerika. Die kommen
n&auml;mlich vom Mars.</P>

<P>Au&szlig;erdem soll gar nicht der Herr Bin Laden dem Herr Bush seinen
Turm umgeworfen haben. Die Araber meinen, es sei die j&uuml;dische
Weltverschw&ouml;rung. W&uuml;rde aber keinen Sinn machen, weil der Turm
selbst war ja auch von der j&uuml;dischen Weltverschw&ouml;rung. Ist aber
auch egal, weil die j&uuml;dische Weltverschw&ouml;rung ja zu den
Illuminaten geh&ouml;rt, und bei denen blickt sowieso keiner durch.</P>

<P>Andere meinen, Pakistan oder Saudi Arabien stecken dahinter, weil die
den Terroristen Geld gegeben haben. Oder zumindest die Geheimdienste
waren's, weil die ja eh zu den &uuml;blichen Verd&auml;chtigen
geh&ouml;ren. Sowieso waren nicht die Terroristen Schl&auml;fer, sondern
die beim Geheimdienst.</P>

<P>Bei dem, was die Geheimdienste so machen, reimt sich ja sowieso nichts
zusammen. Erst wollen sie &uuml;berhaupt nichts gewusst haben. Dann wollen
sie zwar 'was gewusst haben, haben aber nicht gewusst, dass sie 'was
gewusst haben. Is aber auch egal, wahrscheinlich haben sie geglaubt, das
seien alles so bl&ouml;de Verschw&ouml;rungstheorien aus dem Internet.
Macht aber nichts. Dazu gibt's jetzt die Heimatsicherheit. Das ist so was
wie die Stasi, nur viel gr&ouml;&szlig;er und f&uuml;r Amerika. Die horcht
jetzt jeden ab, und wei&szlig; alles. Macht aber nichts, weil sie auch
nicht wei&szlig;, was sie alles wei&szlig;.</P>

<P>In Wahrheit war's nat&uuml;rlich der Herr Bush selber. Sonst h&auml;tten
die Leute ja mitgekriegt, dass er gar nicht gew&auml;hlt worden ist. So
haben sie stattdessen F&auml;hnchen geschwenkt, und sind mit Hurra in den
Krieg gezogen. Der Herr Bush hat dann alle Freunde von seinem Vater
bedienen k&ouml;nnen: Die R&uuml;stungsindustrie, die Geheimdienste und die
&Ouml;lbarone. Muss er auch, weil die ihm ja den Wahlkampf bezahlt
haben.</P>

<P>Die Leute vom Bush behaupten, dass der Saddam dahinter steckt, auch wenn
das jetzt wirklich weit hergeholt ist. Den m&ouml;gen sie n&auml;mlich
nicht. Und was ihnen da als Ausrede einf&auml;llt, um gegen ihn Krieg zu
machen, erfahrt ihr beim n&auml;chsten Mal.</P> <HR> <A name="SADDAM"></A>
          
<H2>Der Saddam und die Massenvernichtungswaffen</H2>

<P><IMG alt="Saddam" align="left" width="156" height= "153"
src="st_bush5.jpg"> Das ist der Saddam. Schaut aus wie ein durchgeknallter
Sonntagsj&auml;ger. Isser aber nicht. Is ein blutr&uuml;nstiger Diktator.
Muss er auch sein, weil's in der Gegend nur blutr&uuml;nstige Diktatoren
gibt. Da gibt's die Mullahs im Iran. Die schicken Kinder in den Krieg, und
verstecken ihre Frauen unter Tischdecken. Dann gibt's die Scheichs in Saudi
Arabien. Die verkaufen &Ouml;l an die Amis ... und finanzieren von dem Geld
Terroristen. Und ihre Frauen verstecken sie auch. Und die anderen Herrscher
in der Gegend sind auch nicht ganz koscher.</P>

<P>Der Saddam ist schon lang ein Schurke. Macht aber nichts, weil zuerst
war er ja unser Schurke. Da hat er f&uuml;r uns gegen die Mullahs Krieg
gef&uuml;hrt, mit seinen Kindern. Hat aber nicht gereicht, da hat ihm der
Herr Rumsfeld noch Giftgas geliefert. Das hat der Saddam dann gegen seine
eigenen Leute eingesetzt. Macht aber nichts, daf&uuml;r hat ihm der Herr
Rumsfeld noch Biowaffen geschenkt. Das hat sich der Herr Rumsfeld alles
gemerkt, weil man ja immer was brauchen kann, was man einem Schurken
anh&auml;ngen kann.</P>

<P>Irgendwann war der Saddam dann pleite, weil er den Krieg nicht gewonnen
hat. Das wollte er dann alles mit &Ouml;l bezahlen. Ging aber nicht. Der
&Ouml;lpreis war n&auml;mlich im Keller. Dorthin haben ihn die Kuwaitis
gebracht, und die Schulden, die sie beim Saddam hatten, haben sie auch
nicht bezahlt. Deshalb war der Saddam sauer, und hat einfach Kuwait
besetzt.</P>

<P>Das hat dem Herr Bush seinem Vater nicht gefallen, deshalb hat der den
Saddam da wieder 'rausgeworfen. Dem Herr Bush sein Vater mag n&auml;mlich
keine Verlierer. Damit alle mitmachen, hat dem Herr Bush sein Vater dann
Sattelitenfotos gef&auml;lscht, und behauptet, der Saddam w&uuml;rde gleich
auch noch nach Saudi-Arabien einmarschieren. Hat aber nicht gereicht. Dann
hat dem Herr Bush sein Vater dem Botschafter von Kuwait seine Tochter als
Krankenschwester verkleidet, und die hat dann behauptet, der Saddam
w&uuml;rde Babies umbringen. Das hat dann gereicht.</P>

<P>Dem Herr Bush sein Vater ist dann aber abgew&auml;hlt worden, bevor er
mit dem Krieg gegen den Saddam richtig fertig geworden ist. Stattdessen ist
dann der Herr Clinton Pr&auml;sident gewesen. Der hat nicht richtig gegen
den Saddam k&auml;mpfen wollen, wenn ihm langweilig war. Macht aber nichts,
daf&uuml;r hat er sich lieber von der Monica den Schwanz lutschen
lassen.</P>

<P>Jetzt ist der Herr Bush Pr&auml;sident, und weil ihm wieder langweilig
ist, will er endlich den Saddam loswerden. Der Herr Bush hat n&auml;mlich
keine Praktikantin.</P>

<P>Leider kann der Herr Bush nicht einfach sagen, dass ihm der Saddam einen
Turm umgeworfen hat. Macht aber nichts, weil der Herr Bush dann einfach
sagt, man soll sich einfach vorstellen, der Saddam w&uuml;rde einen Turm
umwerfen wollen. Das ist dann noch viel schlimmer, weil der Saddam
Massenvernichtungswaffen hat. Der Herr Bush muss das wissen, denn die hat
der Saddam ja von seinen Leuten gekriegt.</P>

<P>Der Herr Bush sagt, Demokratien horten keine Massenvernichtungswaffen.
Er sagt auch, Demokratien greifen keine anderen Staaten an. Dabei hat er
selbst die meisten Massenvernichtungswaffen, und will den Irak angreifen.
Macht aber nichts, weil dem Herr Bush sein Staat ja auch keine richtige
Demokratie ist. Sonst w&auml;r der Herr Bush ja dort nicht
Pr&auml;sident.</P>

<P>Der Saddam sagt aber, dass er gar keine Massenvernichtungswaffen mehr
hat. Die haben ihm die Waffeninspektoren alle schon weggenommen. Und
&uuml;berhaupt darf er sie ja auch nicht mehr auf die eigenen Leute werfen
wenn ihm langweilig ist, da macht das ja gar keinen Spa&szlig;. Der Saddam
hat n&auml;mlich auch keine Praktikantin. Aber weil der Saddam ein Schurke
ist, wei&szlig; der Herr Bush, dass er l&uuml;gt. Deshalb sagt der Herr
Bush, dass er jetzt nicht mehr l&auml;nger warten will.</P>

<P>Wann dem Herr Bush der Geduldsfaden mit dem Saddam rei&szlig;t und die
beiden sich mit Sand und F&ouml;rmchen bewerfen, und wer der Herr Rumsfeld
ist, das erfahrt ihr ein anderes Mal.</P> <HR> <A name="MERKEL"></A>
              
<H2>Das ist die Frau Merkel</H2>

<P><IMG alt="Frau Merkel" align="left" width="189" height="141"
src="st_bush6.jpg"> Das ist die Frau Merkel. Sieht ziemlich beschissen aus.
Muss sie auch sein. Die Frau Merkel kriecht n&auml;mlich gern anderen in
den Arsch. Zuerst war das der Herr Honecker, damals noch in der DDR. Da hat
die Frau Merkel alles gemacht, was der Karriere gen&uuml;tzt hat. Die Frau
Merkel hat sogar Blockfl&ouml;te gespielt. Macht aber nichts, weil nach der
Wende war sie dann pl&ouml;tzlich immer schon Widerstandsk&auml;mpferin,
und ist mitsamt ihrer Blockfl&ouml;te dem Herr Kohl in den Arsch
gekrochen.</P>

<P>Der Herr Kohl fand das richtig toll und hat die Frau Merkel sogar zur
Generalsekret&auml;rin der CDU gemacht. Dann ist der Herr Kohl aber
abgew&auml;hlt worden, und der Herr Schr&ouml;der ist Kanzler geworden. Ist
aber nicht so schlimm, weil kurz sp&auml;ter ist herausgekommen, dass der
Herr Kohl seine Partei &uuml;ber schwarze Kassen finanziert hat. Das sind
Kassen, &uuml;ber die niemand was wei&szlig;, au&szlig;er der Herr Kohl
selber. Da h&auml;tte er dann eh gehen m&uuml;ssen, und der Frau Merkel
konnte er auch nicht mehr helfen.</P>

<P>Macht aber nichts, die Frau Merkel hat das gleich kapiert, und den Herr
Kohl abges&auml;gt. Sie ist dann selber Chef der CDU geworden. Da hat sie
sich dann einen neuen Arsch gesucht, n&auml;mlich den vom Herr Stoiber. Der
wollte auch Kanzler werden. Hat aber nicht geklappt, weil der Herr
Schr&ouml;der die neuen L&auml;nder geflutet hat, und der Herr Bush
unbedingt Krieg gegen den Saddam machen wollte. Da macht der Herr
Schr&ouml;der nicht mit, und das gef&auml;llt den Leuten.</P>

<P>Der Herr Stoiber hat dann auch versucht, gegen den Krieg zu sein, hat
ihm aber keiner geglaubt. Der Herr Stoiber wollte sogar dem Herr Bush die
&Uuml;berflugsrechte nehmen. Macht aber nichts, weil der Herr Stoiber ja
gar nicht Kanzler geworden ist. Deshalb hat er sich auch kein Glas
Champagner aufgemacht. Und die Frau Merkel sucht wieder einen neuen Arsch,
n&auml;mlich den vom Herr Bush.</P>

<P>Muss sie auch, weil die CDU n&auml;mlich pleite ist. Das kommt davon,
weil nicht nur der Herr Kohl, sondern auch der Herr Koch schwarze Kassen
hatte. Deshalb fehlen der CDU jetzt 21 Millionen Euro. Das ist ganz
sch&ouml;n viel Holz. Und weil die Frau Merkel das nicht hat, ist sie ganz
nett zum Herr Bush. Vielleicht gibt er ihr dann Geld. Sonst gibt der Herr
Bush auch denen ganz viel Geld, die bei seinem Krieg mitmachen. Die
T&uuml;rkei kriegt sogar 20 Milliarden. Das ist viel mehr, als die CDU
br&auml;uchte. Und dabei wei&szlig; die T&uuml;rkei noch gar nicht, ob sie
wirklich mitmachen will.</P>

<P>Ob die Frau Merkel damit durchkommt, in welchen Arsch sie als
n&auml;chstes kriecht, und was aus dem Herr Koch wird, das erfahrt ihr ein
anderes Mal.</P>

<P><EM>Anmerkung:</EM> Die Frau Merkel war in der DDR "nur" beim
Demokratischen Aufbruch, einer von der Stasi gelenkten
"Oppositionspartei".</P> <HR>

<H2>Das ist der Herr Rumsfeld</H2>

<P><IMG alt="Don Rumsfeld" align="left" width= "201" height="163"
src="st_bush7.jpg"> Das ist der Herr Rumsfeld. Sieht aus wie ein alter
Haudegen. Isser aber nicht. Ist ein Gr&uuml;ner. Der Herr Rumsfeld will
n&auml;mlich die NATO aufl&ouml;sen und die Ami-Truppen aus Deutschland
rauswerfen. K&ouml;nnte man meinen. Is aber irgendwie anders. Deshalb von
vorn.</P>

<P>Das ist der Herr Rumsfeld. Sieht ziemlich humorlos aus. Isser aber
nicht. Isn Witzbold. Der Herr Rumsfeld vergleicht Deutschland mit Kuba und
Libyen. Er sagt, wenn man im Loch sitzt, soll man aufh&ouml;ren zu graben.
Und weil Deutschland und Frankreich nicht mitmachen wollen beim Krieg gegen
den Saddam, ist f&uuml;r ihn das "alte Europa" ein Problem. Das l&auml;sst
sich n&auml;mlich nicht so einfach kaufen wie das "neue Europa".</P>

<P>Leider versteht keiner die Witze vom Herr Rumsfeld. Macht aber nichts,
weil ja nicht der Herr Rumsfeld schuld ist, wenn alle auf Amerika sauer
sind. Der Herr Rumsfeld ist ja auch kein Diplomat. So'n Diplomat sagt immer
alles so, wie es die anderen h&ouml;ren wollen. Das ist ein Job f&uuml;r
Weicheier und Neger. Deshalb macht das beim Herr Bush auch der Herr Powell.
Der muss dann immer erkl&auml;ren, dass der Herr Rumsfeld das nicht so
b&ouml;s gemeint hat. Ist aber auch egal, weil dem Herr Rumsfeld dann schon
wieder ein neuer Spruch eingefallen ist.</P>

<P>Der Herr Rumsfeld ist beim Herr Bush f&uuml;r den Krieg zust&auml;ndig.
Damit kennt er sich aus. Er kennt sich auch mit Massenvernichtungswaffen
aus, weil er die schon im Koreakrieg eingesetzt hat, und an den Saddam
geliefert hat. Macht aber nichts, weil die Guten d&uuml;rfen solche Waffen
verwenden. Damals war auch das "alte Europa" noch kein Problem, weil das
ganz feste mitgemacht hat. Nur heute verkauft keiner mehr dem Saddam
Waffen.</P>

<P>Deshalb will er auch jetzt unbedingt den Saddam loswerden. Der hat
n&auml;mlich kaum mehr Massenvernichtungswaffen, und darum kann man an
Saudi Arabien keine Waffen mehr verkaufen. Weil die sich nicht mehr vorm
Saddam f&uuml;rchten.</P>

<P>Macht aber nichts, weil wenn die Amis im Irak sind, kann der Herr
Rumsfeld seine Massenvernichtungswaffen gleich mer, und kaufen viele
Waffen. Der Herr Bush will ja schlie&szlig;lich Demokratie nach Arabien
bringen. Was er damit meint, wei&szlig; er wohl selber nicht so genau.
Sonst w&uuml;rde er ja nicht der T&uuml;rkei erlauben, die Kurdengebiete im
Irak zu besetzen. Dort hat der Saddam n&auml;mlich gar nichts zu sagen,
sondern ein gew&auml;hltes Parlament. Macht aber nichts, weil die im
Parlament nicht miteinander reden.</P>

<P>Ob der Herr Rumsfeld noch dazu kommt, seinen Krieg zu machen, und was
ihm sonst noch f&uuml;r Spr&uuml;che einfallen, das erfahrt ihr ein anderes
Mal.</P> <HR>

<H2>Das ist der Herr Schr&ouml;der</H2>

<P><IMG alt="Gerhard Schr&ouml;der" align="left" width="158" height="129"
src="st_bush8.jpg"> Das ist der Herr Schr&ouml;der. Schaut fest
entschlossen aus. Isser aber nicht. Is'n Opportunist. Das ist einer, der
immer nur macht, was die anderen wollen. Muss er auch sein, weil er nicht
wei&szlig;, was er selber will. Au&szlig;er nat&uuml;rlich Kanzler werden.
Isser aber schon. Deshalb macht der Herr Schr&ouml;der dann eine Kommission
nach der anderen, die sich einigen sollen, was f&uuml;r Reformen gemacht
werden. So 'ne Reform ist ganz einfach: Da nimmt man den armen Leuten 'was
weg, und gibt's den Reichen. Und 'ne Kommission ist wie'n Stammtisch: Da
hocken lauter kluge Leute zusammen und reden viel dummes Zeug.</P>

<P>Da kommt nat&uuml;rlich nichts raus. Nur lauter Wenns und Abers, und
viel Sowohl Als Auch. Macht aber nichts, weil die Ref&ouml;rmchen dann am
Bundesrat scheitern. Da sitzen n&auml;mlich der Herr Koch und der Herr
Stoiber, und die sind grunds&auml;tzlich dagegen, was der Herr
Schr&ouml;der machen will. Die wollen n&auml;mlich auch Kanzler werden. Und
wenn dann mal doch 'was durch den Bundesrat geht, macht der Herr Koch ein
ganz gro&szlig;es Theater und geht vor Gericht.</P>

<P>Deshalb geht in Deutschland nichts voran. Is aber auch egal, weil genau
das wollen die Leute ja. Sonst w&uuml;rden sie ja nicht den Herr
Schr&ouml;der nach Berlin w&auml;hlen, den Herr Koch nach Hessen, und den
Herr Wulff nach Niedersachsen.</P>

<P>Das haben die Leute schon beim Herr Kohl so gemacht. Der war ja erst ok,
weil er &uuml;berhaupt nichts gemacht hat. Dann hat er aber mit der
Wiedervereinigung angefangen. Die war ganz sch&ouml;n teuer. Dann war kein
Geld mehr da, und der Herr Kohl musste sparen. Schlie&szlig;lich wollte er
sogar die Renten k&uuml;rzen. Da haben die Leute dann einfach den Herr
Lafontaine in den Bundesrat gew&auml;hlt, damit nichts passiert. Hat aber
nicht gereicht. Dann haben sie den Herr Kohl abgew&auml;hlt. Der Herr
Schr&ouml;der hat dann einfach die Ref&ouml;rmchen vom Herr Kohl wieder
zur&uuml;ckgenommen. Weil das aber nicht die Probleme l&ouml;st, will der
Herr Schr&ouml;der jetzt auch die Rente k&uuml;rzen. Deshalb sind die Leute
jetzt sauer, und w&auml;hlen wieder die Partei vom Herr Kohl. Dabei will
die noch mehr k&uuml;rzen.</P>

<P>Das einzige, wo der Herr Schr&ouml;der genau wei&szlig;, was er will,
ist beim Krieg im Irak. Da will er nicht mitmachen. Dabei ist der Herr
Schr&ouml;der gar kein Pazifist. Beim Krieg gegen den Herr Milosewitsch hat
er ja auch mitgemacht. Ist aber auch egal, weil da hat er blo&szlig; eine
Viertelstunde zum &Uuml;berlegen Zeit gehabt, und der Herr Scharping durfte
dann dem Herr Clinton seine L&uuml;genm&auml;rchen vorlesen.</P>

<P>Dem haben sie damals n&auml;mlich gerade die Monica weggenommen. Da war
ihm dann so langweilig, dass er Bomben geworfen hat. Das mit dem Kosovo hat
er so im Kino gesehen. Da war's zwar Albanien. Macht aber nichts, weil sich
die Amis in Erdkunde nicht so auskennen.</P>

<P>Der Herr Schr&ouml;der macht beim Krieg nat&uuml;rlich auch wieder viel
Sowohl Als Auch. Er ist zwar dagegen, l&auml;sst die Amis aber trotzdem
&uuml;ber Deutschland fliegen. Ist aber auch egal, weil wenn er's verbieten
w&uuml;rde, w&uuml;rden die's ja trotzdem machen. So wie &uuml;ber
&Ouml;sterreich. Da d&uuml;rfen sie zwar nicht, fliegen aber einfach
trotzdem dr&uuml;ber. Au&szlig;erdem ist der Herr Bush sowieso schon sauer
auf den Herr Schr&ouml;der, weil der ihn im Sicherheitsrat isoliert
hat.</P>

<P>Der Herr Schr&ouml;der ist n&auml;mlich nicht der einzige, der nicht
mitmachen will. Der Herr Chirac aus Frankreich, der Herr Putin aus
Ru&szlig;land und der Herr Hu aus China wollen n&auml;mlich auch nicht
mitmachen. Wenn sich der Herr Schr&ouml;der traut, dagegen zu sein, dann
trauen sie sich auch. Deshalb kocht der Herr Bush jetzt vor Wut, und
l&auml;sst sogar die Pommes umbenennen. Von "franz&ouml;sische Fritten" auf
"Freiheitsfritten". Dabei ist die Freiheitsstatue auch aus Frankreich.</P>

<P>Was der Sicherheitsrat ist, und ob der Herr Schr&ouml;der noch mal ein
kleines Ref&ouml;rmchen machen kann, oder ob sich die armen Leute doch
nichts mehr wegnehmen lassen, erfahrt ihr ein anderes Mal.</P> <HR>

<H2>Der Kofi und der Sicherheitsrat</H2>

<P><IMG alt="Kofi Annan" align="left" width="125" height="122"
src="st_bush9.jpg"> Das ist der Kofi. Schaut eigentlich ganz nett aus.
Isser auch, ist der h&ouml;chste Diplomat der Welt. Der Kofi hat daf&uuml;r
sogar den Friedensnobelpreis gekriegt. Den kriegen nur ganz nette Leute,
wie der Herr Brandt und der Herr Carter. Und der Herr Arafat, aber das war
ein Versehen.</P>

<P>Ob's Krieg gibt, wird eigentlich im Sicherheitsrat entschieden. Da
hocken dann lauter alte M&auml;nner und labern 'rum. Das dauert. Und
solange die labern, passiert nichts. Irgendwann sind sie sich dann einig,
und haben ein ganz kompliziertes Papier geschrieben, mit noch mehr Wenns
und Abers und Sowohl Als Auch als dem Herr Schr&ouml;der seine
Kommissionen. Das versteht dann keiner, und jeder meint, er hat, was er
will. Dann gibt's Frieden.</P>

<P>Das passt dem Herr Bush nicht. Langes Gelaber kann der Herr Bush
n&auml;mlich nicht ausstehen. Der Herr Bush holt lieber gleich die Gewehre
und sattelt die Pferde. Weil der Kofi den Herr Bush nicht einfach so Krieg
machen l&auml;sst, ist der Herr Bush sauer. Er sagt dann, der
Sicherheitsrat ist "irrelevant".</P>

<P>Das hat ihm die Frau Rice gesagt. Die hat ihm gesagt, der Sicherheitsrat
ist wie der V&ouml;lkerbund. Der war n&auml;mlich auch nur 'ne Schwatzbude,
und hat nichts hingekriegt. Deshalb ist der V&ouml;lkerbund auch gegen den
Hitler gescheitert. Is aber auch egal, weil das n&auml;mlich dem Hitler
sein Text ist. Der ist n&auml;mlich damals aus dem V&ouml;lkerbund
ausgetreten, weil er unbedingt Krieg machen wollte, und sich nicht nur
Gelaber anh&ouml;ren wollte.</P>

<P>Der Herr Bush sagt jetzt, dass der Sicherheitsrat auch versagt hat.
Deshalb gibt's jetzt keinen Frieden, sondern Krieg. Is aber auch egal, weil
den g&auml;b's auch, wenn der Sicherheitsrat zu allem Ja und Amen gesagt
h&auml;tte. Dann w&auml;r' der Herr Bush aber kein Kriegsverbrecher. Macht
aber nichts, weil sich der Herr Bush sowieso nicht zur Verantwortung ziehen
l&auml;sst. Auf den internationalen Gerichtshof in Den Haag will er sogar
Bomben werfen, wenn der nicht spurt.</P>

<P>Wie der Herr Bush Krieg macht, und was ihm die Frau Rice sonst noch
erz&auml;hlt, erfahrt ihr beim n&auml;chsten Mal.</P> <HR>

<H2>Der Irak als Computerspiel</H2>

<P><IMG alt="Irak" align="left" width="180" height="129"
src="st_bush9a.jpg"> Das ist der Irak. Sieht aus wie ein Computerspiel.
Kann man sich Waffen aussuchen, Missionen w&auml;hlen, kriegt den Einsatz
erkl&auml;rt, und ist dann voll interaktiv dabei, mit Wumms und Krabumm. Da
gibt's Explosionen, Br&auml;nde, <IMG alt= "Irak-Spiel" align="right"
width="180" height= "133" src="st_bush9b.jpg"> da spritzt Blut. Sieht nur
alles etwas pixelig aus, aber die Effekte sind toll. Wie bei Counterstrike.
Kennt ihr ja.</P>

<P>Isser aber nicht. Ist ein richtiges Land mit echten Leuten drin. Da
gibt's Berge im Norden, Sand im Westen, Wasser im S&uuml;d-Osten und
&Ouml;l untendrunter. In den Bergen im Norden leben die Kurden, in der
Mitte leben Araber, und im S&uuml;den Schiiten. Macht aber nichts, war
schon immer so. Nur fr&uuml;her hie&szlig;en die im Norden Hethiter, die im
S&uuml;den Perser, und die in der Mitte Assyrer. Und das ganze Land
Mesopotamien. Das ist schon ganz lang her.</P>

<P>Damals haben die in Mesopotamien die Schrift erfunden, die Uhrzeit, die
Gesetze, den Staat, den Krieg und den Imperialismus. Das ist, wenn man
anderen Leuten einfach alles kaputtmacht und sie auch noch daf&uuml;r
bezahlen l&auml;sst. Man kann halt nicht immer nur gute Ideen haben. Den
Blitzkrieg hat der Herr Rumsfeld neu erfunden. Da muss man nur ganz viele
Bomben auf die Leute werfen, ganz schnell mit Panzern herrollen, aus allen
Rohren ballern, und den Leuten erkl&auml;ren, dass man in Frieden kommt,
und sie nur befreien will. Tod oder lebendig. Dann freuen die sich alle,
werfen ihre Waffen weg und wedeln mit amerikanischen Fahnen. Meint der Herr
Rumsfeld. Hat ja beim Hitler auch geklappt.</P>

<P>Is aber nicht so einfach. Da ist erst mal der Saddam. Der muss vorher
weg, weil sonst bringen dem seine Leute alle um, die sich freuen. Ob der
Saddam noch lebt, wei&szlig; man nicht, weil der so viele Doppelg&auml;nger
hat. Die einen meinen 40, die anderen 5 Millionen, weil die im Irak eh alle
den gleichen Schnurrbart haben. Ist aber auch egal, weil den Herr bin Laden
haben sie auch noch nicht gekriegt. Und der hat nicht so viele
Doppelg&auml;nger.</P>

<P>Und dann ist da noch der Herr Bush. Der ist ja der Wiederg&auml;nger von
seinem Vater. Die Iraker w&uuml;rden sich gern von wer wei&szlig; wem
befreien lassen, aber nicht vom Herr Bush. Dem seinen Vater m&ouml;gen sie
n&auml;mlich nicht. Der hat auch mal ganz viele Bomben auf sie geworfen,
und sie dann doch nicht befreit, sondern 12 Jahre lang hungern lassen. Weil
der Herr Powell nicht wollte. Der war damals n&auml;mlich nicht Diplomat,
sondern f&uuml;r den Krieg zust&auml;ndig, und hat den Schwanz
eingekniffen.</P>

<P>Au&szlig;erdem will der Herr Bush den Irak nur verteilen. Das &Ouml;l an
die einen Kumpels und den Wiederaufbau an die anderen. Deshalb ist es auch
egal, was der Krieg kostet, zahlt ja eh der Steuerzahler. Hauptsache, die
Gewinne werden von seinen Kumpels eingesackt. Was dann vom Rest &uuml;brig
bleibt, k&ouml;nnen die Iraker behalten. Also die Berge, den Sand und das
Wasser. Und damit ihm da der Kofi oder der Herr Schr&ouml;der nicht
dreinreden, will der Herr Bush das alles ganz alleine bestimmen.</P>

<P>Ob das mit dem Blitzkrieg noch klappt und wann der Herr Bush seinen
Endsieg feiern kann, wie ihm's die Vorsehung gesagt hat, das erfahrt ihr
ein anderes Mal.</P> <HR>

<H2>Der Joe befreit den Irak</H2>

<P><IMG alt="Joe" align="left" width="117" height="147"
src="st_bush9c.jpg"> Das ist der Joe. Sieht aus wie ein Muskelprotz ohne
Hirn. Isser auch, ist n&auml;mlich bei der Army. Eigentlich wollte der Joe
ja in die hunderterste Kavallerie. Da kriegt man 'ne h&uuml;bsche Uniform,
kann man Pferde reiten, h&uuml;bsche Apachen-Sqwas vergewaltigen und
dreckige Indianerkinder umbringen, damit die Indianer merken, dass man es
ernst meint. Gibt's aber nicht mehr. Macht aber nichts, gibt's ja neue
Einsatzgebiete.</P>

<P>Zum Beispiel in Vietnam. Da kann man Hubschrauber fliegen, h&uuml;bsche
Vietnamesinnen vergewaltigen und dreckige Kinder umbringen, damit der
Vietcong merkt, dass man es ernst meint. Gibt's auch nicht mehr.</P>

<P>Ist aber auch egal. Deshalb ist der Joe jetzt in der hundertersten
Luftlandedivision im Irak. Da geht's auch richtig ab. Deshalb wirft sich
der Joe erst mal ein paar Extacy-Pillen ein, und schie&szlig;t dann auf
alles, was sich bewegt.</P>

<P>Am liebsten schie&szlig;t der Joe Journalisten tot. Nat&uuml;rlich nicht
die in seiner Einheit, sondern nur die, die die L&uuml;gen vom Irak seinem
Informationsminister verbreiten. Obwohl der total witzig ist, und immer so
lustige Sachen sagt wie "Die Amis werden in der H&ouml;lle schmoren" und
"Wir werden sie vernichten - sie werden am Stadtrand von Bagdad Selbstmord
begehen". Oder dass die Bomben von den Amis zwar viel Krach machen und ganz
gro&szlig;e Pilze, aber nichts kaputt geht.</P>

<P>Die das dann verbreiten hocken bei Al Jazeera oder im Hotel Palestine
und zeigen, wo die Bomben wirklich hingefallen sind. Zum Beispiel in ein
Kinderzimmer. K&ouml;nnt' ja sein, dass der Saddam da unter'm Bett
versteckt ist. Oder auf einen Krankenwagen, der eine werdende Mutter zum
Krankenhaus bringt. K&ouml;nnte ja der Saddam damit herumfahren. Oder auf
Familienkutschen an der Stra&szlig;ensperre. K&ouml;nnte ja ein
Selbstmordbomber drin sitzen. Oder auf Cafes. Da hocken alte M&auml;nner
und trinken arabischen Kaffee. Der ist eine Gefahr f&uuml;r die Army, weil
der viel zu stark ist.</P>

<P>Wenn sonst nichts da ist, wo man drauf schie&szlig;en kann, dann
schie&szlig;t der Joe auch schon mal auf ein paar britische Soldaten. Die
sind n&auml;mlich voll schwul, und haben statt Stahlhelmen M&uuml;tzen mit
bunten Bommeln auf. Damit man sie von den Amis unterscheiden kann. Und auf
Zivilisten schie&szlig;en die auch nicht.</P>

<P>Ist aber auch egal, weil der Krieg jetzt schon vorbei ist und die Iraker
befreit sind. Da sieht man dann auch ein paar jubelnde Iraker, wenn eine
Saddam-Statue umgeworfen wird, oder Pl&uuml;nderer mit ihren Karren
Krankenh&auml;user leerr&auml;umen.</P>

<P>Die Freiheit vom Herr Bush ist n&auml;mlich ganz einfach: Jeder nimmt
sich, was er schleppen kann. Der Herr Bush nimmt sich das &Ouml;l, und die
Iraker klauen sich ihr eigenes Kulturerbe aus dem Nationalmuseum. Ist aber
auch egal, weil das, was sie da klauen, kaufen ihnen dann die Amis ab.</P>

<P>Macht aber nichts. Die Mehrheit im Irak sind eh Schiiten, und die wollen
jetzt auch ihre eigene Freiheit. Die sind n&auml;mlich ganz religi&ouml;s.
Fr&uuml;her gab's dann immer vom Saddam eins auf die Hucke, wenn sie ihre
Feste gefeiert haben. Jetzt geben sie sich selbst eins auf die Hucke, das
hei&szlig;t dann "Gei&szlig;eln". Und statt Saddam Hussein feiern sie jetzt
Imam Hussein. Das war ein Mullah. Und die Mullahs m&ouml;gen keine
Amis.</P>

<P>Weil der Herr Bush keine Mullahs mag, mag er die Schiiten nicht. Die
sind n&auml;mlich vom Iran ferngelenkt. Und der ist ja auch auf der Achse
des B&ouml;sen. Deshalb droht der Herr Bush schon mal dem Iran mit Krieg.
Und Syrien. Weil der Herr Bush noch keine Massenvernichtungswaffen im Irak
gefunden hat, meint er, die seien jetzt alle in Syrien versteckt. Ist aber
auch egal, weil Syrien ja sowieso Terror unterst&uuml;tzt, n&auml;mlich die
Hisbollah. Da wird dem Herr Bush schon ein Grund einfallen, noch 'nen Krieg
zu machen. Wo das mit dem Irak ja so toll geklappt hat.</P>

<P>Wie's mit dem Irak weitergeht, und gegen wen der Herr Bush als
n&auml;chstes Krieg macht, erfahrt ihr ein anderes Mal.</P> <HR>

<H2>"Neger", Antiamerikanismus und Links</H2>

<P>Das mit dem Wort "Neger" versteht nicht jeder. Finden manche total
rassistisch und rasten aus. Da n&uuml;tzt <A href="neger.html"><IMG width=
"16" height="16" src="st_bush1c.gif" border="0"
alt="[html]">Erkl&auml;ren</A> auch nichts. Es gibt immer Leute, die
schwarzen (b&ouml;sen, zynistischen) Humor nicht verstehen.</P>

<P>Au&szlig;erdem haben die Amerikaner den Herr Bush nicht gew&auml;hlt,
und k&ouml;nnen deshalb nicht in Kollektivhaft genommen werden. Es gibt
auch nette Amerikaner, z.B. den <A href=
"http://www.michaelmoore.com/"><IMG width="16" height="16"
src="st_bush1c.gif" border="0" alt= "[html]">Herr Moore</A>. Der macht auch
ganz lustige Filme, schreibt gute B&uuml;cher, und kriegt eins auf's Maul,
wenn er sagt "Sch&auml;men Sie sich, Herr Bush!". Er meint sogar, f&uuml;r
die schweigende Mehrheit zu sprechen. Und von denen haben ja auch ganz
sch&ouml;n viele gegen den Krieg demonstriert. Macht aber nichts, weil das
dort nicht im Fernsehen gekommen ist. Deshalb machen die das auch im
Internet aus, etwa bei <A href= "http://www.unitedforpeace.org/"><IMG
width="16" height="16" src="st_bush1c.gif" border="0" alt= "[html]">United
for Peace</A>.</P>

<P>Und weil Lachen entwaffnet, sollte man &uuml;ber den Herr Bush ganz viel
lachen, vielleicht h&ouml;rt er dann auf, Krieg zu spielen. Leider kriegen
die meisten Amerikaner nicht viel mit, weil die Presse dort ziemlich
gleichgeschaltet ist. Und im Fernsehen bringen sie eh nur
Regierungspropaganda.</P>

<P>Eine <A href= "http://thomas.wolff.net/Bush.htm"><IMG width= "16"
height="16" src="st_bush1c.gif" border="0"
alt="[htm]">Bush-Witz-Sammlung</A> hat Thomas Wolff. Noch mehr gibt's unter
<A href="http://politicalhumor.about.com/library/images/blsaddampictures.htm">
<IMG width="16" height="16" src="st_bush1c.gif" border="0" alt="[htm]">Political
Humor</A>. Der <A href= "http://www.ndr.de/tv/extra3/klaus.html"><IMG
width="16" height="16" src="st_bush1c.gif" border="0" alt="[html]">Klaus
auf Extra3</A> macht auch Maus-Satire. Auch die echte Maus hat eine Seite
&uuml;ber den <A href= "http://www.wdrmaus.de/wirsinddiemaus/irak/"><IMG
width="16" height="16" src="st_bush1c.gif" border="0"
alt="[html]">Irak</A>. Und den Herr Bush kann man auch im <A href=
"http://www.whitehouse.org/"><IMG width="16" height="16"
src="st_bush1c.gif" border="0" alt= "[html]">Wei&szlig;en Haus</A>
besuchen.</P>

<P>Und <A href= "http://www.jwdt.com/~paysan/bush/11_september.pdf"> <IMG
width="16" height="16" src="st_bush1c.gif" border="0" alt="[pdf]">dieses
Dokument</A> fasst die wichtigsten Verschw&ouml;rungstheorien zusammen (mit
Links auf entsprechende Internetseiten). Ob man das alles so glauben kann,
ist nat&uuml;rlich eine andere Sache. Macht aber nichts, weil die Theorie
mit dem Herr Bin Laden ist ja auch eine Verschw&ouml;rungstheorie.</P>

<P>Ein besonders krasses Opfer texanischer Justiz ist <A href=
"http://www.fordarlieroutier.org/"><IMG width= "16" height="16"
src="st_bush1c.gif" border="0" alt="[html]">Darlie Routier</A>. Und ein
Bischof in Florida erkl&auml;rt dem Herr Bush, warum Terroristen <A href=
"http://www.uni-kassel.de/fb10/frieden/themen/Terrorismus/bowman.html">
<IMG width="16" height="16" src="st_bush1c.gif" border="0"
alt="[html]">Amerika hassen</A>.</P>

<P>Wo die <A href="wo-ist-die-maus.html"><IMG width="16" height="16"
src="st_bush1c.gif" border="0" alt="[html]">Maus abgeblieben</A> ist, haben
sich auch schon viele gefragt. Da ist doch der ganze Gag weg. Stimmt
leider. Liegt am b&ouml;sen WDR, der gar nicht so liberal ist, wie er immer
tut.</P>

<P>Zuguterletzt noch eine Anmerkung: Konsistent durchgezogene
Rechtschreibfehler sind beabsichtigt. Nat&uuml;rlich wei&szlig; ich, dass
man "dem Herrn" mit "n" schreibt, und dass es einen Genitiv gibt. Und dass
die Sprache in der echten Maus komplexer ist. Macht aber nichts, irgendwo
muss ja die satirische &Uuml;berh&ouml;hung sein. Wer tats&auml;chlich noch
Tippfehler findet, kann mir gern Korrekturen schicken. Da ich nicht selbst
HTML schreibe, am besten direkt in der <A href="bush.wf"><IMG width="16"
height="16" src="st_bush1c.gif" border="0" alt="[wf]">Quelle</A> (50k).</P>
<HR>

<H2>In eigener Sache</H2>

<P>Das ist die Bush-Seite. Die finden viele ganz witzig. Deshalb schicken
sie die URL oder das PDF an alle ihre Freunde weiter. Leider gibt's deshalb
ganz viel Traffic, und manche Leute beschweren sich dann sogar bei
jwdt.com, weil die so eine Mail gar nicht haben wollen. Dabei hat jwdt.com
gar nichts mit dem Text zu tun. Weil das PDF inzwischen schlimmer als die
Sintflut sein soll, gibt's die nicht mehr von hier, auch wenn's dann mehr
Traffic gibt.</P> Mirror-Liste:

<BLOCKQUOTE>
<I><FONT color="#008000">Es sind bis Dato
(05.05.03) 88 Adressen, bei Bedarf bitte auf
der Homepage anschauen. (Wolf Zimmer)</FONT></I>
</BLOCKQUOTE>

<P>Wer die Seite spiegeln will, macht das (auf einem Unix-Webserver)
mit</P>

<P>wget -l 1 -m -N -nd http://www.jwdt.com/~paysan/bush/</P>

<P>Da kommen dann auch die Bilder mit. Und weil sich an der Seite sowieso
h&ouml;chstens am Wochenende etwas &auml;ndert, reicht es, wenn man das am
Montag fr&uuml;h macht. H&ouml;rt sich kompliziert an. Macht aber nichts,
wer das nicht versteht, kann auch einfach einen der vorhandenen Mirrors
nehmen, sind sowieso schon gen&uuml;gend.</P>

<P>Und wer will, dass ich seinen Mirror hier mit aufnehme (oder wieder
'rausnehme, weil der Herr Bush das FBI geschickt hat), schickt mir eine
Mail mit dem Betreff "Bush Mirror".</P> <HR>

<H2>Disclaimer</H2>

<P>Dies ist ein satirischer Text auf einer privaten Homepage, und
unterliegt der Meinungsfreiheit nach Artikel 5 Grundgesetz (ich hoffe, das
gilt noch). Die verwendeten Bilder sind als solche nicht frei von Rechten
Dritter, sie werden hier frei verwendet gem&auml;&szlig; &sect;24(1)
Urheberrechtsgesetz.</P>

<P>Ich beabsichtige nicht, die erw&auml;hnten Personen der Zeitgeschichte
zu verunglimpfen, sondern in polemisch &uuml;berspitzer Weise meine Ansicht
&uuml;ber ihre Politik darzustellen.</P>

<P>Beispiel: Den Titel "Massenm&ouml;rder" verdient sich Herr Bush, der
mitf&uuml;hlende Konservative, durch seinen gnadenlosen Einsatz f&uuml;r
die Vollstreckung der Todesstrafe in &uuml;ber hundert F&auml;llen in
Texas, &uuml;berwiegend an nicht-wei&szlig;en Texanern, deren Verurteilung
unter teilweise eher merkw&uuml;rdigen Umst&auml;nden zustandegekommen ist.
Und dass es dort statt B&auml;umen nur noch Bohrt&uuml;rme geben soll,
steht f&uuml;r seine Gesetzesvorhaben, Umweltschutz den kommerziellen
Interessen der &Ouml;lindustrie unterzuordnen. Privat ist der Herr Bush ja
ein musterg&uuml;ltiger Umweltsch&uuml;tzer; seine Ranch ist jedenfalls
&ouml;kologisch unbedenklich.</P>

<P>Die Persiflage auf die Sendung mit der Maus des WDRs soll keine
Abwertung dieser Sendung darstellen; im Gegenteil, es gibt kaum einen
besseren Grund, Kinder vor den Fernseher zu setzen als die Maus, die die
Welt ganz einfach erkl&auml;rt.</P>

<P>&Auml;hnlichkeiten mit dem Niveau diverser Politiker sind rein
zuf&auml;llig und sicher nicht beabsichtigt.</P>

<P>Inhaltlich verantwortlich f&uuml;r den Text ist ausschlie&szlig;lich <A
href= "mailto:bernd.paysan@gmx.de"><IMG width="16" height="12"
src="st_bush1c.gif" border="0" alt= "[de]">Bernd Paysan
&lt;bernd.paysan@gmx.de&gt;</A>.</P> <HR>

<ADDRESS>
<CENTER>
Created 25mar2001. Last modified: 5may2003 by
<IMG alt="Mail" width="16" height="12" src=
"st_bush1c.gif"> <A href=
"mailto:bernd.paysan@gmx.de">Bernd Paysan</A>
</CENTER>
</ADDRESS>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
<TR bgcolor="#88ccff">
 <TD align="center">&nbsp; <FONT color= "#0000ff"><B>Wolf Zimmer</B></FONT> </TD>

 <TD align="center"><FONT color= "#0000ff"><B>wolf@nc-mag.de</B></FONT>
 </TD>

<TD align="center">
<FONT color="#0000ff"><B>http://www.nc-mag.de</B></FONT> </TD>
</TR>
</TABLE>
<A href="st_stx.html"><FONT size= "+1"><B>zur&uuml;ck mit Frame</B></FONT></A><BR> </CENTER>
                
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

