<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HEAD>
<META name="AUTHOR" content="Martin Voepel voepelm@t-online.de">
<TITLE>Mein leben mit Computern</TITLE>
</HEAD>
<BODY BACKGROUND="mitglieder/back01.gif" bgcolor="#8B8378" text="#000000" link="#8A2BE2"
alink="#8A2BE2" vlink="#8A2BE2">

<TABLE BORDER="0" CELLPADDING="15" CELLSPACING="15" WIDTH="100%">
<TR>
<TD>
<CENTER><IMG SRC="st_mc0.gif" WIDTH="212" HEIGHT="53"></CENTER><BR>
<H1>Mein Leben mit Computer</H1>
<BR>
<BR>
In den Jahren 89 bis 91 habe ich eine Umschulung gemacht und brauchte
daf&uuml;r einen Computer. Die Zeit des C64 war vorbei, aber die PCs auch
noch nicht das "gelbe vom Ei", ein Mac - leider fiel zu teuer, kam also nur
ein Amiga in Frage.<BR>
<BR>
<IMG SRC="st_mc1a.gif" WIDTH="256" HEIGHT="112" ALIGN="LEFT">
<H2>Mein Amiga 500 mit OS 1.3</H2>
<BR>
Meine Wahl fiel damals auf den Amiga 500 und einen Monitor. Das ganze
kaufte ich im Jahr 90 zu Weinachten. Zu dem A500 geh&ouml;rte auch die
Textverarbeitung Kind-Words (schon auf drei Disketten) und eine Diskette
mit der Bezeichnung Appetizer mit diversen Programmen und Spielen. Recht
bald merkte ich, dass mit 512 KB nicht warnsinnig viel anzufangen war und
eine Speichererweiterung musste her. Damit hatte mein A500 ein ganzes MB
und eine Uhr. Nur was n&uuml;tzen einem die Daten auf Diskette, wenn man sie
auf Papier braucht... ...also musste noch ein Drucker her und auch ein
zweites Diskettenlaufwerk.<BR>
<BR>

Den Amiga 500 habe ich leider verkauft, wie ich meinen zweiten Computer
gekauft habe. Inzwischen &auml;rgere ich mich dar&uuml;ber, aber ich
brauchte das Geld!<BR>
<BR>
Zu meinem Amiga 1200 bin ich damals, genau am 7. April 93, eigentlich
gekommen "wie die Jungfrau zum Kind". Auf den Amiga Plus Monats-Disks waren
Programme die nicht mehr richtig unter Amiga OS 1.3 liefen. Ich bin zu
einem Amiga H&auml;ndler gefahren und habe gefragt, was wohl eine
Aufr&uuml;stung auf OS 2.0 oder 2.1 kosten w&uuml;rde. Er meinte, es
w&uuml;rde sich nicht lohnen, weil ich auch gerne eine Festplatte haben
wollte. Die Frage von mir war nat&uuml;rlich rech naiv, er wollte
nat&uuml;rlich verkaufen, obwohl ich im Nachhinein recht froh &uuml;ber
diese "Beratung" war!<BR>
<BR>
<IMG SRC="st_mc2a.gif" WIDTH="164" HEIGHT="174" ALIGN="LEFT">
<H2>Mein Amiga 1200 mit OS 3.0</H2>
<BR>
Meinen Amiga 1200 habe ich also am 7. April 93 gekauft (ich habe noch die
Rechnung) mit einer 60 MB Festplatte zu einem Preis von 1318 DM. Die
Festplatte hat alleine schon 548 DM gekostet!<BR> Einen Monitor brauchte
ich nicht, ich hatte ja einen, auch mein zweites Disklaufwerk und den
Drucker konnte ich noch gebrauchen. <BR>
<BR>
Eigentlich zu meinem A500 hatte ich die Textverarbeitung Maxon Word
gekauft, sie kam aber erst als ich den A1200 schon hatte und ich musste
bald feststellen, dass Maxon Word reichlich Speicher braucht (und
gro&szlig;er Mist war!). Also musste eine Erweiterung her, nun um 2 MB.
Damit bin ich dann recht lange zufrieden gewesen. Aber die Technik
schreitet voran, ich also hinterher.<BR>
Ein CD-Rom Laufwerk habe ich so um 96 gekauft.<BR>
<BR>
Auf einer CD-Rom war das Programm DArc von Frank Weber. Es gefiel mir recht
gut und ich habe es bei ihm bestellt. In dem Brief, den er mir zur&uuml;ck
schrieb, teilte er mir mit, dass er ein neues Programm schreiben w&uuml;rde
mit dem man besser CDs archivieren k&ouml;nnte als mit DArc, was f&uuml;r
Disketten gedacht war und er suchte noch einen Beta-Tester. Ich schrieb ihm
zur&uuml;ck ich w&uuml;rde diese Aufgabe gerne &uuml;bernehmen.<BR>
<BR>
In den n&auml;chsten Jahren kam dann eine Turbokarte mit 16 MB Ram hinzu,
ein externes HD-Laufwerk, ein neuer Tintenstrahl-Drucker, eine Festplatte
mit 1,2 GB und als letzte gro&szlig;e Anschaffung ein Scanner.<BR>
<BR>
In den letzten Jahren ist bei mir nun aber der Wunsch nach einem eigenen
Internetzugang aufgekommen. Daf&uuml;r aber meinen Amiga 1200
aufr&uuml;sten w&uuml;rde einer Neuanschaffung gleichkommen. Mein Amiga
wird ja nicht j&uuml;nger und es ist nicht nur mit einer ISDN-Box
getan!<BR>
<BR>
Sich auf Amiga Inc. zu verlassen, dass es endlich etwas Neues gibt, habe
ich, zumindest im Augenblick, aufgegeben. Also ein PC, einen Mac... siehe
oben!<BR>
<BR>
Wenn es einen guten Amiga in neuer Aufmachung mit OS 4.X, guten Laufwerken
zu einem angemessenen Preis geben w&uuml;rde, h&auml;tte ich wahrscheinlich
nicht einen PC gekauft, aber den gibt es zumindest im Augenblick nicht und
darauf warten, habe ich die letzten zwei Jahre getan. Nun also ein PC!<BR>
<BR>
<IMG SRC="st_mc3a.gif" WIDTH="180" HEIGHT="68" ALIGN="LEFT">
<H2>Mein PC mit Windows XP und Amiga Forever 3.1</H2>
<BR>
<IMG SRC="st_mc4.png" BORDER="0" WIDTH="160" HEIGHT="164" ALIGN="RIGHT">
Den PC habe ich am 1.April 2003 gekauft, ist also noch recht neu (aber kein
Aprilscherz!). Auch habe ich mir einen TFT-Monitor geleistet, mein alter
Monitor ist ja schon 13 Jahre alt! W&uuml;rde au&szlig;erdem nicht passen.
Aber meinen Tintenstrahl-Drucker und die Aktivboxen habe ich von meinem
Amiga 1200 &uuml;bernommen. Da ich recht viele Amiga Programme habe und
auch auf die nicht verzichten m&ouml;chte, habe ich mir gleich die
Emulation Amiga Forever gekaut. Sie l&auml;uft recht schnell ist gut zu
bedienen und ich kann nun endlich einen Bildschirm mit 1280X1024 Pixeln und
32-bit Aufl&ouml;sung "fahren", davon habe ich in den letzten Jahren nur
tr&auml;umen k&ouml;nnen.<BR>
<BR>
Von den Windows-Programmen bin ich recht entt&auml;uscht, au&szlig;er Word
sind die Programme ziemlicher M&uuml;ll und ich arbeite am liebsten auf
der gewohnten Amiga-Ebene. Ins Internet gehe ich &uuml;ber die T-Online
Software.<BR>
<BR>
Das Kopieren der Programme und der Dateien von meinem Amiga 1200 zum Amiga
PC ist nur recht langwierig, da fast alles per Diskette kopiert werden muss
und das dauert...!<BR>
<BR>
<HR>
Genaue Angaben &uuml;ber meine Computer, siehe <A
HREF="mitglieder/voepel.html"><IMG SRC="mitglieder/voepel0.gif" ALT="Martin
Voepel" BORDER="0" WIDTH="262" HEIGHT="45"></A>
<BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
