<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Ein` hab ich noch...
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="st_einnoch.jpg" alt="Ein` hab ich noch" width="432"
            height="96"> </CENTER> <HR align="center" width="75%" size="5"
            color="#C8C6C2"> <BR>

          <P>
            Zwei hungrige M&auml;uschen sehen einen Elefanten. Sagt die eine zu der anderen: "Den braten wir uns. Ich besorge uns schnell Brennholz und du bewachst ihn in der Zwischenzeit!"<BR>
             Als die Maus wiederkommt, ist der Elefant verschwunden. Misstrauisch fragt sie die andere Maus: "Wo ist unser Mittagessen?"<BR>
             "Der Elefant? Weggelaufen!"<BR>
             Darauf die andere Maus:"L&uuml;g doch nicht, du kaust ja noch!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Als Gott mit der Erschaffung von Adam und Eva fertig war, sah er Adam an und sagte: "Och, was bist du sch&ouml;n, dich habe ich toll hin bekommen!<BR>
             Dann sah er Eva an und sprach: "Schlecht siehst du auch nicht aus, aber nicht so sch&ouml;n wie Adam. Du sollst dazu verdammt sein, dich ein Lebenlang zu schminken!".
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Warum mu&szlig;test du denn nun schon wieder nachsitzen?" fragt die Mutter ihre Tochter.<BR>
             "Ich wu&szlig;te nicht, wo die Malediven sind." - "Das n&auml;chste mal passt du eben besser auf, wo du deine Sachen hinlegst!"
          </P>
          <HR width="100%" size="3">
          <BR>

          <P>
            Ein wei&szlig;er Siedler, der im Norden der USA lebt, bereitet sich auf den kommenden Winter vor. Als er gerade beim Holzhacken ist, kommt ein Indianer vorbei. Der Siedler: "How, roter
            Bruder, wie wird der Winter?" Der Indianer:" Kalt!"<BR>
             Da der Siedler viel Vertrauen in die Wettererfahrung der Einheimischen setzt, hackt er noch mehr Holz.<BR>
             Als am Abend der Indianer wieder am Haus des Siedlers vorbeikommt, fragt der Siedler den Indianner noch einmal: "Du, mein roter Bruder, wird der Winter wirklich so kalt?" - "Sehr, sehr
            kalt!" bekommt der Siedler als Antwort.<BR>
             Nun bekommt der Siedler Angst und er hackt noch mehr Holz.<BR>
             Am n&auml;chsten morgen kommt der Indianer wieder vorbei und sagt: "Uff, das wird sich der k&auml;lteste Winter seit Menschengedenken, sehr kalt!" Der Siedler, noch v&ouml;llig
            ersch&ouml;pft vom hacken des vielen Holzes, fragt: "Woher wei&szlig;t du das?" Der Indianer: "Altes Indianerwissen. Wenn wei&szlig;er Mann hacken viel, viel Holz, Winter sehr, sehr
            kalt!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Die Mutter sieht sich das Diktat ihres Sohnes an. "Zwanzig Fehler in einem einzigen Diktat, wie ist so was m&ouml;glich?" - Mault der Sohn: "Der Lehrer hat die Schuld, der sucht ja
            f&ouml;rmlich danach!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Zwei Rentner unterhalten sich auf einer Parkbank.<BR>
             "Ich habe mir ein neues Japanisches H&ouml;rger&auml;t gekauft! Super klein, super Leistungsstark!"<BR>
             "Und, wie teuer?" - "Halb Vier!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Der Schlosser in der Werkstatt: "Ihre Reifen sie abgefahren, mein Herr!"<BR>
             Ruft der Autobesitzter: "Dann nichts wie hinterher!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Kommt ein H&auml;schen in die Molkerei und fragt: "Hatt du Milch?" - "Ja!"<BR>
             "Hatt du auch Fett-Arme!" - "Ja!"<BR>
             "Mutt du tragen lang&auml;rmeliges Hemd!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Kommt der kleine Tim ins Fundb&uuml;ro: "Ist hier ein Fahrrad abgegeben worden?"<BR>
             "Ja, welche Farbe denn?"<BR>
             "Am liebsten ein blaues!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Ich habe die Nase voll! Schlu&szlig; jetzt!", br&uuml;llt der Familienvater seine Familie an. "Ich halt`s hier nicht mehr aus, ich hau ab nach Kanada zu Fischen, in den Dschungel zum
            jagen. Nur weg hier!"<BR>
             Er rennt zur Haust&uuml;r, rei&szlig;t sie auf und macht auf dem Absatz kehrt.<BR>
             "Ihr habt noch mal Gl&uuml;ck gehabt, es regnet."
          </P>
          <BR>
           <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Die eine Kuh zu der anderen: "Warum enth&auml;lt unsere Milch eigentlich Fett?"<BR>
             "Damit das Euter beim melken nicht quietscht!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Eine Mutter schenkt ihrem Sohn zum Geburtstag einen Formel 1-Rennwagen aus Schokolade, weil er so gerne die Rennen ansieht.<BR>
             Kurz vor dem Mittag ist da Rennauto schon aufgegessen. Die Mutter ist sauer und schimpft: "Du gehst jetzt sofort auf die Toilette, und da bleibst du, bist das Auto wieder drau&szlig;en
            ist".<BR>
             Nach zwei Stunden ist der Junge noch nicht von der Toilette runter, und die Mutter ruft: "Ist das Auto noch nicht drau&szlig;en?" - "Nein, Mama, noch nicht, aber es hupt schon!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Ein Gast in einem Restaurant zum Ober: "Ich nehme das Rinderhack-Medalaillon mit K&auml;se &uuml;berbacken in der Teigh&uuml;lle und als Beilage Kartoffelstifte fritiert auf einer
            deftigen Tomatenso&szlig;e."<BR>
             Ruft der Ober zur K&uuml;che: "Eine Portion Cheesburger mit Pommes und Ketchup!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Ist der Stille Ozean eigentlich immer still, Papa?" - "Stell nicht immer so dumme Fragen! Frag doch mal was ernsthaftes."<BR>
             Na gut, Papa. Woran ist das Tote Meer gestorben?"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Eine kleine graue Zelle kommt zuf&auml;llig in das Gehirn eines Mannes. Alles ist dunkel, leer und ohne Leben.<BR>
             "Huhuu" ruft die Zelle. Keine Antwort.<BR>
             Sie ruft ein zweites mal "Huhuu". Wieder bleibt alles ruhig.<BR>
             Da erscheint pl&ouml;tzlich eine andere graue Zelle und fragt: "Was machst du denn hier so einsam. Komm doch mit, wir sind alle unten."
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Was bedeutet es, nach Hause zu kommen, zu einem Mann der dich liebt und der z&auml;rtlich zu dir ist?<BR>
             Du bist in der falschen Wohnung!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Der Vertreter klingelt an der Haust&uuml;r: "Guten Tag, ich h&auml;tte hier eine ganz tolle Mikrowelle f&uuml;r Sie!"<BR>
             "Nein, danke! Ich hab schon was, dass schnell hei&szlig; wird und in 30 Sekunden fertig ist!"
          </P>
          <BR>

          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <CENTER>
            <BR>

            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC" align="left">
                  <CENTER>
                    <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                  </CENTER>
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC" align="left">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

