<html>
<head>
<title>Editorial der NoCover</title>
</head>
<body background="bg.jpg" text="#000000" link="#000000" alink="#ff0000"
vlink="#000080"  bgcolor="#b0b0b0">

<center>
<table border=1 width=96%>
<tr><td align=center>
<br><b><font color="#006000" size="7"><i>
NoCover - Das Freeware Mag
</i></font></b></center>
</td></tr></table>

<br><img src="../el.gif" width=365 height=45><br>

<h2><b>zur NoCover #95 (3.2.2002)</b></h2>

<p><img src="el1.gif" width=200 height=36 border=0></p>

<p><img src="el2.gif"></p>

<p>
<table width=96%><TR><TD>
<p><b>Hi Folks!</b></p>

<p>Hi!<br>
Das neue Jahr ist also inzwischen auch einen Monat alt und ich hoffe, dass dieser Monat f&#252;r alle Leser der NoCover erfreulich verlaufen ist - f&#252;r meine Wenigkeit auf jeden Fall, wenn man mal vom gelegentlichen Stress absieht, der einen so umgibt.</P>

<p>Noch ein Wort zur letzten Ausgabe: Einige Stunden vor Redaktionsschluss sind hier noch einige Artikel eingetrudelt, womit die Ausgabe dann doch noch ganz achtbar gef&#252;llt werden konnte. Aus diesem Grunde d&#252;rfte einige von Euch das recht pessimistische Editorial auch &#252;berrascht haben. Trotzdem bitte ich Euch, die Artikel m&#246;glcusht so fr&#252;h wie m&#246;glich an mich zu senden. Bis Mitte des Monats trudelt hier n&#228;mlich i.d.R. nur vereinzelt etwas ein und ich gerate dann schon wieder in Panik, wie ich denn die aktuelle Ausgabe f&#252;llen kann. Na ja, &#252;ber die Beteiligung in diesem Monat sage ich an dieser Stelle dann besser auch nichts, so dass sich jeder selber ein Bild machen kann. Ich sehe die Entwicklung auf jeden Fall positiv. Trotzdem gilt nach wie vor: Schreibt flei&#223;ig Artikel und empfehlt die NoCover Euren Freunden und Bekannten aus dem Amiga Sektor weiter. Nur so kann es auf Dauer mit der NoCover auf&#228;wrts gehen. Nat&#252;rlich k&#246;nnt ihr den Jungs dann die aktuelle Ausgabe auch gleich in die Hand dr&#252;cken, denn die NoCover ist ja inzwischen - das kann man gar nicht oft 
genug betonen - Freeware!</P>

<p>Ein Wort noch an alle auslaufenden Diskabo`s: Meldet Euch bezgl. der Verl&#228;ngerung bitte direkt bei Wolfgang Haas, dessen Addy und Bankverbindung im Impressum zu finden ist. Nur dieser ist verantwortlich f&#252;r das Diskabo und alles, was damit zu tun hat. Also bitte kein Geld oder &#228;hnliches an meine Addresse mailen. Wer sich also &#252;ber auslaufende Diskabo`s wundert, sollte sich schnellstm&#246;glich an ihn wenden. In Ausnahmef&#228;llen k&#246;nnt ihr mir auch einen Brief mit Diskette sowie 1.30 DM R&#252;ckporto schicken und ich maile euch die aktuelle Issue zu.</P>

<p>Und noch eine traurige Nachricht, die indirekt auch die NoCover betrifft, in erster Linie aber unsern geliebten Amiga trifft: Die Amiga Arena um Olaf K&#246;bin hat zum 31.1.02 ihre Aktivit&#228;ten eingestellt! In der Vergangenheit hatte die Amiga Arena immer wieder Shareware zu verbilligten Preisen angeboten, Keyfiles &#228;lterer Software frei gegeben und Interviews gef&#252;hrt, um insgesamt den Amiga Sharewaremarkt zu st&#228;rken, was wohl auch gelungen ist. Da leider das Feedback der User nicht immer optimal war und es viele nur auf die kostenlosen Keyfiles abgesehen haben, gibt es die Amiga Arena nicht mehr. An dieser Stelle alles gute f&#252;r Olaf mit seinen neuen Projekten! Aus diesem Grund wird es in Zukunft innerhalb der NoCover auch leider keine Interviews mehr von der Amiga Arena geben. Hier suche ich User, die sich in Zukunft pro Monat mal in diesem Bereich etwas bet&#228;tigen und mir Interviews zur Verf&#252;gung stellen. </P>

</p>

<p>Allright, jetzt w&#252;nsche ich Euch viel Spa&#223; beim Lesen der
aktuellen NC. See ya,<br>

<b>Kilian <blink>&quot;The Bruce&quot;</blink> Servais</b></p>

</td></tr></table>
<p><img src="el2.gif"></p>
<h3><b><a href="../nc/index.html"> zur NoCover </a> &#160; &#160;
<a href="../aa/index.html"> zu AmigaAktuell </a> &#160; &#160;
<a href="../index.html"> zum Start </a></b></h3>
</center>

<br>
</BODY>
</HTML>
