<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Etusivu</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img src="kuvat/thoriel.jpg" width="187" height="193" alt="Anu" border="1"></center>
						<div align="left">
							<p>Olen t&auml;m&auml;n vuoden kuluessa saanut runsaasti kyselyj&auml; Saku 2000 -tapahtuman kohtalosta. Pidet&auml;&auml;nk&ouml; sit&auml;, milloin se pidet&auml;&auml;n, ket&auml; siell&auml; on, menik&ouml; se jo, miss&auml; se on... Vastaus on viel&auml; avoinna. Yhdistyksen uusi ja osittain hieman viel&auml; keltanokkainenkin hallitus totuttelee viel&auml; vastuun kantamiseen ja yhteispeliin. Menneist&auml; yritet&auml;&auml;n ammentaa oppia, mutta samalla pyrimme miettim&auml;&auml;n, mit&auml; uutta voisimme yhdistyksen nimiss&auml; saada aikaan. Hallituksen vaihtumisella haettiin nimen omaan uutta verta ja tuoreita ideoita. Ei sill&auml; ett&auml; aiemmat hallitukset olisivat mit&auml;&auml;n naavapartoja nek&auml;&auml;n olleet, mutta viime vuosi oli raskas sek&auml; Amigalle ett&auml; toisaalta my&ouml;s yhdistykselle ja sen vastuuhenkil&ouml;ille.</p>
							<p>Saku 99 oli menestys, mutta toisaalta se oli melkoinen painekattila sit&auml; j&auml;rjest&auml;m&auml;ss&auml; olleille ihmisille. Se ett&auml; tapahtuma lopulta sujui alkuvaikeuksien j&auml;lkeen niin hyvin kuin sujui oli helpotus kaikille, mutta se j&auml;tti j&auml;lkens&auml; niin yhdistyksen talouteen kuin hallituksen puuhamiehiinkin. Pient&auml; taisteluv&auml;symyst&auml; on ollut havaittavissa my&ouml;s Amiga-yhteis&ouml;ss&auml; kaiken t&auml;m&auml;n myllerryksen j&auml;lkeen. Yhdistyksen taloudellinen tilanne esimerkiksi ei anna t&auml;ll&auml; hetkell&auml; mahdollisuutta j&auml;rjest&auml;&auml; Saku 99:n laajuista tapahtumaa viel&auml; t&auml;n&auml; kes&auml;n&auml;. Haluaisimme ilman muuta tarjota j&auml;senille ja muille vierailijoille j&auml;lleen ainutlaatuisen tapahtuman, mutta sit&auml; ei haluttaisi j&auml;rjest&auml;&auml; vain vanhan kertausharjoituksena.</p>
							<p>Aatteellisena yhdistyksen&auml; olemme varoneet visusti verottajaa ja ker&auml;nneet varoja l&auml;hinn&auml; vain j&auml;senmaksuista ja rompunmyynnist&auml; siin&auml; pelossa, ett&auml; verokarhu puuttuu muutenkin rahallisesti pieneen budjettiin. Lait kuitenkin muuttuvat jatkuvasti, niit&auml; sovelletaan vaihtelevasti ja ennakkotapauksia tulee, ja tarkoitus olisikin mietti&auml;, miten yhdistyksen taloutta voitaisiin jatkossa kohentaa muutoinkin kuin j&auml;senmaksujen ja Saku-romppujen myynnin mudossa. Ensimm&auml;inen teht&auml;v&auml; tosin on saada vuosikausia tekem&auml;tt&auml; ollut yhdistyksen kirjanpito kuntoon, kuten voitte kokousmuistiosta lukea. Janne Sir&eacute;n on ottanut teht&auml;v&auml;n hoitaakseen, ja kaikki tahoillamme olemme pyrkineet olemaan apuna.</p>
							<p>Jonkin verran toimintavinkkej&auml; on tullut my&ouml;s kotisivun palautelomakkeen kautta, mist&auml; kiitokset kaikille palautteen antajille.&nbsp;Kaikkea kannattaa aina ehdottaa, sill&auml; voihan jollakulla olla takataskussa hyv&auml;kin idea, jota vain ei kukaan muu ole tullut ajatelleeksi. Postipalstalla on t&auml;ll&auml; kertaa pitk&auml; kirje, jossa on k&auml;sitelty paljon my&ouml;s muiden mieli&auml; askarruttaneita aiheita, kuten oman verkkotunnuksen hankkiminen yhdistykselle, nykyinen osoite kun ei ole siit&auml; helpoimmasta p&auml;&auml;st&auml; muistaa. Lis&auml;ksi kirjeess&auml; ja sen vastauksessa k&auml;sitell&auml;&auml;n melko laajasti yhdistyksen taloudellista toimintaa, joten suosittelen lukemaan sen, mik&auml;li Saku-tapahtumien tulevaisuus ja yhdistyksen tilanne yleens&auml;kin kiinnostavat. Samoin hallituksen kokousmuistiossa on t&auml;rkeit&auml; asioita.</p>
							<p>Nykyinen hallituskin toivoo, ett&auml; j&auml;senet pyrkisiv&auml;t olemaan mukana vaikuttamassa yhdistyksen toimintaan monipuolisesti. &quot;Hallitus&quot; on aika juhlava sana meid&auml;n poppoolle, sill&auml; meh&auml;n olemme vain osa teist&auml;, joten ei t&auml;&auml;ll&auml; miss&auml;&auml;n norsunluutornissa tai &quot;liikennevalojen&quot; takana istuskella, vaikka v&auml;lill&auml; yrit&auml;mme n&auml;ytt&auml;&auml; ulosp&auml;in virallistakin naamaa. Niin, olemme me sent&auml;&auml;n nyt oikein virallisesti tunnustettu k&auml;ytt&auml;j&auml;ryhm&auml;, hurraa... :-)</div>
					</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
