<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Minne meni se Amiga?</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						Olen t&ouml;rm&auml;nnyt hiljattain eri paikoissa toistuvasti ajatukseen, jonka mukaan monet Amiga-k&auml;ytt&auml;j&auml;t ovat viime vuosina el&auml;neet enemm&auml;n siin&auml; ajatuksessa mit&auml; Amiga voisi joskus olla tai mit&auml; se joskus on ollut - sen sijaan, ett&auml; keskitytt&auml;isiin siihen mit&auml; se on nyt. Ja mit&auml; enemm&auml;n sit&auml; mietin, sit&auml; enemm&auml;n se t&auml;ytyy allekirjoittaa.
						<p>Viime vuodet ovat riepotelleet j&auml;ljelle j&auml;&auml;neit&auml; Amiga-k&auml;ytt&auml;ji&auml; pettymyksest&auml; toiseen. Horisontissa on useimmiten n&auml;kynyt jokin kipin&auml;, joka on pit&auml;nyt yll&auml; toivoa yll&auml;, oli se sitten uusi perheellinen PowerPC-kortteja, uusi tuloillaan oleva lisenssiemolevy, seuraavan sukupolven j&auml;rjestelm&auml; tai vain uusi, uljas omistajayritys.
						<p>Mieleeni muistuu er&auml;&auml;n tuttuni sanat jostain 90-luvun puoliv&auml;list&auml;. Jo silloin h&auml;n totesi ja kielt&auml;m&auml;tt&auml; osuvasti, ett&auml; Amigalla kaikki se mik&auml; muilla on nykyp&auml;iv&auml;&auml; tuntuu aina olevan vasta tulossa. Kommentti ei ollut mitenk&auml;&auml;n pahansuopa, eik&auml; sit&auml; ollut tarkoitettu k&auml;rjistetysti, mutta se kyll&auml; piti tietyss&auml; mieless&auml; paikkansa.
						<p>Jos jotain Amigasta puuttui, aina eli usko siit&auml; ett&auml; kyll&auml; se ja se tuo sen pian Amigalle... Ja usein, suurista lupauksista huolimatta, ei tuonut. Tai sitten tyydymme paljon v&auml;hemp&auml;&auml;n kuin muut. Kuinka moni tunnustaa ihan oikeasti olleensa hitusen fiiliksiss&auml; Amigalle &auml;skett&auml;in tulleista PC-k&auml;&auml;nn&ouml;speleist&auml;? Min&auml; ainakin, ja outoa kyll&auml; tein niin, vaikka vieress&auml; oli monta kertaa tehokkaampi PC:kin. Mist&auml; l&auml;htien Amiga-k&auml;ytt&auml;j&auml;t hyppiv&auml;t riemusta peleist&auml;, jotka tulivat jo vuosia sitten PC:lle? Minne meni se kotimikro, jolla oli aina ne uusimmat ja parhaimmat pelit?
						<p>Edell&auml;k&auml;vij&auml;st&auml; on vuosien saatossa tullut per&auml;ss&auml;laahaaja, ja ik&auml;v&auml; kyll&auml; edes per&auml;ss&auml; pysyminen ei tunnu onnistuvan kuin sekalaisten yritysten suurissa suunnitelmissa ja uskollisten k&auml;ytt&auml;jien p&auml;iv&auml;unissa. En v&auml;it&auml;, etteik&ouml; muutamia merkitt&auml;vi&auml;kin askeleita viime vuosina ole tapahtunut, mutta mit&auml; tapahtui sille kotimikrolle, joka oli etenkin sit&auml; tunteville kiistatta parempi kuin mik&auml;&auml;n muu?
						<p>Olen kuullut monen aktiivisenkin Amiga-k&auml;ytt&auml;j&auml;n olevan samaa mielt&auml; siit&auml;, ett&auml; jos sukulainen tai tuttava kysyy konesuositusta, niin ei Amigaa voi suositella. Seuraa pitk&auml; selitys siit&auml;, miksi Amiga on hieno kone ja upea ja kaikkea, mutta siit&auml; ja tuosta ja t&auml;st&auml; syyst&auml; tuo PC on kyll&auml; sille sukulaiselle parempi valinta. Mit&auml; tapahtui sille kotimikrolle, jota saattoi suositella selittelem&auml;tt&auml;?
						<p>Kun joku osoittaa Amigassa jonkun heikkouden, heti kohta ollaan kertomassa kuinka &quot;pian julkaistava&quot; BoXeR tai G3/G4-kiihdyttimet tai Phase 5:n (R.I.P.) viimeisin pilvilinna tulee ja pelastaa kaikki. Ja vuodesta toiseen suurin osa niist&auml; unelmista vain valuu sormien v&auml;list&auml; ilman mit&auml;&auml;n substanssia. Mit&auml; tapahtui sille kotimikrolle, joka on niin perkeleen hyv&auml; t&auml;ss&auml; ja nyt, ettei tulevasta v&auml;li&auml;?
						<p>Vastaus kai on, ett&auml; se kotimikro kuoli jossain Commodoren konkurssin tiet&auml;mill&auml;. Ja t&auml;ss&auml; me olemme kuusi vuotta my&ouml;hemmin, eik&auml; meill&auml; viel&auml;k&auml;&auml;n ole kuin lupauksia paremmasta. Ehk&auml;p&auml; ne lupaukset t&auml;ll&auml; kertaa toteutuvat, ehk&auml;p&auml; eiv&auml;t, mutta joka tapauksessa maailma muuttuu, eik&auml; se vanha kunnon Amiga koskaan tule takaisin - uusi Amiga on joka tapauksessa jotain aivan muuta, nime&auml; ja mahdollisesti emolaatioyhteensopivuutta lukuunottamatta. Ja kuka sanoo, ett&auml; tuo uusi Amiga oikeasti on edes hyv&auml;?
						<p>Itse Amiga-piireiss&auml; el&auml;neen&auml; asiaan on helppo suhtautua tunteella, ja tahdonvoima uusii helposti toivoa, mutta toivossa ei ole hyv&auml; el&auml;&auml;, jos samalla unohtaa my&ouml;s el&auml;&auml;. Amiga on itselleni viime vuosina ollutkin yh&auml; enemm&auml;n vain upea joukko ihmisi&auml;, joten siit&auml; on vaikea olla pahoillaan - Amiga on siin&auml; mieless&auml; todella hauska harrastus, ja kaikki toteuttamamme tempaukset ovat olleet upeita el&auml;m&auml;nkokemuksia. Toisaalta varsinainen tietokoneharrastukseni ja -ty&ouml;ni ovat jo vuosia vieneet eri suuntaan.
						<p>Kaikin mokomin, paremmasta Amiga-tulevaisuudesta saa unelmoida, mutta ei unohdeta tarttua my&ouml;s hetkeen. Ymp&auml;rill&auml;mme on kovaa vauhtia muuttuva tietokonemaailma, jossa aivan uudenlaiset laitteet mullistavat vanhoja rakenteita ja avaavat teit&auml; uudenlaisille datael&auml;myksille. Ehk&auml;p&auml; uusi Amiga uusine omistajineen on siell&auml; joukossa, tai sitten ei, mutta kuka tiet&auml;&auml;, mit&auml; muuta mielenkiintoista sielt&auml; l&ouml;ytyy!
						<p>Pidet&auml;&auml;n silm&auml;t auki ja iloitaan siit&auml;, mit&auml; nyky-Amiga ja muut laitteet voivat meille tarjota. Juuri t&auml;n&auml;&auml;n. Olen varma, ett&auml; tarttumalla yh&auml; vahvemmin nykyhetkeen my&ouml;s Saku ja Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. s&auml;ilytt&auml;v&auml;t arvonsa yhteiskanavanamme.
					</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font><p></center>
	</body>

</html>
