<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Potilaskertomus</b></font></td>
				</tr>
				<tr>
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Sirpa P&ouml;yh&ouml;nen</font></td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						Jos joku olisi kymmenen vuotta sitten sanonut minulle, ett&auml; kiinnostuisin tietokoneista, olisin pit&auml;nyt kertojaa mielipuolena. Viisi vuotta sitten v&auml;ite, ett&auml; omistaisin oman koneen, joka ei ole markkinajohtajan valmistama ja t&auml;ysin k&auml;ytt&ouml;valmiina kaupasta kotiin kannettu, olisi saanut aikaan ep&auml;uskoista mutinaa. Tai jos kuukausi sitten minulle olisi kerrottu, ett&auml; pian naputtelisin teksti&auml; Saku-lehteen, en olisi uskonut mokomaa.
					</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black">
							<b>Ei kuulunut riskiryhm&auml;&auml;n</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						Synnyin perheemme ainoaksi lapseksi 3. hein&auml;kuuta 1976 Y&ouml;tt&ouml;m&auml;n Y&ouml;n Mansikoiden kotikaupungissa Suonenjoella. Mainittakoon, ett&auml; kotona ei ole koskaan kasvatettu rivi&auml;k&auml;&auml;n mansikkaa. Sen sijaan meill&auml; kasvatettiin pihvej&auml;, lapaa, marinoituja paistisuikaleita ja muuta sellaista, siis lihakarjaa. Is&auml;ni ammatti oli viime vuoden maaliskuuhun saakka maanviljelij&auml;, &auml;idin em&auml;nt&auml;. Nykyisin he ovat el&auml;kkeell&auml;.
						<p>Puuhailin paljon itsekseni, sill&auml; naapuritilan samanik&auml;ist&auml; poikaa lukuunottamatta l&auml;hist&ouml;ll&auml; ei leikkikavereita ollut. Yhteisi&auml; leikkej&auml;mme ei juuri &quot;tytt&ouml;jen jutuiksi&quot; voinut sanoa: laskimme m&auml;ke&auml;, vakoilimme aikuisia, rymysimme milloin miss&auml;kin ja varsinkin kev&auml;isin ammuimme r&auml;k&auml;ttirastaita ilmakiv&auml;&auml;rill&auml;. Min&auml; en tosin halunnut ampua, joten sain etsi&auml; kohteita ja ker&auml;t&auml; saaliin.
						<p>Tytt&ouml;porukoissa py&ouml;riminen j&auml;i kokematta eik&auml; en&auml;&auml; my&ouml;hemmin edes kiinnostanut. En viel&auml; nyky&auml;&auml;nk&auml;&auml;n oikein ymm&auml;rr&auml;, mit&auml; hohdokasta on sipist&auml; tuntitolkulla vaatteista, meikeist&auml;, pojista tai popt&auml;hdist&auml;! Sen sijaan l&ouml;ysin kirjat. Parhaassa tapauksessa saatoin lukea l&auml;pi viisikin kirjaa viikossa. Jo tuolloin luin mielell&auml;ni scifi&auml; ja fantasiaa, jotka ovat edelleen suosikkejani. Lis&auml;ksi pidin tiiviisti yhteytt&auml; kirjeyst&auml;viini, joita oli parhaimmillaan nelisenkymment&auml; eri puolilla maailmaa.
						<p>Ala-asteella er&auml;s luokkani pojista otti harrastuksekseen takoa minulle p&auml;&auml;h&auml;n, ett&auml; en ollut mit&auml;&auml;n, en mink&auml;&auml;n arvoinen, eik&auml; minusta sit&auml; paitsi koskaan tulisikaan yht&auml;&auml;n mit&auml;&auml;n. Samaa toisteli lopulta l&auml;hes koko muukin luokka, ja lopulta aloin uskoa niin itsekin. Yli kuusivuotinen, yksin&auml;inen helvettini loppui vasta kun sain peruskoulun p&auml;&auml;st&ouml;todistuksen kouraani kev&auml;&auml;ll&auml; 1992. Viimeiset kahdeksan vuotta onkin kulunut pystyyn kompuroidessa ja el&auml;m&auml;&auml; opetellessa. Paljon teht&auml;v&auml;&auml; on viel&auml; j&auml;ljell&auml; mutta nykyisin menee jo ihan hyvin. Useimmiten.
						<p>Kotitilan jatkajaa minusta ei tullut, vaikka sekin vaihtoehto olisi tarjolla ollut. Siirryin lukioon el&auml;inl&auml;&auml;k&auml;rin ammatti mieless&auml; kangastellen ja p&auml;&auml;tin suorittaa sek&auml; matematiikan ett&auml; fysiikan laajan oppim&auml;&auml;r&auml;n. Muistan yh&auml;, miten lukion opo kehotti minua harkitsemaan viel&auml; kertaalleen. Lukiossamme kun kuulemma tyt&ouml;t yleens&auml; valitsivat helpomman ja hy&ouml;dyllisemm&auml;nkin(!) kielipainotteisen linjan. Sit&auml; paitsi muiden aineiden opiskelu tulisi kuulemma k&auml;rsim&auml;&auml;n. Lopullisen p&auml;&auml;t&ouml;ksen tekoon k&auml;ytin alle nanosekunnin, ja outo lintuhan minusta tuli: matematiikkaa sent&auml;&auml;n luki viisi tytt&ouml;&auml; (ja 20 poikaa), mutta fysiikassa sinnittelin ykk&ouml;sluokan j&auml;lkeen yksin reilun kymmenen miehenpuolikkaan seurassa. Ylioppilaaksi kirjoitin kev&auml;&auml;ll&auml; 1995 yleisarvosanalla laudatur.
					</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black">
							<b>Alkavaa oireilua</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						Lukiossa jouduin ensimm&auml;ist&auml; kertaa varsinaisesti tekemisiin tietokoneiden kanssa. Ensikosketus tapahtui lyhyell&auml; atk-kurssilla, josta leijonanosa kului, kun hiki p&auml;&auml;ss&auml; muunsimme bin&auml;&auml;rilukuja heksadesimaaliluvuiksi ja p&auml;invastoin. Kukaan ei oikein tajunnut, miksi. Saimme my&ouml;s pienen johdatuksen tekstink&auml;sittelyyn. Parhaiten muistan kuitenkin viimeisen tunnin, jonka saimme pelata Wolfensteinia. Pelkkien elektroniikkapelikokemusten j&auml;lkeen moinen meno r&auml;j&auml;ytti tajunnan ja j&auml;imme er&auml;&auml;n kaverini kanssa nalkkiin ensimm&auml;isen varttitunnin aikana.
						<p>Jatkossa vietin paljon ajastani tietokoneluokassa. Koska koneen hankkimisesta kotiin ei ollut puhettakaan, tein kaikki kirjalliset kotiteht&auml;v&auml;t koulussa. Joskus livahdimme kaverini kanssa hyppytunniksi tyhj&auml;&auml;n atk-luokkaan turruttamaan aivojamme ah-niin-kiehtovan Wolfensteinin parissa.
						<p>Samaisen kaverin kanssa eksyin kansalaisopiston tietokonekurssille. Harjoitukset liittyiv&auml;t Windows 3.11 -k&auml;ytt&ouml;j&auml;rjestelm&auml;n, MS-DOSin ja WordPerfectin k&auml;ytt&ouml;&ouml;n ja osoittautuivat suhteellisen v&auml;h&auml;n ajattelua vaativiksi. Niinp&auml; istuimme takariviss&auml; miinanraivausta pelaillen ja villiten l&auml;hist&ouml;n keski-ik&auml;iset naisihmiset kokeilemaan rajojaan MS-DOSin parissa innolla, joka h&auml;mm&auml;stytti opettajaamme suuresti. Kurssin anti j&auml;i v&auml;h&auml;iseksi, mutta antoipa sent&auml;&auml;n perustaidot: koneen opin k&auml;ynnist&auml;m&auml;&auml;n, ja tiedostoja korpulta lukemaan ja sille tallentamaan!
						<p>Lukion kuluessa el&auml;inl&auml;&auml;k&auml;ritulevaisuus lakkasi houkuttelemasta. Sen sijaan kiinnostuin biologiasta lopulta niin paljon, ett&auml; valmistauduin toden teolla p&auml;&auml;sykokeeseen. Muita vaihtoehtoja miettiess&auml;ni huomasin, ett&auml; arvosanani riitt&auml;isiv&auml;t suoraan p&auml;&auml;syyn Oulun yliopiston matematiikan koulutusohjelmaan. Hetken mielijohteesta pistin hakulomakkeen postiin ik&auml;&auml;n kuin varmuuden vuoksi.
						<p>Ja se kannatti! Posti toi pian kaksi kirjett&auml;. Toisessa kerrottiin biologian opiskelupaikan j&auml;&auml;neen muutaman pisteen p&auml;&auml;h&auml;n, toisessa toivotettiin tervetulleeksi matematiikkaa lukemaan. Niinp&auml; syksyll&auml; -95 matkasin tavaroineni Ouluun. Tyytyv&auml;isen&auml; j&auml;tin hyv&auml;stit kotikaupungin ahdistavalle ilmapiirille, katkerille koulumuistoille ja tietyille ihmisille, joita vihasin. Aloittaisin alusta, ihan kokonaan. Hankkisin lopultakin el&auml;m&auml;n!
						<p>Suunnitelma alkoi toteuttaa itse&auml;&auml;n nopeammin kuin tajusinkaan. Heti ensimm&auml;isell&auml; viikolla tutustuin er&auml;&auml;seen oman fuksipienryhm&auml;ni miespuolisista j&auml;senist&auml;. Juttelimme, aloimme liikkua yhdess&auml;, k&auml;vin h&auml;nen kotonaan katsomassa tv:t&auml; (jakson Star Trek TNG:t&auml; viikossa), homma muuttui seurusteluksi, ajan my&ouml;t&auml; muutimme asumaan yhteen ja nyky&auml;&auml;n olemme kihloissa. Vasta saman katon alle asettuessamme minulle selvisi kaamea totuus koko laajuudessaan: olin t&ouml;rm&auml;nnyt Amiga-k&auml;ytt&auml;j&auml;&auml;n!
					</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black">
							<b>Taudinkuva alkaa selvit&auml;</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						Kyll&auml;h&auml;n h&auml;nell&auml; oma tietokone oli. Ei minulle tullut pieneen mieleenik&auml;&auml;n, ett&auml; se olisi jotenkin <b>erikoinen</b>, minulle kaikki koneet olivat vain koneita. Olin sit&auml; paitsi t&auml;ysavuton, mit&auml; niihin tuli. Itse asiassa minulla oli vankka k&auml;sitys, ett&auml; kaikki koneet erityisesti vainosivat minua ja kenkkuilivat ihan vain siksi, ett&auml; yritin k&auml;ytt&auml;&auml; niit&auml;. Siisp&auml; reippaasti kumppanilta, tietokoneasioiden kaikkitiet&auml;v&auml;lt&auml;, apua ruikuttamaan.
						<p>Kumppanin suhtautuminen ongelmiini oli h&auml;mment&auml;v&auml;&auml;. Kommentit tyyliin &quot;sellaisia ne PC:t on&quot; tai &quot;Windows nyt onkin paska&quot; tai &quot;ei noista Microsoftin hommista ota mit&auml;&auml;n tolkkua&quot; eiv&auml;t kamalasti minulle kertoneet. Ihmettelin, miten tyyppi, jolla oli omakin kone, ei tiennyt mist&auml;&auml;n mit&auml;&auml;n. Seurauksena oli pitk&auml;hk&ouml; opetustuokio, jonka aikana tajusin syyllistyneeni l&auml;hes anteeksiantamattomaan syntiin: luullut Amigaa miksi tahansa tietokoneeksi, pthyi!
						<p>Varovainen l&auml;hentyminen kumppanini A3000:een alkoi. Aluksi seurailin sujuvasti vierest&auml;, mutta pikkuhiljaa uskaltauduin itsekin tekem&auml;&auml;n yksinkertaisia asioita kuten k&auml;ynnist&auml;m&auml;&auml;n addiktoivan Tetris-pelin muunnelman, Hextriksen. V&auml;h&auml;n my&ouml;hemmin kuvioihin tuli mukaan yhteyden ottaminen yliopiston modeemipankkiin s&auml;hk&ouml;postin lukua varten, mik&auml; olikin jo melkoinen saavutus meik&auml;l&auml;iselt&auml;. Koska puhelinyhteys nieli markkoja, kannatti opetella siirt&auml;m&auml;&auml;n tiedostoja ja k&auml;ytt&auml;m&auml;&auml;n omaa tekstieditoria. T&auml;ll&ouml;in ei tarvinnut pit&auml;&auml; yhteytt&auml; p&auml;&auml;ll&auml; kirjoittamisen aikana.
						<p>Vuoden verran matematiikan koulutusohjelmassa roikuttuani valmentauduin uudella innolla biologian p&auml;&auml;sykokeeseen, ja toisella yritt&auml;m&auml;ll&auml; onnisti. Sain kuin sainkin opiskelupaikan biologian puolelta Oulusta. Yll&auml;tt&auml;en ty&ouml;selostusten ja seminaarit&ouml;iden laatimiseen tarvittiin kirjoitusv&auml;line. Onneksi kotosalla oli kone, eik&auml; tarvinnut jonottaa julkisissa mikroluokissa ty&ouml;vuoroa. Kotikoneessa olevan Final Writerin k&auml;ytt&ouml;&ouml;n perehdyin ik&auml;&auml;n kuin varkain. Samoin tein tuttavuutta AmigaDOSin kanssa opettelemalla uuden shell-komennon aina tarpeen vaatiessa. Vasta aivan &auml;skett&auml;in opin, mit&auml; kaikkea olisin voinut tehd&auml; suoraan WB:lt&auml;. No, mit&auml;p&auml; turhaa, KingCON rules! :-)
						<p>Puolihuomaamattomasti ja mitenk&auml;&auml;n erityisesti yritt&auml;m&auml;tt&auml; tulin tutustuneeksi Amigan k&auml;ytt&ouml;&ouml;n noin niin kuin p&auml;&auml;llisin puolin. Samalla kykyni p&auml;rj&auml;t&auml; muidenkin koneiden, kuten yliopiston inhojen PC:iden, kanssa koheni huomattavasti.
						<p>Konkreettisesti Amigan sis&auml;lle p&auml;&auml;sin kurkkaamaan, kun tuli aika vaihtaa kiintolevy kookkaampaan. Ja min&auml;h&auml;n olin ihan myyty! Jonkinmoinen sairaalloinen mieltymys elektroniikkaan minulla on ollut jo pienest&auml; asti. Piirilevy ja ne kaikki houkuttelevann&auml;k&ouml;iset komponentit nyt vain ovat kerrassaan vastustamaton n&auml;ky. Syy lienee lapsuudessa ja is&auml;n kyvyss&auml; purkaa atomeiksi esimerkiksi moottorisaha, traktorin starttimoottori, kelloradio, kamera tai iskuporakone korjausta varten ja taas kasattuna saada laite uudelleen toimimaan.
						<p>Noin vuosi sitten perhesopu alkoi rakoilla. Minulla olisi ollut kirjoitushommia, mutta ainokaisen koneemme omistajakin vaati suurta k&auml;ytt&ouml;optiota. Ja kumpikohan voittaa, jos koodausinspiraatio ja sienijuuriessee laitetaan vastakkain? Aivan! Jos kanssaihminen lis&auml;ksi k&auml;ytt&auml;&auml; signaturenaan Star Trek: Voyagerin hologrammil&auml;&auml;k&auml;rin lausahdusta &quot;I don't have a life, I have a program&quot;, on parasta vain keitt&auml;&auml; sille kannullinen teet&auml; ja vet&auml;yty&auml; odottamaan strategisesti parempaa hetke&auml; kiilata koneelle. Aikaa tosin saattaa menn&auml; muutama p&auml;iv&auml;, v&auml;hint&auml;&auml;nkin.
						<p>Toistuva tilanne k&auml;ynnisti keskustelun oman koneen hankkimisesta minulle. Kun rahavarat eiv&auml;t puoltaneet Pentium-pakettia, t&auml;ytyi l&ouml;yt&auml;&auml; edullisempi ratkaisu. sfnet.atk.amigassa oli samoihin aikoihin useampiakin konepaketteja kaupan, ja ratkaisu keksittiin. Min&auml; tarvitsisin konetta l&auml;hinn&auml; pienimuotoiseen kirjoittamiseen, taloudesta l&ouml;ytyi tekstink&auml;sittelyohjelma ja tekninen tuki. Ajatus omasta Amigasta alkoi tuntua ihan hyv&auml;lt&auml;.
					</td>
				</tr>
			</table>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black">
							<b>Diagnoosi: toivoton tapaus!</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						Uutisryhm&auml;n kautta l&ouml;ytyi pian Oulussa sijainnut A1200, jonka k&auml;vimme hakemassa uuteen kotiin. Varusteluna oli 60-megainen 2,5-tuumainen kiintolevy ja 2+8 Mt muistia. Uudesta PC-monitorista maksoin enemm&auml;n kuin itse koneesta ja k&auml;rsin nyt &quot;rajoitettujen n&auml;ytt&ouml;tilojen syndroomasta&quot;. Mit&auml; kaikkea j&auml;&auml;k&auml;&auml;n n&auml;kem&auml;tt&auml;...
						<p>Jo melko pian tarpeellisten ohjelmien asennuksen ja ymp&auml;rist&ouml;n hiomisen j&auml;lkeen t&ouml;rm&auml;ttiin ensimm&auml;isiin kasvukipuihin. Ajatus vaatimattomasta, kirjoitusk&auml;yt&ouml;ss&auml; olevasta koneesta oli ollut vainaa jo syntyess&auml;&auml;n. Kiintolevy nimitt&auml;in alkoi olla t&auml;ynn&auml;! Vaihto suurempaan j&auml;tettiin hautumaan, kun l&auml;hdin l&auml;hes puoleksi vuodeksi Etel&auml;-Suomeen ty&ouml;harjoitteluun ja koneenk&auml;ytt&ouml; taantui &quot;parina viikonloppuna kuussa muutama tunti Moriaa&quot; -tasolle.
						<p>Viime lokakuussa koneen ymp&auml;rill&auml; alkoi taas olla s&auml;pin&auml;&auml;. K&auml;ytettyn&auml; ostettu, per&auml;ti 240 Mt:n kokoinen kovalevy saatiin kuin saatiinkin vaihdettua vanhan tilalle. K&auml;site &quot;vaihtaa suurempaan&quot; konkretisoitui vihdoin minullekin, kun 3,5-tuumainen levy ei en&auml;&auml; mahtunut koneen sis&auml;lle, vaan se piti j&auml;tt&auml;&auml; kotelon ulkopuolelle. Levyn virransaanti turvattiin n&auml;pp&auml;r&auml;sti virittelem&auml;ll&auml; sille oma, vanhasta PC-koneesta kaapattu virtal&auml;hde. Kerrassaan mainio rakennelma! Lis&auml;j&auml;nnityst&auml; el&auml;m&auml;&auml;n saan edelleenkin konetta k&auml;ynnist&auml;ess&auml;ni: jos koneen, kovalevyn virtal&auml;hteen ja monitorin k&auml;ynnist&auml;&auml; yht&auml; aikaa ja samaan aikaan stereot sattuvat olemaan p&auml;&auml;ll&auml;, <u>saattaa</u> paukahtaa sulake ja samalla pimenee puoli asuntoa. :-T
						<p>Tilaa tuli ja olin taas hetken aikaa tyytyv&auml;inen. Joulun alla iski sitten seuraava mielijohde, t&auml;ll&auml; kertaa pahemman sorttinen. Huomasin nimitt&auml;in ajattelevani, ett&auml; oma kone olisi mukava tuntea paremmin. Olisihan se hienoa, jos ei ihan joka asiaan tarvitsisi aina olla apua kyselem&auml;ss&auml;. Kun en muutakaan keksinyt, hy&ouml;kk&auml;sin Workbench 3.1 -manuaalin kimppuun ja kahlasin sen tunnollisesti l&auml;pi. Sen lukeminen taisi olla l&auml;hinn&auml; virhe, sill&auml; seurauksena oli entist&auml; voimakkaampi kiinnostus ottaa asioista selv&auml;&auml;. T&auml;ll&auml; hetkell&auml; olen tilanteessa, jossa kaikenlainen lis&auml;tieto olisi kovasti tervetullutta. En vain osaa p&auml;&auml;tt&auml;&auml;, mihin suuntaan s&auml;nt&auml;isin sit&auml; hankkimaan!
						<p>Olen my&ouml;s harrastusmieless&auml; alkanut kiinnostua Amigan piirto- ja kuvank&auml;sittelyohjelmista. T&auml;h&auml;nastiset tuherrukseni eiv&auml;t tosin juuri seitsenvuotiaan tekeleist&auml; eroa, mutta alkuverryttely&auml; se vasta on ollutkin :-). Ja jossakin aika l&auml;hell&auml; tulevat koneen rajatkin vastaan. Ei tarvitse kummoista kuvaa yritt&auml;&auml; k&auml;sitell&auml;, jos v&auml;rej&auml; k&auml;ytt&auml;&auml; yht&auml;&auml;n runsaammin, kun homma muuttuu tervassa r&auml;mpimiseksi.
						<p>Amiga-j&auml;lleenmyyjien hinnastot ja tuotelistat ovat kokonaan oma lukunsa. Huomaan piilev&auml;n sis&auml;isen rakentelijani her&auml;&auml;v&auml;n, kun kuolaan tornituspakettien, graffakorttien sun muiden j&auml;nnien romppeiden per&auml;&auml;n. No, onnekseni taloudellinen tilanne ei salli moisten haahuilujen muuttumista todeksi. Ainakaan ihan pian.
						<p>My&ouml;nt&auml;&auml; tosin t&auml;ytyy, ett&auml; aivan &auml;skett&auml;in itsehillint&auml;ni petti t&auml;ysin. Ostin k&auml;ytettyn&auml; myynniss&auml; olleen turbokortin jotakuinkin samaan tapaan kuin kanssasiskoni muotimekon alesta: iskin kiinni kuin sika limppuun t&auml;ysin ilman etuk&auml;teisharkintaa. Perusteluni on: &quot;Kun sai halvalla hyv&auml;n jutun, niin pitih&auml;n tilaisuus k&auml;ytt&auml;&auml; hyv&auml;ksi!&quot; (Ainakin kuvittelen, ett&auml; noiden v&auml;lill&auml; on analogia. Anteeksi, jos olen v&auml;&auml;r&auml;ss&auml;!) No, minusta joka tapauksessa tuli tyytyv&auml;inen Blizzard 1230 (68EC030/40 MHz) -turbon ja sen my&ouml;t&auml; entist&auml; sutjakamman Amigan omistaja.
						<p>Kaiken lis&auml;ksi olen alkanut seurata Amiga-aihepiirin uutisryhmi&auml;. Huolestuttavaa on se, ett&auml; alan toisinaan jopa ymm&auml;rt&auml;&auml;, mist&auml; keskusteluissa on kyse... Ja ik&auml;&auml;n kuin tuossa ei jo olisi tarpeeksi, ajauduin alkuvuodesta viel&auml; Aminetin notkuvan herkkup&ouml;yd&auml;nkin &auml;&auml;reen. Reilu kuukausi sitten t&ouml;m&auml;hdin lopulta Sakun kotisivuille, mit&auml; voidaan pit&auml;&auml; lopullisena niittin&auml;. Tapauksesta seurasi ensinn&auml;kin se, ett&auml; k&ouml;yhdyin viisikymppi&auml; Sakun hyv&auml;ksi ja toisekseen se, ett&auml; p&auml;&auml;dyin naputtelemaan t&auml;m&auml;n jorinan.
						<p>Jaa se minun el&auml;m&auml;ni? Morian peluun, piirto-ohjelmien k&auml;yt&ouml;n harjoittelun ja tiedonhankinnan lis&auml;ksi? Paitsi ett&auml; luen, heit&auml;n my&ouml;s mielell&auml;ni rinkan selk&auml;&auml;n ja l&auml;hden vaellukselle. T&auml;ysin ep&auml;musikaalisena ihmisen&auml; pit&auml;ydyn kuuntelemaan toisten tuotoksia melko monipuolisesti. Vaikka pakko kai on my&ouml;nt&auml;&auml;, ett&auml; raskaampaan suuntaan olen melko kallellaan, tusinadiscopopista visusti poisp&auml;in. Ja jos K&auml;rp&auml;t nousee SM-liigaan, minut tapaa ensi talvena kausikorttipaikalta Raksilan j&auml;&auml;hallista. Opinnoissa aloittelen parhaillaan graduntekoa Maatalouden tutkimuskeskuksen alaisuudessa, aiheena kastelierot ja salaojat. Linja siis pit&auml;&auml;: ei mit&auml;&auml;n s&ouml;p&ouml;&auml; ja p&ouml;rr&ouml;ist&auml;...
						<p>V&auml;h&auml;n aikaa sitten jossakin kansainv&auml;lisess&auml; Amiga-uutisryhm&auml;ss&auml; ep&auml;toivoiselta kuulostava mieshenkil&ouml; etsi koira- ja kissaikoneja, jotta voisi koukuttaa tytt&ouml;yst&auml;v&auml;ns&auml; k&auml;ytt&auml;m&auml;&auml;n Amigaa. Ihmiset ovat tietysti erilaisia, mutta itse olen sit&auml; mielt&auml;, ett&auml; omalla kohdallani houkuttelu on toteutettu paljon elegantimmin ja tehokkaammin (ja huomaamattomammin ;-)). Hienoja ikoneita on tietysti kiva katsella, mutta vain jos ne ovat ik&auml;&auml;nkuin pisteen&auml; iin p&auml;&auml;ll&auml;. Vaadin koneelta paljon muutakin, jotta sen k&auml;ytt&ouml; olisi mukavaa. Ja Amigan k&auml;ytt&ouml; on. Olen viel&auml; sen verran huonosti perill&auml; ohjelmistoyksityiskohdista, ett&auml; en pysty t&auml;ss&auml; tarkasti nime&auml;m&auml;&auml;n noita tekij&ouml;it&auml;. Mutta lupaan kertoa heti, kun osaan!
					</td>
				</tr>
			</table>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font><p></center>
	</body>

</html>
