<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Adobe GoLive 4">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suhtari</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Petri Keckman &lt;<a href="mailto:keckman@mbnet.fi">keckman@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kumoan t&auml;ss&auml; artikkelissa Einsteinin suhteellisuusteorian ja Cantorin &auml;&auml;rett&ouml;myysopin. Kumoan loogisesti ja matemaattisesti perustellen, ett&auml; sek&auml; modernin uudenaikaisen luonnontieteen ett&auml; matematiikan perustat eiv&auml;t voi kuvata todellisuutta. Syy siihen, ett&auml; t&auml;m&auml; artikkeli julkaistaan Sakussa, ei ole siin&auml;, etteik&ouml; t&auml;t&auml; varmasti olisi hyv&auml;ksytty my&ouml;s Scientific America -lehteen (jos olisin vaivautunut edes yritt&auml;m&auml;&auml;n), vaan siin&auml;, ett&auml; min&auml; en kelpuuta kyseist&auml; lehte&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Mik&auml; on suhteellisuusteoria?</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suhteellisuusteoria ja Einstein symbolisoivat usein jotain tavalliselle ihmiselle l&auml;hes k&auml;sitt&auml;m&auml;t&ouml;nt&auml; ja samalla jotain sellaista, jota tavallisen ihmisen ei kannattaisi kritisoida. Fysiikka ja matematiikka ovat jotain, joiden ymm&auml;rt&auml;miseen tarvitsee monivuotisen koulutuksen (ts. aivopesun). Einstein on nostettu ja hypetetty suuren ja mahtavan tieteen ikoniksi. Jos joku v&auml;itt&auml;&auml; tosissaan, ett&auml; suhteellisuusteoria on v&auml;&auml;r&auml;ss&auml;, perustelee kantansa, antaa tilalle paremman selityksen ja samalla selitt&auml;&auml;, miksi koetulokset n&auml;ytt&auml;v&auml;t puoltavan suhteellisuusteoriaa, niin jossain on pahasti jotain vikaa - joko tuon jonkun psyykeess&auml;, tai sitten koko tiedemaailma on t&auml;ynn&auml; herkk&auml;uskoisia pellej&auml;. Tiedemaailman fyysikot ovat tietysti sit&auml; mielt&auml;, ett&auml; jos joku v&auml;itt&auml;&auml; suhteellisuusteorian olevan v&auml;&auml;r&auml;, niin h&auml;n on ymm&auml;rt&auml;nyt siit&auml; jotain v&auml;&auml;rin tai ei ole ymm&auml;rt&auml;nyt sit&auml; ollenkaan.
						<p>Einsteinin suhteellisuusteoria on v&auml;kin&auml;inen selitys kahdelle samaan aikaan voimassa olevalle tosiasialle: 1. nopeus on suhteellista ja 2. valonnopeus on kuitenkin aina vakio c=299792,4562 km/s. Nopeuden suhteellisuusperiaatteen toi fysiikkaan jo Galilei (1564-1642). Sen mukaan emme voi puhua nopeudesta muuten kuin suhteessa johonkin. Jos olisin el&auml;nnyt ennen 1500-lukua, niin olisin varmasti keksinyt nopeuden suhteellisuusperiaatteen - niin itsest&auml;&auml;nselv&auml; se on. Jos auto ajaa tienpintaan n&auml;hden nopeudella 100 km/h ja mittaat auton nopeutta paikaltasi, niin mittaat sen l&auml;hestymiselle saman nopeuden itseesi n&auml;hden. Mutta jos poljet polkupy&ouml;r&auml;ll&auml; autoa vastaan nopeudella 45 km/h, niin sinun ja auton v&auml;limatka lyhenee nopeudella 145 km/h.</p>
						<p>Mutta samapa ei p&auml;dek&auml;&auml;n valolle. Jos olet paikallasi ja mittaat l&auml;hestyv&auml;lle valolle nopeuden 1079252842,32 km/h, niin vaikka juoksisit valoa vastaan miljardi kilometri&auml; tunnissa, edelleen valo l&auml;hestyisi sinua vain samalla nopeudella 299792,4562 km/s. Ja sama vaikka yritt&auml;isit juosta valoa karkuun, niin havaitsisit sen saavuttavan sinua aina nopeudella c=299792456,2 m/s.</p>
						<p>Valonnopeuden vakioisuus on osaksi mitattu tosiasia. Ei havaita eroa sen suhteen, mitataanko valon nopeutta maapallolla siihen suuntaan kuin maapallo py&ouml;rii auringon ymp&auml;ri tai vastakkaiseen. T&auml;ll&auml; tempulla herrat Michelson ja Morley 1800-luvulla k&auml;sitt&auml;&auml;kseni tosin poistivat vain eetterin k&auml;sitteen fysiikasta. Aikaisemmin oli ajateltu, ett&auml; maailmankaikkeuden t&auml;ytt&auml;&auml; eetteri, joka toimisi valoaaltoilmi&ouml;iden &quot;kentt&auml;n&auml;&quot;. Aaltoliike kun on v&auml;r&auml;htely&auml;, ja ajateltiin, ett&auml; samoin kuin meren aallot tarvitsevat veden, niin valo tarvitsisi eetterin tai jotain muuta yht&auml; sekavaa edet&auml;kseen.</p>
						<p>Koska siis valonnopeuden ei havaittu muuttuvan maapallon liikkeiden suhteen, ei maailmankaikkeutta voi peitt&auml;&auml; mik&auml;&auml;n absoluuttisessa levossa oleva eetteri, jonka suhteen valo kulkisi vakionopeudella. Sill&auml; tuskin maapalloa voitaisiin pit&auml;&auml; levossa olevana maailmankaikkeuden levossa olevaan eetteriin n&auml;hden (levossa ja levossa... joko rupeavat eetterihuurut v&auml;sytt&auml;m&auml;&auml;n?). Mutta Michelsonin kokeessa ei kuitenkaan siis mitattu sit&auml;, muuttuuko valonnopeus, jos mittaaja liikkuu valons&auml;teeseen n&auml;hden. Kokeessahan k&auml;ytettiin itsetehty&auml; valons&auml;dett&auml;, jonka aiheuttajaan n&auml;hden mittalaite oli levossa maapallolla.</p>
						<p>Joka tapauksessa, riippumatta siit&auml;, onko sit&auml; kokeellisesti todistettu vai ei, valonnopeuden vakioisuudelle l&ouml;ytyy muitakin perusteluja kuin empiiriset havainnot ja kokeet. Maxwellin s&auml;hk&ouml;yht&auml;l&ouml;it&auml; voidaan pit&auml;&auml; muuttumattomina p&auml;teviksi sek&auml; liikkuvissa koordinaatistoissa ett&auml; paikallaan pysyviss&auml; vain jos valonnopeus on aina vakio. Lis&auml;ksi jos valohiukkasta fotonia haluttaisiin kiihdytt&auml;&auml;, niin mill&auml;p&auml;s voimalla kiihdyt&auml;t sit&auml; kaavan F=ma mukaisesti - jos kerran fotonin massa on nolla, saadaan F=0*a=0 aina.</p>
						<p>Minulla on tieteen ulkopuoleltakin tulevia perusteita valon vakioisuudelle:</p>
						<ol>
							<li>Jumala antoi ihmisille silm&auml;t ja kyvyn n&auml;hd&auml; aina.
							<li>Jumala haluaa, ett&auml; ihminen tulee t&auml;ytt&auml;m&auml;&auml;n maailmankaikkeuden (mutta ei viel&auml;, vasta sitten kun edes kotiplaneetta on kondiksessa).
							<li>Siksi jumala antoi ihmiselle kyvyn lent&auml;&auml; raketilla vaikka kuinka nopeasti ja lis&auml;&auml;nty&auml; eksponentiaalisesti.
						</ol>
						<p>Jos nyt valonnopeus ei olisi aina vakio, niin sattuisi silm&auml;&auml;n, jos l&auml;hestytt&auml;isiin Andromedan galaksia nopeudella 30*c ja fotonit pommittaisivat silm&auml;&auml;. Ja t&auml;lle tosiasialle Einstein ei keksinyt muuta ratkaisua kuin sen, ett&auml; h&auml;n l&auml;hti venyttelem&auml;&auml;n ja lyhentelem&auml;&auml;n pituuksia ja ajanjaksoja. H&auml;n kehitti ajatuksen, ett&auml; pituus ja aika ovat suhteellisia eli ett&auml; ne riippuvat havaitsijan nopeudesta mitattavaan pituuteen tai ajanv&auml;liin n&auml;hden.</p>
						<p>Nopeudesta ajanv&auml;liin n&auml;hden? Ehk&auml; kieleni ei ole ihan tarkkaa ja oikeaa, mutta idea on se, ett&auml; jos paikallaan oleva mittaa tapahtumille aikav&auml;lin t0, niin nopeudella v paikallaan olevaan n&auml;hden liikkuva mittaa tapahtumien v&auml;liksi t=t0/Sqrt(1-v&sup2;), miss&auml; yksinkertaisuuden vuoksi v = nopeus km/s / 299792,4562 km/s. Eli jos esim. liikuttaisiin puolet valonnopeudesta v=0,5 saadaan sekunnin pituudeksi 1s/Sqrt(1-0,5&sup2;)=1/Sqrt(0,75)=1,1547 s.</p>
						<center>
							<p><img height="53" width="271" src="kuvat/suhtis_1.gif" border="0" alt=" "></p>
						</center>
						<p>Eli kun puolet valonnopeudesta liikkuvassa aluksessa kuluu vuosi, kuluu maassa vuosi ja 0,1547*365,25 = 56 ja puoli p&auml;iv&auml;&auml;. N&auml;ytt&auml;&auml; kuin liikkeess&auml; olevassa aluksessa aika kulkisi hitaammin. Mutta koska nopeus on suhteellista, voidaan yht&auml; hyvin sanoa, ett&auml; maa liikkuu alukseen n&auml;hden nopeudella 0,5c, ja kun maassa kuluu sekunti, havaitaan se aluksesta k&auml;sin 1,1547 sekunniksi. Eli nyt n&auml;ytt&auml;isikin, ett&auml; aika kulkisi maassa hitaammin.</p>
						<p>Onko t&auml;m&auml; paradoksi? Ei kuulemma aiheuta ongelmaa, koska aika on suhteellista. Se vain mitataan tietyn pituiseksi. Ja erityisesti siksi t&auml;m&auml; ei haittaa, kun erikoisessa suhteellisuusteoriassa, josta t&auml;ss&auml; puhutaan, k&auml;sitell&auml;&auml;n vain tasaisessa liikkeess&auml; olevia havaitsijoita. Kuitenkin jos haluttaisiin tarkistaa kellot, jotka molemmat ovat k&auml;yneet hitaammin kuin toinen, niin jouduttaisiin tekem&auml;&auml;n kiihtyvi&auml; liikkeit&auml;. Yleisess&auml; suhteellisuusteoriassa ei kuulemma ongelmaa ole - tai niin sanotaan, en tied&auml; onko kukaan tarkistanut laskuilla.</p>
						<p>Kun ajanv&auml;lit kasvavat, niin pituudet sit&auml; vastoin lyhenev&auml;t samalla skaalaustekij&auml;ll&auml; Sqrt(1-v&sup2;), jolla nyt ei jaeta vaan kerrotaan. Keppi, joka on aluksessa metrin pituinen, mitataan maasta k&auml;sin 1*Sqrt(1-0,5&sup2;) m = 86 cm ja 60 mm.</p>
						<p>Ennen Einsteinia Newton oli aikanaan omaksunut absoluuttisen ajan k&auml;sitteen. Aika oli jotain, joka aina ja kaikkialla &quot;virtaa&quot; samalla nopeudella eteenp&auml;in, ja koko maailmankaikkeuden t&auml;ytt&auml;&auml; suuri &quot;nyt&quot;. Matemaattisesti voidaan tarkastella tuota ajan nopeutta ja virtaamista. Nopeushan on suure, jossa aikayksikk&ouml;&auml; kohti tapahtuu jokin m&auml;&auml;r&auml; jollain toisella yksik&ouml;ll&auml; ilmaistavan suureen mukaisia ilmi&ouml;it&auml;. Jos puhutaan ajan nopeudesta, saataisiin s/s, mik&auml; on yksi (1). Tai jos sanotaan, ett&auml; aika kulkee puolet hitaammin nopeasti kulkevassa aluksessa kuin paikallaan olevassa, saataisiin 0,5 s/s. 0,5 mit&auml;? Ei mit&auml;&auml;n. Pelkk&auml; 0,5. Voisi sanoa buddhalaisesti, ett&auml; aika ei itseasissa kulje mihink&auml;&auml;n, vaan kaikki maailman tapahtumat, menneet ja tulevat tapahtumat samanaikaisesti.</p>
						<p>Einstein l&auml;hti miettim&auml;&auml;n samanaikaisuuden k&auml;sitett&auml;. Mill&auml; varmennetaan, ett&auml; kaksi tapahtumaa tapahtuvat samanaikaisesti? Siihen h&auml;n ei keksinyt muuta keinoa kuin ett&auml; l&auml;hetet&auml;&auml;n valosignaaleja paikasta toiseen. Koska valonnopeus on suurin luonnossa havaittu nopeus, antaa se tarkimman keinon samanaikaisuuden m&auml;&auml;rittelemiseen. Valonnopeus on kuitenkin siis vain &auml;&auml;rellinen, ja t&auml;m&auml; j&auml;tt&auml;&auml; samanaikaisuuden m&auml;&auml;ritt&auml;miseen pient&auml; ep&auml;m&auml;&auml;r&auml;isyytt&auml; ja samoin ajanjaksojen pituuteen. Ja t&auml;m&auml; ep&auml;m&auml;&auml;r&auml;isyys mahdollisti sen, ett&auml; ylip&auml;&auml;ns&auml; voitiin l&auml;hte&auml; v&auml;s&auml;&auml;m&auml;&auml;n suhteellisuusteoriaa. Einstein oli positivisti ja uskoi, ett&auml; asioista, joita ei voi mitata tai havainnoida, ei kannata puhua.</p>
						<p>Suhteellisuusteoria tuntuu &auml;kki&auml; j&auml;rkeenk&auml;yv&auml;lt&auml;. Jos kerran valonnopeus mitataan aina vakioksi ja nopeus on pituuden suhde ajanv&auml;liin, niin pituutta ja aikaahan sit&auml; on l&auml;hdett&auml;v&auml; jotenkin rukkaamaan, jotta se olisi mahdollista?</p>
						<center>
							<p><img height="27" width="207" src="kuvat/suhtis_2.gif" border="0" alt=" "></p>
						</center>
						<p>Vanhan nopeuksien yhteenlaskukaavan v=v1+v2 sijaan Einstein kehitti uuden, miss&auml; v=(v1+v2)/(1+v1*v2), miss&auml; taas nopeudet v1 ja v2 on ilmaistu suhteessa valonnopeuteen. Esimerkiksi kaksi puolet valonnopeudesta kulkevaa alusta t&ouml;rm&auml;isiv&auml;t toisiinsa nopeudella (0,5+0,5)/(1+0,5*0,5)=0,80. Tuotakaan kaavaa en kyll&auml; t&auml;ysin ymm&auml;rr&auml;. Nopeushan on suuntavektori, ja toisiaan vastaan liikkuville aluksille (v1=-v2) saataisiin (0,5-0,5)/(1-0,5*0,5))=0. ehk&auml; pit&auml;isikin puhua vauhtien yhteenlaskukaavasta?</p>
						<p>Oletetaan seuraavanlainen tilanne: olet pienell&auml; asteroidilla, jota kahdesta vastakkaisesta suunnasta l&auml;hestyv&auml;t pommiraketit nopeudella 0,9 eli noin 269813 km/s, ja ne ovat juuri 269813 kilometrin p&auml;&auml;ss&auml;. Niiden v&auml;linen et&auml;isyys toisistaan on 539626 km, ja ne t&ouml;rm&auml;&auml;v&auml;t sinuun molemmat sekunnin kuluttua. Etk&ouml; silloin havaitse, ett&auml; alusten v&auml;linen et&auml;isyys pieneni nopeudella 539626 km sekunnissa? Kyseess&auml; t&auml;ytyy olla ajatusvirhe, sill&auml; valonnopeushan on ehdoton yl&auml;raja. Ja eih&auml;n t&auml;ss&auml; mik&auml;&auml;n liiku yli valonnopeudella. Sin&auml; pysyt paikallasi ja alukset l&auml;hestyv&auml;t sinua nopeudella 0,9 ja havaitsevat l&auml;hestyv&auml;ns&auml; toisiaan nopeudella 0,9945 (=298136 km/s). Se on ihan sama, mit&auml; sin&auml; siin&auml; v&auml;liss&auml; mittailet alusten l&auml;hestyv&auml;n toisiaan. Ja sit&auml; paitsi, jos alukset ovat pommiraketteja, niin juuri sill&auml; hetkell&auml; kun tulisit varmuuteen siit&auml;, ett&auml; alukset tosiaankin l&auml;hestyiv&auml;t toisiaan nopeudella 539626 km/s, olisit jo atomeina.</p>
						<center>
							<p><img height="96" width="364" src="kuvat/suhtis_3.gif" border="0" alt=" "></p>
						</center>
						<p>Tai mietit&auml;&auml;n tilannetta toisaalta. Kun asteroidilla kuluu siis yksi sekunti, kuluu aluksissa 2,294 sekuntia. Havaitsevatko ne siis l&auml;hestyv&auml;ns&auml; sinua 539626 km 2,294 sekunnissa eli hitaammin kuin sin&auml;? Ei, kun ajan lis&auml;ksi my&ouml;s pituus on suhteellista, ja sen pituudeksi, mille sin&auml; mittaat 539626 km, ne mittaavat 235218 km. T&auml;st&auml; saadaankin, ett&auml; ne mittaavat nopeudekseen 235218 km/2,294 s = 102529 km/s = 0.342c, mik&auml; on ihan eri luokkaa kuin nopeuksien yhteenlaskukaavasta saatu (0,9+0,9)/(1-0,9*0,9)=0,9945. T&auml;ss&auml; on nyt saatu laskemalla tai j&auml;rkeilem&auml;ll&auml; yhdelle nopeudelle kolme eri arvoa.</p>
						<ol>
							<li>1,8c (sin&auml; havaitset 0,9+0,9=1,8)
							<li>0,9945c (laskukaava antaa (0,9+0,9)/(1+0,9*0,9)
							<li>0,342c (aluksessa olijat mittailevat l&auml;hestyv&auml;ns&auml; aikav&auml;liss&auml; = 1sek/sqrt(1-v&sup2;) et&auml;isyyden sqrt(1-v&sup2;) * 1,8c kun sin&auml; mittasit 1 s ja 1.8*c.
						</ol>
						<p>Pistet&auml;&auml;n t&auml;h&auml;n nyt viel&auml; nelj&auml;skin nopeus: aluksessa olijathan olisivat voineet etuk&auml;teen voineet mitata vaikka mittanauhalla, ett&auml; ne olivat 539626 kilometrin p&auml;&auml;ss&auml; toisistaan, ja sitten ne havaitsevat, ett&auml; ne t&ouml;rm&auml;&auml;v&auml;t toisiinsa 2,294 sekunnin kuluttua ja p&auml;&auml;ttelisiv&auml;t t&auml;st&auml;, ett&auml; matkattiin 539626 km 2,294 sekunnissa eli nopeudella 0,7846c.</p>
						<p>Mietit&auml;&auml;n tuota kolmatta. Mist&auml; aluksessa olijat tiet&auml;v&auml;t liikkuvansa nopeudella 0,9c sinua kohti ja osaavat sijoittaa oikean v:n kaavaan? He eiv&auml;t sit&auml; tied&auml;k&auml;&auml;n, vaan t&auml;ss&auml; me laskemme, mink&auml; pituuden ja ajanv&auml;lin he havaitsevat eli mill&auml; nopeudella he mittaavat l&auml;hestyv&auml;ns&auml; toisiaan, kun me tied&auml;mme heid&auml;n liikkuvan nopeudella 0,9c meihin n&auml;hden.</p>
						<p>Korostan nyt t&auml;t&auml;: suhteellisuusteorian yhteenlaskukaava, joka on johdettu Lorentzin koordinaatiomuunnoskaavoista antaa aluksille l&auml;hestymisnopeudeksi 0,9945c. Mutta suhteellisuusteorian lyhennetyt pituudet ja venytetyt ajanjaksot -kaavat kertovat meille, ett&auml; he mittaavat nopeudekseen 0,342c.</p>
						<p>Fysiikassahan korostetaan havainnointia. Ja koko suhtis on saannut alkunsa positivistisesta l&auml;ht&ouml;kohdasta: jos samanaikaisuutta ei voida mittaamalla m&auml;&auml;ritt&auml;&auml;, niin siit&auml; on turha puhua. Mit&auml; muita tapoja aluksissa olevilla on mitata l&auml;hestymisnopeuttaan kuin mitata jokin et&auml;isyyys ja siihen k&auml;ytetty aika? Suhteellisuusteorian pituuden lyhenemisen ja ajan venymisen kaavat kertovat heid&auml;n mittaavan l&auml;hestymisnopeudekseen 0,342c.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Mink&auml; selityksen min&auml; annan?</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Min&auml; selit&auml;n valonnopeuden vakioisuuden siten, ett&auml; sen sijaan, ett&auml; aika ja pituus olisivat suhteellisia, niin valo onkin suhteellista. Mist&auml; voimme koskaan olla varmoja, ett&auml; kaksi eri havaitsijaa mittaisivat samalle valolle nopeutta? Emme mist&auml;&auml;n. T&auml;m&auml; tulkinta on sopusoinnussa kvanttifysiikan maailmakuvan kanssa. Kvanttifysiikan er&auml;&auml;n tulkinnan mukaan vasta havainto luo ulkomaailman. Kaavat kuvaavat ulkomaailman tapahtumia tietyll&auml; todenn&auml;k&ouml;isyydell&auml;, ja hiukkasella ei ole tarkkaa paikkaa ennen sen havaintoa. Tai pidemm&auml;lle vietyn&auml;, koko hiukkasta ei ole olemassa kuin vasta havainnossa.
						<p>Tai toki jotain on olemassa, mutta sille tavalle, jolla me havainnomme ulkopuolista todellisuutta, on kuvaavaa, ett&auml; ne arvot, joita mittaamme ulkomaailman ominaisuuksille, aktualisoituvat lopullisesti vasta havainnossa. Voidaan jopa sanoa, ett&auml; kun kaksi ihmist&auml; katsoo p&ouml;yd&auml;ll&auml; olevaa appelssiinia, niin eiv&auml;t he samaa appelssiinia katso. Tai kuten piispa Berkeley 1800-luvulla pohti: &quot;Jos kukaan ei ole katsomassa mets&auml;ss&auml; olevaa puuta, niin onko sit&auml; olemassa?&quot; Kvanttifysiikan antama maailmankuva on sen luonteinen, ett&auml; vastaus piispan kysymykseen on &quot;ei&quot;.</p>
						<p>Nyt jokainen havainnoitsija luo er&auml;&auml;nlaisen oman maailmaneetterins&auml; (sen joka 1800-luvulla poistettiin fysiikan maailmankartalta). Maailma ts. havaintomaailma vain on sen luonteinen, ettei valon voida havaita kulkevan muulla nopeudella kuin vakionopeudella. Kaksi eri nopeudella - tai vaikka samallakin - liikkuvaa havaitsijaa eiv&auml;t mittaa samalle valolle samaa nopeutta, vaan &quot;eri valolle&quot;.</p>
						<p>Miksi sitten esim. massojen havaitaan kasvavan hiukkaskiihdyttimiss&auml;? Ai niin. Olen kokonaan unohtanut kertoa, ett&auml; Einstein keksi my&ouml;s, ett&auml; kun kappale liikkuu, niin sen massa kasvaa. Mit&auml; l&auml;hemp&auml;n&auml; valonnopeutta sen nopeus on, sit&auml; suurempi massa ja sit&auml; enemm&auml;n energiaa tarvitaan sen kiihdytt&auml;miseen. Siksi ei voida kiihdytt&auml;&auml; valonnopeuteen, kun massa l&auml;hestyy &auml;&auml;ret&ouml;nt&auml;. Massan kasvun lausekkeessa, joka on sama kuin ajan pitenemisen lauseke, jakaja Sqrt(1-v&sup2;) l&auml;hestyy nollaa ja osam&auml;&auml;r&auml; kasvaa rajatta.</p>
						<center>
							<p><img height="59" width="241" src="kuvat/suhtis_4.gif" border="0" alt=" "></p>
						</center>
						<p>Selitys on liian yksinkertainen: nykyiset koej&auml;rjestelyt eiv&auml;t mill&auml;&auml;n tavalla puolla massankasvua. Hiukkaskiihdyttimiss&auml;h&auml;n hiukkasten nopeutta kasvatetaan antamalla niille magneettisia impulsseja. Mitk&auml; hiukkaset v&auml;litt&auml;v&auml;t magneettisia voimia? Valohiukkaset, jotka eiv&auml;t voi kulkea kuin valonnopeudella. On itsest&auml;&auml;n selv&auml;&auml;, ettei hiukkaskiihdyttimiss&auml; voida mit&auml;&auml;n kiihdytt&auml;&auml; yli valonnopeuteen t&auml;ysin riippumatta siit&auml;, p&auml;teek&ouml; suhteellisuusteoria vai ei. Kun impulssinantajahiukkanen fotoni ei saa kiihdytett&auml;vi&auml; hiukkasia edes kiinni, jos ne kulkisivat valonnopeutta. Ei auta, vaikka hiukkasiin kohdistettaisiin vaikka miten voimakkaita magneetteja.</p>
						<p>Ent&auml; raketit? Voidaanko niit&auml; kiihdytt&auml;&auml; mielivaltaisen suureen nopeuteen? Fysiikassahan on edelleen voimassa liikkeen jatkuvuuden laki. Jos jokin kappale liikkuu nopeudella v, niin se liikkuu tasaisesti sill&auml; nopeudella, ellei mik&auml;&auml;n ulkopuolinen voima siihen vaikuta. Tasaisessa liikkeess&auml; nopeudella 0,9999c liikkuva ei havaitse itse mit&auml;&auml;n erikoista. H&auml;n painaa saman verran kuin aiemminkin, ja kello tikitt&auml;&auml; edelleen kerran sekunnissa. Mik&auml; est&auml;isi kiihdytt&auml;m&auml;st&auml; t&auml;t&auml; rakettia edelleen? Rakettimoottoreihin n&auml;hdenh&auml;n raketin nopeus on nolla, joten ei sen massa ole suhteellisuusteoriankaan mukaan kasvanut impulssinantajaan n&auml;hden. Ja vaikka massa kasvaisikin, niin samassa suhteessahan kasvaisi my&ouml;s rakettimoottorille impulsseja antavien hiukkasten massa, mik&auml; kompensoisi raketin kiihdytt&auml;miseen yh&auml; suurempaa tarvittavaa energiaa.</p>
						<p>Ja tuo massankasvu on saatu suhteellisuusteorian yht&auml;l&ouml;ihin vain sit&auml; kautta, ett&auml; kaavasta E=mc^2 on p&auml;&auml;telty v&auml;&auml;rin, ett&auml; energialla olisi aina massaa, ja ett&auml; kun siis hiukkanen tai kappale saa liike-energiaa, niin sen massakin kasvaisi. P&auml;&auml;teltiin tietysti v&auml;&auml;rin, koska se sopi niin n&auml;tisti kuvaan, ettei mit&auml;&auml;n lepomassaa omaavaa voida kiihdytt&auml;&auml; alle valonnopeudesta valonnopeuteen. Kaava pit&auml;&auml; kuitenkin sis&auml;ll&auml;&auml;n vain sen, ett&auml; massa sis&auml;lt&auml;&auml; energiaa, ja hiukkaskiihdyttimiss&auml; tietyn hiukkasen synnytt&auml;miseen tarvitaan tietty energiam&auml;&auml;r&auml;. Mutta ei t&auml;st&auml; voida p&auml;&auml;tell&auml;, ett&auml; energia aina &quot;painaisi&quot; tai ett&auml; sill&auml; olisi massaa. Kaavassa esiintyv&auml;lle E:lle on annettu v&auml;&auml;r&auml; tulkinta.</p>
						<p>Pienen&auml; v&auml;lihuomautuksena muuten hiukkauskiihdytin fyysikoista: min&auml; olen sit&auml; mielt&auml;, ett&auml; hiukkaskiihdyttimill&auml; tutkitaan l&auml;hinn&auml; hiukkaskiihdyttimi&auml;. Ne olosuhteet, joita niiss&auml; saavutetaan, muistuttavat olosuhteita silloin kun maailmankaikkeus oli aluillaan, jolloin maailmankaikkeuttamme karakterisoivia luonnonvakioita ei ollut viel&auml; ly&ouml;ty lukkoon. Planckin vakio, valonnopeus, elektronin lepomassa jne. olisivat periaatteessa voineet saada mit&auml; tahansa muitakin arvoja. Mahdollisten maailmankaikkeuksien lukum&auml;&auml;r&auml; on &auml;&auml;ret&ouml;n. Mit&auml; kauemmaksi prosessi on edennyt, sit&auml; v&auml;hemm&auml;n sill&auml; on vaihtoehtoja valittavanaan.</p>
						<p>Meid&auml;n havaitsemamme maailmankaikkeus laajuudessaan ja maanp&auml;&auml;llisess&auml; kauneudessaan koostuu vain protoneista, elektroneista ja neutroneista ja parista muuta hiukkasesta, joita en nyt jaksa kirjasta tarkistaa, ja antanut piutpaut muille. Edes kvarkkiteoriaa ei kai tarvita v&auml;ltt&auml;m&auml;tt&auml; meid&auml;n nykyisen maailmankaikkeuden hiukkasten mallintamiseen. Hiukkaskiihdyttimill&auml; luodaan loputtomiin uusia ja uusia hiukkasia. On ajan ja yhteisten verorahojemme haaskausta rakentaa aina vain kalliimpia ja kalliimpia hiukaskiihdyttimi&auml; ja kuvitella luovansa jotain suurta yhten&auml;isteoriaa. Mielummin kenties yritt&auml;isimme j&auml;rjell&auml;mme p&auml;&auml;tell&auml;, ett&auml; jos planckin vakio on toi ja valonnopeus toi, niin mink&auml;h&auml;nlaisia maailmankaikkeuksia siit&auml; tulisi, jos v&auml;ltt&auml;m&auml;tt&auml; edes ket&auml;&auml;n kiinnostaa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Taidetta tieteest&auml;</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Se hy&ouml;ty suhteellisuusteorian kaavoista on, ett&auml; niill&auml; saa tietokoneen avustuksella piirretty&auml; komeita kuvia. Oheinen kuvaa lausekkeen m/Sqrt(1-v&sup2;) kasvua kun v l&auml;hestyy yht&auml;. Y-akseli eli ruudun vasen reuna kuvastaa massan arvoa, joka mahtuu siis n&auml;yt&ouml;lle v&auml;lilt&auml; 0...256. Luonnollisesti koordinaatisto on k&auml;&auml;nnetty siten, ett&auml; nolla on vasemmassa alakulmassa. X-akselin suuntaisesti kasvaa nopeus. N&auml;ytt&auml;isik&ouml; silt&auml;, ett&auml; massan kasvu on sit&auml; voimakkaampaa, mit&auml; suurempi lepomassa ts. mit&auml; ylemp&auml;&auml; Y-akselista k&auml;yr&auml; l&auml;htee? K&auml;yr&auml;th&auml;n n&auml;ytt&auml;v&auml;t kasvavan sit&auml; voimakkaammin, mit&auml; ylemp&auml;&auml; ne l&auml;htev&auml;t. Ei. Massa kaksinkertaistuu aina samassa nopudessa 2=1/Sqrt(1-v&sup2;), josta v=0,866. Kun lepomassa on pieni, esim. yksi, on sen m&auml;&auml;r&auml;llinen kasvu kaksinkertaiseksi vain niin pient&auml;, ettei se kuvaajissa n&auml;y. Ohessa kuvaajan piirt&auml;v&auml; C-kielinen <a href="suhtiskuvaajat.exe">ohjelma</a> ja sen <a href="suhtiskuvaajat.c">l&auml;hdekoodi</a>.
						<center>
							<p><img height="128" width="320" src="kuvat/suhtis_5.gif" border="0" alt=" "></center>
					</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Jatkoa nopeuksien yhteenlaskulle</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Artikkelin kirjoittamisen ja l&auml;hett&auml;misen j&auml;lkeen mietiskelin tuota nopeuksien yhteenlaskua lis&auml;&auml; (vain saadakseni syyn piirt&auml;&auml; siit&auml; kivan kuvan). Siis v=(v1+v2)/(1+v1*v2). Jos siis kaksi valons&auml;dett&auml; l&auml;hestyy toisiaan, niin v1=1 ja v2=-1 ja niiden v&auml;linen nopeus on (1-1)/(1-1)=0/0, mik&auml; on m&auml;&auml;rittelem&auml;t&ouml;n ja voi olla melkein mit&auml; tahansa, kuten oheisesta kuvasta huomaa. Siin&auml; siis nopeus v1 kasvaa X-akselia pitkin -1....1 ja v2 kasvaa alhaalta yl&ouml;s samoin -1....1. V&auml;rikoodein on ilmaistu pisteess&auml; oleva yhteenlaskettu nopeus. Kuten n&auml;hd&auml;&auml;n, jos kaksi hiukkasta liikkuvat l&auml;hell&auml; nopeuksia 1 ja -1 eli eri suuntiin l&auml;hes valonnopeudella, havaitaan toisen liikkuvan toisesta v&auml;lill&auml; l&auml;hes valonnopudella poisp&auml;in, v&auml;lill&auml; l&auml;hes valonnopeudella samaan suuntaan ja v&auml;lill&auml; pysyv&auml;n paikallaan. Ihan siit&auml; riippuen, kuinka luvut sattuvat heilumaan lukujen v1=1......0,99999 ja v2=-1....-0,99999 seutuvilla.
						<p>Jos valons&auml;de etenee oikealle, niin voit pysy&auml; paikallasi ja et&auml;isyytesi kasvaa valons&auml;teest&auml; valonnopeudella, sill&auml; (0+1)/(1+0*1)=1. T&auml;m&auml; on itsest&auml;&auml;n selv&auml;&auml; (suhteellisuusteoria anta my&ouml;skin j&auml;rkevi&auml; tuloksia!). Jos valon s&auml;dett&auml; hitaammin kulkeva hiukkanen, vaikka vain millinkin vuodessa hitaammin kulkeva hiukkanen, kulkee samaan suuntaan kuin valo, niin sekin et&auml;&auml;ntyy valons&auml;teest&auml; valonnopeudella. Sill&auml; (1+0,9999999)/(1+1*0,99999999)=1. Siis kuten sanoin: hiukkanen kulkee l&auml;hes millilleen saman matkan vuodessa kuin valo, mutta et&auml;&auml;ntyy valosta silti valonnopeudella. Jos havaitsen hiukkasen et&auml;&auml;ntyv&auml;n valosta yhden millimetrin vuodessa, niin eik&ouml; minun fyysikkona pit&auml;isi luottaa havaintoon?</p>
						<center>
							<p><a href="kuvat/suhtis_6.gif" target="_blank"><img height="128" width="320" src="kuvat/suhtis_6s.gif" border="0" alt=" "></a></p>
						</center>
						<p>Vai onko t&auml;ss&auml; nyt siit&auml; kyse, ett&auml; valonnopeudella liikkuvasta valons&auml;teest&auml; tarkasteltuna hiukkanen j&auml;&auml; j&auml;lkeen 299792,4562 km/s? Aikahan hidastuu ja pysyy itse asiassa paikallaan valons&auml;teess&auml;. Siis kun min&auml; mittaan hiukkasen j&auml;&auml;v&auml;n j&auml;lkeen yhden millimetrin vuodessa, niin valons&auml;teess&auml; on kulunut &auml;&auml;rett&ouml;m&auml;n lyhyt aika ja se voi mitata hiukkasen kulkevan nopeudella 1 mm/0 s, mik&auml; onkin melko huima nopeus. Toisaalta jos hiukkanen kulkisi valonnopeudellakin, niin se j&auml;isi silti j&auml;lkeen valosta 299792,4562 km/s, sill&auml; (1+1)/(1+1*1)=1. Toisaalta valokin j&auml;isi hiukkasesta j&auml;lkeen tuolla samalla nopeudella.</p>
						<p>Nyt artikkelin kirjoittamisen j&auml;lkeen, kun joutui v&auml;h&auml;n miettim&auml;&auml;n ja tekem&auml;&auml;n itselle selviksi noita asioita niin alkaa tuntua, ett&auml; saattoi se Einstein sittenkin olla oikeassa. Tied&auml; h&auml;nt&auml;. Ai niin, ent&auml; Cantorin &auml;&auml;rett&ouml;myysoppi? Taidankin j&auml;tt&auml;&auml; sen seuraavaan kertaan. Kyll&auml; se riitt&auml;&auml; yhdelle artikkelille, ett&auml; siin&auml; osoitetaan suhteellisuusteoria hyv&auml;ksi huonoksi yritykseksi selitt&auml;&auml; valonnopeuden vakioisuus.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Viimeiset sanani fyysikoille</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">L&auml;hestyk&ouml;&ouml;n raketti &quot;paikallaan olevaa&quot; asteroidia tasaisella nopeudella. Nykyfysiikassa on suhteellisuusteoriasta huolimatta voimassa nopeuden suhteellisuusperiaate. Jos kappale I liikkuu kappale II:een n&auml;hden nopeudella v1, niin kappale II liikkuu kappale I:een n&auml;hden nopudella v2=v1. Mutta onko suhteellisuusperiaate voimassa suhteellisuusteoriassa?
						<p>Mit&auml; tarkoitamme sill&auml;, ett&auml; raketti l&auml;hestyy asteroidia nopeudella v1=s1/t1? Ilmeisesti sit&auml;, ett&auml; joku on mitannut, ett&auml; ajassa t1 raketti on edennyt matkan s1. Sovitaan, ett&auml; se on mitattu asteroidin koordinaatistosta. Voiko raketti itse mitata omaa nopeuttaan? Jos leikit&auml;&auml;n suhteellisuusteorialla, niin ei - tai voi se mitata, mutta mittaa sen &quot;v&auml;&auml;rin&quot;, koska se mittaisi nopeudekseen v2=s1*sqrt/(t1/sqrt), miss&auml; sqrt=sqrt(1-v1^2). Kuka ei t&auml;t&auml; allekirjoita, ei tied&auml; suhteellisuusteoriasta mit&auml;&auml;n, eik&auml; voi v&auml;itt&auml;&auml; sen olevan oikeassa tai v&auml;&auml;r&auml;ss&auml;.</p>
						<p>Siis jos asteroidista on havaittu raketin ajassa t1 kulkevan matkan s1, niin samat t1 ja s1 mitataan raketista t2=t1/sqrt ja s2=s1*srqrt, miss&auml; sqrt=sqrt(1-v1^2), kun v1=s1/t1, jolloin raketista mitataan l&auml;hestytt&auml;v&auml;n asteroidia nopeudella v2=s2/t2, mik&auml; on aina ihan eri tulos kuin s1/t1, ellei v1=0.</p>
						<p>Mutta jos nopeus olisi suhteellista, pit&auml;isi raketin havaita liikkuvansa samalla nopeudella kohti asteroidia kuin asteroidista havaitaan raketin liikkuvan kohti asteroidia. Suhtis on niin uskomattoman itsest&auml;&auml;nselv&auml;sti ristiriidassa fysiikassa paljon edelle menev&auml;n tosian kanssa, ett&auml; nopeus on suhteellista, ett&auml; sit&auml; on vaikea edes uskoa todeksi. Kummasta fysiikka luopuu? Suhteellisuusperiaatteesta vai suhtiksesta?</p>
						<p>PS: Jos alatte rustata uusiksi muitakin nykyp&auml;iv&auml;n fysiikan lakeja, niin toivoisin otettavan minuun ensin yhteytt&auml;, ennen kuin alatte omin p&auml;in rustata, sill&auml; minulla on n&auml;kemyksi&auml; (esim. onko valolla liikem&auml;&auml;r&auml;&auml;?) - tai itse asiassa kaavat jo valmiina.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
