<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>N&auml;in saat kauniin ja k&auml;ytett&auml;v&auml;n WB:n</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Roni Ij&auml;s &lt;<a href="mailto:rnx@nic.fi">rnx@nic.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Amigistiurani aikana olen n&auml;hnyt monenlaisia Workbenchej&auml;. Monet niist&auml; eiv&auml;t ole olleet kovin hienoja, mist&auml; intoni WB:n virittelyyn ja koristeluun on luultavasti juontanut. Voisi helposti luulla, ett&auml; moisten Workbenchien omistajilla on niin huonot kokoonpanot, ettei parempaa lookia saa aikaiseksi. Ensinn&auml;kin, saadaksesi hienon JA hyvin toimivan WB:n, ei koneen tarvitse olla mit&auml;&auml;n TehoMylly(tm). Tavallinen A1200, OS 3.0, kiintolevy ja 4 Mt muistia riitt&auml;&auml;. Kyseisell&auml; kokoonpanolla itse aloitin varsinaisen virittelyn.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Kuusi askelta kohti parempaa k&auml;yttist&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<ol>
							<li>N&auml;ytt&ouml;tilan on oltava v&auml;hint&auml;&auml;n 640x400 ja v&auml;rej&auml; siin&auml; enint&auml;&auml;n 64, ellet omista grafiikkakorttia.
							<li>Muista, ett&auml; taustakuvat tehd&auml;&auml;n k&auml;yttikselle, eik&auml; k&auml;yttist&auml; taustakuvalle! (Konvertoi taustakuvat aina sopiviksi esim. ImageStudiolla.)
							<li>Chip-muistia on oltava aina yli 1700 kt!
							<li>Topaz-fonttia ei kannata k&auml;ytt&auml;&auml; miss&auml;&auml;n! (Hyi! Se on ruma.)
							<li>Jos k&auml;yt&auml;t yht&auml; ikonityyli&auml;, &auml;l&auml; k&auml;yt&auml; muita!
							<li>Yrit&auml; aina pit&auml;&auml; kokonaisuus yhten&auml;isen&auml;, eli kaikki v&auml;rit sopivat hyvin toisiinsa!
						</ol>
					</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Miten teen t&auml;m&auml;n kaiken?</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">On parasta aloittaa tyhj&auml;lt&auml; kiintolevylt&auml;. Ennen mink&auml;&auml;n asentamista on syyt&auml; osioida kiintolevy. Peruss&auml;&auml;nt&ouml; on, ett&auml; luo ainakin kaksi osioita: System ja Work (tai mink&auml; nimisi&auml; niist&auml; haluatkaan tehd&auml; - jatkossa viittaan n&auml;ihin perusosioihin em. nimill&auml;). Systemiin asennetaan pelk&auml;st&auml;&auml;n k&auml;ytt&ouml;j&auml;rjestelm&auml;, ei mit&auml;&auml;n muuta. Sen kooksi usein riitt&auml;&auml;kin 20-30 Mt. Workiin tulevat kaikki ohjelmat. Jos kiintolevy on iso, voidaan osioita tehd&auml; useampia - peleille omansa, emulaattoreille omansa jne. T&auml;m&auml;n j&auml;lkeen asennetaan k&auml;ytt&ouml;j&auml;rjestelm&auml;.
						<p>Seuraava vaihe on Workin hakemistopuu. PC-maailmasta tuttu tapa on pist&auml;&auml; kaikki data vain &quot;C:n juureen&quot;, mutta on my&ouml;s parempia tapoja. Work-osiolle voidaan vaikkapa tehd&auml; hakemistot Files, Graphics, Music, Net, Tools, Unpack ja Writing. Files-hakemistoon kopioidaan t&auml;ss&auml; tapauksessa kaikki tiedostot kuten musiikkikappaleet, taustakuvat jne., tietenkin omiin alihakemistoihinsa. Graphics-hakemistoon tehd&auml;&auml;n alihakemistot kuvank&auml;sittelyohjelmille sek&auml; hakemisto Images, jonne voidaan kopioida kaikki muut kuin taustakuvat. Music-hakemistoon asennetaan kaikki musiikkiohjelmat, Net-hakemistoon kaikki netti/tietoliikenneohjelmat, Tools-hakemistoon ty&ouml;kalut ja Writing-hakemistoon kirjoitusohjelmat. Unpack onkin sitten oma lukunsa. Sinne voidaan esimerkiksi imuroida data netist&auml; odottamaan my&ouml;hemp&auml;&auml; lajittelua, sinne voidaan purkaa paketit tai siell&auml; voidaan pit&auml;&auml; v&auml;liaikaiset projektit.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>N&auml;kym&auml; n&auml;tiksi</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Seuraava vaihe ovat k&auml;ytt&ouml;j&auml;rjestelm&auml;n apuohjelmat ja kaunistajat. Magic Menu korvaa Amigan tavallisen kaksiv&auml;risen valikon. Ohjelma sijoitetaan WBStartup-hakemistoon, josta se k&auml;ynnistyy joka boottauksessa. MCP on varmasti paras &quot;kaikki yhdess&auml;&quot; -ohjelmista. Sill&auml; voi s&auml;&auml;t&auml;&auml; kaikki patchit ja ominaisuudet, joita k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml; l&ouml;ytyy ja v&auml;h&auml;n viel&auml; lis&auml;&auml;kin. Visual Prefsill&auml; s&auml;&auml;det&auml;&auml;n ikkunan reunuksia. Ohjelmalla onnistuu melkein mik&auml; tahansa reunuksien kosmeettinen s&auml;&auml;t&ouml;, ja mik&auml; parasta, se ei vie paljon Chip-muistia.
						<center>
							<p><img height="248" width="300" src="kuvat/visual.jpg" border="0" alt=" "></p>
						</center>
						<p>Visual Prefs vaatii kunnolla toimiakseen ohjelman nimelt&auml; Full Palette. Ohjelmalla voidaan s&auml;&auml;t&auml;&auml; ja lukita kaikki paletin v&auml;rit. K&auml;tev&auml; ohjelma on my&ouml;s ReqTools, jolla voidaan s&auml;&auml;t&auml;&auml; valitsimien kirjasin, koko ja aukeamispaikka. Hyv&auml; pikku ohjelma on my&ouml;s FBlit, jolla FastIPrefsin kanssa s&auml;&auml;st&auml;&auml; monta sataa kilotavua Chip-muistia, koska kaikki kuvat ladataan Fast-muistiin. Kaikille, jotka tarvitsevat n&auml;yt&ouml;lleen siistin kellon, on varmasti TolleUhr hyv&auml; vaihtoehto. Kellossa on monipuoliset s&auml;&auml;d&ouml;t. Hieman uudempi vaihtoehto olisi BackClock. BackClock on paremmin s&auml;&auml;dett&auml;viss&auml;, mutta vie enemm&auml;n muistia.</p>
						<p>Monet ohjelmat vaativat, ett&auml; MUI on asennettu. MUI:lla s&auml;&auml;det&auml;&auml;n kaikkien sit&auml; k&auml;ytt&auml;vien ohjelmien k&auml;ytt&ouml;liittym&auml;n ulkoasu nappien muodosta, koosta ja v&auml;reist&auml; l&auml;htien.</p>
						<center>
							<p><img height="250" width="300" src="kuvat/mui.jpg" border="0" alt=" "></center>
					</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>&Auml;&auml;nt&auml;...</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Frogger on yksi hyv&auml; ohjelma MPEG-formaatissa olevien videop&auml;tkien katseluun. Se tukee monia formaatteja, kuten yleisi&auml; &quot;system streameja&quot;, ja siit&auml; on my&ouml;s PPC-versio. N&auml;ytt&ouml;tiloja ei tarvitse s&auml;&auml;t&auml;&auml;, koska videot katsellaan ikkunassa. Ikkunan kehyksess&auml; on tilapalkki sek&auml; play- ja eject-napit. Valitettavasti Froggerissa on viel&auml; paljon bugeja.
						<p>Hyv&auml; ohjelma MPEG:ien katselemiseen on my&ouml;s Ripley, se on vain huomattavasti hitaampi. MOV- ja AVI-filmien katseluun soveltuu parhaiten Soft Cinema. Soft Cinema vaatii PPC:n, joten kaikille, jotka eiv&auml;t sit&auml; omista, on CyberAVI parempi vaihtoehto. Aminetist&auml; saatava Soft Cinema on demo, jolla voi katsella filmej&auml; vain 30 sekuntia, mink&auml; j&auml;lkeen kuva menee mustaksi ja ohjelma pyyt&auml;&auml; rekister&ouml;itym&auml;&auml;n. Rekister&ouml;inti maksaa noin 90 mk (30 DEM).</p>
						<p>Musiikin ja varsinkin MOD:ien, XM:ien, S3M:ien ja monien muiden formaattien kuunteluun soveltuu parhaiten suomalaisen K-P Koljosen Hippoplayer, joka luultavasti l&ouml;ytyy melkein joka amigistin kiintolevylt&auml;. Ohjelma on todella hyvin s&auml;&auml;dett&auml;viss&auml; ja k&auml;ytt&auml;&auml; eritt&auml;in v&auml;h&auml;n prosessoritehoa ja muistia.</p>
						<p>MP3:n kuunteluun on monia hyvi&auml; ohjelmia. Jos k&auml;yt&ouml;ss&auml;si on PPC-prosessori ja grafiikkakortti, on AmigaAMP varmasti paras ja viel&auml;p&auml; n&auml;ytt&auml;v&auml;. AmigaAMP on melkein t&auml;ydellinen kopio PC:n WinAMPista. AmigaAMPiin k&auml;yv&auml;t my&ouml;s samat skinit, jos BMP-datatypet vain l&ouml;ytyv&auml;t kiintolevylt&auml;. AmigaAMP k&auml;ytt&auml;&auml; purkuun omaa PPC:lle tehty&auml; dekooderia, joten mpega.librarya ei k&auml;ytet&auml;. T&auml;m&auml; mahdollistaa 68k-prosessorin suuremman kuormituksen MPEG-musiikkia kuunnellessa. T&auml;ll&ouml;in onnistuu esim. netin selaaminen ilman nykimist&auml; ja musiikin p&auml;tkimist&auml;.</p>
						<center>
							<p><img height="90" width="270" src="kuvat/prayer.jpg" border="0" alt=" "></p>
						</center>
						<p>N&auml;ytt&auml;vin vaihtoehto MP3:sten kuunteluun on kuitenkin MindNeverin Prayer 2.0. Se on tehty samalla periaatteella kuin PC:n Sonique, eli ohjelma ei ole sidottu skiniin, vaan kukin voi v&auml;&auml;nt&auml;&auml; sen mink&auml; n&auml;k&ouml;iseksi tahansa.</p>
						<center>
							<p><img height="116" width="280" src="kuvat/songplayer.jpg" border="0" alt=" "></p>
						</center>
						<p>Jos k&auml;yt&ouml;ss&auml;si ei ole PPC-prosessoria, on paras MP3:n soitto-ohjelma SongPlayer. SongPlayer vie v&auml;h&auml;n prosessoritehoa ja muistia. Musiikin taso s&auml;ilyy viel&auml; hyv&auml;n&auml;, vaikka prosessorina olisi vain 030. Song Playerilla voi kuunnella my&ouml;s CD:t&auml; CDDA:n kautta, mik&auml; tekee siit&auml; erinomaisen CD:n kuunteluohjelman.</p>
						<center>
							<p><img height="116" width="275" src="kuvat/amigaamp.jpg" border="0" alt=" "></p>
						</center>
						<p>AmigaAMPia kevyempi, mutta hyvin samantapainen ohjelma on Amplifier, joka k&auml;ytt&auml;&auml; samoja skinej&auml; kuin AmigaAMP, joten ulkon&auml;k&ouml; on identtinen. Erot l&ouml;ytyv&auml;tkin vasta kuoren alta. Amplifierin asetukset ovat hieman monipuolisemmat kuin AmigaAMPin. Amplifierill&auml; voi lis&auml;ksi kuunnella my&ouml;s sampleja.</p>
						<p>Musiikin tekemiseen on oivallinen softa suomalaista alkuper&auml;&auml; oleva OctaMEDSoundStudio V1. Ohjelman saa freewarena tekij&ouml;iden kotisivuilta osoitteesta <a href="http://www.octamed.co.uk">www.octamed.co.uk</a>. Tekeill&auml; on my&ouml;s OctaMED V2, josta sivuilla on varhainen betaversio - se on kuitenkin melko buginen. Jos koneessa on v&auml;&auml;nt&ouml;&auml; tarpeeksi (040, 060 tai PPC), on MP3-pakkaaja hyv&auml; olla olemassa. T&auml;h&auml;n tarkoitukseen Lame sopii hyvin. Paketista l&ouml;ytyy optimoidut versiot eri prosessoreille. 060-prosessorilla 5:n minuutin MP3:n pakkaa noin 2 tunnissa. PPC:ll&auml; (603e/240 MHz) homma hoituu 9 minuutissa. Kotimainen ohjelma Second Spin ottaa ja pakkaa MP3:n suoraan CD:lt&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>...ja kuvaa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tarvitaan my&ouml;s kuvankatselu- ja k&auml;sittelyhjelmia. PersonalPaint on yksi hyv&auml; t&auml;llainen. Aminetist&auml; saatava versio on demo, joka j&auml;tt&auml;&auml; kaikkiin tallennettuihin kuviin &auml;rsytt&auml;v&auml;t &quot;Demo&quot;-raidat. Personal Paint 7:n saa kokoversiona mm. Amiga Formatin CD:lt&auml; #26, mutta ei ohjelma kallis ole vaikka sen ostaisikin: se maksaa vain 120 mk. Hyv&auml; ohjelma on my&ouml;s Deluxe Paint 5. N&auml;iden kahden paremmuudesta onkin usein kiistelty. Ero onkin p&auml;&auml;asiassa siin&auml;, ett&auml; Personal Paint lukee monia formaatteja, kun taas Deluxe Paint vain IFF-formatissa olevia kuvia. Sek&auml; Personal Paint ett&auml; Deluxe Paint aiheuttavat harmaita hiuksia grafiikkakorttien k&auml;ytt&auml;jille. Ohjelmat sopivatkin parhaiten tavalliselle AGA:lle.
						<p>ImageStudio on yksi parhaista kuvanmuokkausohjelmista. Se lukee monia formaatteja ja sis&auml;lt&auml;&auml; useita toimintoja, joilla kuvaa voidaan muokata. Aminetist&auml; l&ouml;ytyv&auml; ImageStudio on uusin, mutta se on demoversio, jossa ei voi tallentaa yli 512x512-kokoista kuvaa. Edesmenneen Amiga Magazinen levykkeelt&auml; #156 l&ouml;ytyy kuitenkin kokoversio 2.3, jonka keyfile&auml; voi k&auml;ytt&auml;&auml; my&ouml;s Aminetist&auml; l&ouml;ytyv&auml;&auml;n versioon.</p>
						<p>Ehdottomasti Amigan paras kuvank&auml;sittelyohjelma on ImageFX, ainoana huonona puolena on sen todella korkea hinta - l&auml;hemm&auml;s 2000 markkaa. Ohjelma on kyll&auml; todella sen arvoinen. IFX:ll&auml; pystyy kuviin lis&auml;&auml;m&auml;&auml;n erilaisia efektej&auml;, kuten salamia ja spotteja. IFX tukee my&ouml;s PPC:t&auml; ja monia grafiikkakortteja. IFX:ss&auml; on my&ouml;s erillisen&auml; moduulina skannaus- ja tulostuspuoli. Juuri tullutta fxPaintia voisi pit&auml;&auml; halpisversiona ImageFX:st&auml;. Siin&auml; on kutakuinkin samat ominaisuudet kuin IFX:s&auml;. fxPAINT tukee my&ouml;s PPC:t&auml;. T&auml;m&auml; on suositeltava ohjelma kaikille grafiikkakortin omistajille, joilla rahaa iFX:n ei ole. Ohjelmasta on demo, jonka voi imuroida Aminetist&auml;.</p>
						<p>Kuvankatseluohjelmista on grafiikkakortin omistajalle paras vaihtoehto Photo Folio. Photo Foliolla tehd&auml;&auml;n kiintolevyll&auml; olevista kuvista lista, johon kuvat latautuvat pienin&auml;. Toimintoa voidaan verrata PC-maailmasta tutun Paint Shop Pron browse-ominaisuuteen. Hyv&auml; kuvankatseluohjelma on my&ouml;s ShowPPC, joka nimens&auml; mukaisesti vaatii PPC-prosessorin ja kuvat katsellaan omalla ruudulla. ShowPPC on my&ouml;s todella nopea ja tukee IFF-, JPG-, BMP-, PNG- ja GIF-formaatteja.</p>
						<p>Kaikille, jotka eiv&auml;t omista PPC:t&auml; eiv&auml;tk&auml; grafiikkakorttia, on paras vaihtoehto VisageNG. Visagella kuvat avataan my&ouml;s omalle ruudulleen, mutta kun kuva on latautunut ja sit&auml; katsellaan, Visage avaa jo toista kuvaa taustalla. N&auml;in kuvankatselu on nopeata, vaikkei k&auml;yt&ouml;ss&auml; olekaan PPC-prosessoria. Visage tukee my&ouml;s todella montaa formaattia. Grafiikkakortilla (BVision) en ole saanut Visagea toimimaan, vaikka guidessa sanotaan, ett&auml; sen pit&auml;isi. Jos jollain on t&auml;st&auml; kokemuksia ja ehk&auml;p&auml; jopa ratkaisu, pyyt&auml;isin l&auml;hett&auml;m&auml;&auml;n s&auml;hk&ouml;postia.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Liikennett&auml; linjoille</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tiedonsiirto kahden koneen v&auml;lill&auml; sek&auml; purkeissa k&auml;ynti onnistuu terminaaliohjelmilla. NComm on yksi hyv&auml; vaihtoehto t&auml;h&auml;n. NComm on nyky&auml;&auml;n freewarea ja saatavilla Aminetist&auml;. Nykyaikaisempi vaihtoehto t&auml;h&auml;n on AmTerm. Aminetist&auml; l&ouml;ytyv&auml; AmTerm on demo, jota saa k&auml;ytt&auml;&auml; 30 p&auml;iv&auml;&auml;, mink&auml; j&auml;lkeen se ei en&auml;&auml; k&auml;ynnisty. AmTerm k&auml;ytt&auml;&auml; GUInaan MUIta ja on hyvin aseteltavissa.
						<center>
							<p><img height="94" width="390" src="kuvat/amterm.jpg" border="0" alt=" "></p>
						</center>
						<p>Nyky&auml;&auml;n melkein jokaisella on jo modeemi ja Internet koneessaan. Hyv&auml; ohjelma netiss&auml; surffaamiseen on Voyager 3.0. Voyager k&auml;ytt&auml;&auml; MUIta ja on hyvin s&auml;&auml;dett&auml;viss&auml;. Se on my&ouml;skin kohtalaisen nopea vaikkei k&auml;yt&ouml;ss&auml; olisi Grafiikkakorttia, Voyager tukee my&ouml;s PPC:t&auml;. Toinen hyv&auml; vaihtoehto on IBrowse 2, joka on kaupallinen. My&ouml;s IBrowse k&auml;ytt&auml;&auml; MUIta. Selaimissa ei ole mit&auml;&auml;n suurempaa eroa. Erot tulevatkin selvemmin vastaan vasta netiss&auml; surffatessa. Voyager ei tue viel&auml; kunnolla javascripti&auml;, IBrowse tukee. Molempien demoversioita saa k&auml;ytt&auml;&auml; 30 min, mink&auml; j&auml;lkeen selain on k&auml;ynnistett&auml;v&auml; uudelleen.</p>
						<p>TCP/IP-pinoksi on vain muutama vakavasti otettava vaihtoehto. Miamilla p&auml;&auml;see helposti nettiin erillisen Miami Init -ohjelman avulla. Miami Init tunnistaa modeemin ja soittaa yhteydentarjoajalle, mink&auml; j&auml;lkeen se s&auml;&auml;t&auml;&auml; asetukset itse yhteydentarjoajalta saaduilla tiedoilla. T&auml;m&auml;n j&auml;lkeen asetukset siirtyv&auml;t itse Miamiin, jolla t&auml;m&auml;n j&auml;lkeen voidaan menn&auml; nettiin. Miami Deluxe on kalliimpi ja hieman parempi versio tavallisesta Miamista. Vaporwaren Genesis on uusin t&auml;ll&auml; saralla. Itsell&auml;ni t&auml;st&auml; ei ole k&auml;ytt&ouml;kokemuksia, mutta ohjelman pit&auml;isi olla ihan kunnollinen.</p>
						<p>kuva: Miami</p>
						<p>S&auml;hk&ouml;postiohjelmista YAM on varmasti paras. YAM k&auml;ytt&auml;&auml; MUIta ja on k&auml;ytt&ouml;liittym&auml;lt&auml;&auml;n hieno ja tehokas. YAMista on saatavilla eri prosessoreille optimoidut versiot. Internet mahdollistaa my&ouml;s IRC:n ja telnetin. Hyv&auml; IRC-ohjelma onkin Voyagerin tekij&ouml;iden AmIRC. AmIRC k&auml;ytt&auml;&auml; MUIta ja on hyvin s&auml;&auml;dett&auml;viss&auml;. Vaporwaren kotisivuilta l&ouml;ytyv&auml; AmIRC on juuri ilmestynyt versio 3.4, jota saa rekister&ouml;im&auml;tt&ouml;m&auml;n&auml; k&auml;ytt&auml;&auml; 30 minuuttia kerralla. AmIRCin mukana tulevat my&ouml;s suomenkieliset locale-tiedostot. AmTelnet on ohjelma, jolla voi ottaa telnet-yhteyden telnet-palvelimeen. Aikarajoitus versio 2:ssa on 15 minuuttia. Ykk&ouml;sversiossa aikarajaa ei ole.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Ty&ouml;kalupakki</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jollei k&auml;ytt&ouml;j&auml;rjestelm&auml;n&auml; ole jo esim. Opus Magellan, on Directory Opus 4.12 varmasti paras levyty&ouml;kalu. Se on todella monipuolinen ja sen napit voi itse s&auml;&auml;t&auml;&auml; tekem&auml;&auml;n halutun toiminnon. GP-softin sivuilta www.gpsoft.com.au l&ouml;ytyy tarkempaa tietoa Opuksesta. Opus 4.12 on nyky&auml;&auml;n saatavilla Aminetiss&auml;.
						<p>Pakkausformaateista LHA, LZX ja ZIP ovat yleisimm&auml;t. Niiden purkamiseen l&ouml;ytyy Aminetist&auml; sek&auml; PPC- ett&auml; 68k-versiolliset ohjelmat. Jollei shelliss&auml; purkaminen miellyt&auml;, on hyv&auml; GUI n&auml;ille ohjelmille Mira WizArc. PPC- ja 68k-versioilla on pakkausohjelmissa suuri ero! PPC-versio ZIPist&auml; purkaa 500 Mt:n paketin muutamassa minuutissa, kun taas 68k-versiolla se kest&auml;&auml; melkein puoli tuntia, vaikka k&auml;yt&ouml;ss&auml; olisi 060-prosessori.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">N&auml;in olen itse rakentanut WB:ni, enk&auml; voisi olla en&auml;&auml; tyytyv&auml;isempi lopputulokseen. Amiga on monipuolinen tietokone, jonka ominaisuudet ovat l&auml;hes rajattomat. K&auml;yt&auml; sit&auml; siis hyv&auml;ksesi, ja tee PC-k&auml;ytt&auml;j&auml;t kateellisiksi!
						<center>
							<p><a href="kuvat/wb_big.jpg" target="_blank"><img height="188" width="250" src="kuvat/wb_small.jpg" border="0" alt=" "></a></p>
						</center>
						<p>Tekstiss&auml; mainittuja kaupallisia ohjelmia kannattaa kysy&auml; esimerkiksi <a href="http://www.ge.vip.fi">Gentle Eyelt&auml;</a>, (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a>. Muut ohjelmat l&ouml;ytyv&auml;t Aminetist&auml;, ja niit&auml; kannattaa etsi&auml; Aminetin <a href="http://ftp.sunet.se/aminetbin/find">hakusivun</a> avulla.</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
