<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Fleecy Mossin terveiset Suomen Amiga-k&auml;ytt&auml;jille</b></font></td>
				</tr>
				<tr height="15">
					<p>
						<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Suomennos:&nbsp;Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
					</p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kaikille entisille, nykyisille ja tuleville amigisteille, l&auml;mpim&auml;sti tervetuloa Saku 2001:een, Skandinavian parhaaseen Amiga-tapahtumaan.<br>
								<br>
								T&auml;&auml;ll&auml; p&auml;&auml;sette todistamaan ei pelk&auml;st&auml;&auml;n sit&auml; kaverihenke&auml; ja yhteis&ouml;&auml;, joka tekee Amigasta ainutlaatuisen tietokoneen ja k&auml;sitteen, vaan my&ouml;s er&auml;iden maailman taitavimpien laite- ja ohjelmistovalmistajien nerokkuutta ja omistautumista.<br>
								<br>
								Amiga oli edell&auml;k&auml;vij&auml;n&auml; maailman multimediassa 1980-luvulla, ja nyt me Amiga Inc.ss&auml; aiomme saada intohimon ja hauskuuden takaisin tietokoneharrastukseen matkallamme kohti uutta vuosituhatta.<br>
								<br>
								Yhteisty&ouml;kumppanimme Eyetechin (<a href="http://www.eyetech.co.uk" target="_blank">www.eyetech.co.uk</a>) kanssa olemme siirtym&auml;ss&auml; AmigaOnen kehitysty&ouml;n viime vaiheisiin. AmigaOne on ensimm&auml;inen, alusta alkaen suunniteltu Amiga-tietokone markkinoilla yli kymmeneen vuoteen. Huippuunsa kehitettyjen komponenttien ja j&auml;rjestelmien ansiosta Amiga-k&auml;ytt&auml;j&auml;t voivat nauttia samoista modernin teknologian eduista kuin PC-virkaveljens&auml;kin tarvitsematta kuitenkaan siet&auml;&auml; Windows-m&ouml;hk&auml;lett&auml;, joka sit&auml; teknologiaa on hidastamassa. <br>
								<br>
								Samaan aikaan Amiga etenee my&ouml;s AmigaDE:n (Digital Environment) kanssa, joka on uusi teknlogia t&auml;ht&auml;imess&auml;&auml;n valaista koko digitaalimaailma. Tarjoamalla laitteistoagnostisen, sis&auml;lt&ouml;keskeisen arkkitehtuurin se yhytt&auml;&auml; viimeinkin &quot;loogisen&quot; &quot;teknologisesta&quot; ja antaa voiman Amigan uudelle sloganille, seuraavalle WWW:lle: mit&auml; tahansa (whatever), miss&auml; tahansa (wherever) ja milloin tahansa (whenever).<br>
								<br>Sis&auml;ll&ouml;ntuottajat voivat luoda yhden ainoan sovelluksen ja n&auml;hd&auml; sen toimivan laitteissa k&auml;nnyk&ouml;ist&auml; palvelimiin laitteistopohjaan katsomatta. Kuluttajat voivat ostaa ja kehitt&auml;&auml; omaa sis&auml;lt&ouml;&auml; ja siirt&auml;&auml; sen mihin tahansa digitaalilaitteeseensa tarvitsematta huolehtia yhteensopivuudesta tai tuesta. Sis&auml;ll&ouml;nv&auml;litt&auml;j&auml;t voivat ker&auml;t&auml; t&auml;t&auml; sis&auml;lt&ouml;&auml; ja tarjota sit&auml; myyntiin miss&auml; tahansa ja mink&auml; laitteen omistajalle tahansa. Digitaalinen el&auml;minen on siirtym&auml;isill&auml;&auml;n tieteistarinoista tieteistodellisuudeksi.<br>
								<br>
								Olen pahoillani, etten voi olla siell&auml; teid&auml;n kanssanne. Niin kova on kiinnostus Amigaan, ett&auml; pienet ja suuret yritykset ja organisaatiot ottavat meihin yhteytt&auml; tapaamisten j&auml;rjest&auml;miseksi l&auml;hes p&auml;ivitt&auml;in. Nelj&auml; viikkoa sitten odotin ensimm&auml;ist&auml; vierailuani Suomeen ilman ainuttakaan tapaamista n&auml;k&ouml;piiriss&auml;, ja sitten suuri elektroniikka-alan yritys &quot;vaati&quot; tapaamista kanssaan pikimmiten. Valitettavasti t&auml;m&auml; tarkoittaa sit&auml;, ett&auml; minun t&auml;ytyy odottaa Saku 2002:een, ennen kuin p&auml;&auml;sen tapaamaan teit&auml; kaikkia.<br>
								<br>
								Amigan ihmeellisyys on kuitenkin siin&auml;, ettei kukaan ole yhteis&ouml;ss&auml; niin t&auml;rke&auml;, ett&auml; yhteis&ouml; horjuisi heid&auml;n puuttuessaan. Saku 2001 on yht&auml; paljon ihmisten kuin teknologiankin juhla, ja te kaikki siell&auml; olette todisteena Amigan merkityksellisyydest&auml; ja siit&auml; sammumattomasta totuudesta, jota se edustaa: jotain tehd&auml;&auml;n oikein. <br>
								<br>
								Terveisin<br>
								<br>
								fleecy moss (Amiga Inc.:n varatoimitusjohtaja) koko Amiga Inc.:n puolesta.<br>
								<br>
								30. elokuuta 2001</font></p>
						<hr>
						<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>To all Amigans, past, present, and future, I bid you a hearty welcome to Saku, 2001, the premier Amiga event in Scandanavia.<br>
							<br>
							Here you will witness not only the camaraderie and community that makes Amiga a unique computer and concept, but also the ingenuity and dedication of some of the most talented hardware and software developers in the world.<br>
							<br>
							Amiga led the world in multimedia in the 1980s and now we at Amiga Inc intend to put the passion and fun back into computing as we move forwards into the new millenium.<br>
							<br>
							Working with our partners at Eyetech (www.eyetech.co.uk), we are moving into the final stages of development work on the AmigaOne, the first, designed from scratch Amiga computer to reach the market in over ten years. Featuring state of the art components and systems, Amiga owners will be able to enjoy all the benefits of the most modern of technology that their PC counterparts enjoy without having to endure the concrete block that is Windows slowing that technology down.<br>
							<br>
							At the same time, Amiga is moving forwards with the AmigaDE (Digital Environment), a brand new technology that is intended to set the digital world alight. Offering a hardware agnostic, content centric architecture, it finally embraces the &quot;logical&quot; in &quot;technological&quot;, and empowers the new slogan of Amiga, the next WWW - Whatever, Wherever, Whenever.<br>
							<br>
							Content producers can create a single application and see it run transparently on devices from cell phones to servers irrespective of the underlying hardware. Content consumers can purchase and develop their own content and move it onto any of their digital devices without having to worry about compatability or support. Content brokers can collect this content and offer it for sale anywhere to any device owner. Digital Living (tm) is about to move from science fiction to science fact.<br>
							<br>
							I am sorry I cannot be there with you. Such is the interest in Amiga that corporations and organisations small and large are contacting us to arrange meetings almost daily. Four weeks ago I was looking forwards to my first visit to Finland with no hint of a meeting in sight and then a large consumer electronics company &quot;insisted&quot; that we meet with them at their earliest convenience. Unfortunately that means that I will have to wait until Saku 2002 before I can get to meet you all.<br>
							<br>
							However, the wonder of the Amiga is that no one is so important in its community that the community falters if they are missing. Saku 2001 is as much a celebration of people as it is of technology, and all of you there are proof of the relevance of the Amiga, and the inextinguishable truth of what it stands for - something done the right way.<br>
							<br>
							Cheers.<br>
							<br>
							fleecy moss (CTO Amiga Inc) on behalf of the Amiga Inc team.<br>
							<br>
							August 30th 2001</font></td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>