<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Saku 2001 - Amigaa tuutin t&auml;ydelt&auml;</b></font></td>
				</tr>
				<tr height="15">
					<p>
						<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Terho Henriksson &lt;<a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>&gt;</font></td>
					</p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<p><img src="kuvat/saku_2001_logokuva.jpg" width="354" height="290" border="0" alt="Saku 2001"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 2001, Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.:n j&auml;rjest&auml;m&auml; Suomen suurin Amiga-tapahtuma, pidettiin nelj&auml;nnen kerran Tiedekeskus Heurekassa, Vantaalla. Saku 2001:st&auml; vastaava hallitus oli Saku-vihre&auml;n&auml; j&auml;rjest&auml;m&auml;ss&auml; tapahtumaa ensimm&auml;ist&auml; kertaa ja oli siten todellisen tulikasteen edess&auml;. Haasteita tapahtumalle toivat Amiga-markkinoiden pienentyminen ja tapahtumaa edelt&auml;nyt v&auml;livuosi, joka asetti omat vaatimuksensa tapahtumasta tiedottamiselle ja markkinoinnille. Oli my&ouml;s tiedossa, ett&auml; AmigaOnen aikataulu viiv&auml;styisi, joten uutuustuotteet tulisivat olemaan niukassa.</font></p>
						<div align="center">
							<p><img src="kuvat/saku_2001.jpg" width="298" height="209" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Hallituksessa oltiin yht&auml; mielt&auml; siit&auml;, ett&auml; nyt vuonna 2001 tapahtuma tullaan j&auml;lleen j&auml;rjest&auml;m&auml;&auml;n. Suomen Amiga-k&auml;ytt&auml;j&auml;t tarvitsivat piristyst&auml; arkeen ja tietoa p&auml;iv&auml;npolttavista laitteista ja ohjelmista. Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on historiansa aikana osaltaan pit&auml;nyt yll&auml; suomalaisia Amiga-markkinoita ja yhdist&auml;nyt Amiga-k&auml;ytt&auml;ji&auml;, joten oli luonnollista, ett&auml; j&auml;rjestelyteht&auml;v&auml;&auml;n l&auml;hdettiin yhteistuumin t&auml;ydell&auml; teholla. Saku 2001:n tapahtumavastaavaksi nimitettiin Saku-lehden entisen&auml; uutistoimittajanakin tunnettu Terho Henriksson. </font></p>
						<div align="center">
							<p><img src="kuvat/gentle_eye.jpg" width="298" height="221" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtuman j&auml;rjestelyjen aikana oli iloisia hetki&auml;, mutta my&ouml;s paljon yll&auml;tt&auml;vi&auml; tilanteita ja dramatiikkaa mahtui mukaan. Seuraavassa katsaus Saku 2001:n j&auml;rjestelyjen kulkuun ja itse tapahtumaan.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Valmistelut alkavat</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 2001 &#150;tapahtuman valmisteluihin l&auml;hdettiin intensiivisesti noin vuosi ennen tapahtumaa, ja t&auml;t&auml;kin ennen tapahtuma oli ollut jo kauan ideointiasteella. Mm. tapahtumapaikan suhteen k&auml;ytiin keskusteluja ja asiaa tutkittiin. Pian oli selv&auml;&auml;, ett&auml; paras vaihtoehto oli tuttu Tiedekeskus Heureka, jonne oli my&ouml;s k&auml;tev&auml; kuljettaa mahdolliset kansainv&auml;liset vieraat. Lis&auml;ksi tiedekeskusymp&auml;rist&ouml; sopii hyvin my&ouml;s tapahtuman teknologiaimagoon. T&auml;m&auml;n j&auml;lkeen oli vuorossa itse tapahtuman rakentaminen, k&auml;yt&auml;nn&ouml;ss&auml; tyhj&auml;lt&auml; p&ouml;yd&auml;lt&auml;.</font></p>
						<div align="center">
							<p><img src="kuvat/sami_ylonen.jpg" width="298" height="225" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kontaktit ulkomaille ja varsinkin Amiga-emoyhti&ouml;&ouml;n olivat laajasti k&auml;ynniss&auml; alusta alkaen. Tiedusteluja l&auml;hetettiin useisiin kymmeniin potentiaalisiin Amiga-alan yrityksiin ulkomaille ja my&ouml;s Amiga Inc.:lle. Tiedustelut poikivatkin itse tapahtumaan lahjoituksina mm. Nova Designilta laadukkaat Aladdin 4D- ja ImageFX-hy&ouml;tyohjelmat.</font></p>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/shogo_mad.jpg" width="298" height="263" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Asiat alkoivat n&auml;ytt&auml;&auml; todella hyvilt&auml;, kun Mataylta ja Cloantolta saatiin varmistus tapahtumaan saapumisesta. My&ouml;s Amiga Inc.:lt&auml; Yhdysvalloista saatiin tieto, ett&auml; Amigan edustaja saataisiin tapahtumaan rapakon takaa, jos aikataulut sopivat yksiin Saku-viikonlopun kanssa.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtuman j&auml;rjestelyorganisaatioon ker&auml;ttiin tiedotteiden avulla tapahtuma-avustajia. J&auml;rjestelytiimiin saatiin lopulta haalittua noin 20 ahkeraa sakulaista. Siin&auml; vaiheessa tunnelma alkoi olla jo korkealla tapahtumaj&auml;rjestelyjen suhteen. </font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Tiedotus ja markkinointi k&auml;yntiin</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 2001 -tapahtuman suunnittelua ja tiedottamista avustamaan p&auml;&auml;tettiin k&auml;ytt&auml;&auml; mahdollisimman paljon hy&ouml;dyksi Interneti&auml;. Perustettiin Saku 2001 &#150;postituslista ja my&ouml;s vain j&auml;rjestelij&ouml;ille tarkoitettu Internet-sivusto. Saku-tapahtuman julkista tiedotusta varten v&auml;s&auml;ttiin viel&auml; oma Saku 2001 -Internet-sivusto (<a href="http://saku2001.amigafin.org" target="_blank">saku2001.amigafin.org</a>), joka toimi tiedotuskanavana sek&auml; suomalaisille ett&auml; ulkomaisille tapahtumasta kiinnostuneille.<br>
							<br>
						</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Edellisten Saku-tapahtumien kaltaista kiinnostusta l&auml;hdettiin hakemaan tapahtumaan my&ouml;s markkinoinnin kautta. T&auml;t&auml; varten tapahtumavastaava otti yhteytt&auml; sponsoreihin (JPS-mainos ja Kirjapaino &Ouml;hrling), joiden panoksen ansiosta ensimm&auml;isen kerran Saku-tapahtuma sai oman ammattimaisesti valmistetun neliv&auml;riesitteens&auml;. Yhteisty&ouml;ss&auml; esitteest&auml; saatiin informatiivinen mainos tapahtumalle ja my&ouml;s yhdistykselle.</font>
						<div align="center">
							<p><img src="kuvat/broadline.jpg" width="298" height="240" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-esitett&auml; varten ker&auml;ttiin kuvamateriaalia Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n 8-vuotiselta taipaleelta. Mukaan liitettiin my&ouml;s kohokohtia yhdistyksen historiasta. Saku-esitett&auml; ja Internet-sivustoa varten suunniteltiin tapahtuman logo, jossa v&auml;rikkyydell&auml; haluttiin ilmaista, ett&auml; Amiga-maailmassa on edelleen j&auml;ljell&auml; el&auml;m&auml;&auml; ja aktiivisuutta.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-sivusto sai suurimman k&auml;vij&auml;piikkins&auml;, kun Bass Cadetin Saku 2001 Theme, tapahtuman virallinen tunnuskappale, julkaistiin MP3-muodossa (614 eri k&auml;vij&auml;&auml; p&auml;iv&auml;n aikana). Teemamusiikkia myytiin my&ouml;s tapahtumassa CD:ll&auml;, mukana bonuksena erikoisversiot kappaleesta. Saku-foorumiin (<a href="http://foorumi.amigafin.org" target="_blank">foorumi.amigafin.org</a>) avattiin my&ouml;s oma keskusteluosasto liittyen Saku 2001 -tapahtumaan.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>H-hetki l&auml;hestyy</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Viikko ennen tapahtumaa ly&ouml;tiin lukkoon viimeisi&auml; suunnitelmia tapahtumap&auml;iv&auml;lle. Ulkomaisen vieraan varalle suunniteltiin ohjelmaa perjantai p&auml;iv&auml;najaksi, ja t&auml;h&auml;n sis&auml;ltyi mm. k&auml;ynti Star Wars -n&auml;yttelyss&auml; Tennispalatsissa. J&auml;rjestelytiimiss&auml; varmasti monella oli perhosia vatsanpohjassa, varsinkin allekirjoittaneella. Ohjelmassa oli my&ouml;s valmistaa tarvittavat monisteet ja plakaatit ja suunnitella tapahtumap&auml;iv&auml;n ohjelma lopulliseen muotoonsa.</font>
						<div align="center">
							<p><img src="kuvat/star_wars.jpg" width="298" height="235" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Viime hetkell&auml; ennen tapahtumap&auml;iv&auml;&auml; tapahtumavastaava sai tiedon, ett&auml; Matay ja Amiga Inc. peruivat osallistumisensa tapahtumaan. Se latisti tunnelmaa, mutta vain hetkeksi, koska Cloanton Michael Battilana kuitenkin oli tulossa paikalle ja toi tarvittavaa kansainv&auml;list&auml; v&auml;ri&auml; tapahtumakuvioihin. My&ouml;s AmigaPLUSsan toimittaja Robert Sch&auml;fer ilmoitti saapuvansa paikanp&auml;&auml;lle tekem&auml;&auml;n jutun tapahtumasta.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">S&auml;pin&auml;&auml; tapahtumap&auml;iv&auml;n aamuna</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtumap&auml;iv&auml;n&auml; j&auml;rjestelyt saatiin k&auml;yntiin jo kello 8 aamulla. J&auml;rjestelytiimist&auml; oli p&auml;&auml;ssyt aamusta paikalle noin puolet, mink&auml; ansiosta luentotilan p&ouml;yd&auml;t saatiin melko nopeasti suunnitellun layoutin mukaan paikoilleen. Saku 2001:ss&auml; k&auml;ytettiin aikaisemmista tapahtumista poikkeavaa layout-ideaa. Tarkoituksena oli saada tapahtuman aikana ilma kiert&auml;m&auml;&auml;n ja vierailijoille mukavampi olla v&auml;ljyyden ansiosta. Idea oli onnistunut.</font>
						<div align="center">
							<p><img src="kuvat/gentle_eye.jpg" width="298" height="221" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Koneiden ja muiden laitteiden kasaus k&auml;vi kuin tutusta rutiinity&ouml;st&auml; n&auml;ytteilleasettajille, Classic Amigat olivat hanskassa. Ongelmia tuotti Amiga-demomaraton-video, jota auditorion high-end-tason videot kielt&auml;ytyiv&auml;t n&auml;ytt&auml;m&auml;st&auml; ilman h&auml;iri&ouml;t&auml;. Onneksi outo h&auml;iri&ouml; esiintyi vain videon alkuosassa. My&ouml;s AmigaOS 3.9:n esittelyyn tarkoitettu A4000 vaati useamman henkil&ouml;n mietint&ouml;&auml;, jotta se saatiin s&auml;&auml;detty&auml; kuntoon ajoissa tapahtuman alkuun.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Uutuuksia ja demomaratoni</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<img src="kuvat/amigade.jpg" width="298" height="246" border="0" alt=" "></div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtuman uusinta antia oli tuore AmigaDE Player Demo, jonka Amiga Inc:n Fleecy Moss l&auml;hetti yhdistyksen esittelyk&auml;ytt&ouml;&auml; varten. T&auml;t&auml; demoa ei ollut n&auml;ht&auml;vill&auml; miss&auml;&auml;n muualla. Pakettiin kuului my&ouml;s Series Zero -pelipaketti. AmigaDE Player oli tapahtumassa n&auml;ht&auml;vill&auml; Windows-ymp&auml;rist&ouml;ss&auml;. Lis&auml;ksi n&auml;ytill&auml; oli AmigaSDK Party Pack Linux- ja Windows-ymp&auml;rist&ouml;iss&auml;. Sek&auml; AmigaDE Player ett&auml; Amiga SDK toiminnassa olivat konkreettisia esimerkkej&auml; siit&auml;, ett&auml; Amiga Inc.:n kehitysosastolla paiskitaan lujasti t&ouml;it&auml;.&nbsp;Vaikka Fleecy Moss joutuikin perumaan vierailunsa, h&auml;n l&auml;hetti terveisens&auml; s&auml;hk&ouml;postitse kaikille suomalaisille amigisteille. Fleecyn terveiset l&ouml;ytyv&auml;t <a href="fleecy.html" target="_self">erillisest&auml; artikkelista</a>.</font></p>
						<div align="center">
							<p><img src="kuvat/mediator_pci.jpg" width="298" height="268" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Matayn piti tuoda tapahtumaan n&auml;ytille upouusi Prometheus-v&auml;yl&auml;kortti, mutta yritys joutui viime hetkell&auml; perumaan osallistumisensa. Matayn poisj&auml;&auml;mist&auml; paikkasi hyvin esittelyss&auml; ollut Mediator PCI  -kortilla varustettu tornitettu A1200. Koneessa oli my&ouml;s Voodoo 3000 -n&auml;ytt&ouml;kortti.</font></p>
						<div align="center">
							<p><img src="kuvat/shogo_mad.jpg" width="298" height="263" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Auditoriossa oli tarjolla lyhyen yhdistyksen puheenvuoron j&auml;lkeen Cloanton Amiga Forever 4 &#150;esitys. T&auml;ysin uudistettu tekniikka auditoriossa mahdollisti kannettavan tietokoneen kuvan siirt&auml;misen valkokankaalle ilman erityisj&auml;rjestelyj&auml;. Havainnollisemmin aihetta ei olisi voinut esitt&auml;&auml;. T&auml;m&auml;n j&auml;lkeen seurasi Amiga-demomaratoni, joka ker&auml;si mukavasti porukkaa katselemaan Amigan parhaita demoja videolta. Mukana oli my&ouml;s Mature Furkin tekem&auml; Assembly 2001 -tapahtuman voittajademo Lapsuus, joka her&auml;tti wow-el&auml;myksi&auml; katsojien parissa.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Loppufiilikset ja kommentit</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kaiken kaikkiaan Saku 2001 oli eritt&auml;in positiivinen kokemus. J&auml;lleen kerran n&auml;ytimme, ett&auml; Amiga-yhteis&ouml;n ymp&auml;rille Suomessa on mahdollista rakentaa isompi tapahtuma vapaaehtoisvoimienkin avulla. Uusi hallitus pystyi venym&auml;&auml;n maksimisuoritukseen ja j&auml;rjestelyt onnistuivat keskim&auml;&auml;rin erinomaisesti.</font>
						<div align="center">
							<p><img src="kuvat/payback.jpg" width="298" height="231" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga-kiinnostus ei ole kadonnut tiedotusv&auml;lineist&auml;. Saku 2001 -tapahtumasta julkaistiin useita tiedotteita Internetin suosituimpiin lukeutuvilla IT-aiheisilla uutissivustoilla. Paikan p&auml;&auml;ll&auml; tapahtumassa n&auml;htiin my&ouml;s MBnetin ja Tekniikan Maailman toimittajat. Amiga-lehtiin juttua tekem&auml;&auml;n saapui Saksasta asti AmigaPLUS-lehden toimittaja. My&ouml;s saksalainen Amiga Future pyysi tapahtumasta jutun. MikroBitti julkaisi tapahtuman j&auml;lkeen lyhyen uutisen.</font></p>
						<div align="center">
							<p><img src="kuvat/irc.jpg" width="298" height="228" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtuman k&auml;vij&auml;m&auml;&auml;r&auml; oli pudonnut noin kolmeensataan, mik&auml; heijasti selv&auml;sti Amiga-markkinoiden jatkuvaa pienentymist&auml;. Uusien tuotteiden ostohalu oli kuitenkin selv&auml;sti aistittavissa. Jos Amiga pystyy pit&auml;m&auml;&auml;n lupauksensa ja toimittamaan uuden tuotelinjan, se aktivoi varmasti lis&auml;&auml; Amiga-k&auml;ytt&auml;ji&auml; Suomessa. Saku 2001:n t&auml;rkein sanoma oli, ett&auml; vipin&auml;&auml; ja yritteli&auml;isyytt&auml; Amiga-piireiss&auml; on edelleen, vaikka uusia tietokonemalleja ei ole julkaistu markkinoille kymmeneen vuoteen. Viel&auml; enemm&auml;n sit&auml; on siis odotettavissa, kun Amiga siirtyy uuteen aikaan AmigaOne-mallistollaan ja AmigaDE:ll&auml;.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-tapahtumien tulevaisuudesta</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-tapahtumien sarjan kehittyminen vaatii uusia tuotteita ja sit&auml; kautta lis&auml;&auml; aktiivisuutta Amigan ymp&auml;rille. Classic-Amiga malliston ollessa perusraudaltaan kymmenen vuotta vanhaa ja ohjelmistotuotannon ollessa niukkaa, entist&auml; enemm&auml;n on odotettavissa markkinoiden kutistumista. Macintosh on alkanut saada kotik&auml;yt&ouml;ss&auml; yh&auml; enemm&auml;n pisteit&auml; uudistetun MacOS X k&auml;ytt&ouml;j&auml;rjestelm&auml;ns&auml; ansiosta. PC on edelleen "se yleisin ja edullisin joka kodin perusvaihtoehto", johon taivutaan l&auml;hes aina.</font>
						<div align="center">
							<p><img src="kuvat/puheenvuoro.jpg" width="298" height="259" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. tutkii jatkuvasti tilaisuutta j&auml;rjest&auml;&auml; uusia tapahtumia uuden Amiga-raudan ymp&auml;rille. Uusi tietokone on aina merkitt&auml;v&auml; tapaus mediassa ja varmasti my&ouml;s muiden kuin Amiga-k&auml;ytt&auml;jien keskuudessa. Yhdistys jatkaa Saku 2001:n kautta luotuja kontakteja Amiga Inc.:n kanssa tulevaisuudessa tarpeen mukaan.</font></p>
						<div align="center">
							<p><img src="kuvat/vaporware.jpg" width="298" height="248" border="0" alt=" "></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. kiitt&auml;&auml; l&auml;mpim&auml;sti kaikkia tapahtumaan osallistuneita j&auml;rjestelij&ouml;it&auml;, n&auml;ytteilleasettajia ja vieraita. Lue my&ouml;s artikkeli &quot;<a href="saku2001tekijat.html" target="_self">Saku 2001 - tapahtuman tekij&auml;t</a>&quot;.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>