<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Saku 2001 -k&auml;vij&auml;kysely</b></font></td>
				</tr>
				<tr height="15">
					<p>
						<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo &lt;<a href="mailto:jarmo.piippo@pp.nic.fi">jarmo.piippo@pp.nic.fi</a>&gt;</font></td>
					</p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tuskinpa monikaan harrastajayhteis&ouml;n tapahtuma on yht&auml; t&auml;rke&auml; j&auml;senilleen kuin Saku on Suomen amigisteille - niin t&auml;rke&auml;, ett&auml; viimeisin sai jopa oman teemamusiikki-CD:ns&auml;! Mutta palat jo varmaan halusta saada tiet&auml;&auml; k&auml;vij&ouml;iden tuntemuksista tarkemmin? Annettakoon tapahtumavieraiden itse kertoa, perinteisen k&auml;vij&auml;kyselyn tulosten muodossa.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Klassikot jyr&auml;&auml;.&quot;</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n j&auml;rjest&auml;m&auml; Saku 2001 -tapahtuma syyskuun 1. p&auml;iv&auml;n&auml; Tiedekeskus Heurekassa Vantaalla oli jo nelj&auml;s laatuaan. Kahden viime kerran tapaista valtavaa yleis&ouml;menestyst&auml; ei amigistien v&auml;henemisen takia ollut en&auml;&auml; odotettavissa, mutta kuten muista yhteyksist&auml; on jo havaittu, j&auml;ljell&auml; olevat harrastajat ovat sit&auml;kin innokkaampia.<br>
								<br>T&auml;ll&auml; kertaa k&auml;vij&auml;t t&auml;yttiv&auml;t yhteens&auml; 133 vastauslomaketta, mik&auml; n&auml;ppituntumalta sanottuna on suhteessa k&auml;vij&ouml;iden kokonaism&auml;&auml;r&auml;&auml;n aavistuksen verran parempi tulos kuin aiempien tapahtumien 227 (Saku 99) ja 210 (Saku 98) vastausta. Lis&auml;ksi ensimm&auml;ist&auml; kertaa k&auml;yt&ouml;ss&auml; olleeseen yhdistyksen vieraskirjaan kertyi kaikkiaan 117 nime&auml;. Osa kyselyyn vastaamatta j&auml;tt&auml;neist&auml; oli kirjoittanut nimens&auml; vieraskirjaan.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vastanneiden kesken arvottiin j&auml;lleen tapahtuman p&auml;&auml;tteeksi Amiga-aiheisia palkintoja kuten Immortal-CD-levyj&auml;, ImageFX- ja Aladdin 4D-ohjelmat sek&auml; Payback- ja Shogo-pelit. Palkinnot luovutettiin samassa yhteydess&auml; voittajille.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kyselyn tulokset ilmoitetaan prosentteina suhteessa vastanneiden kokonaism&auml;&auml;r&auml;&auml;n, ja luvut on py&ouml;ristetty yhden desimaalin tarkkuuteen. Prosenttiarvot eiv&auml;t aina ole yhteens&auml; 100, koska osassa lomakkeita ei ollut vastattu kaikkiin kysymyksiin. Lis&auml;ksi muutama vastaaja ei ilmeisesti huomannut kysymyspaperin olevan kaksipuolinen. Kuten viimeksikin, puuttuvat vastaukset tulkittiin kielteisiksi.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Laitetietojen kyselyn kohdalla ei puuttuvia tai v&auml;&auml;rin t&auml;ytettyj&auml; kohtia l&auml;hdetty arvailemaan, vaan ne j&auml;tettiin vain pois laskuista, koska niill&auml; ei v&auml;h&auml;isen m&auml;&auml;r&auml;ns&auml; takia ollut suurta merkityst&auml; tuloksiin. Edelleen on muistettava, ettei t&auml;ll&auml; tavoin toteutettu kysely ole tilastotieteellisesti p&auml;tev&auml;, joten tulokset ovat vain suuntaa-antavia arvioita.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kiitokset kaikille vastanneille!</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>K&auml;vij&ouml;iden puheenvuoro</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">1. Kuinka kaukaa tulet tapahtumaan?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely1.gif" width="550" height="186" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Pitk&auml;nmatkalaiset ovat hieman kasvattaneet osuuttaan taannoiseen Saku 99 -tapahtumaan verrattuna, erityisesti 600-800 km:n osuus, joka viimeksi oli 3% luokkaa. Kokonaisuutena muutos on pieni, varsinkin kun otetaan huomioon silloisen kyselyn suurempi vastausm&auml;&auml;r&auml; (227).</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">2. Mist&auml; sait ensimm&auml;isen&auml; tiet&auml;&auml; tapahtumastamme?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely2.gif" width="550" height="172" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuten olettaa sopii, nopeimmin uutiset l&ouml;yt&auml;v&auml;t tiens&auml; perille Internetin kautta, ja mit&auml; ilmeisimmin kaverilta saatu tietokin on useimmiten kolahtanut s&auml;hk&ouml;isten postilaatikoiden luukuista sis&auml;&auml;n. Muita lehti&auml; mainittiin olleen verkkojulkaisut ja MikroBitti, ja muut tietol&auml;hteet l&ouml;ytyiv&auml;t ircist&auml;, muualta webist&auml;, newseist&auml;, ja s&auml;hk&ouml;postilla suoraan j&auml;rjest&auml;jilt&auml;. Kutsukirjekin t&auml;ytti kiitett&auml;v&auml;sti teht&auml;v&auml;ns&auml; sek&auml; tiedonv&auml;litt&auml;j&auml;n&auml; ett&auml; houkuttimena tulla mukaan tapahtumaan paikan p&auml;&auml;lle.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">3. Oletko aikaisemmin osallistunut Saku-tapahtumiin?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely3.gif" width="480" height="110" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 99:n vierailijoista oli 45% k&auml;ynyt Saku 98:ssa ja 19% Saku 97:ss&auml;, joten noista ajoista n&auml;ytt&auml;isi nytkin porukka osittain vaihtuneen, mutta viime tapahtuman j&auml;lkeen on vaihtuvuus v&auml;hentynyt roimasti. Samaa enteili jo Saku-lehden vuoden 2000 lukijakyselykin, jossa todettiin amigistien olevan tiiviimpi ryhm&auml; kuin koskaan, p&auml;&auml;tellen siit&auml; ett&auml; huikeat 69% yhdistyksen j&auml;senist&auml; osallistui siihen kyselyyn.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">4. Oletko Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n j&auml;sen (2001)?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely4.gif" width="480" height="112" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kotimaamme pitk&auml;t v&auml;limatkat vaikuttavat tuovan tapahtumiin v&auml;hemm&auml;n j&auml;seni&auml; paikalle kuin s&auml;hk&ouml;isten kyselyiden perusteella l&ouml;ytyisi halukkaita tulijoita. Seh&auml;n tietysti kielii siit&auml;, ett&auml; tapahtumia kannattaisi j&auml;rjest&auml;&auml; muuallakin kuin p&auml;&auml;kaupunkiseudulla, mutta harmi kyll&auml; t&auml;m&auml;n kokoluokan tapahtumia ei ainakaan nykyisell&auml;&auml;n voida pit&auml;&auml; kuin korkeintaan yksi vuodessa.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">5. Aiotko uusia j&auml;senyytesi/liitty&auml; j&auml;seneksi?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely5.gif" width="480" height="100" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vastaajien kokonaism&auml;&auml;r&auml;st&auml; laskettuna t&auml;m&auml; tulos on ilahduttava, sill&auml; lupausten mahdollisesti toteutuessa se merkitsisi runsaasti uusiakin j&auml;seni&auml; yhdistykselle. (Vertaa edellisen kysymyksen vastauksiin!)</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">6. Luetko yhdistyksen elektronista Saku-lehte&auml;?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely6.gif" width="480" height="100" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku jatkaa totuttuun tapaan murskaavan ylivoimaista voittokulkuaan, ja kummakos tuo, kun laatu on kohdallaan ja kilpailijoitakin on kotimaisessa lehdist&ouml;ss&auml; melkoisen harvassa... ;-)</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">7. Pit&auml;isik&ouml; lehden taustamusiikki jatkossa toteuttaa MP3-muodossa?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely7.gif" width="480" height="109" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suurin osa tyytyisi edelleen perinteiseen MOD-musiikkiin, eik&auml; monikaan ole kiinnostunut imuroimaan suurehkoja MP3-muotoisia kappaleita, vaikka ne tietysti mahdollistaisivat paremman laadun ja olisivat nykyisell&auml;&auml;n ehk&auml; muusikoille mieluisampia toteuttaa kuin MODit. J&auml;t&auml;mme kuitenkin toistaiseksi j&auml;ttim&auml;isist&auml; Hi-Fi-lehtipaketeista haaveilun tulevaisuuteen, ja keskitymme asiasis&auml;ll&ouml;n tuottamiseen, kuten toivomus kuuluu. :-)</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">8. Eniten k&auml;ytt&auml;m&auml;si Amiga-malli?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely8.gif" width="550" height="242" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suorastaan &auml;llistytt&auml;v&auml;&auml;, miten tarkasti muutaman suosituimman konemallin osuudet vastaavat Saku 99:n kyselyn tuloksia! Tuolloin A1200:n omisti 54%, A4000:n 11% ja A500:n 9% vastanneista. Amigaa omistamattomien k&auml;vij&ouml;iden m&auml;&auml;r&auml; on entisest&auml;&auml;n pienentynyt, mik&auml; voi osittain heijastella suuren yleis&ouml;n mielenkiinnon laimenemista aiheeseen. Jos siit&auml; jotain positiivista haluaa keksi&auml;, niin ainakaan Sakulta ei siis n&auml;yt&auml; ty&ouml;t olevan loppumassa aivan heti!</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">9. Mik&auml; on eniten k&auml;ytt&auml;m&auml;si Amigan paras prosessori?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely9.gif" width="550" height="223" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vaikka malliston tehokkain p&auml;&auml; muodostaa yhteens&auml; jo yli puolet kaikista konekannan prosessoreista, pit&auml;&auml; my&ouml;s 68030 yh&auml; pintansa aktiivik&auml;yt&ouml;ss&auml;. 68000/68020-pohjaisia ei vastaajien ykk&ouml;s-Amigoista ole en&auml;&auml; kuin ehk&auml; kuutisen prosenttia, mik&auml; tarkoittanee ett&auml; kaikki j&auml;ljell&auml; olevat amigistit ovat tosissaan liikkeell&auml; harrastuksensa suhteen.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">10. Mit&auml; seuraavista varusteista Amiga-laitteistostasi l&ouml;ytyy?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely10.gif" width="480" height="336" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Melkein puolet vastaajien Amigoista on varustettu n&auml;ytt&ouml;kortilla, ja Internet-yhteys l&ouml;ytynee suurimmasta osasta koneita, samoin kuin romppuasema, joista jo melkoinen osa on kirjoittavaa mallia. &Auml;&auml;nikortti ei ole edelleenk&auml;&auml;n p&auml;&auml;ssyt muodostumaan kovinkaan suosituksi, sill&auml; useimmille vaikuttaa riitt&auml;v&auml;n Amigan vakio&auml;&auml;nipiiri normaalik&auml;ytt&ouml;&ouml;n. Toinen syy lienee se, ett&auml; markkinoilta puuttuu yh&auml; se halpa perus&auml;&auml;nikortti, jollaiset ovat varmaankin muilla konemerkeill&auml; kaikkein eniten myyv&auml; vaihtoehto. PCI-v&auml;yl&auml;korttien avulla ne saanee tosin nyky&auml;&auml;n k&auml;ytt&ouml;&ouml;n Amigassakin, vaikkei edullisen &auml;&auml;nikortin saaminen tietenk&auml;&auml;n yksin&auml;&auml;n viel&auml; riit&auml; perusteeksi hankkia arvokas PCI-v&auml;yl&auml;. Sit&auml; paitsi onhan se kyll&auml; niinkin, ett&auml; amigistit tunnetusti panostavat mielell&auml;&auml;n laatuun ja toimintavarmuuteen, joten ehk&auml;p&auml; halpakorttien puute ei sittenk&auml;&auml;n ole kovin paha haitta. T&auml;rkeint&auml; onkin, ett&auml; vaihtoehtoja ja valikoimaa saadaan tuotua halukkaiden ulottuville, mink&auml; todistaa jo kyselyn vastaajienkin lukemattomien erilaisten laitekokoonpanojen kirjo.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">11. Vastasiko Saku 2001 odotuksiasi?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely11.gif" width="500" height="100" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtumaan oltiin huomattavan tyytyv&auml;isi&auml;, ja suurimmalle osalle k&auml;vij&ouml;ist&auml; oli ep&auml;ilem&auml;tt&auml; jo etuk&auml;teen aika hyvin selvill&auml;, millainen tilaisuudesta tulisi muodostumaan. Kuten arvata saattaa, pient&auml; pettymysmielialaa kehittiv&auml;t l&auml;hinn&auml; t&auml;rkeiden ulkomaisten vierailijoiden viime hetkell&auml; tulleet peruuntumiset ja se, ettei Amiga-markkinoille ole edelleenk&auml;&auml;n ehtinyt tulla kovin paljon uusia tuotteita tarjolle esitelt&auml;v&auml;ksi. Onneksi kuitenkin my&ouml;s nykyisen konekannan elinik&auml;&auml; ja k&auml;ytt&ouml;arvoa lis&auml;&auml;vi&auml; laitteita on saatavilla, ja niiden esittely&auml; tapahtumassa kiiteltiinkin paljon, kuten my&ouml;s kotimaisten j&auml;lleenmyyjien l&auml;sn&auml;oloa.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">12. Lis&auml;sik&ouml; Saku 2001 luottamustasi Amiga-tuotemerkkiin?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely12.gif" width="500" height="100" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Aktiivinen k&auml;ytt&auml;j&auml;yhteis&ouml; on v&auml;h&auml;&auml;k&auml;&auml;n liioittelematta sanottuna se t&auml;rkein asia, joka on pit&auml;nyt Amigan hengiss&auml; ja ihmisten tietoisuudessa n&auml;in&auml; koneen vanhojen mallien valmistuksen loppumisen j&auml;lkeisin&auml; vuosina. Niinp&auml; ei ole oikeastaan kummakaan, ett&auml; t&auml;llaisen tapahtuman kaltainen k&auml;ytt&auml;j&auml;yhdistyksen voimann&auml;ytt&ouml; valaa uskoa homman jatkuvuuteen. Aika ei meit&auml; nujerra, se on nyt kertakaikkiaan tehty selv&auml;ksi.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">13. Uskotko Amigan uusien tuotteiden menestykseen?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely13.gif" width="500" height="100" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">K&auml;yt&auml;nn&ouml;n todellisuus on kerran toisensa j&auml;lkeen sanellut tiukat ehtonsa markkinoiden tasap&auml;ist&auml;mist&auml; tavoittelevalle kehitykselle. Se ei onnistu, sill&auml; ihmiset haluavat aina maailmasta l&ouml;ytyv&auml;n todellisia vaihtoehtoja ja valinnanvapautta, jotteiv&auml;t he tuntisi joutuneensa m&auml;&auml;r&auml;ilyn ja vapauden riiston kohteeksi. Niinp&auml; my&ouml;s tietotekniikan saralla l&ouml;ytyy aina kysynt&auml;&auml; massasta poikkeaville tuotteille, ja my&ouml;s senhetkisen yleisimm&auml;n vaihtoehdon valinneet tiet&auml;v&auml;t tavalla tai toisella hy&ouml;tyv&auml;ns&auml; kilpailijoiden olemassaolosta. Kun puhutaan uusien tuotteiden menestyksest&auml;, on siis syyt&auml; muistaa, ett&auml; menestykseen riitt&auml;&auml;, kun tuote ja kohderyhm&auml; l&ouml;yt&auml;v&auml;t toisensa, mit&auml;&auml;n valtastandardien kaatamista siihen ei ole pakko aina yritt&auml;&auml; v&auml;kisin yhdist&auml;&auml;. Toisaalta, onhan se nykyinenkin valtastandardi joskus ollut uusi tuote, ett&auml; siin&auml; mieless&auml;... ;)</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">14. Anna yleisarvosana asteikolla 0-5, joka mielest&auml;si kuvaa tapahtuman...</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely14.gif" width="550" height="110" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Arvosanojen tulkinta on joskus hieman hankalaa, sill&auml; keskiarvojen erot tuppaavat j&auml;&auml;m&auml;&auml;n pieniksi, kuten k&auml;vi t&auml;ll&auml;kin kerralla. Selv&auml;sti n&auml;kyv&auml; yksityiskohta on kuitenkin ohjelman tason saama muita alempi tulos, joka viel&auml; kerran todistaa kysymyksen 11 yhteydess&auml; jo mainittujen pienten takaiskujen harmittaneen k&auml;vij&ouml;it&auml;. Huomaa, ett&auml; erojen korostamiseksi kuvan asteikossa n&auml;kyy vain alue 2-4. Pylv&auml;iden lukuarvoissa erot eiv&auml;t n&auml;y yht&auml; tarkasti kuin niiden pituudessa, sill&auml; t&auml;ss&auml;kin on k&auml;yt&ouml;ss&auml; vain yhden desimaalin tarkkuus.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">15. Tuletko Saku 2002 -tapahtumaan (jos j&auml;rjestet&auml;&auml;n)?</font></b></div>
								</td>
							</tr>
						</table>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kysely15.gif" width="500" height="100" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-lehden vuoden 2000 lukijakyselyss&auml; noin sata vastaajaa ilmoitti tulevansa Saku 2001 -tapahtumaan, ja k&auml;yt&auml;nn&ouml;ss&auml; jo pelkki&auml; k&auml;vij&auml;kyselyn vastauksiakin oli reilusti enemm&auml;n, joten ei voi muuta kuin todeta ett&auml; suuret kiitokset teille kaikille lupauksenne pit&auml;misest&auml;, ja tapahtuman tekemisest&auml; ikimuistoiseksi tilaisuudeksi! T&auml;ll&auml; kertaa jopa yli sata vastaajaa ilmoitti haluavansa tulla seuraavallakin kerralla, joten toivotaan hartaasti, ett&auml; yhdistyksen varat ja tilanne mahdollistavat uuden tapahtuman j&auml;rjest&auml;misen.</font></p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy" size="2">16. Mit&auml; haluaisit kehitt&auml;&auml; Saku-tapahtumissa, mit&auml; haluaisit lis&auml;&auml;? Millainen fiilis Saku 2001-tapahtumasta j&auml;i? Kommentoi vapaasti!</font></b></div>
								</td>
							</tr>
						</table>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;ll&auml; kertaa tapahtumatilojen ilmanvaihto s&auml;&auml;styi moitteilta, aiempaa avarammin j&auml;rjesteltyjen tilojen ja hieman armollisemman s&auml;&auml;n ansiosta. Kuten totuttua, kyselypapereihin kirjoitetut palautteet ovat k&auml;yt&auml;nn&ouml;n syist&auml; keskim&auml;&auml;rin lyhyempi&auml; kuin s&auml;hk&ouml;isesti toteutetuissa lehden lukijakyselyiss&auml;. Kun nyt tilanpuute ei entisaikojen tapaan ole en&auml;&auml; riesana, laitetaanpa saman tien kaikki kommentit mukaan, useita lyhyit&auml; mutta kivoja &quot;Ok!&quot;-huudahduksia lukuun ottamatta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Saisi mainostaa itse&auml;&auml;n enemm&auml;n mediassa.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Tosi jees!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Ei ole possen vika jos kutsuvieraat j&auml;&auml; pois...&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Uutuustuotteet voisi helpottaa kiinnostavuutta.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;CS, nettikoneita ;-)&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; tuotteita esittelyyn! :)&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Loistava tilaisuus! Tilaakin ihan mukavasti mutta pieni lis&auml; ei pahitteeksi.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Tuote-esittelyj&auml;.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Jee, seuraavaks joku hinaa sen Mossin vaikka v&auml;kisin!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Ok meininki.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; pelipaikkoja!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Mielt&auml; avartava kokemus. Hyv&auml; ilmapiiri.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Todella harmi tuo Fleecyn peruminen. Amiga-kr&auml;&auml;s&auml;&auml; harmittavan v&auml;h&auml;n.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; porukkaa...&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Harmittaa v&auml;h&auml;n esim. Fleecy Mossin pois j&auml;&auml;minen ja Prometheus-esittelyn puuttuminen. Ihmiset mukavia. Ihan hyv&auml; fiilis loppujen lopuksi j&auml;i.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; firmoja paikalle toki. :) Kiva rento fiilis, mukava n&auml;hd&auml; muita amigisteja pitk&auml;st&auml; aikaa.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Saku on ehdottomaati vakiinnuttanut paikkansa ja t&auml;m&auml; tapahtuma, suurimpana Amiga-tapahtumana Suomessa on t&auml;rke&auml; Amigan n&auml;kyvyyden kannalta. Pohjois-suomalaisena voisi joskus kokeilla samanhenkisen tapahtuman j&auml;rjest&auml;mist&auml;, vaikkapa Oulussa. Mukavasti tuntuu olevan katseltavaa...&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Kyll&auml;h&auml;n sit&auml; Billi&auml; olisi voinut kuunnella...&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Hieno tapahtuma!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Enemm&auml;n tekemist&auml;? Ihan kiva, irccikoneen kello kyll&auml; sekoili.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Kuljetuksia... Haasteellisempia kilpailuja! :)&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Amiga-fiilist&auml; ei voita mik&auml;&auml;n! AmigaOne t&auml;&auml;lt&auml; tullaan!!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; koneita nettiin ja ircciin.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;N&auml;yttely oli ik&auml;v&auml;n pieni.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; kokoa (Comdex = jees :) ja Fleecy messiin!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;My&ouml;s vastavirtatuotteet (MorphOS) esille!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; juttui!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;T&auml;&auml;ll&auml; o kivaa!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Hyv&auml; fiilis. Fleecyn poisj&auml;&auml;nti oli tosin ik&auml;v&auml;&auml;, mutta seh&auml;n ei ollut Sakun (eik&auml; Fleecynk&auml;&auml;n) vika.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Juu ihan ok. Lis&auml;&auml; pelikoneita olis kiva.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; Amiga-aiheista tapahtumaa.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Lis&auml;&auml; AmigaDE-n&auml;kyvyytt&auml; ja n&auml;ytett&auml;v&auml;&auml;. :-)&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;J&auml;i hyv&auml; fiilis.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Ihan hyv&auml;!&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;TurboRaketti-skaba! Klassikot jyr&auml;&auml;.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Laitteisto/ohjelmistoesittelyj&auml;, esim. musiikki/grafiikkaohjelmisto/&auml;&auml;nikorttiesittelyj&auml;.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;N&auml;ytti olevan hieman v&auml;hemm&auml;n porukkaa kuin '99.&quot;<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&quot;Fleecy! Olis edes joku tullut tilalle. Eik&auml; myyty DE:t&auml; tai SDK:ta party-alennuksen kera! :) Halvalla l&auml;hti Broadlinen klassikkotavara.&quot;</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on monivaiheisen historiansa aikana j&auml;rjest&auml;nyt useita erilaisia kyselyit&auml; kartoittaakseen Suomen Amiga-k&auml;ytt&auml;jien tilannetta ja toiveita. Lis&auml;&auml; n&auml;ist&auml; historiallisista kyselyist&auml; voitte lukea n&auml;ist&auml; Saku-lehden numeroista: <br>
							<br>
						</font>
						<table border="0" cellpadding="0" cellspacing="2">
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #8 (4/94)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Ensimm&auml;inen lukijakysely</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #9 (5/94)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Ensimm&auml;isen lukijakyselyn tulokset (vastanneita 77)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #12 (3/95)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Toinen lukijakysely</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #13 (4/95)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Toinen lukijakysely (toistoa)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #14 (5/95)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Toisen lukijakyselyn tulokset (vastanneita 142)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #23 (4/97)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Saku 97 -vierailijakyselyn tulokset (vastanneita 61)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #25 (2/98)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Saku 98 -vierailijakyselyn tulokset (vastanneita 210)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #27 (1/99)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Pikkujoulujen vierailijakyselyn tulokset (vastanneita 23)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #29 (3/99)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Kolmas lukijakysely</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #30 (4/99)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Kolmannen lukijakyselyn tulokset (vastanneita 297)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #30 (4/99)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Saku 99 -vierailijakyselyn tulokset (vastanneita 227)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #34 (4/2000)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Nelj&auml;s lukijakysely</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #35 (1/2001)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Nelj&auml;nnen lukijakyselyn tulokset (vastanneita 169)</font></td>
							</tr>
							<tr>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku #38 (4/2001)</font></td>
								<td valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">- Saku 2001 -vierailijakyselyn tulokset (vastanneita 133)</font></td>
							</tr>
						</table>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>