<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Schluss.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P><B>&raquo;*Amiga Arena Interview mit &quot;Lukas Stehlik&quot; (AmiGOD)*</B></P>
<P>
Mit &quot;AmiGOD&quot; 2.x m&ouml;chte der Entwickler &quot;Lukas Stehlik&quot; einen w&uuml;rdigen
Nachfolger f&uuml;r die schon in die Jahre gekommenen Benchmark Programme
&quot;SysInfo&quot; und &quot;Sysspeed&quot; entwickeln. &quot;AmiGOD&quot; liegt zur Zeit noch im Beta
Stadium vor und soll aber in Zukunft auch PPC und 3D Grafikkarten
unterst&uuml;tzen. Das Interview liegt zur Zeit nur in Englsich vor.&laquo;
</P>
<P><B>&raquo;Amiga Arena News</B></P>
<P>
Das Interview mit &quot;Lukas Stehlik&quot; dem Entwickler von &quot;AmiGOD&quot;,dem neuen
Benchmark Programm f&uuml;r Classic und in Zukunft PPC Amigas ist jetzt auch in
Deutsch Online!&laquo;
</P>
<P>
<B>&raquo;*Amiga Arena - Vollversion (Valhalla 3 - and the Fortress of Eve)*</B>
</P>
<P>
 Mit &quot;Valhalla 3&quot; liegt der dritte und letzte Teil der Adventure Serie
&quot;Valhalla&quot; von &quot;Vulcan Soft.&quot; f&uuml;r den Amiga in der Deutschen HD Version (+
Komplettl&ouml;sung) zum Download bereit.&laquo;
</P>
<P><B>&raquo;*Amiga Arena - Interview mit &quot;James Jacobs&quot; (Saga,Repot+,WormWars)*</B></P>
<P>
Neue PD oder Shareware Spiele werden immer weniger f&uuml;r den Amiga
entwickelt.
</P>
<P>
Mit der Brettspiel Umsetzung &quot;Saga: Age of Heroes&quot; hat nach langer Zeit
eine neue Konventierung den Weg zum Amiga gefunden.
</P>
<P>
Wenn Sie bereit sind Monster zu besiegen,Sch&auml;tze zu gewinnen und
K&ouml;nigreiche zu regieren sollte &quot;Saga: Age of Heroes&quot; eine willkommende
Brettspiel Umsetzung f&uuml;r Sie sein.
</P>
<P>
Da das Spiel zur Zeit nur in Englsich spielbar ist, &quot;James Jacobs&quot; aber
bereit ist auch eine Deutsche Version zu erstellen braucht er Ihre
Mithilfe!
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Wer gerne bei der &Uuml;bersetzung helfen m&ouml;chte mail bitte an: <A HREF="mailto:amigan@abime.net">amigan@abime.net</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- James Jacobs&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>&raquo;*Amiga Arena - Vollversion &quot;World Hockey League Manager&quot;*</B></P>
<P>
Mit &quot;World Hockey League Manager&quot; aus dem Jahre 1993 liegt der
Eishockeymanager aus dem Haus &quot;Sayonara Software&quot; zum Download bereit.
Besonderen Dank an Marc der das Spiel zur Verf&uuml;gung stellte und Jo Seitz
von Sayonara Software f&uuml;r die Genehmigung der Freigabe.
</P>
<P>
Das Spiel erwies sich auf meinem Amiga 4000/60 unter OS 3.9 als nicht
lauff&auml;hig und konnte deshalb keiner Bewertung unterzogen werden.&laquo;
</P>
<P>
<B>&raquo;*Amiga Arena - Vollversion &quot;Hilt II plus German files&quot;*</B>
</P>
<P>
&quot;Hilt II&quot; von Scorpius Software ist ein Strategiespiel in dem Sie nicht nur
Ihr Team aus Soldaten zusammen stellen m&uuml;ssen,wobei die Einheiten &uuml;ber
verschiedene F&auml;higkeiten verf&uuml;gen,sondern auch zahlreiche Missionen zu
erf&uuml;llen haben.
</P>
<P>
Die &quot;Amiga Arena&quot; pr&auml;sentiert nun erstmals die erste Deutschsprachige
Mission und m&ouml;chte in Zukunft weitere Missionen sowie das &quot;mainfile&quot;
komplett &uuml;bersetzten.
</P>
<P>
Wer Strategie Spiele mag sollte sich &quot;Hilt II&quot; einmal anschauen.
</P>
<P>
Die Englsiche Orginal Version sowie ein Installer und die ersten Deutschen
files liegen zum Download bereit. Wer bei der &Uuml;bersetzung helfen m&ouml;chte
sowie einfach nur Interesse hat das Spiel auch in Deutsch spielen zu
k&ouml;nnen, Feedback ist erw&uuml;nscht!
Besonderen Dank an Mark Sheeky dem Entwickler f&uuml;r seine Hilfe sowie
Christian Busse der die ersten Missionen &uuml;bersetzt hat.&laquo;
</P>
<P><B>&raquo;*Interview mit &quot;Christian Rosentreter&quot; (Shangai Dragon)*</B></P>
<P>
Wer in den vergangenen Tagen die News im Forum von &quot;amiga-news.de&quot; gelesen
hat,dem d&uuml;rfte der Name &quot;Shangai Dragon&quot; aufgefallen sein.
</P>
<P>
Der Entwickler &quot;Christian Rosentreter&quot; gab dort bekannt mit &quot;Shangai
Dragon&quot; ein neues Spiel in Entwicklung zu haben f&uuml;r den Amiga.
Ein weiterer &quot;Majong&quot; Clone? werden jetzt sicher viele denken aber
sp&auml;testens wenn man sich die mindest Systemanforderungen anschaut (68040,4
MB FastRam) und dazu,das es ausschliesslich Grafikkarten unterst&uuml;zt,sieht
man das hier neue Anforderungen und Massst&auml;be an ein Mailware Spiel
gestellt werden.
</P>
<P>
Im Interview mit der &quot;Amiga Arena&quot; sprach &quot;Christian Rosentreter&quot; &uuml;ber
weitere features von &quot;Shangai Dragon&quot; und wie es zu der Entwicklung kam.&laquo;
</P>
<P><B>&raquo;&quot;Hilt II&quot;: German files Update</B></P>
<P>
F&uuml;r das Action-Strategie Spiel &quot;Hilt II&quot; ist ein weiteres Update Online!
Alle Waffen sowie weitere Gegenst&auml;nde aus dem Inventar sind &uuml;bersetzt.
Team Einheiten k&ouml;nnen jetzt beliebing ausger&uuml;stet werden,dazu verf&uuml;gen Sie
jetzt &uuml;ber 20 Waffen zur Auswahl
(Lasergewehr,Napalm,Brenner,Handgranate,L&auml;hmungsbombe,Kettens&auml;ge) sowie
Schutzanz&uuml;ge und Medikits.
</P>
<P>
Desweiteren k&ouml;nnen Sie die &quot;Feldz&uuml;ge&quot; Tutorial,Terrorist und Holowars
komplett in Deutsch spielen.
</P>
<P>
Weiterhin wird noch Hilfe gesucht um die Missionen zu &uuml;bersetzten!&laquo;
</P>
<P>
<B>&raquo;*&quot;Amiga Arena&quot; goes Scene part II / Interview mit &quot;Ghandy&quot; und &quot;Zito&quot; (Scene Mag - JurassicPack)*</B>
</P>
<P>
Wenn mich heute einer fragen w&uuml;rde,was mich am C64/Amiga seit anbeginn
fasziniert hat,meine Antwort w&auml;re &quot;Die Spiele und Scene Demos!&quot;
Das die Amiga Demo Scene auch 2002 &quot;still alive&quot; ist zeigen immer wieder
die erfolgreichen Platzierungen der Wettbewerbe auf Partys und
Veranstaltungen.
</P>
<P>
Aber nicht nur Demos sondern auch Magazine sind fester Bestandteil der
&quot;Scene&quot;.
</P>
<P>
Im letzten Jahr gab es nicht nur mit dem Comback von &quot;D.I.S.C.&quot; (siehe
Interview mit &quot;Frode Hansen&quot;) eine neue Ausgabe des Magazines sondern auch
&quot;JurassicPack&quot; erschien unerwartet mit einer neuen Ausgabe.
</P>
<P>
Lars &quot;Ghandy&quot; Sobiraj und Marc &quot;Zito&quot; Oberst sind seit dem die Herausgeber
und f&uuml;hrten mit der &quot;Amiga Arena&quot; ein sehr ausf&uuml;hrliches Interview &uuml;ber die
&quot;Amiga Demo Scene&quot; und Ihrem Magazin &quot;JurassicPack&quot;.
</P>
<P>
Gerade &quot;Einsteigern&quot; kann das Magazin sehr empfohlen werden,auch wenn Ihre
letzte Ausgabe 10 nicht von Kritik seitens einiger &quot;Scener&quot; verschont
blieb,aber liest selbst und taucht ab in einen Teil der Amiga Welt die bis
heute einzigartig ist.
*Nachtrag:*
Urspr&uuml;nglich war das Interview kurz nach der &quot;Mekka+Symposium&quot;
Veranstaltung geplant doch aus verschiedenen Gr&uuml;nden konnte es es erst
jetzt fertig gestellt werden.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Schluss.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
