<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Diverse Amiga-News</H1>
<H2>1. Zusammenfassung: Neuigkeiten zu Pegasos/MorphOS (von Wolfgang Hosemann)</H2>
<P>
Im vergangenen Monat gab Thendic-France einige Neuigkeiten rund um den
Pegasos bekannt. Das Interessanteste dabei war sicher die Ank&uuml;ndigung des
Pegasos-Vorabsystems &quot;BETATESTER&quot;. Hierbei handelt es sich um vorerst 1000
Pegasos-Boards, die komplett konfiguriert oder, wie sp&auml;ter bekannt wurde,
auch einzeln an jene Entwickler abgegeben werden sollen, die bestimmte
Verpflichtungen akzeptieren. Einzelheiten sind in einer separaten
Bekanntmachung nachzulesen, die in dieser AMIGA-aktuell-Ausgabe enthalten
ist.
</P>
<P>
Kurz darauf wurde von Thendic-France bekannt gegeben, dass im Dezember die
Auslieferung der Endkundenger&auml;te starten soll. Auf der Aachener Messe
&raquo;Amiga &amp; Retro Computing 2002&laquo; sollen die Rechner bereits erh&auml;ltlich sein
und zusammen mit MorphOS und einigen Applikationen verkauft werden.
Zum Pegasos-Hauptdistributor f&uuml;r Deutschland wurde derweil Vesalia Computer
ernannt.
</P>
<P>
Auch bez&uuml;glich alternativer Betriebssysteme gab es Neuigkeiten, die laut
Thendic-France haupts&auml;chlich eine Reaktion auf das Erscheinen der neuen
Mac-Modelle sein soll. Man m&ouml;chte hier einen Weg gehen, der Terra Soft, die
iMacs mit Yellow Dog Linux ausliefern, bereits gute Resonanz gebracht
h&auml;tte. Pegasos werde also auch f&uuml;r andere Betriebssysteme offen sein.
</P>
<P>
Mitte August startete Thendic-France ein weiteres Mal einen Werbefeldzug
auf Google. Nach Eingabe der Stichw&ouml;rter &quot;AmigaOne&quot;, &quot;AmigaOs 4&quot;, &quot;Amiga
OS4.x&quot; und einigen weiteren wird neben dem Suchergebnis eine kurze Pegasos-
Werbung angezeigt.
</P>
<P>
Dem Beispiel von AMIGA, Inc. folgend wurde kurze Zeit sp&auml;ter ebenfalls ein
T-Shirt-Wettbewerb ausgerufen, bei dem optimale &Uuml;bersetzungen des Satzes
&quot;Das Gute liegt oft n&auml;her, als man denkt.&quot; gesucht werden, die dann auf den
T-Shirts ver&ouml;ffentlicht werden sollen.
</P>
<P>
Bezugnehmend auf Vorw&uuml;rfe von AMIGA, Inc., MorphOS sei mittels unrechtm&auml;&szlig;ig
erworbener Sourcen entstanden, hat Thendic-France ein Statement
ver&ouml;ffentlicht, in dem diese Anschuldigungen zur&uuml;ckgewiesen werden.
</P>
<P>
Eine ganz aktuelle Meldung von Thendic-France, ver&ouml;ffentlicht auf der
Website des Newsdienstes ANN.lu, besagt, dass MorphOS auch auf dem AmigaOne
lauff&auml;hig sei. Ferner sei dem AmigaOS4-Entwicklerteam freigestellt, ein
Pegasos-System zu bestellen.
</P>
<P>
Dar&uuml;ber hinaus wurden noch einige Veranstaltungsauftritte angek&uuml;ndigt. Hier
ein Auszug:
</P>
<UL>
<LI> A-Expo, 7.-8. September, Frankreich
</LI>
<BR><LI> BETATESTER CONFERENCE, 14. September, Deutschland
</LI>
<BR><LI> Pianeta Amiga, 21.-22. September, Italien
</LI>
<BR><LI> Gothenburg Pegasos Show, 22. September, Schweden
</LI>
<BR><LI> SAKU 2002, 28. September, Finnland
</LI>
</UL>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
