<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A></B></P>
<H2>1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren</H2>
<P>
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<P><B>Die Frage des letzten Monats lautete:</B></P>
<P>
&raquo;Was erwartest du dir von der Aachener Amiga-Messe im Dezember? Wirst du
sie besuchen?&laquo;
</P>
<P><B>Mirko Naumann freut sich auf die Messe:</B></P>
<P>
&raquo;Also zun&auml;chst einmal finde ich es gut, dass &uuml;berhaupt wieder eine gr&ouml;&szlig;ere
Messe in Deutschland stattfinden wird. K&ouml;ln, Neuss und all die anderen
Messen waren und sind immer ein wichtiger Bestandteil der Amiga-Gemeinde.
Es w&auml;re ziemlich schlimm f&uuml;r uns alle, wenn der H&ouml;hepunkt des Jahres auch
nur einmal ausfallen w&uuml;rde.
</P>
<P>
Ich denke sie schwei&szlig;t die vielen User erst zu der viel beschworenen
&quot;Gemeinde&quot; zusammen. Ohne sie w&uuml;rden sich die meisten wohl nur als so eine
Art &quot;Kunde&quot; f&uuml;hlen (Computer gekauft, bezahlt und das war's).
</P>
<P>
Die Messe ist ein wichtiger Treffpunkt f&uuml;r uns alle. Sie f&uuml;hrt Hersteller
und Distributoren zusammen, bietet den Usern die M&ouml;glichkeit, in den
Angeboten der vielen H&auml;ndler zu st&ouml;bern sowie Hard- und Softwareprodukte
live zu erleben.
</P>
<P>
Klar ist es auch wichtig, hier und da sein Schn&auml;ppchen zu machen. Der
Vorteil der Messe ist dabei, dass man die Produkte vor Ort begutachten und
mit H&auml;ndlern und Entwicklern auch mal dar&uuml;ber reden kann. Die Entwickler
k&ouml;nnen so von den Usern direkt erfahren, was in Zukunft gew&uuml;nscht wird, was
sich noch verbessern l&auml;sst und wie bisherige Produkte beim Kunden ankommen.
</P>
<P>
Ich stell meine Erwartungen an die Messe mal lieber nicht zu hoch, freue
mich aber trotzdem &uuml;ber alles, was geboten wird, und wer wei&szlig;, vielleicht
schaffen es ja einige, mich mit ihren neuen Produkten zum Kauf zu
verf&uuml;hren. :)
</P>
<P>
Das einzige, was ich aber nicht h&ouml;ren will, sind vollmundige Versprechungen
&uuml;ber Produkte, die dann doch nicht erscheinen, oder langweilige Reden &uuml;ber
irgendwelche Pl&auml;ne, die dann eh nicht so realisiert werden.
</P>
<P>
Richtig cool w&auml;re nat&uuml;rlich, wenn die Amiga-Band Annex mal wieder mit ihren
s&uuml;&szlig;en M&auml;dels dabei w&auml;re, um f&uuml;r die richtige Stimmung zu sorgen. Vielleicht
mit einem oder mehreren neuen Songs?
</P>
<P>
Die Messe lass ich mir auf keinen Fall entgehen, und die sollte sich auch
sonst keiner entgehen lassen! Hoffentlich sehen das die H&auml;ndler und
Entwickler genauso, dann wird's bestimmt super.&laquo;
</P>
<P>
Manfred Rohde &uuml;bt heftige Kritik am Austragungsort der Messe:
</P>
<P>
&raquo;Ich habe eben erst in der Augustausgabe von der Messe in Aachen erfahren.
Da bleibt mir vor Schreck die Spucke weg!
</P>
<P>
Wer plant an den Usern vorbei solche Messetermine? Ich wohne in Hannover,
da war die Messe in K&ouml;ln gerade noch o.k. Das ist an einem Tag zu schaffen.
Aber alle, die weiter &ouml;stlich wohnen oder aus dem S&uuml;den kommen, haben da
schon ein Problem. Und jetzt Aachen, und das noch im Dezember, da werde ich
wohl passen m&uuml;ssen.
</P>
<P>
Perfekt w&auml;re doch ein Messestandort in der Mitte Deutschlands, der f&uuml;r
jeden gut zu erreichen ist. Nichts gegen die Aachener, aber ich bef&uuml;rchte,
die Messe dort wird unter starkem Besucherschwund leiden. Aber vielleicht
ist das gewollt, um sie k&uuml;nftig ganz abzublasen?
</P>
<P>
Die Frage, was man von der Messe erwartet, wird da schon ganz
nebens&auml;chlich. Ich w&uuml;rde mir w&uuml;nschen, dass es dort endlich einen neuen,
zukunftssicheren AMIGA zu sehen und vor allem auch zu einem akzeptablen
Preis zu kaufen gibt. Dazu noch neue oder aktualisierte Software, denn die
ist dringend erforderlich.&laquo;
</P>
<P><B>Auch Wolfgang Hosemann kritisiert den Messestandort:</B></P>
<P>
&raquo;Tja, die Messe in Aachen... was erwarte ich mir davon? Ich hoffe, den
AmigaOne mit AmigaOS4 wenigstens teilweise laufen zu sehen. Ich hoffe auch,
auf dieser Messe mit Leuten in Kontakt zu kommen, die endlich wieder genug
Mumm aufbringen, an der momentan verfahrenen Situation etwas zu &auml;ndern. Ich
selbst versuche mein Bestes, etwas dazu beizutragen. Des weiteren w&uuml;rde ich
mir den CommodoreOne gern etwas n&auml;her betrachten und mit der Entwicklerin
ein wenig plaudern. Vielleicht hat sie ja etwas f&uuml;r den Amiga &uuml;brig?
</P>
<P>
Das sagt nat&uuml;rlich auch, dass ich dort hinfahren werde. Begeistert bin ich
von Aachen als Austragungsort aber genauso wenig wie Carsten. Mir w&uuml;rde
z.B. Hannover extrem zusagen, obwohl ich in Nordrhein-Westfalen beheimatet
bin. Seit dem Ausbau der A2 ist Hannover aber sehr gut zu erreichen, die
Anbindung durch die Bundesbahn ist seit der Expo 2000 geradezu vorbildlich
geworden, und der &Ouml;PNV ist da nicht anders. Aber warten wir mal die Messe
in Aachen ab, vielleicht erleben wir alle ja eine positive &Uuml;berraschung
(oder mehrere)...&laquo;
</P>
<P><B>Nun zur aktuellen Frage des Monats:</B></P>
<P>
&raquo;Wie beurteilst du, dass das neue Strategiespiel Tales of Tamar gratis
abgegeben wird und daf&uuml;r Kosten pro gespielte Runde anfallen?&laquo;
</P>
<P><B>Schickt eure Beitr&auml;ge bitte an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A></B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
