<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>6. Interview mit Richard Fagher, Autor von &raquo;BabeAnoid&laquo;</H2>
<H3>1. Bitte stell dich unseren Lesern kurz vor...</H3>
<P>
Mein Name ist Richard &quot;Dawnbringer&quot; Fagher, ich bin 31 Jahre alt und lebe
auf der Insel Dons&ouml; bei G&ouml;teborg, Schweden. Zur Zeit bin ich ohne
Besch&auml;ftigung, aber gew&ouml;hnlich arbeite ich im Webdesign und an anderen
computerbezogenen Projekten.
</P>
<P>
Ich benutze den Amiga seit 1991 und habe viele PD-Programme geschrieben:
</P>
<UL>
<LI> BabeAnoid            (game/action/babeanoid_demo.lha)
</LI>
<BR><LI> DawnVideoPoker3.0    (game/think/DawnVideoPoker.lha)
</LI>
<BR><LI> SpaceBall2000        (game/action/spaceball2000.lha)
</LI>
<BR><LI> D-Flip               (game/think/D-Flip.lha)
</LI>
<BR><LI> Simon2001            (game/think/Simon2001.lha)
</LI>
<BR><LI> SeaHaven2000         (game/think/SeaHaven2000.lha)
</LI>
<BR><LI> Fnurr2000            (game/action/Fnurr2000.lha)
</LI>
<BR><LI> Tittris              (game/think/Tittris.lha)
</LI>
</UL>
<BR>
<H3>2. Was waren die Beweggr&uuml;nde f&uuml;r deine Arbeiten?</H3>
<P>
Es ist Spa&szlig;! Ironischerweise schreibe ich h&auml;ufig solche Spiele, die ich
eigentlich gar nicht mag... aber das mache ich gew&ouml;hnlich, weil ich einige
neue Routinen oder Programmiertechniken ausprobieren m&ouml;chte - und der beste
Weg, das zu tun, ist, ein kleines Spiel zu schreiben... und manchmal f&uuml;hre
ich dieses einfach weiter, wie z.B. BabeAnoid. ;)
</P>
<H3>3. Gab es Schwierigkeiten dabei, dieses faszinierende Spiel zu schreiben?</H3>
<P>
Einige Kommandos von AMOS sind ziemlich langsam, aber gl&uuml;cklicherweise gibt
es einige Erweiterungen mit zus&auml;tzlichen oder verbesserten Kommandos. Diese
machen AMOS sehr viel m&auml;chtiger. Es ist kein Problem, mit AMOS ein
gro&szlig;artiges Spiel zu entwickeln, wenn man mit Disziplin programmiert, die
schnellen L&ouml;sungen lernt und die Amiga-eigenen Features nutzt (Sprites,
Copper usw.).
</P>
<P>
Auch AmigaOS-bezogene Probleme sind eher weniger vorhanden, da AMOS fast
alles mit eigenen Routinen erledigt. Wie auch immer, BabeAnoid nutzt einige
Libraries, die Mathematik-Libraries im Besonderen. Man sollte
sicherstellen, die neuesten und schnellsten Mathematik-Bibliotheken
installiert zu haben, da diese einen gro&szlig;en Einfluss auf ein Mathematik-
intensives Programm wie BabeAnoid haben k&ouml;nnen.
</P>
<H3>4. Gibt es ausreichend R&uuml;ckmeldungen aus der Amiga-Gemeinde?</H3>
<P>
Nein, im Grunde gar keine.
</P>
<H3>5. Was h&auml;ltst du von den (mehr oder weniger) bald erscheinenden PPC-
basierenden Maschinen?</H3>
<P>
Ich wei&szlig; nicht genug dar&uuml;ber, um das zu kommentieren. Ich bin ein Hardcore-
Amiga-Classic-Fan.
</P>
<H3>6. Hast du ein paar Tipps f&uuml;r andere Spieleprogrammierer?</H3>
<P>
Der Platz reicht nicht aus, um hier irgendjemandem Programmierkniffe
beizubringen... aber eine Sache, die sehr wichtig ist: Versucht, eure
Programme auf so vielen verschiedenen Maschinen wie irgend m&ouml;glich zu
testen, bevor ihr sie ver&ouml;ffentlicht... selbst, wenn es nur ein Demo ist.
Viel zu viele Spiele aus dem Aminet st&uuml;rzen schlicht und einfach ab oder
verweigern den Start, bedingt durch einen Fehler irgendeiner Art. Und nur
sehr wenige Leute probieren so ein Programm zweimal aus!
</P>
<H3>7. Glaubst du, dass die Chance besteht, dass es in naher Zukunft mehr
Spiele geben wird?</H3>
<P>
Traurigerweise denke ich, dass es in Zukunft immer weniger Spiele geben
wird, zumindest f&uuml;r den Classic-Amiga, den ich selbst benutze und vorziehe.
</P>
<H3>8. Denkst du, dass du noch ein anderes brillantes Spiel wie BabeAnoid
schreiben w&uuml;rdest, wenn genug Feedback aus der Amiga-Gemeinde k&auml;me?</H3>
<P>
Bevor AmigaOS nicht eines der weltweit f&uuml;hrenden Betriebssysteme wird,
w&uuml;rde ich ein so gro&szlig;es Programm wie BabeAnoid nicht wieder f&uuml;r Amiga
schreiben (dabei ist BabeAnoid noch nicht einmal fertig, erinnerst du
dich?)... wie auch immer, einige kleinere Spiele w&auml;ren nicht unm&ouml;glich.
</P>
<P>
Zur Zeit arbeite ich noch an einem Weltraumspiel (bisher habe ich schon elf
Jahre daran gesessen), haupts&auml;chlich an den Theorien, aber wenn es jemals
beendet wird, wird es eines der gr&ouml;&szlig;ten und komplexesten Spiele sein, die
geschrieben wurden. Alle Spiele, die ich bisher f&uuml;r den Amiga programmiert
habe, waren Training f&uuml;r diese Mission. ;)
</P>
<P>
Die traurige Wahrheit ist, so gern ich dieses Spiel f&uuml;r den Amiga schreiben
w&uuml;rde, mir fehlt die Motivation dazu (ich kann nicht umsonst arbeiten). Ich
werde es f&uuml;r das System mit den meisten Nutzern schreiben. Aber wenn Amiga
dann immer noch existiert, und dann hoffentlich etwas gr&ouml;&szlig;er als heute...,
werde ich mein Bestes tun, um es f&uuml;r den Amiga zu konvertieren und zu
ver&ouml;ffentlichen, falls m&ouml;glich.
</P>
<H3>9. Ein paar Worte an alle Amiga-User?</H3>
<P>
Danke, dass ihr so lange in einer so schweren Zeit immer zu unserem
geliebten Amiga gehalten habt! Und lasst uns hoffen, dass der Amiga eines
Tages, auf irgendeinem Weg, ein starkes Comeback erleben wird - so dass wir
wieder die &Uuml;berlegenheit dieser intelligenten, kreativen und wundersch&ouml;nen
Computerumgebung erfahren k&ouml;nnen, die einst in der ganzen Welt f&uuml;hrend war.
Amiga rulez!
</P>
<P>
Das Interview mit Richard Fagher f&uuml;hrte Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
