<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>5. Spielevorstellung: &raquo;BabeAnoid&laquo;</H2>
<P>
Bei &quot;BabeAnoid&quot; handelt es sich um ein Projekt, das von Richard Fagher vor
ca. sieben Jahren begonnen wurde. Im ersten Moment sieht es aus wie ein
weiterer von vielen, vielen Arkanoid-Clones, es ist aber viel mehr.
</P>
<P>
Im Laufe der Zeit haben immer mehr zus&auml;tzliche Ideen in das
Ursprungskonzept &quot;Arkanoid&quot; Einzug gehalten, &quot;BabeAnoid&quot; fasst die besten
davon in einem Spiel zusammen.
</P>
<P>
Als erstes w&auml;re das Level-Design zu nennen. Bei BabeAnoid ist es das Ziel,
sich durch mehrere R&auml;ume zu spielen, die wiederum in verschiedene Level
aufgeteilt sind. Jeder dieser Level und auch jeder Raum hat seine
Besonderheiten, darunter verschiedenste &quot;Feinde&quot; des Spielers und Hunderte
von Extras (kennt jemand &quot;Arkanoid: Revenge of Doh&quot;?).
</P>
<P>
Die Menge an Extras ist schier unglaublich. Sie alle aufzuz&auml;hlen und zu
beschreiben, w&uuml;rde den Rahmen dieses Artikels sprengen. Nur soviel: Sowohl
der Schl&auml;ger als auch der Ball selbst k&ouml;nnen mit etlichen Extras
aufgewertet werden. Zus&auml;tzlich zu den eher ungew&ouml;hnlichen Extras gibt es
noch das Mega-Bonus-System, das mit den bekannten Extras f&uuml;r den Schl&auml;ger
aufwartet. Dadurch, dass man den Mega-Bonus durch Aufsammeln von &quot;M&quot;-
Piktogrammen nur St&uuml;ck f&uuml;r St&uuml;ck erh&ouml;hen kann, kommt zu der
Zufallskomponente des Spiels die Geschicklichkeit als entscheidendes
Kriterium f&uuml;r Erfolg oder Misserfolg in einem Level zum Tragen. Der ge&uuml;bte
Spieler schafft es dann, zur richtigen Zeit das richtige Extra auszul&ouml;sen.
Das erh&ouml;ht den Reiz des Spiels deutlich.
</P>
<P>
Die technische Seite dieses Spiels ist ebenfalls nicht zu verachten. Ich
war ehrlich erstaunt, als ich erfuhr, dass dieses Programm haupts&auml;chlich
mit AMOS geschrieben wurde. Die sehr vielseitigen und zahlreichen Effekte
lie&szlig;en mich zuerst auf handoptimiertes Assembler schlie&szlig;en. Ein &Uuml;briges
erledigt die wirklich professionelle Grafik des Programms. Man merkt hier
mehr als deutlich, dass der Autor mit viel Akribie und reichlich Geduld
gearbeitet hat. Das erkl&auml;rt auch die sehr lange Entwicklungszeit. Nahezu
alle Amigas werden unterst&uuml;tzt, da &quot;BabeAnoid&quot; auf ECS l&auml;uft und
verh&auml;ltnism&auml;&szlig;ig wenig Speicher ben&ouml;tigt. Aufgrund der zahlreichen
grafischen Effekte sollte schon ein 68030 im heimischen Amiga seinen Dienst
tun, ein nicht aufger&uuml;steter Amiga 1200 ist laut Readme aber schon
ausreichend, um &quot;BabeAnoid&quot; mit reduzierter Effektzahl und damit erh&ouml;hter
Geschwindigkeit spielen zu k&ouml;nnen. Im &uuml;brigen l&auml;uft &quot;BabeAnoid&quot; auch
einwandfrei auf Emulatoren, Tests mit AmigaXL verliefen sehr
zufriedenstellend. Amithlon- und (Win)UAE-Nutzer sollten daher ebenfalls
keine Kompatibilit&auml;tsprobleme zu bef&uuml;rchten haben.
</P>
<P>
Erh&auml;ltlich ist das Spiel zur Zeit nur als Demoversion, da der Autor noch
eine Menge weiterer Ideen f&uuml;r sein Programm hat und nat&uuml;rlich auch noch ein
wenig Zeit braucht, um diese zu implementieren. Ein kleiner Wermutstropfen
dabei ist, dass Richard Fagher vor einiger Zeit die Arbeiten auf Eis gelegt
hat, da er auf Feedback aus der Anwenderschaft hoffte, dieses aber nicht
bei ihm ankam.
</P>
<P>
Aus diesem Grund sehen wir diesen Artikel auch als eine Anregung f&uuml;r die
Spielefans dort drau&szlig;en, sich dieses Game einmal anzusehen, zu spielen und
dem Autor danach per E-Mail (<A HREF="mailto:dawnbringer@hem.utfors.se">dawnbringer@hem.utfors.se</A>) ein paar
Anregungen, Lob oder Kritik zukommen zu lassen. Es lohnt sich!
</P>
<P>
Zu finden ist die Demoversion mit einer Karte mit 4 Levels unter
</P>
<P>
<A HREF="http://hem.fyristorg.com/dawnbringer" TARGET="_top">http://hem.fyristorg.com/dawnbringer</A>
</P>
<P>
unter &quot;Downloads&quot;.
</P>
<P><B>Also: Maus angew&auml;rmt und los geht's!</B></P>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
