<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Spieleteil (von Wolfgang Hosemann und J&uuml;rgen Theiner)</H1>
<H2>1. Vorwort</H2>
<P>
In der letzten Ausgabe von AMIGA aktuell klang das Vorwort der Spielerubrik
sehr pessimistisch. Zu diesem Zeitpunkt wusste ich nicht, wie ich diese
Rubrik weiterf&uuml;hren und interessanter gestalten soll. Ich habe mir eine
Menge Gedanken gemacht, mich ein wenig umgeh&ouml;rt und bin Tipps gefolgt, die
als Feedback zur letzten Ausgabe kamen (ich danke vor allem Olaf K&ouml;bnik f&uuml;r
den Tipp &quot;BabeAnoid&quot;!). Letzteres f&uuml;hrte zu einem Konzept, das bei euch,
den Lesern, hoffentlich so viel Anklang findet, wie ich mir davon erwarte.
</P>
<P>
Der Gedanke ist, eine unregelm&auml;&szlig;ig erscheinende zus&auml;tzliche Rubrik
einzuf&uuml;hren, die &quot;Perlen der PD&quot;. Hier geht es, man kann es sich denken, um
ausgesuchte Spiele aus dem PD-Bereich. Dieser brachte in fr&uuml;heren Zeiten
jede Menge Spiele hervor. Das dies heute nicht mehr in dem Ma&szlig;e der Fall
ist, habe ich ja schon in der letzten Ausgabe beklagt. Um hier einen Ansto&szlig;
zu geben, stelle ich in dieser Rubrik nun also PD-, Shareware- oder
Freeware-Spiele vor, die auf die eine oder andere Weise etwas Besonderes
darstellen.
</P>
<P>
Zus&auml;tzlich zu den Artikeln &uuml;ber das Spiel selbst werde ich versuchen,
Hintergrundinformationen zu liefern. Zuerst nat&uuml;rlich &uuml;ber den Autor des
Spiels in Form eines Interviews (bevor die ersten losschreien: Nein, ihr
bekommt hier keine &quot;aufgew&auml;rmten&quot; Amiga-Arena-Interviews!). Dazu kommt dann
ein Artikel &uuml;ber den technischen Hintergrund des Spiels, der z.B.
erl&auml;utert, in welcher Sprache es geschrieben ist, wie lange die bisherige
Entwicklung gebraucht hat, wo Probleme auftauchten, usw. Vielleicht verr&auml;t
der eine oder andere Entwickler auch mal, auf welche Art und Weise er
bestimmte Effekte realisiert, wie man eine h&ouml;here Geschwindigkeit erreichen
kann u.v.m.
</P>
<P>
Sollte dieses Konzept aufgehen, w&auml;re auch noch mehr denkbar. Als Beispiel
k&ouml;nnte ich hier eine extra Artikel-Reihe f&uuml;r Spieleentwickler nennen. Diese
k&ouml;nnte Informationen enthalten, die von dem einen oder anderen
Spieleprogrammierer der Allgemeinheit zur Verf&uuml;gung gestellt w&uuml;rden. Oder
einen Workshop zur Spieleprogrammierung mit einem vollst&auml;ndigen,
hochwertigen Spiel als Ergebnis (geschrieben z.B. in BlitzBasic, um die
Anregung des letzten Vorworts aufzugreifen).
</P>
<P>
Ob dies alles ein Erfolg bzw. Realit&auml;t wird, h&auml;ngt aber vor allen Dingen
davon ab, ob ihr, unsere Leser, &uuml;berhaupt Interesse an diesem Konzept habt
und dieses Interesse auch kundtut. Schreibt mir eure Meinung dazu, wenn ihr
Tipps f&uuml;r eine &quot;Perle&quot; habt, immer her damit! Solltet ihr an einem Spiel
arbeiten, macht mich darauf aufmerksam!
</P>
<P>
Auch auf die Gefahr hin, dass ich mich wiederhole: Der Amiga lebt vom
Teamgeist seiner User. Dieser Teamgeist k&ouml;nnte viel mehr bewirken, wenn er
sich mehr in den Vordergrund stellen w&uuml;rde. Er kann es aber nur, wenn die
User sich wieder auf diesen Geist besinnen.
</P>
<P>
Also, begrabt eure Kriegsbeile, setzt euch zusammen, spinnt Ideen und setzt
sie um! F&uuml;r welches System (68k oder PPC), spielt im Grunde genommen keine
Rolle. Die &quot;normalen&quot; User warten seit Jahren darauf, dass es wieder
bergauf geht. Die Spiele, die den Amiga einst gro&szlig; gemacht haben, k&ouml;nnen
ihn auch wieder gro&szlig; machen!
</P>
<P><B>In diesem Sinne</B></P>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
