<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Vorwort
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Vorwort</H1>
<P>
+++ Viel Neues von Thendic-France +++ Executive Update von Bill McEwen +++
&raquo;Tales of Tamar&laquo; kurz vor dem Erscheinen +++
</P>
<P>
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Insgesamt gesehen verliefen die letzten Wochen eher ruhig. Mit einer ganzen
Reihe von Neuigkeiten stellte lediglich Thendic-France eine Ausnahme dar.
Dieser Medienvorherrschaft wollte offenbar AMIGA, Inc. nachtr&auml;glich etwas
entgegensetzen, und so hat CEO Bill McEwen kurz vor Redaktionsschluss ein
neues Executive Update ver&ouml;ffentlicht, das aufgrund seines ung&uuml;nstigen
Erscheinungszeitpunkts lediglich im englischen Original in dieser Ausgabe
zu finden ist.
</P>
<P>
Es kommt kaum vor, dass wir in den Schlagzeilen die baldige
Ver&ouml;ffentlichung eines neuen Amiga-Spiels erw&auml;hnen, doch bei &raquo;Tales of
Tamar&laquo; machen wir eine Ausnahme - aus zwei Gr&uuml;nden: Zum einen wird dieses
Strategiespiel von vielen Usern seit Jahren sehns&uuml;chtig erwartet, und zum
anderen ist es das wohl erste Amiga-Spiel &uuml;berhaupt, das rundenabh&auml;ngig
bezahlt wird, was sich als wirkungsvolles Mittel gegen Raubkopierer
erweisen k&ouml;nnte.
</P>
<P>
Ein Test von &raquo;Tales of Tamar&laquo; ist in dieser AMIGA-aktuell-Ausgabe zu
finden.
</P>
<P><B>Zu den regelm&auml;&szlig;igen Aufrufen:</B></P>
<UL>
<LI> An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber
  an AMIGA aktuell (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>).
</LI>
<BR><LI> Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich
  an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> oder <A HREF="mailto:aichi@gmx.de">aichi@gmx.de</A> wenden.
</LI>
</UL>
<P><B>Viel Spa&szlig; jetzt bei dieser Ausgabe,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
