<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Workshop: AFPL Ghostscript 6.50 - Teil 4 (von Uwe Pannecke)</H2>
<P><B>Crash-Kurs durch die Ghostscript-Untiefen</B></P>
<P>
Mit ein wenig Verz&ouml;gerung in dieser Septemberausgabe nun der versprochene
vierte Teil des Ghostscript-Workshops. Diesmal soll neben der harmonischen
Zusammenarbeit von Ghostscript [1] und Final Writer die Ausgabe von PS- und
PDF-Dateien in weiteren Formaten sowie die Erh&ouml;hung des Bedienkomforts im
Mittelpunkt unserer Betrachtungen stehen.
</P>
<H3>1. Teamwork</H3>
<P>
Im letzten Teil haben wir uns Ghostscripts interessante F&auml;higkeit,
PostScript-Dateien in (zunehmend) betriebssystemunabh&auml;ngig verarbeitbare
PDF-Dokumente umwandeln zu k&ouml;nnen, kennen gelernt.
</P>
<P>
Anwender der Textverarbeitung Final Writer werden sich, obwohl das Programm
in der letzten Version bereits f&uuml;nf Jahre alt ist, &uuml;ber dessen
Leistungsf&auml;higkeit im t&auml;glichen Einsatz nach wie vor freuen. Doch leider
findet sich unter den vielf&auml;ltigen Funktionen kein PDF-Export erstellter
Dokumente. Da aber Final Writer in der Lage ist, seine Dokumente als
Postscript-Dateien auszugeben, ist das PDF-Format nur einen (Ghostscript-)
Schritt entfernt.
</P>
<P>
Im Unterschied zu einigen Firmen auf dem Amiga-Markt demonstrieren die
beiden Programme eindrucksvoll, dass man gemeinsam stark sein kann. Zwar
k&ouml;nnt ihr auch per Hand jede exportierte PS-Datei &uuml;ber Ghostscript ins PDF-
Format wandeln, doch wesentlich komfortabler ist ein Automatismus, der
einem diese Arbeit abnimmt. Dank ARexx und dem Skript &quot;Convert to PDF&quot; [2]
des nur mit seinem Synonym auftretenden &quot;ELAL&quot; ist auch dieser Wunsch
mit wenig Aufwand erf&uuml;llbar.
</P>
<P>
Kopiert das ARexx-Skript nach &quot;FinalWriter_D:FWMacros&quot;. Da das ARexx-File
f&uuml;r Ghostscript 5.x geschrieben wurde, solltet ihr vor dem eigentlichen
Start zuvor mit Hilfe eines beliebigen Editors im Skript den Stapelspeicher
von 40000 auf den f&uuml;r Ghostscript 6.50 notwendigen Wert von 200000 erh&ouml;hen.
</P>
<P>
 <A HREF="img/gs_fwriter1.png"><IMG SRC="thumb/gs_fwriter1.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Um den Komfort auf die Spitze zu treiben, binden wir nun dieses Skript in
das FinalWriter-Men&uuml; ein. W&auml;hlt dazu in FinalWriter in der Men&uuml;-Zeile
&quot;User/Andere/Voreinsteller...&quot; und klickt im aufpoppenden Fenster unter
&quot;Aktionen&quot; auf &quot;Neu&quot;, anschlie&szlig;end f&uuml;llt ihr das Feld unter &quot;Name des
Men&uuml;punkts&quot; mit einem gew&uuml;nschten Eintrag, wie etwa sinnigerweise &quot;Convert
to PDF&quot;, und stellt den &quot;Befehl/Typ&quot; auf &quot;ARexx-Script&quot;. Mit einem weiteren
Klick auf &quot;Ausw&auml;hlen...&quot; &ouml;ffnet sich ein Datei-Requester, der den Inhalt
des &quot;FWMacros&quot;-Verzeichnisses auflistet. Nachdem das Skript &quot;Convert to
PDF&quot; ausgew&auml;hlt wurde, beendet ihr die Konfiguration mit einem beherzten
Klick auf &quot;Sichern&quot;.
</P>
<P>
 <A HREF="img/gs_fwriter2.png"><IMG SRC="thumb/gs_fwriter2.jpg" WIDTH="114" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Ab sofort wartet die PDF-Ausgabe in FinalWriter unter dem Men&uuml;-Abschnitt
&quot;User&quot; auf ihren Einsatz.
</P>
<P>
 <A HREF="img/gs_fwriter3.png"><IMG SRC="thumb/gs_fwriter3.jpg" WIDTH="67" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Vom eigentlichen Zusammenspiel FinalWriters und Ghostscripts bemerkt der
Anwender nicht sonderlich viel: Ghostscript erledigt seine Konvertierung im
Hintergrund. Lediglich f&uuml;r die Ausgabe der fertigen PDF-Datei will das
Skript von euch einen Dokumentnamen und das Zielverzeichnis.
</P>
<P>
 <A HREF="img/gs_fwriter4.png"><IMG SRC="thumb/gs_fwriter4.jpg" WIDTH="74" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Bei den Tests konnten typische FinalWriter-Dokumente mit unterschiedlichen
Schriftschnitten und reichlich eingebundenem Bildmaterial problemlos
konvertiert werden. Bei der Anzeige der PDF-Dateien stellte sich heraus,
dass &quot;APDF&quot; offensichtlich keinerlei Gefallen an diesen Dokumenten fand und
grunds&auml;tzlich jeden Anzeigeversuch mit einem Absturz quittierte. Schade,
zeigte sich &quot;APDF&quot; doch bisher recht robust beim Umgang mit dem portablen
Dokumentenformat.
</P>
<P>
Ghostscript selbst hatte keine Probleme mit der PDF-Pr&auml;sentation, ebenso
wenig wie der &quot;Acrobat Reader&quot;, &quot;GsView&quot; und &quot;KGhostView&quot; unter Microsoft
Windows und Linux.
</P>
<H3>2. Rasterformate</H3>
<P>
Ghostscript bringt im Schlepptau Treiber f&uuml;r einige Grafikformate mit und
erlaubt so die Konvertierung von PS- und PDF-Dokumenten in diese Formate
und die Ausgabe der Grafikdateien auf ein gew&uuml;nschtes Ger&auml;t. Zu den
unterst&uuml;tzten Formaten z&auml;hlen u.a. TIFF, BMP, PBM, PCX, PNG und JPEG.
Wollt Ihr etwa eine im Verzeichnis &quot;Work:&quot; vorhandene 25-seitige Datei
&quot;test.pdf&quot; Seite f&uuml;r Seite in eines der unterst&uuml;tzten Rasterformate wandeln
und nach &quot;RAM:&quot; ausgeben, lautet die passende Syntax nach dem Setzen des
Stapelspeichers auf den Wert 200000:
</P>
<PRE>
gs -dNOPAUSE -dFIXEDMEDIA -sDEVICE=Bildformat -rWertXxWertY -sOutputFile=RAM:Seite-0%d.Dateiendung Work:Test.pdf
</PRE>
<P>
Mit &quot;-dNOPAUSE&quot; &uuml;berreden wir Ghostscript, bei der Konvertierung alle
Seiten in einem Rutsch ohne explizite Best&auml;tigung durch den Anwender
abzuarbeiten. Der Schalter &quot;-dFIXEMEDIA&quot; veranlasst das Programm, nach der
Initialisierung die Seitengr&ouml;&szlig;e zu fixieren. Wenn es erforderlich sein
sollte, wird Ghostscript Seiten entsprechend drehen und/oder skalieren.
Der Schalter &quot;sDEVICE=&quot; bekommt das entsprechende Bildformat zugewiesen,
mit &quot;-rWertXxWertY&quot; legen wir die gew&uuml;nschte DPI-Aufl&ouml;sung der Ausgabedatei
fest. Wird keine spezielle Aufl&ouml;sung f&uuml;r die Bildformate angegeben, nutzt
Ghostscript die vordefinierten. Bei TIFF w&auml;re es die FAX-Aufl&ouml;sung 204 x
196 DPI, bei JPEG 72 x 72 DPI. Die Ausgabedatei wird durch das
&quot;-sOutputFile&quot;-Argument &quot;RAM:Seite-%02d.Dateiendung&quot;, Seite f&uuml;r Seite ab
Ziffer 01 zweistellig durchnummeriert, mit der gew&uuml;nschten Dateiendung in
der RAM-Disk abgelegt.
</P>
<P>
Soll also unser &quot;Test.pdf&quot;-Dokument im JPEG-Format in der Ausl&ouml;sung 200x200
DPI nach &quot;RAM:&quot; ausgegeben und die Seitenzahl fortlaufend auf zwei Stellen
angegeben werden, geben wir Ghostscript in der Shell die entsprechenden
Anweisungen:
</P>
<PRE>
gs -dNOPAUSE -dFIXEDMEDIA -sDEVICE=jpeg -r200x200 -sOutputFile=RAM:Seite-%02d.jpg Work:Test.pdf
</PRE>
<P>
Je nach Leistungsf&auml;higkeit der CPU im Amiga liegt nach mehr oder weniger
kurzer Zeit das Ergebnis in der RAM-Disk vor.
</P>
<P>
 <A HREF="img/gs_jpegausgabe.png"><IMG SRC="thumb/gs_jpegausgabe.jpg" WIDTH="65" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<H3>3. Mehr Komfort</H3>
<P>
Nach wie vor tummeln wir uns in der Shell, um Ghostscript unsere W&uuml;nsche zu
&uuml;bermitteln. Das klappt nach einer Eingew&ouml;hnungsphase auch ganz gut. Doch
ein wenig mehr Komfort wird wohl niemand verschm&auml;hen. Und mit den zwei
nachfolgend beschriebenen Befehlserweiterungen sollte auch eine komplette
Maussteuerung, etwa per selbsterstelltem Icon, nur noch wenige
Befehlszeilen entfernt sein.
</P>
<P><B>Dateiauswahl-Requester</B></P>
<P>
Bei allen bisherigen Anweisungen haben wir dem Programm die zu
bearbeitenden Dateien in der Kommandozeile &uuml;bergeben. Deutlich bequemer
w&auml;re eine Auswahl &uuml;ber einen Requester. Das haben sich offensichtlich auch
die Ghostscript-Programmierer gedacht und eine solche Option in das
Programm implementiert. Wenn wir aus dem obigen Beispiel die Angabe
&quot;Work:Test.pdf&quot; durch &quot;`RequestFile`&quot; ersetzen, k&ouml;nnen wir zuk&uuml;nftig die
gew&uuml;nschten Dateien per Maus ausw&auml;hlen. Au&szlig;erdem sorgt der Zusatz
&quot;PATTERN &quot;(#?.ps|#?.pdf)&quot;&quot; f&uuml;r mehr &Uuml;bersicht, da er alle Dateien, die
nicht auf &quot;.ps&quot; oder &quot;.pdf&quot; enden, im Requester-Fenster ausblendet.
</P>
<P><B>Ende und Aus</B></P>
<P>
Eine zweite Besonderheit hat bisher unn&ouml;tig viel zus&auml;tzliche Arbeit
erfordert und eine m&ouml;gliche Automatisierung erschwert: Ghostscript meldete
sich nach getaner Arbeit im Interpreter-Modus in der Shell zur&uuml;ck und
musste durch &quot;quit&quot; bzw. &quot;CTRL + C&quot; beendet werden. &Uuml;bergeben wir dem
Programm in der Kommandozeile &quot;-dBATCH&quot;, wird es sich nach Erledigung
seiner Aufgabe selbst&auml;ndig terminieren. Alternativ k&ouml;nnen wir auch an das
Ende der Zeile ein &quot;-c quit&quot; setzen.
</P>
<P>
Abschlie&szlig;end die entsprechend erweiterte Shell-Eingabe des obigen
Beispiels:
</P>
<PRE>
gs -dBATCH -dNOPAUSE -dFIXEDMEDIA -sDEVICE=jpeg -r200x200 -sOutputFile=RAM:Seite-%02d.jpg `RequestFile PATTERN &quot;(#?.ps|#?.pdf)&quot;`
</PRE>
<H3>4. Schluss f&uuml;r heute</H3>
<P>
So, das soll es f&uuml;r diesen Monat gewesen sein. In einer der n&auml;chsten AMIGA-
aktuell-Ausgaben wird Ghostscripts Funktionalit&auml;t beim Ausdruck intensiver
beleuchtet. Den Abschluss soll eine Steuerung des Programms &uuml;ber Icons und
eine (von euch erweiterbare) Mini-GUI bilden.
Bis dann.
</P>
<P>
[1] im Aminet unter <A HREF="http://de.aminet.net/aminetbin/find?gfx+conv+GS650-+.lha">/gfx/conv/GS650-***.lha</A><BR>
[2] im Aminet unter <A HREF="http://de.aminet.net/pub/aminet/util/rexx/Convert_to_PDF.lha">/util/rexx/Convert_to_PDF.lha</A>
</P>
<P><B>Uwe Pannecke &lt;<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
