<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, holy moses,master of disaster,ep">
<title>Holy Moses: Master Of Disaster - EP</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Holy Moses: Master Of Disaster</font></h1><BR> (17:33 / Century Media)</center></P>

<p>Reunions m&#246;gen sich auf den ersten Blick zwar sinnvoll anh&#246;ren, aber wenn man mal bedenkt, wieviele ehemalige richtig gute Bands nach der Reunion nur noch M&#252;ll zusammen bekommen haben (als Pradebeispiel kann man hier wohl Metal Church anf&#252;hren), dann kan man 95 % aller Reunions eigentlich f&#252;r &#252;berfl&#252;ssig erkl&#228;ren. Auch die Trasher von Holy Moses um Sabrina und Andy Classen (letzterer ist aber nur noch im Hintergrund t&#228;tig) meinten, da&#223; eine Reunion sinnvoll sei und somit d&#252;rfen sich jetzt alle Trash Fans &#252;ber die vorliegende EP &quot;Master Of Disaster&quot; freuen. Zumidnest prinzipiell, ist auch diese EP sicherlich kein Paradebeispiel f&#252;r eine wirklich gelungene Reunion. Okay, die f&#252;nf Songs sind richtig heavy ausgefallen, treten m&#228;chtig Arsch und kommen zudem noch amtlich fett r&#252;ber, aber um Glanztaten handelt es sich dabei nun wirklich nicht. Am ehesten kann man die Klamotten noch mit dem zweiten Album &quot;Finished With The Dogs&quot; (1987) vergleichen, wenngleich die neuen Songs qualitativ abfallen und damals wohl eher zu den durchschnittlichen Tracks gez&#228;hlt h&#228;tten. Auch das streckenweise hystersiche Gekreische von Frontfrau Sabrina Classen verspr&#252;ht heutzutage einfach nicht mehr das Charisma der &#228;lteren Platten, die wohl auch wegen des Gesangs heute Kultstatus genie&#223;en. Insgesamt ist &quot;Master Of Disaster&quot; also eher eine absolut durchschnittliche EP geworden, die zum gro&#223;en Teil von dem Namen lebt und in der heutigen Ver&#246;ffentlichungsflut wohl untergehen wird. Ist ohnehin fraglich, wieviele Fans sich eine EP f&#252;r 20 M&#228;rker mit knapp 18 Minuten Spielzeit zulegen werden. Macht pro Minute fast eine Mark und das 
ist &quot;Master Of Disaster&quot; einfach nicht wert....</P>

<p>Fazit: 4 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
