<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,nightwish,over the hills and far away">
<title>Nightwish: Over The Hills And Far Away</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Nightwish: Over The Hills And Far Away</font></h1><BR> (48:51 / Drakkar)</center></P>

<p>Nightwish geh&#246;ren neben HammerFall wohl zu den Entdeckungen der letzten Jahre und ver&#246;ffentlichen mit &quot;Over The Hills And Far Away&quot; nun ein Album bestehend aus Live Tracks, neuen Songs und jeweils einer Coverversion und Neueinspielung. Das ganze h&#246;rt sich zwar zun&#228;chst arg nach Geldmacherrei an, aber ich kann alle Fans schon jetzt beruhigen: &quot;Over The Hills And Far Away&quot; ist ein Album geworden, das den hohen Qualit&#228;ten, die mit dem Namen Nightwish verbunden sind, entsprechend ausgefallen ist. Die Gary Moore Coverversion und gleichzeitiger Opener / Namensgeber &quot;Over The Hills And Far Away&quot; ist einfach nur genial und mitrei&#223;end ausgefallen und geht schon - &#228;hnlich wie das Original - nach dem ersten H&#246;ren nicht mehr aus den Ohren raus. Die bei
den neuen Kompositionen &quot;10th Man Down&quot; (straighter Rocker) und &quot;Away&quot; sind zwar nicht herausragend, aber auch beileibe nicht schlecht, wenngleich ich anmerken muss, da&#223; die Ballade &quot;Away&quot; nicht an das Niveau von anderen Nightwish Balladen heranreicht. Tja, und dann w&#228;re 
da noch die Neueinspielung von &quot;Astral Romance&quot;, welches im Original auf dem `97er Debutalbum &quot;Angels Fall First&quot; zu finden war, der in der aktuellen Version - auch bedingt durch die verbesserte Produktion - weitaus besser zu gefallen wei&#223;, als das Original. Abgerundet wird das ganze dann noch von 6
Live Tracks von den letzten beiden Alben &quot;Wishmaster&quot; und &quot;Oceanborn&quot;, die ohnehin zu &#252;berzeugen wissen und soundtechnisch auch oberamtlich daherkommen - letzteres mag daran liegen, da&#223; selbige Tracks auch auf der neuen DVD &quot;From Wishes To Eternity&quot; zu finden sind und gerade deswegen h&#246;chsten Anspr&#252;chen gen&#252;gen m&#252;ssen. F&#252;r Fans der Band ist diese Scheibe also eine ganz tolle Sache, die die Wartezeit bis zum n&#228;chsten regul&#228;ren Studioalbum angenehm verk&#252;rzt. Neueinsteiger sollten aber eher mit dem f&#252;r meinen Geschmack st&#228;rksten Nightwish Album &quot;Oceanborn&quot; anfangen und sich dann bei Gefallen &quot;Wishmaster&quot; sowie diese Compilation zulegen. Trotzdem eine ohne Frage gute Platte, in die man als Nightwish Fan ohne zu 
z&#246;gern sein Geld investieren kann.</P>

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
