<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,steel attack,fall into madness">
<title>Steel Attack: Fall Into Madness</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Steel Attack: Fall Into Madness</font></h1><BR> (45:49 / AFM)</center></P>

<p>Ein Gl&#252;ck, da&#223; der ziemlich billige Bandname (und das noch billigere Logo!) zwar R&#252;ckschl&#252;sse &#252;ber die musikalische Ausrichtung, aber keine &#252;ber die Qualit&#228;ten dieser Band zul&#228;sst - denn die Band hat bei weitem mehr drauf, als man auf den ersten Blick vermuten mag. Okay, nicht jeder d&#252;rfte heutzutage Luftspr&#252;nge machen, wenn er eine weitere Band h&#246;rt, die sich dem melodischen Power Metal der Marke old-Helloween verschrieben hat, aber Steel Attack sind dann doch besser, als viele ihrer Mitstreiter. Die neun Tracks brezeln ziemlich ordentlich rein, egal ob es sich um stampfenden Nummern der Marke &quot;The Beast&quot; und &quot;Holy Swordsmen&quot; oder speedigere Tracks wie etwa den Opener &quot;Fall Into Madness&quot;, &quot;Guardians&quot; (kein Helloween Cover!) oder das f&#252;r meinen Geschmak st&#228;rkste St&#252;ck &quot;Clearing The Mind&quot; handelt. War der Vorg&#228;nger &quot;Where Mankind Falls&quot; noch etwas blutleer und zu durchschnittlich ausgefallen, haben Steel Attack am Songwriting gearbeitet und pr&#228;sentieren uns einen Longplayer, der nicht nur vor Spielfreude so strotzt, sondern auch richtig begeistern kann. Originalit&#228;t kann und darf man hier zwar nicht erwarten - Helloween sind hier nat&#252;rlich allgegenw&#228;rtig und auch Stratovarius, Gamma Ray und HammerFall Trademarks schimmern an jeder Ecke durch -, aber selbst das grandiose HammerFall Debut &quot;Glory To The Brave&quot; (1997), welches man mitlerweile wohl zu den Meilensteinen der `90er Jahre z&#228;hlen darf, konnte auch &quot;nur&quot; damit gl&#228;nzen, alte Sounds in ein modernes Gewand zu packen. Insofern kann fehlende Originalit&#228;t keine wirklich gro&#223;e Kritik an diesem Album sein, welches einfach nur Spa&#223; vermitteln will und dies auch ohne Probleme schafft. Wer also auf Ohrwurmdurchsetzten melodischen Power Metal steht und die &quot;Keeper...&quot; Alben von Helloween nur auf Knien aus dem Schrank holt, um diese zum x-ten male zu h&#246;ren, der wird auch &quot;Fall Into Madness&quot; schon nach dem ersten Durchlauf m&#246;gen. Gef&#228;llt mir auf jeden Fall besser, als so manch andere Band, die sich lieber &quot;weiterentwickelt&quot; hat und dabei nur noch gequirlte Kacke von sich gibt. Klare Kaufempfehlung!</P>

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
