<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,voice,golden signs">
<title>Voice: Golden Signs</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Voice: Golden Signs</font></h1><BR> (59:42 / AFM)</center></P>

<p>Waren schon die beiden Vorg&#228;nger &quot;Prediction&quot; (welches zun&#228;chst nur als Eigenpressung ver&#246;ffentlicht wurde und mitlerweile via AFM Records rereleast wurde) sowie &quot;Trapped In Anguish&quot; beileibe nicht von Pappe, so haben Voice nun mit &quot;Golden Signs&quot; ihr wohl bisher ausgereiftestes Werk vorgelegt. Stilistisch bewegt man sich nach wie vor im melodischen Power Metal Sound und lockert diesen zudem mit starken Bombast Elementen sowie vereinzelten progressiven Parts amtlich auf, so da&#223; hier nicht permanent Vergleiche mit HammerFall &amp; Co. aufkommen, sondern man der Band auch soetwas wie Eigenst&#228;ndigkeit attestieren kann. Schon der Opener &quot;Golden Signs&quot; fegt mit seinem mitrei&#223;enden Ohrwurm Chorus alles weg und auch die beiden nachfolgenden Tracks, die jeweils eine Spielzeit von &#252;ber 6 Minuten haben und somit ordentlich Platz f&#252;r ausgedehnte Soli und progressive Elemente bieten, &quot;Days Of Trust&quot; und &quot;On My Way&quot; (hier kann man latente Stratovarius Einfl&#252;sse ausmachen) wissen zu gefallen. Dazu gibt es mit &quot;The Last Dance&quot; auch noch eine nette Ballade sowie mit der Neueinspielung von &quot;The Prediction&quot; auch noch ein kleines Bonbon f&#252;r alle &#228;teren Fans der Band, wobei hier die progressiven Elemente etwas st&#228;rker zum Zuge kommen und diesen Track somit etwas herausragen lassen, was aber keineswegs negativ gemeint ist - vielmehr geh&#246;rt &quot;The Prediction&quot; zu einem der st&#228;rksten St&#252;cke auf dieser abwechselungsreichen Platte, die &#252;brigens von Stefan Schwarzmann (Accept / U.D.O., Running Wild) an den Drums eingezimmert wurde. Das ganze ist zudem amtlich und fett produziert, so da&#223; Power Metal Fans hier eigentlich auf ihre vollen Kosten kommen sollten. Abz&#252;ge gibt es lediglich f&#252;r das etwas schw&#228;chere &quot;The Last Dance&quot; sowie das zu platte &quot;Deadly Embrace&quot;, wobei diese den positiven Gesamteindruck von &quot;Golden Signs&quot; auch nur unwesentlich schm&#228;lern k&#246;nnen. Eine ohne Frage starke Platte, die man nicht links liegen lassen sollte!</P>

<p>Fazit: 8 von 10 Punkten</P> 
<center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
