<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,festivalbericht,bang your head,byh">
<title>Festivalbericht: Bang Your Head Festival 2001</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><center><h1><font color="yellow">Festivalbericht: Bang Your Head Festival 2001</Font></center></h1></P>

<p>Nachdem die diesj&#228;hrige Hard Union mit dem With Full Force Festival etwas alternativer und moderner eingeleutet wurde, stand auf dem diesj&#228;hrigen Bang Your Head gr&#246;&#223;tenteils wieder der klassische Heavy Metal auf dem Programm (siehe unten). Mal abgesehen von dem tollen Billing, das die Veranstalter auf die Beine gestellt haben, kann man den Jungs vom Heavy oder Was?!? Magazin, die das Bang Your Head organisiert haben, auch in allen anderen Bereichen gratulieren: Die Organisation war spitzenm&#228;&#223;ig, was nicht nur an dem obermatlichen Sound, den freundlichen Mitarbeitern sondern an der ganzen positiven (gibt es davon eine Steigerung?) Stimmung auf dem Festivagel&#228;nde deultich wurde. Ich habe auf jeden Fall nur strahlende Gesichter gesehen und ich stelle einfach mal die These auf, da&#223; es das Wacken Open Air in diesem Jahr schwer haben wird dagegen anzukommen. Mein Kompliment an die Veranstalter- ich freue mich schon auf n&#228;chstes Jahr!</P>

<p><u>Freitag (29.6.01)</U></p>
<p>Zwar wurde das Festival schon am 28.6. mit einem Club Gig eingeleitet, den ich aber leider aus zeitlichen Gr&#252;nden nicht besuchen konnte. Ebenso war es mir aus zeitlichen Gr&#252;nden auch nicht m&#246;glich alle Bands auf dem BYH anzuschauen, so da&#223; ich im folgenden nur meine Impressionen zu den gesehenen Bands loswerden werde.</P>

<p>F&#252;r mich begann das Festival mit den Schwaben <b>Brainstorm</B>, die bisher drei starke Longplayer rausgehauen haben, aber noch nicht die Aktzeptanz bekommen, die sie eigentlich verdient h&#228;tten. V&#246;llig unverst&#228;ndlich, denn auch Live macht die Band mit Ausnahmes&#228;nger Andy B. Franck, der zudem noch bei seiner eigenen Band Symphorce t&#228;tig ist, eine excellente Figur und agierte am fr&#252;hen Freitag morgen &#228;u&#223;erst aktiv und konnte dem schon wachen Publikum ordentlich einheizen, was nat&#252;rlich nicht nur an der guten Leistung der Band, sondern auch am gespielten Material lag. Neben Knallern vom aktuellen Output wie etwa &quot;Crush Depth&quot;, &quot;Tear Down The Walls&quot; und &quot;Demonsion&quot; gab es mit &quot;Holy War&quot; (vom `98er Album &quot;Unholy&quot;) und &quot;King Of Fools&quot; (vom Debutalbum &quot;Hungry&quot;) sogar noch zwei &#228;ltere H&#228;mmer, die auch beim Publikum super ankamen. Desweiteren kredenzten uns die Jungs noch einen neuen Song, der auch ordentlich reinbrezelte und einen Vorgeschmack auf das bald erscheinende vierte Album bot. Brainstorm waren f&#252;r mich auf jeden Fall ein fr&#252;hes Highlight auf diesem Festival und konnten sich die Symptahie der Fans erspielen, wenngleich eine etwas l&#228;ngere Spielzeit angebracht gewesen w&#228;re. Daumen ganz steil nach oben!</P>

<p>Es folgten die Amis <b>Kamelot</B>, die ihr kommerziell erfolgreichstes Album  &quot;Karma&quot; gerade ver&#246;ffentlicht haben. Live gefiel mir die Band eigentlich auch ganz gut, auch wenn S&#228;nger Khan auf Platte einfach besser r&#252;berkommt und eine zweite Gitarre den Jungs auch nicht schlecht zu Gesicht gestanden h&#228;tte. Anyway, Kamelot waren trotzdem ziemlich gut und pr&#228;sentierten neben neuem Material (&quot;Forever&quot;, &quot;The Spell&quot;, &quot;The Light I Shine On You&quot; und &quot;Wings Of Despair&quot;) auch &#228;ltere Klamotten von &quot;Fourth Legacy&quot; oder &quot;Siege Perilious&quot;, die ebenfalls ziemlich gut ankamen und den zahlreichen Kamelot Fans offensichtlich gefielen. Auch hier gilt &#228;hnliches wie f&#252;r Brainstorm: Trotz starken Alben ist auch diese Band bisher stark unterbewertet geblieben, was angesichts des musikalischen Potentials eigentlich schade ist. Couragierte Leistung der Band!</P>

<p><b>Kreator</B> geh&#246;rten auf dem BYH Festival sicherlich zu der h&#228;rteren Fraktion und konnten vielleicht gerade deswegen zahlreiche Fans vor der B&#252;hne begr&#252;&#223;en. Live macht die Band auch heute noch ein gutes Gesicht, auch wenn man sich mit den letzten Alben ein wenig weiterentwickelt hatte, was zwar nicht jedem Fans gefiel, aber von der Band trotzdem durchgezogen wurde. Trotzdem spielte man auf dem BYH viele alte Klassiker, die vom Publikum euphorisch aufgenommen wurden. Auch B&#252;hnentechnisch pr&#228;sentierte sich die Band in Topform und spr&#252;hte sogar merhfach orangenen Trockeneisnebel ins Publikum. Auch wenn ich nicht der gro&#223;e Kreator Fans bin, so konnte mich das Auftreten der Band dennoch &#252;berzeugen.</P> 

<p>Von den nachfolgenden Bands wie Rose Tattoo und Armored Saint bekam ich nur br&#252;ckst&#252;ckhaft etwas mit, weil ich mich erst wieder zur Rock Legende <b>Uriah Heep</B> eingeklinkt habe. Diese Band durfte man einfach nicht verpassen und es war schon erstaunlich, was die Band in Balingen mit ihrem Hard Rock rei&#223;en konnte. Hymnen wie &quot;Return To Fanatsy&quot; oder &quot;Look At Yourself&quot; sind einfach auch nach 20 Jhren noch unsterblich und auch das neue Material wurde oberamtlich runtergezockt. Was aber viel begeisternder war, war die Tatsache, da&#223; Uriah Heep absolut sympathisch r&#252;berkamen, wobei insbesondere Gitarrist Mich Box einem dauergrinsenden Honigkuchenpferd ziemlich nahe kam und haufenweise Charisma verspr&#252;hte. Auch S&#228;nger Bernie Shaw war ziemlich aktiv und suchte permanent den Kontak mit den Fans. Also ganz ehrlich: Von der engagierten Leistung dieser beileibe nicht jungen Rock Ikonen k&#246;nnten sich andere Bands eine ganze Scheibe abschneiden und somit geh&#246;ren auch Uriah Heep zu den vielen Highlights auf diesem Festival. Keep on rockin`!</P>

<p>Es folgte der Auftritt, auf den ich mich pers&#246;nlich zwar am meisten gefreut hatte, aber vor dem ich auch ein wenig Angst hatte - die Rede ist nat&#252;rlich von <b>Savatage</B> im neuen Line-up. Und was soll ich sagen? Meine &#196;ngste bez&#252;glich des neuen Line-up`s waren absolut unbegr&#252;ndet: Neu S&#228;nger Damond Jiniya und Neu Gitarrist Jack Frost haben sich optimal in das Line-up integriert und f&#252;r mich wurde der einst&#252;ndige Savatage Gig zum geilsten auf diesem Festival. S&#228;nger Damond Jiniya stand nat&#252;rlich im Mittelpunkt meiner Aufmerksamkeit und der Junge hat echt einiges auf dem Kasten und es gab wohl keinen, der sich seinen ebenfalls b&#228;renstarken Vorg&#228;nger Zak Stevens zur&#252;ckw&#252;nschte. Selbst schwierige Passagen meisterte er absolut souver&#228;n und zudem rastete er auf der B&#252;hne f&#246;rmlich aus und suchte obendrein noch den Kontak zu den Fans, die ihn ab der ersten Sekunde auf diesem Gig aktzeptierten. Die einst&#252;ndige Spielzeit war nat&#252;rlich viel zu kurz f&#252;r Savatage, aber es reichte, einige der zahlreichen Highlights der Bandgeschichte unterzubringen: &quot;Edge Of Thorns&quot;, &quot;Strange Wings&quot;, &quot;Surrender&quot;, &quot;Awaken&quot;, &quot;Sirens&quot;, &quot;The Wake Of Magellan&quot;, &quot;Chance&quot; (mit dem mehrstimmigen Part am Ende, den die Band perfekt hinbekam), &quot;Gutter Ballet&quot;, &quot;Hall Of The Mountain King&quot; und &quot;Believe&quot; (die G&#246;ttergabe &#252;berhaupt!!), um nur einige zu nennen. Bei den &#228;lteren Sachen - die insbesondere am Anfang des Set`s auftauchten - &#252;bernahm Jon &quot;Mountain King&quot; Olivia die Vocals, auch wenn man deutlich merkte, da&#223; er bei weitem nicht &#252;ber das Stimmvolumen wie auf &#228;lteren Savatage Alben bzw. dem legend&#228;ren Doctor Butcher Sideprojekt verf&#252;gt. Hier sollte man evtl. &#252;berlegen, Damond Jiniya alles &#252;bernehmen zu lassen. Der Rest der Band war nat&#252;rlich wie &#252;blich in bester Spiellaune und Gitarrist Chris Caffery zauberte zusammen mit Jack Frost, der ebenfalls gut in`s neue Line-up zu passen scheint, wieder viele messerscharfe Riffs hervor. Meiner Meinung nach ist das neue Line-up keinen Deut schlechter als die &#228;lteren Besetzungen und somit kann man davon ausgehen, da&#223; Savatage auch in Zukunft noch eine ganze Menge rei&#223;en k&#246;nnen - f&#252;r mich die beste Show auf dem Festival, auch wenn Pyros etc. fehlten.</P>

<p>Und danch waren dann die Britischen Kult Rocker von <b>Judas Priest</B> an der Reihe, die am ersten Tag die Position des Headliners inne hatten. Und schlecht war der Gig von Judas Priest nun wirklich nicht, auch wenn mir pers&#246;nlich einige optische Effekte ganz gut gepasst h&#228;tten. Na ja, die Setlist war nat&#252;rlich stark von Klassikern durchsetzt, was auch gut so ist, sind sowohl das letzte Album &quot;Jugulator&quot; als auch das aktuelle Werk &quot;Demolition&quot; doch eher Durchschnittsware, die auch in zehn Jahren wohl keinen Kultstatus inne haben werden. Vom neuen Album kamen lediglich die beiden Nummern &quot;Machine Man&quot; und &quot;One On One&quot; zum Zuge, was Platz f&#252;r einige der zahlreichen Klassiker machte: &quot;Metal Gods&quot;, &quot;Victim Of Changes&quot; (G&#228;nsehautatmosph&#228;re mit Ripper Owens am Mikro!), &quot;Electric Eye&quot;, &quot;Grinder&quot;, &quot;Blood Stained&quot;, &quot;Touch Of Evil&quot;, &quot;Painkiller&quot;, &quot;Diamonds And Rust&quot;, &quot;Breaking The Law&quot;, &quot;Living After Midnight&quot;, &quot;Hell Bent For Leather&quot; und &quot;The Green Manalish&quot;  um nur einige zu nennen. Die Performance der Band war auch okay, auch wenn ich im direkten Vergleich mit Savatage sagen muss, da&#223; Judas Priest klar abfielen. Sicherlich, Ripper Owens macht seine Sache sehr ordentlich und hat l&#228;ngst seine eigene Identit&#228;t gefunden, aber insgesamt war der Gig von Judas Priest einfach zu durchschnittlich - &#220;berraschungen fehlten genauso wie irgendwelche Show Einlagen oder mitrei&#223;ende Reden a la Bruce Dickinson von Iron Maiden. So bleibt f&#252;r mich ein eher geteilter Eindruck zur&#252;ck: Die Setlist war ganz okay (ich h&#228;tte mir zwar noch einige Painkiller Klamottenn sowie &quot;Screaming For Vengeance&quot; gew&#252;nscht, aber das ist halt bei der beschr&#228;nkten Spielzeit nicht mehr drin gewesen), aber ansonsten fehlte es an Abwechselung. Kult hin oder her: Etwas entt&#228;uscht war ich dann doch schon von Judas Priest, zumal man als Headliner doch etwas mehr bringen kann....</P>

<p><u>Samstag (30.6.01)</U></p>

<p>F&#252;r mich pers&#246;nlich waren <b>Squealer</B> die erste interessante Band an diesem sonnigen Samstag (auch wenn der Freitag sonnentechnisch noch extremer war und mir einen fetten Sonnenbrand einbrockte...) und wie schon vom letztj&#228;hrigen Wacken Open Air bzw. vom Westfalenfestival gewohnt, legte die Truppe um AFM Labelboss Andy Allend&#246;rfer auch an diesem fr&#252;hen morgen wieder eine hammergeile und routinierte Show hin, die von dem Doppel &quot;End Of The World&quot; und &quot;The Final Daylight&quot; eingeleitet wurde. Mit von der Partie war auch erneut der zweite S&#228;nger und so kamen die Passagen, die z.T. abwechselnd intoniert wurden, noch wesentlich geiler r&#252;ber - Live Feeling war hier einfach angesagt. Daf&#252;r fehlte Drummer Mike Terrana, der einige Stunden sp&#228;ter noch mit
Axel Rudi Pell auf die B&#252;hne musste, aber dieser wurde mehr als souver&#228;n von Edguy Schlagzeuger Felix Bohmke ersetzt. Aber zur&#252;ck zu Squealer: Es folgten mit &quot;Free Your Mind&quot; und &quot;Nothing To Believe&quot; noch zwei weitere Kracher im Set vom nach wie vor aktuellen Album &quot;Made For Eternity&quot;, ehe es mit &quot;Wrong Time, Wrong Place&quot; noch eine &#228;ltere Numemr vom gleichnamigen, etwas trashigeren Longplayer gab. Die &quot;The Prophecy&quot; Klamotten in Form von &quot;Friends For Life&quot; und &quot;Nowhere To Hide&quot; durften nat&#252;rlich auch nicht fehlen. Unterbrochen wurde das ganze immer wieder von recht am&#252;santen Ansagen von Andy Allend&#246;rfer, der es damit schaffte, die Fans ohne Probleme auf seine Seite zu ziehen. Auch wenn man es auf den ersten Blick nicht glaubt: Dieser Mann strahlt Charisma pur aus! Den Abschluss des Squealer Set`s bildete dann die Depeche Mode Coverversion &quot;Enjoy The Silence&quot;, die auch gut beim Publikum ankam. Wenn das n&#228;chste Album wieder ein Kracher vom Kaliber des 2000er Werks &quot;Made For Eternity&quot; wird, dann d&#252;rfen Squealer n&#228;chstes Jahr vielleicht auch mal etwas sp&#228;ter auf einem Festival ran - verdient h&#228;tten sie es auf jeden Fall.</P>

<p>An <b>Anvil</B> scheiden sich ganz offensichtlich die Geister: Die einen m&#246;gen die simpel konstruierten und mitrei&#223;enden Metal Songs, den anderen ist das zu langweilig und nicht interessant genug. Ich z&#228;hle mich da mehr zu ersten Fraktion und konnte so den Gig der Kanadier um Frontmann Lipps wirklich genie&#223;en. Aussergew&#246;hnlich war dieser zwar beileibe nicht, aber Hymnen wie &quot;Metal On Metal&quot; werden wohl auch noch in 50 Jahren Kultcharakter haben. Auch das neue Material vom Kaliber eines &quot;Plenty Of Power&quot; oder &quot;Computer Down&quot; brezelte ordentlich rein, so da&#223; man den Jungs durchaus einen guten Gig attestieren konnte - Spa&#223; hat es auf jeden Fall gemacht und S&#228;nger / Gitarrist Lipps suchte immer wieder den Kontakt mit den Fans, was ihm zus&#228;tzliche Sympathien einbrachte. Abz&#252;ge gibt`s lediglich f&#252;r das belanglose jammen sowie den halbherzigen Versuch eines Drumsolos. Ich habe zwar gegen beides nichts, aber wenn man soetwas macht, sollte es zumidnest gehaltvoll genug sein, was es im Fall von Anvil leider nicht war. War 
trotzdem eine coole und kurzweilige dreiviertelstunde!</P>

<p>Mit <b>Six Feet Under</B> trat schlie&#223;lich die wohl extremste Band an diesen zwei Tagen auf. Und um ehrlich zu sein: Ich bin eigentlich kein Fan dieser Musik und habe mir den Gig auch nur deshalb angeguckt, weil ich gehofft habe, da&#223; die Death Metaller zumindest einige Covervserionen ihres Coveralbums &quot;Graveyard Classics&quot; spielen werden. Dem war leider nicht so und aus diesem einfachen Grund konnte ich auch eher wenig mit den Songs dieser Combo anfangen. Den zahlreichen Supportern schien das aber reichlich egal zu sein und es kam direkt vor der B&#252;hne zu richtig guter Stimmung. Mir waren die Songs auf jeden Fall zu brutal und so war ich auch froh, als es wieder vorbei war. Sorry, ist aber nunmal nicht meine Mukke...</P>

<p>Als n&#228;chstes standen <b>Axel Rudi Pell</B> auf dem Programm, auf die ich mich - trotz der Tatsache, da&#223; die ich die Band erst vor wenigen Wochen auf der regul&#228;ren Tour gesehen hatte - auch freute. Zwar gab es nur ein kalorienreduziertes Programm der Tour, aber es machte trotzdem jede Menge Spa&#223; sich diese &quot;Soloband mit erstklassigen Gastmusikern&quot; anzuschauen. S&#228;nger Johnny Gioeli machte zwar wieder einen arg &#252;bermotivierten Eindruck und traf f&#252;r meinen Geschmack auch nicht jede Nuance perfekt, gab aber auch einen erstklassigen Entertainer auf der B&#252;hne ab. Am musikalischen K&#246;nnen der Jungs darf nat&#252;rlich ebenfalls nicht gezweifelt werden (insbesondere die Keyboard Duelle zwischen Ferdy Doernberg und Gitarrero Axel Rudi Pell sind immer wieder am&#252;sant mit anzuschauen) und die Setlist war nat&#252;rlich auch okay, auch wenn einige der &#252;berlangen Songs zwangsweise zu Medley`s zusammengefasst werden mussten: &quot;Tear Down The Walls&quot;, &quot;Warrior&quot;, &quot;Fool Fool&quot;, &quot;The Masquerade Ball&quot;, &quot;Casbah&quot; (mit langem Mitsing- und Frickelpart) und &quot;Carousel&quot; sind nur einige der Highlight`s im Set. Und als finalen Rausschmei&#223;er gab es erwartunsggem&#228;&#223; mal wieder &quot;Call Her Princess&quot;, der seine Funktion auch heute noch blendend erf&#252;llt. Nicht zu vergessen sind da nt&#252;rlich die zahlreichen Klassiker aus dem Rock Bereich, die der gute Axel w&#228;hrend seiner Soli zumindest anspielte (Deep Purple / Led Zeppelin etc.) und die den Songs Live immer wieder Abwechselung zu gute kommen lassen. Auch hier gilt nat&#252;rlich: Daumen hoch!</P>

<p>Auf <b>Stratovarius</B> waren die Fans nat&#252;rlich auch gespannt, ist es doch der einzigste Live Gig der Jungs in diesem Jahr. Bie dieser Show lag das Augenmerk wohl ganz eindeutig auf dem Funkfaktor, denn trotz einiger technischen Probleme und einiger Spielfehler (insbesondere Gitarrist Timo Tolkki schien keinen guten Tag erwischt zu haben) war die Stimmung am absoluten Sidepunkt, was wohl auch der ausgekl&#252;gelten Setlist anzurechnen ist: Neben Klassikern wie &quot;Black Diamond&quot;, &quot;Kiss Of Judas&quot;, &quot;Father Time&quot; und &quot;Forever&quot;, die die Band einfach spielen musste, kamen mit &quot;Phoenix&quot; und dem schon jetzt nicht mehr aus dem Programm wegzudenkenenden &quot;Hunting High And Low&quot; auch zwei Tracks von &quot;Infinity&quot; Album zum Zuge. Und da gerade die Compilation &quot;Intermission&quot; herausgekommen ist, wurden auch davon mit &quot;Why Are We Here&quot; und &quot;Will My Soul Ever Rest In Peace&quot; zwei Tracks gespielt. Zudem hatte die Band mit dem Track &quot;Dreamspace&quot; noch ein handfestes Highlight auf Lager, welches lange nicht mehr Live zum besten gegeben wurde und mit dem ich pers&#246;nlich nun gar nicht gerechnet h&#228;tte. &#220;ber &quot;Hold On To Your Dream&quot; vom selben Album h&#228;tte ich mich zwar noch mehr gefreut (dieser Song ist einfach g&#246;ttlich!), aber auch &quot;Dreamspace&quot; machte m&#228;chtig etwas her. Zudem hatten Stratovarius f&#252;r reichlich optische Gimmicks wie Pyros etc. gesorgt, die die B&#252;hnenshow optimal abrundeten - und diesesmal wusste sogar S&#228;nger Timo Kotipelto wann die Pyros hochgingen ! Trotz der kleineren oben erw&#228;hnten Defizite geh&#246;rte auch der Stratovarius Gig klar zu den Highlight`s und die Band hat sich ihre zweij&#228;hrige Pause redlich verdient. Hut ab!</P>

<p>Es folgte noch der Twisted Sister lastige Gig von <b>.Dee Snider</B>, der im wesentlichen alte Twisted Sister Klamotten auf die Fans lo&#223;lies und dessen Gig von einem fulminanten Abschlussfeuerwerk beendet wurde - es war &#252;brigesn der einzigste Gig an diesen zwei Tagen, an dem es geregnet hatte! Sorry, aber mehr habe ich leider nicht mehr mitbekommen....</P>

<p>Das waren sie schon - meine Eindr&#252;cke des Bang Your Head Festivals 2001 ! Mir hat das ganze auf jeden Fall tierisch Spass gemacht und ich werde wohl auch im n&#228;chsten Jahr wieder mit von der Partie sein. Absolut g&#246;ttliches Wochenende!!</P>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
