<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Vorwort</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><b>Hi out there!</B><br>
Ach ist das herrlich. Da bin ich gestern vom Bang Your Head Festival wiedergekommen und es war ein Volltreffer - einen Bericht dar&#252;ber gibt es nat&#252;rlich in dieser Ausgabe der Metal Corner. Ich will Euch auch jetzt gar nicht erz&#228;hlen wie toll all die Bands waren, denn es geht mir um einen ganz anderen Aspekt: Den Zusammehalt in der Metal Comminty. Mal ganz im Ersnat: Auch wenn man all die Leute dort nicht kannte (und die Eltern der j&#252;ngeren Besucher wohl auch einen Schock ob soviel Langhaariger gekriegt h&#228;tten), so lag man mit diesen doch auf einer Wellenl&#228;nge und auch Hilfsbereitschaft wurde gro&#223; geschrieben. Richtig G&#228;nsehautatmosph&#228;re kam allerdings bei der Aftershow Party im Zelt auf, wo die Fans noch bis in den fr&#252;hen morgen feierten und mitsangen - insbesondere Maiden`s &quot;Fear Of The Dark&quot; lie&#223; mir doch einen kalten Schauer &#252;ber den R&#252;cken laufen, als alle Fans sich gl&#252;cklich in den Armen lagen und lautstark mitbr&#252;llten. Die Szene ist also allen Unkenrufen zum trotz nach wie vor absolut lebendig und wer das Gegenteil behauptet, der l&#252;gt ganz einfach oder war nicht beim Bang Your Head. Worauf ich hinaus will: Bei welcher anderen Muskrichtung gibt es soetwas noch? Irgendwie sind wir alle doch etwas einzigartiges und das ist auch gut so - solange diese Atmosph&#228;re noch existiert, solange wird auch noch Heavy Metal existieren. Ich f&#252;r meinen Teil freue mich schon in Wacken auf &#228;hnliche Erlebnisse, sind es doch manchmal die kleinen Dinge im Leben, die einem Spa&#223; machen. Stay heavy,</P>

<p>Kilian <blink>&quot;The Bruce&quot;</blink> Servais</P>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
