<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="MMI">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Haastattelussa amigisteja Euroopasta</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Sakussa #31 (1/2000) julkaistiin Litti-lempinimell&auml; #amigafin-IRC-kanavalla py&ouml;rineen espanjalaisen amigistin, David Gonz&aacute;lez Barrag&aacute;nin haastattelu. Ajan my&ouml;t&auml; mieless&auml; muhi ajatus haastattelujen laajentamisesta. Miksip&auml; emme kyselisi muiltakin amigisteilta, millainen historia heill&auml; on takanaan ja millainen tilanne Amigalla t&auml;ll&auml; hetkell&auml; on heid&auml;n kotimaassaan? Tuumasta toimeen. Haastateltavat on napattu suurimmaksi osaksi IRCnetin #amiga-IRC-kanavalta ja haastattelut toteutettiin joko s&auml;hk&ouml;postitse tai IRC:n v&auml;lityksell&auml;.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Haastatteluun saatiin nelj&auml; henkil&ouml;&auml;:&nbsp;Jaro Puolasta, Christian Johansson Ruotsista, Michal Bergseth Norjasta sek&auml; Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vuosikokouksessakin vieraillut Jarle Eidet, Norjasta Suomeen muuttanut amigisti.
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">1. Kertoisitko v&auml;h&auml;n perheest&auml;si ja taustastasi. Mik&auml; on oikea nimesi, kuinka vanha olet ja miss&auml; asut?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Olen Jaro, 19 vuotta ja asun Puolassa Bytom-nimisess&auml; kaupungissa.</p>
						<p><b>Christian: </b>Olen Christian Johansson ja olen kotoisin pienest&auml; paikasta nimelt&auml; Forsvik. Nykyisin asun G&auml;vless&auml;.</p>
						<p><b>Michal: </b>Olen Michal Bergseth, ik&auml;&auml; 21 vuotta. Asun Oslossa, mutta juuri t&auml;ll&auml; hetkell&auml; k&auml;yn koulua Lofthusissa.</p>
						<p><b>Jarle:</b> Olen Jarle Eidet ja synnyin Norjassa 1972. Asuin ja ty&ouml;skentelin siell&auml;, kunnes tapasin suomalaisen Mirjan, joka on tietokoneoperaattori. Vakavat suhteet puhelimitse ovat hankalia, joten muutin Vantaalle Mirjan luokse. H&auml;nell&auml; on aiemmasta avioliitosta poika, joka pelailee paljon PC:ll&auml; ja Playstationilla. Olen kihloissa Mirjan kanssa, ja tarkoitus on menn&auml; naimisiin jossain vaiheessa. Norjassa minulla on sisko ja veli sek&auml; vanhemmat. Veljeni on my&ouml;s amigisti.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">2. Opiskeletko vai onko sinulla ty&ouml;paikka?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Opiskelen elektroniikkaa.</p>
						<p><b>Christian: </b>T&auml;ll&auml; hetkell&auml; ty&ouml;skentelen koulun atk-helpdeskiss&auml;, mutta suunnittelen opiskelujen jatkamista t&auml;n&auml; vuonna.</p>
						<p><b>Michal: </b>T&auml;ll&auml; hetkell&auml; olen kokop&auml;iv&auml;toiminen opiskelija. Kes&auml;st&auml; l&auml;htien opiskelen ohjelmointia ja web-suunnittelua. Olen ollut monessa ty&ouml;paikassa, joista paras oli ehk&auml; <a href="http://www.mmi.no/" target="_blank">MMI</a>:ll&auml; Oslossa. Tulevaisuudestani opintojen j&auml;lkeen en ole viel&auml; varma.</p>
						<p><b>Jarle:</b> Norjassa ty&ouml;skentelin Norjan hallituksen omistamassa kalanviljelyn tutkimuslaitoksessa lohen ja ruijanpallaksen parissa... T&auml;ll&auml; hetkell&auml; olen ty&ouml;t&ouml;n ja etsin ty&ouml;t&auml; Suomesta. Tietokoneala olisi kiva.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">3. Milloin ja miten sinusta tuli amigisti?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Ensimm&auml;inen Amigani oli A600 kolme vuotta sitten. Amiga on mielest&auml;ni paras tietokone, siin&auml; on hyv&auml;t &auml;&auml;net ja grafiikka ja sit&auml; on helppo k&auml;ytt&auml;&auml;.</p>
						<p><b>Christian: </b>Aloitin VIC-20:ll&auml; ja siirryin siit&auml; Commodore 64:&auml;&auml;n, joten Amiga oli luonnollinen valinta.</p>
						<p><b>Michal: </b>Vuonna 1988, jolloin sain Amiga 500:n ja se vei minut menness&auml;&auml;n. Pidin pelien pelaamisesta ja DeluxePaintilla piirt&auml;misest&auml;.</p>
						<p><b>Jarle:</b> K&auml;ytin Commodore 64:&auml;&auml; vuodesta 1986, ja ensimm&auml;isen Amiga 500 -esittelyvideon n&auml;hty&auml;ni tiesin, ett&auml; Amiga oli minua varten. Pikkuveljeni aloitti A500:lla vuonna 1990, ja k&auml;ytin sit&auml; konetta paljon! Ensimm&auml;inen Amigani oli A600 vuonna 1993, ja kaverini lainasi minulle modeemiaan viikonlopuksi. Silloin sain ensimm&auml;iset BBS-kokemukseni. Vuotta my&ouml;hemmin minulla oli A1200, jossa oli Blizzard 040+SCSI, Infinitiv-torni, Zorro II -v&auml;yl&auml;kortti, USR Courier -modeemi, 32 Mt muistia, 1,2 Gt SCSI-kiintolevy ja Microvitecin 14&quot; monitori. Lis&auml;ksi olen ostanut ja myynyt paljon Amigoita kavereille, enimm&auml;kseen A2000/3000/1200-koneita, ja auttanut heit&auml; softa- ja kovoasennuksissa.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">4. Mik&auml; on nykyinen Amiga-kokoonpanosi?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>A500, 68030/40 MHz, 2,5 Mt RAM, 1,3 Gt kiintolevy ja 4x CD-asema.</p>
						<p><b>Christian: </b>T&auml;ll&auml; hetkell&auml; en omista Amigaa, mutta suunnitelmissa on ostaa se ja uusi Mediator-PCI-kortti. A1200:ssani oli Infinitiv 2 -torni, BlizzardPPC 240 MHz / 68040 25 MHz ja 64 Mt muistia. Viimeisin&auml; aikoinaan koneeni pysyi pystyss&auml; noin 15 minuuttia ennen kaatumistaan, joten luovuin siit&auml;...</p>
						<p><b>Michal: </b>Amiga 4000 040/PPC, PicassoIV, Delfina DSP, Ariadne II, MultiFaceCard III, 6,4 Gt HD, 36x IDE CD-ROM, Microvitec-monitori ja Amiga OS 3.5.</p>
						<p><b>Jarle:</b> Amiga 4000, Cyberstorm MK-II 060/50 MHz, CyberVision 64-3D 4 Mt, scandoubler, 144 Mt RAM, Microvitec AMIGA M1538S 15&quot;, 3,2 Gt ja 13,2 Gt IDE-levyt, Matshita 6x CD-ROM, Nakamitchi MBR7 4x SCSI (7 levy&auml;), Philips CDD3600 4x4x6 SCSI CD-R, USRobotics Sportster 28.800, USRobotics Courier V.everything, Canon BJC-210 Color Bubble Jet, IDE-Fix, GVP SCSI II, BSC MultiFaceCard III, Pyramid-sampleri (8-bit) ja Amiga OS 3.5.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">5. Mit&auml; teet Amigallasi?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Pelaan pelej&auml; ja teen grafiikkaa sek&auml; joskus www-sivuja.</p>
						<p><b>Christian: </b>L&auml;hinn&auml; roikuskelin #amigaswe-kanavalla, mutta jotain muutakin pient&auml; tuli tehty&auml;.</p>
						<p><b>Michal: </b>Olen Amitopia-nimisen norjalaisen Amiga-lehden p&auml;&auml;toimittaja, joten tietenkin teen lehte&auml; Amigallani Pagestreamilla. Piirr&auml;n TvPaintilla, kuuntelen MP3:ia Amplifierilla, AmigaAMPilla ja DelfMPEGill&auml;, teen musiikkia Digi Booster Prolla, teen kotisivuja WebMakerilla, surffaan IBrowsella, AWebill&auml; ja Voyagerilla, irccaan AmIRC:ll&auml;, luen s&auml;hk&ouml;postit MicroDot2:lla ja k&auml;yt&auml;n FTP:t&auml; DopusFTP:ll&auml;, joka on mielest&auml;ni mainio ohjelma!</p>
						<p><b>Jarle:</b> L&auml;hestulkoon kaikkea. Norjassa minulla oli oma kaksilinjainen purkki. Ehk&auml; laitan sen telnetill&auml; verkkoon, kunhan saan kiinte&auml;n Internet-liittym&auml;n. Teen my&ouml;s musiikkia, kirjoittelen pieni&auml; ARexx-skriptej&auml;, nettailen, emuloin (Shapeshifter on loistava) ja nykyisin testaan my&ouml;s Linux RedHatia.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">6. Onko kotimaastasi helppo l&ouml;yt&auml;&auml; Amiga-tuotteita ja ovatko ne kalliita?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Puolassa on muutamia Amiga-kauppoja, mutta yleens&auml; niiss&auml; on liian kallista.</p>
						<p><b>Christian: </b>Ruotsissa on kolme Amiga-myyj&auml;&auml;, mutta Amiga-hardishan on melko kallista kaikkialla.</p>
						<p><b>Michal: </b>Helppoa Datakompanietin kautta, mutta se on todella kallis liike, joten ostan paljon netin kautta. Datakompanietill&auml; on er&auml;&auml;nlainen monopoliasema Norjassa, enk&auml; pid&auml; siit&auml; lainkaan.</p>
						<p><b>Jarle:</b> Helppoa netin kautta. Pari kolme yrityst&auml; myy edelleen Amiga-tavaraa, mutta vain netiss&auml;, postitse tai puhelimitse. Postimyynnin ongelma on siin&auml;, ettei tuotetta p&auml;&auml;se testaamaan ennen ostoa. Osa yrityksist&auml; myy selviyty&auml;kseen my&ouml;s PC-tavaraa. Amiga-tuotteet ovat my&ouml;s Norjassa kalliita verrattuna vastaaviin PC-tuotteisiin. Hintataso lienee suunnilleen sama kuin Suomessa.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">7. Onko kotimaassasi Amiga-k&auml;ytt&auml;j&auml;ryhmi&auml; ja millaista toimintaa niill&auml; on?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>En todellakaan tied&auml;, en ole n&auml;hnyt niist&auml; mit&auml;&auml;n tietoa.</p>
						<p><b>Christian: </b>Meill&auml; on ACG (Amiga Computer Group), toiminta on l&auml;hinn&auml; tietokonepartyja, mutta pelasimme me kerran laserdomea. :)</p>
						<p><b>Michal: </b>Saattaa ollakin, mutta en tunne niist&auml; yht&auml;&auml;n. Eiv&auml;t ne mit&auml;&auml;n isoja voi olla, mutta jos Amitopia kasvaa ja ihmiset oppivat tuntemaan sen, ehk&auml; sitten ryhmi&auml; syntyy. Demoscene-gruuppeja on kyll&auml; paljon.</p>
						<p><b>Jarle:</b> Oli ja tiet&auml;&auml;kseni on yh&auml;, mutta toimintaa niiss&auml; ei n&auml;yt&auml; olevan. Pieni&auml; demogruuppeja l&ouml;ytyy, ja ne j&auml;rjest&auml;v&auml;t compopartyt kerran vuodessa. Usenetiss&auml; on kolme melko isoa norjalaista uutisryhm&auml;&auml;, joissa harrastajat keskustelevat: no.it.os.amiga.diverse (kaikki Amiga-asiat), no.it.os.amiga.maskinvare (Amiga-laitteistot) ja no.it.os.amiga.programvare (Amiga-ohjelmistot).</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">8. Onko kotimaassasi Amiga-aiheista IRC-kanavaa, ja millainen se on?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>#amigazoom.pl on silloin t&auml;ll&ouml;in, mutta siell&auml; ei ole botteja. #amisia on puolalainen kanava, mutta siell&auml; on yleens&auml; vain puolenkymment&auml; k&auml;ytt&auml;j&auml;&auml;.</p>
						<p><b>Christian: </b>Yleens&auml; roikun #amigaswe:ll&auml;. En ole aivan varma aktiivik&auml;ytt&auml;jien m&auml;&auml;r&auml;st&auml;, mutta kanavan enn&auml;tys on 84 k&auml;ytt&auml;j&auml;&auml;.</p>
						<p><b>Michal: </b>#amigano on suosittu kanava, kymmenkunta k&auml;ytt&auml;j&auml;&auml; yleens&auml;, mutta iltaisin enemm&auml;nkin. Suurin osa heist&auml; postittaa Amiga-uutisia norjalaiseen uutispalveluun osoitteessa <a href="http://www.polarboing.com/" target="_blank">www.polarboing.com</a>.</p>
						<p><b>Jarle:</b> #amigano:lla on vaihtelevasti k&auml;ytt&auml;ji&auml;, 5-25 hieman viikonp&auml;iv&auml;st&auml; ja kellonajasta riippuen. K&auml;yn siell&auml; juttelemassa kavereiden kanssa tai kyselem&auml;ss&auml; neuvoja, jos Amigani kanssa on jotain ongelmia. Toiset k&auml;ytt&auml;j&auml;t ovat hyvin vakavissaan, toiset eiv&auml;t, ja n&auml;hd&auml;&auml;np&auml; siell&auml; vanhoja kunnon konesotiakin tyyliin Amiga vs. PC.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">9. Mit&auml; olet mielt&auml; Amigan tulevaisuudesta, nyt kun SDK on julkistettu ja uusia koneitakin pit&auml;isi olla tulossa?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Monien mielest&auml; tulevaisuus on PC:n. Mutta ehk&auml;p&auml; Amiga saa viel&auml; kunnon koneen markkinoille? Kuka tiet&auml;&auml;.</p>
						<p><b>Christian: </b>En anna paljonkaan arvoa SDK:lle, mielest&auml;ni se on melko hy&ouml;dyt&ouml;n. N&auml;kisin mieluummin Amiga OS:n portattuna x86:lle ja PPC:lle kuin jotain Linux-pohjaista.</p>
						<p><b>Michal: </b>Ajatus on hyv&auml;, mutta mielest&auml;ni AI keskittyy siihen liikaa ja unohtaa meid&auml;t &quot;oikeat&quot; Amiga-k&auml;ytt&auml;j&auml;t. Haage &amp; Partner sent&auml;&auml;n sai tahtonsa l&auml;pi Amiga OS 3.9:n kanssa (n&auml;in minulle on kerrottu). Haluaisin todella n&auml;hd&auml; Amiga OS&nbsp;4.0:n PPC-versiona. Amitopia on yhteisty&ouml;ss&auml; <a href="http://www.amigart.com" target="_blank">www.amigart.comin</a> kanssa ajamassa Amiga OS 4.0:aa eteenp&auml;in. Me haluamme Amiga OS:n PPC:lle ja todelliset amigistit haluavat sen PPC:lle. PPC-versio saisi maailman katsomaan Amigaa uudesta perspektiivist&auml;.</p>
						<p><b>Jarle:</b> Amiga ottaa ison askeleen siirtyess&auml;&auml;n IBM-yhteensopivien alueelle SDK:llaan. Se on hyv&auml; keino kasvattaa k&auml;ytt&auml;j&auml;m&auml;&auml;ri&auml; ja osaltaan se my&ouml;s v&auml;hent&auml;&auml; kalliin Amiga-hardwaren ongelmaa. Ehk&auml; se on my&ouml;s taloudellisesti vastuullinen tapa seurata tekniikan kehityst&auml;. Omasta puolestani aion kuitenkin jatkaa Classic Amigani laajentamista. G3/G4-turbojen ja PCI-v&auml;yl&auml;korttien avulla Classic Amigoilla on valoisa tulevaisuus viel&auml; vuosiksi eteenp&auml;in. Minulle Amiga on custom-piirist&ouml;ll&auml; varustettu kone, ei pelkk&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">10. Kerro yksi hyv&auml; ja yksi huono Amiga-muisto.</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Mit&auml;&auml;n erityist&auml; hyv&auml;&auml; ei tule mieleen. Korppuaseman hajoaminen ei ollut mukavaa.</p>
						<p><b>Christian: </b>Amiga on muistink&auml;yt&ouml;lt&auml;&auml;n todella taloudellinen. Ilman DOpus Magellania Workbench on mielest&auml;ni k&auml;ytt&ouml;kelvoton.</p>
						<p><b>Michal: </b>Amiga OS 3.5:n tulo markkinoille, k&auml;ytt&auml;j&auml;t saivat vihdoin p&auml;ivityksen vanhaan kunnon k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n. Walkerin julkaisematta j&auml;&auml;minen oli huono homma. Sen design oli niin erikoinen, ett&auml; ihmiset olisivat ostaneet sit&auml; jo ulkon&auml;&ouml;n vuoksi. Ihmisi&auml; pit&auml;&auml; v&auml;h&auml;n ravistella, ja Escom yritti sit&auml; mutta ep&auml;onnistui. Miten olisi tyylik&auml;s Amiga 4000 t&auml;ysin uudenlaisessa design-kotelossa? Heh...!</p>
						<p><b>Jarle:</b> Paha kysymys! ;) Yleens&auml; Amiga-historiassani on vain hyvi&auml; muistoja. Pahin taisi olla vuonna 1997 kun salama iski A1200:aani ja tappoi sen. Molempien kiintolevyjeni l&auml;pi meni reik&auml;, my&ouml;s backup-levyn... Sin&auml; p&auml;iv&auml;n&auml; huoneessani oli kolme muuta Amigaa, eik&auml; yksik&auml;&auml;n niist&auml; toiminut sen ukkosmyrskyn j&auml;lkeen. Hyv&auml; uutinen on se, ett&auml; minulla oli my&ouml;s kunnon vakuutukset.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">11. Oletko koskaan k&auml;ynyt Suomessa, tunnetko suomalaisia henkil&ouml;kohtaisesti?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Minulla ei ole passia, enk&auml; tunne suomalaisia. :(</p>
						<p><b>Christian: </b>En ole koskaan k&auml;ynyt Suomessa, mutta ehk&auml;p&auml; joskus tulevaisuudessa tulen k&auml;ym&auml;&auml;n.</p>
						<p><b>Michal: </b>En ole k&auml;ynyt enk&auml; tunne ket&auml;&auml;n Suomessa. Se on totuus.</p>
						<p><b>Jarle:</b> Olen asunut Suomessa viime syksyst&auml; l&auml;htien. Kaunis maa ja mukavia ihmisi&auml;. Kieli on minulle ongelma, mutta norja on hyvin samankaltaista kuin ruotsi, ja olen p&auml;rj&auml;nnyt englannilla t&auml;h&auml;n asti. K&auml;yn kyll&auml; suomentunneilla! S&auml;&auml; on paljon parempi kuin Norjassa, ja l&auml;hes kaikki on t&auml;&auml;ll&auml; 15-20% halvempaa.</p>
						<p>
						<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
							<tr>
								<td bgcolor="#f0f8ff">
									<div align="left">
										<b><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="navy">12. Mit&auml; haluaisit kertoa lukijoillemme?</font></b></div>
								</td>
							</tr>
						</table>
						</p>
						<p><b>Jaro: </b>Pit&auml;k&auml;&auml; kiinni Amigoistanne, koska se on paras tietokone... Terveisi&auml; amigisteille ja kaltaisilleni hulluille. :)</p>
						<p><b>Christian: </b>&Auml;lk&auml;&auml; siirtyk&ouml; pime&auml;lle puolelle kuten min&auml; tein! :)</p>
						<p><b>Michal: </b>Olisi hienoa, jos Amitopia voisi ilmesty&auml; suomeksikin. Ideani on, ett&auml; Amitopia olisi jonain p&auml;iv&auml;n&auml; todella hyv&auml; Amiga-uutisverkko, jossa paikalliset Amitopia-lehdet hy&ouml;dynt&auml;isiv&auml;t samoja uutisl&auml;hteit&auml;, mutta paikallisilla lehdill&auml; olisi oma tyylins&auml; jne. N&auml;in esimerkiksi norjalaiset voisivat lukea suomalaisista Amiga-partyista ja niin edelleen.</p>
						<p><b>Jarle:</b> Tukekaa Amiga-kauppiaitanne ja -kehitt&auml;ji&auml;nne. Tehk&auml;&auml; selv&auml;ksi, ett&auml; olette olemassa ja inspiroikaa heit&auml;, jotta he jatkaisivat Amiga-tuotteiden kehitt&auml;mist&auml; ja myymist&auml;. Niin kauan kuin teemme niin, Amiga ei koskaan kuole.</p>
						<p><b>Kiitokset kaikille vastauksista!</b></td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
