<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>LCD-n&auml;ytt&ouml; Amigaan</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jani Kannisto &lt;<a href="mailto:jkanrav@netti.fi">jkanrav@netti.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Olen jo pitk&auml;&auml;n halunnut Amigaani jonkin ratkaisun, jolla voin n&auml;ytt&auml;&auml; mp3-kappaleiden tietoja ilman monitoria. Paras ratkaisu on LCD-n&auml;ytt&ouml;, koska siihen l&ouml;ytyy Aminetist&auml; hyv&auml;t ohjeet. LCD-n&auml;ytt&ouml;j&auml; n&auml;kee kaikkialla; muun muassa puhelimien n&auml;yt&ouml;t ovat LCD-n&auml;ytt&ouml;j&auml;. LCD-n&auml;ytt&ouml;j&auml; k&auml;ytet&auml;&auml;n paljon, koska ne viev&auml;t todella v&auml;h&auml;n virtaa. Ohjelmisto l&ouml;ytyy helposti Aminetist&auml;, mutta n&auml;yt&ouml;n l&ouml;yt&auml;minen onkin hieman vaikeampaa. LCD-n&auml;ytt&ouml;j&auml; nimitt&auml;in tuntuu olevan aika harvassa paikassa myynniss&auml;. Kotikaupungistani Raumalta ei l&ouml;ytynyt mink&auml;&auml;nlaista LCD-n&auml;ytt&ouml;&auml;.
						<center>
							<p><img height="119" width="350" src="kuvat/lcd_front.jpg" border="0" alt=" "></p>
						</center>
						<p>Oman n&auml;ytt&ouml;ni l&ouml;ysinkin Tampereen <a href="http://www.bebek.fi/" target="_blank">Bebekist&auml;</a>. Siell&auml; niit&auml; on kolme tai nelj&auml; erityyppist&auml;. Parilla kympill&auml; saa 1x20 merkin n&auml;yt&ouml;n ja hieman isommalla sijoituksella saa niin ison n&auml;yt&ouml;n, ett&auml; siihen mahtuu vaikkapa mp3-kappaleen nimi kokonaisuudessaan. Omassa n&auml;yt&ouml;ss&auml;ni on tilaa 2x20 merkille, ja sen hinta oli vain 65 markkaa. N&auml;ytt&ouml; vaikuttaa sellaiselta, ett&auml; siin&auml; olisi taustavalo, mutta en ole sit&auml; saanut toimimaan. N&auml;yt&ouml;n merkki on Epson EA-D20025ER-S.</p>
						<center>
							<p><img height="126" width="350" src="kuvat/lcd_back.jpg" border="0" alt=" "></center>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Kytkenn&auml;n rakentaminen ja testaus</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Aminetist&auml; l&ouml;ytyv&auml; ohjelma on nimelt&auml;&auml;n LCDaemon (<a href="http://ftp.sunet.se/pub/aminet/hard/hack/lcdaemon.lha">hard/hack/lcdaemon.lha</a>, 215 kt). Siin&auml; on varsin laajat ohjeet n&auml;yt&ouml;n kytkemiseksi. N&auml;ytt&ouml; kytket&auml;&auml;n alkuper&auml;iseen parallel-porttiin. Paketin mukana ei tullut tukea muille parallel-porteille, mutta omien implementtien kirjoittaminen vaikuttaa helpolta, jos vain omaa ohjelmointikokemusta. Ohjeiden mukaan kytkeminen olisi ollut helppoa, mutta n&auml;ytt&ouml;ni mukana ei tullut mit&auml;&auml;n ohjeita. N&auml;yt&ouml;ss&auml;ni on 14 nastaa, samoin kuin LCDaemonin esimerkkin&auml;yt&ouml;ss&auml;kin. N&auml;yt&ouml;st&auml; on helppo l&ouml;yt&auml;&auml; nastat, joihin kytket&auml;&auml;n maa ja +5V. Muut 12 nastaa aiheuttivat harmaita hiuksia. Netist&auml;k&auml;&auml;n ei tuntunut l&ouml;ytyv&auml;n ohjeita Epsonin LCD-n&auml;ytt&ouml;&ouml;n.
						<p>Kuitenkin vanhoja nyyssej&auml; aikani pengottuani sain selville, ett&auml; k&auml;yt&auml;nn&ouml;ss&auml; kaikissa LCD-n&auml;yt&ouml;iss&auml; on samat piikit samassa j&auml;rjestyksess&auml;. Kytketty&auml;ni piikit LCDaemonin ohjeiden mukaan n&auml;ytt&ouml; ei suostunut viel&auml; toimimaan. Ongelmana oli v&auml;&auml;rin kytketty kontrastinasta. Ohjeissa neuvottiin kytkem&auml;&auml;n kontrasti maahan, ja jos n&auml;ytt&ouml; ei toimi, niin kontrastinasta kytket&auml;&auml;n potentiometrill&auml; maan ja +5V:n v&auml;liin. Koska kontrastinasta oli minulla aluksi kytketty maahan, n&auml;yt&ouml;n pisteet olivat himmeimm&auml;t mahdolliset, eik&auml; mit&auml;&auml;n n&auml;kynyt. Piti siis kytke&auml; kondensaattori tuohon kontrastinastaan. Kontrastinastan kytkeminen suoraan +5V:iin ei toimi, koska silloin n&auml;ytt&ouml; on kirkkain mahdollinen, ja kaikki pisteet ovat tummia.</p>
						<center>
							<p><img height="232" width="200" src="kuvat/lcd_etulevy.jpg" border="0" alt=" "></center>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Ohjelmisto</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">LCDaemonin ohjelmat ja dokumentointi ovat mukavan laajoja. Jotta n&auml;yt&ouml;n saa toimimaan, pit&auml;&auml; aluksi k&auml;ynnist&auml;&auml; LCD:t&auml; k&auml;ytt&auml;v&auml; ajuri. Se tunnistaa itse n&auml;yt&ouml;n rivien m&auml;&auml;r&auml;n ja pituuden, eik&auml; normaalisti tarvitse mit&auml;&auml;n argumentteja. Jotta n&auml;ytt&ouml;&ouml;n saa mit&auml;&auml;n el&auml;m&auml;&auml;, pit&auml;&auml; lis&auml;ksi ajaa joku LCDaemon-pakettiin kuuluvista ohjelmista. Yksi varsin mukava ohjelma on LCDecho, joka toimii echo:n tapaan, eli 'LCDecho &quot;moi&quot;' tulostaa n&auml;ytt&ouml;&ouml;n tekstin 'moi'. Lis&auml;parametriksi voi antaa ajan, kuinka kauan teksti viipyy n&auml;yt&ouml;ll&auml;, oletusaika on sekunti.
						<p>Pakettiin kuuluu kaksi valmista systeemimonitorityyppist&auml; ohjelmaa. Toinen n&auml;ytt&auml;&auml; muistin m&auml;&auml;r&auml;n ja ajan, ja toinen k&auml;ytt&auml;&auml; Executivea ja n&auml;ytt&auml;&auml; lis&auml;ksi CPU-kuormituksen. LCDaemonin ajuri avaa kaksi viestiporttia. Yksi on MessagePort, jota ohjelmoijat voivat k&auml;ytt&auml;&auml; viestien tulostukseen. Toinen portti on Arexx-portti, johon voidaan sy&ouml;tt&auml;&auml; teksti&auml;.</p>
						<p>Mukana tulee my&ouml;s LCD-handler, jolla voidaan mountata LCD:-niminen laite. Siihen voi ohjata tulostuksen tyyliin 'Type &gt;LCD: Teksti.txt' tai 'dir &gt;LCD:'. Yleens&auml; LCD:hen ohjattu tuloste on tosin varsin sekava. Viesteill&auml; on eri prioriteetit, ja se avaa uusia mielenkiintoisia mahdollisuuksia. Sysmonin tulosteella on pienempi prioriteetti kuin LCDechon tulosteella. Jos Sysmon on ajettuna, n&auml;yt&ouml;ss&auml; n&auml;kyy sen tietoja, mutta kun LCDecho ajetaan lis&auml;ksi, n&auml;yt&ouml;ss&auml; vilahtaa m&auml;&auml;r&auml;tyn ajan LCDechon viesti. Olenkin hy&ouml;dynt&auml;nyt t&auml;t&auml; ominaisuutta siten, ett&auml; S:user-startupissani ajetaan aina komento:</p>
						<p>Run &gt;NIL: C:sysmon</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Mp3-tietoja LCD-n&auml;yt&ouml;ss&auml;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kerroin aluksi, ett&auml; haluan n&auml;hd&auml; mp3-soittotietoja, kun monitori on suljettu. Tein sit&auml; varten lyhyen ARexx-ohjelman, joka Amplifierin soidessa tulostaa mp3:n tietoja n&auml;ytt&ouml;&ouml;n. Ohjelma oli hidas ja ruma, mutta se toimi, tosin oikein vain 2x20-kokoisessa n&auml;yt&ouml;ss&auml;. N&auml;yt&ouml;n ylemm&auml;ss&auml; riviss&auml; on nykyisen kappaleen soittoon k&auml;ytettu aika ja s&auml;velt&auml;j&auml;n nimi. Toisessa riviss&auml; on kappaleen nimi.
						<center>
							<p><img height="100" width="320" src="kuvat/lcd_mp3.jpg" border="0" alt=" "></p>
						</center>
						<p>Ajoin t&auml;m&auml;nkin ohjelman omassa S:user-startup-tiedostossani:</p>
						<p>Run &gt;NIL: REXX:LCDamplifier.rexx</p>
						<p>T&auml;st&auml; kehitetyt LCDmpega ja LCDmpega-notime ovat ARexx-ohjelmia, jotka joko Amplifieria tai Songplayeri&auml; k&auml;ytett&auml;ess&auml; tulostavat kappaleen tekij&auml;n nimen ja kappaleen nimen LCD-n&auml;yt&ouml;lle. LCDmpega tulostaa lis&auml;ksi kappaleen soittoon kuluneen ajan. Ohjelmat on suunniteltu 2x20-merkkiselle n&auml;yt&ouml;lle. 1x20-rivisess&auml; n&auml;yt&ouml;ss&auml; ei n&auml;y kappaleen nime&auml;, ja pienemm&auml;ss&auml; n&auml;yt&ouml;ss&auml; ei kannata edes kokeilla.</p>
						<p>N&auml;ill&auml; komennoilla n&auml;yt&ouml;ss&auml;ni on normaalisti sysmonin vapaan muistin m&auml;&auml;r&auml; ja aika, ja Amplifierin tai Songplayerin ollessa k&auml;ynniss&auml; ja soittaessa mp3:a mp3-kappaleiden tietoja. Luovutin ohjelmat Sakun mukana levitett&auml;viksi, ja ne l&ouml;ytyv&auml;t t&auml;m&auml;n Sakun osastot/sekalaiset-hakemistosta paketista <a href="lcdmpega.lha">lcdmpega.lha</a>.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Yhteenveto</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">LCD-n&auml;yt&ouml;n kytkent&auml; on helppoa ja se on halpa. LCDaemon-ohjelmisto on laaja ja helppo k&auml;ytt&auml;&auml;. Mahdollisuudet ovat mahtavat. Jos et omista kirjoitinta ja parallel-portti on toistaiseksi k&auml;ytt&auml;m&auml;t&ouml;n, kannattaa antaa se LCD:n k&auml;ytt&ouml;&ouml;n. LCD-n&auml;ytt&ouml; ilman taustavaloa on vaikeasti luettava, joten taustavalo olisi ihan mukava. Ostamani n&auml;ytt&ouml; mahtuu 5,25&quot; etulevyyn, jolloin sen voi sijoittaa vaikkapa tornin romppuasemapaikkaan. Jos ostat n&auml;yt&ouml;n Bebekist&auml;, kannattaa samalla ostaa 12,50 markalla valmis D25-jatkojohto. Sen muokkaus LCD:t&auml; varten on helpoin tapa liitt&auml;&auml; n&auml;ytt&ouml; koneeseen.
						<center>
							<p><img height="190" width="307" src="kuvat/lcd_koneessa.jpg" border="0" alt=" "></center>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
