<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="MMI">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Haastattelussa Daniel Sj&ouml;strand</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarkko Pienim&auml;ki</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><b>1. Kertoisitko nimesi ja v&auml;h&auml;n taustastasi. Miss&auml; asut?</b>
						<p>Oikea nimeni on Daniel Sj&ouml;strand. Olen soittanut pianoa lapsesta saakka, mutta nykyisin soitan my&ouml;s kitaraa. Asun tytt&ouml;yst&auml;v&auml;ni Mikan kanssa Tukholman ulkopuolella M&auml;rstassa.</p>
						<p><b>2. Ty&ouml;skenteletk&ouml; musiikkialalla vai jossain muualla?</b></p>
						<p>Olin t&ouml;iss&auml; musiikkiliikkeess&auml;, mutta nyt olen pakkaajana tavaratalossa.</p>
						<p><b>3. Oletko viel&auml; Amiga-k&auml;ytt&auml;j&auml;? Kuinka kauan k&auml;ytit Amigaa?</b></p>
						<p>My&ouml;nt&auml;&auml; t&auml;ytyy, ettei minulla t&auml;ll&auml; hetkell&auml; ole Amigaa, vaan teen kaiken musiikkini PC:ll&auml;. Sain ensimm&auml;isen Amigani vuonna 1994 ja myin sen vuonna 1998.</p>
						<p><b>4. Mit&auml; laitteita k&auml;yt&auml;t s&auml;velt&auml;miseen?</b></p>
						<p>T&auml;ss&auml; on t&auml;ydellinen lista: Korg Triton (syntikka), Yamaha CS1X (syntikka), Behringer MX 1602 (mikseri), AKG D3700 (mikrofoni), Levin (akustinen kitara), Levin-mandoliini ja hidas PC (133 MHz). Aion p&auml;ivitt&auml;&auml; ensi kuussa ja silloin hankin my&ouml;s&nbsp;Whammirackin (&auml;&auml;nikortti).</p>
						<p><b>5. Oletko levytt&auml;nyt? Jos et, tahtoisitko?</b></p>
						<p>Toistaiseksi olen julkaissut musiikkiani vain Internetiss&auml;. En tietenk&auml;&auml;n panisi pahakseni lis&auml;rahaa, mutten halua etten saisi sen vuoksi julkaista musiikkia my&ouml;s ilmaiseksi netiss&auml;.</p>
						<p><b>6. Mist&auml; saat inspiraatiosi?</b></p>
						<p>Jokap&auml;iv&auml;isest&auml; el&auml;m&auml;st&auml;, &auml;&auml;nist&auml; joita kuulen matkalla t&ouml;ihin... Ja tytt&ouml;yst&auml;v&auml;ni on tietenkin t&auml;rkein inspiraationi l&auml;hde.</p>
						<p><b>7. Mit&auml; mielt&auml; olet Amiga-markkinoista ja Amigan tulevaisuudesta? Onko Amiga kuollut?</b></p>
						<p>Vaikea kysymys. Minulle Amiga on kuollut sen rajallisten musiikkiominaisuuksiensa vuoksi, mutta tuskin graafikkojen mielest&auml;. Toivottavasti Amiga voi tulevaisuudessa olla tehokas ammattikone raskaaseen graafiseen ty&ouml;skentelyyn ja musiikintekoon.</p>
						<p><b>8. Aiotko ostaa AmigaOnen?</b></p>
						<p>En ole kunnolla tutustunut siihen, ja suurin ongelma on raha. T&auml;n&auml; p&auml;iv&auml;n&auml; voin ostaa nopean PC:n l&auml;hestulkoon pikkurahalla, onko se mahdollista AmigaOnen kanssa?</p>
						<p><b>9. Mit&auml; mielt&auml; olet Amiga-yhteis&ouml;st&auml;?</b></p>
						<p>Amiga-yhteis&ouml; on maailman paras!</p>
						<p>Daniel Sj&ouml;strandin (aka ElbiE) musiikkiin voi tutustua osoitteessa <a href="http://listen.to/ElbiE" target="_blank">http://listen.to/ElbiE</a> tai Aminetiss&auml; (<a href="http://ftp.sunet.se/~aminet/dirs/mods_elbie.html" target="_blank">/mods/elbie/</a>).</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
