<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. News

Bomber in der zweiten Runde

Der netzwerkf&auml;hige Dynablaster-Clone "dynAMIte" geht in die zweite Runde, 
will sagen, Version 2.0 steht zum Download [1] bereit.
Komplett &uuml;berarbeitet wurde die k&uuml;nstliche Intelligenz der Bots, die diese 
ein wenig st&auml;rker macht. Statt der bisherigen Flashbombs gibt es nun das 
PowerUp 'darkness'. Es macht genau das, wonach es klingt. :)
Au&szlig;erdem wurden einige Fehler korrigiert und der Server verbessert.
Nach wie vor macht das Spiel einen tierischen Spa&szlig;.

F&uuml;r alle, die gar nicht genug davon bekommen k&ouml;nnen, gibt es nun au&szlig;erdem 
die Special Collector's Edition auf CD-ROM, die neben dem eigentlichen 
Spiel alle Maps und Styles enth&auml;lt, eine 3D-Intro-Sequenz, AudioTracks und 
noch mehr.
Zusammen macht das dann 15 Euro inklusive Versandkosten.

[1] http://amisource.de/dynamite/



Neues Spiel von clickBOOM

Angek&uuml;ndigt vom kanadischen Hersteller clickBOOM ist das Spiel "666", zu 
dem bisher auf der Website allerdings nicht mehr als ein Bild mit eben 
dieser Ziffernfolge zu finden ist. Es soll sich aber um ein 3D-Action-
Adventure handeln.

[1] http://www.clickboom.com/666/



Faces Of Mars bietet CD-ROMs an

F&uuml;r begeisterte Anh&auml;nger des Spiels "Wizard War II", oder solche, die es 
werden wollen, gibt es nun eine neue Bezugsquelle [1]. F&uuml;r 3 Euro plus 
Versandkosten bekommt man das ganze auf CD-ROM zugeschickt.
Gleiches gilt f&uuml;r die CD-ROM "Paranoia 2", auf der beide Teile des 3D-
Shooters "Zombi Massacre" zu finden sind, das Rennspiel "Roadkill AGA", das 
Actionspiel "Seek&Destroy" sowie "Woodys World".

[1] http://www.facesofmars.tk



Totgesagte leben l&auml;nger

Trotz anderslautender Ger&uuml;chte wurde die Entwicklung des 3D-Strategiespiels 
"Maim&Mangle" nicht eingestellt. Sie sei nur vor&uuml;bergehend eingefroren 
gewesen.
Es gibt eine &uuml;berarbeitete Website [1], auf der auch einige Screenshots zu 
finden sind.

[1] http://mm.starforge.co.uk



Die Amiga Arena ist flei&szlig;ig wie immer

Neben dem Jump-and-Run "DangerDogg", das nun frei verf&uuml;gbar ist, hat Olaf
K&ouml;bnik es geschafft, von Sayonara Software die Erlaubnis zu bekommen, den
Fu&szlig;ballmanager "Samba Partie" zum Download [1] anzubieten. Es sind k&uuml;nftig
auch noch weitere Titel aus gleichem Hause zu erwarten.

[1] http://online-club.de/~ARENA/



Neue Infos zu Payback

Die "Payback"-Version f&uuml;r das Amiga Anywhere schreitet voran. Programmierer
James Daniels hat einen weiteren Statusbericht ver&ouml;ffentlicht.
Um Speicherplatz zu sparen, k&ouml;nnen Karten nun auch direkt aus LhA-Archiven
genutzt werden. Sehr interessant ist auch der Zufallsgenerator, der immer 
unterschiedliche Missionen ausspuckt.
Au&szlig;erdem wurde den Objekten im Spiel ein wenig mehr Intelligenz spendiert.
Alles in allem sollte der erste wahre Knaller f&uuml;r das Amiga Anywhere in 
K&uuml;rze fertiggestellt sein.

[1] http://www.apex-designs.net

Oliver Tacke &lt;oliver@aakt.de&gt; - schickt mir eure News!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
