<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Der Zwischenruf
---------------

Ruhe in Frieden, kleiner Daumen(?)

Das Leben ist hart...ist ja nichts Neues. Dass es aber auch grausam sein
kann, durfte ich k&uuml;rzlich bei einem kleinen Ausflug in einen WAP-Chat
erfahren. Klein, kompakt und schnuckelig ist mein Hilfsger&auml;t...ein
Siemens ME 45, unter Freaks auch als WAP-Waffel bekannt. 

Da sa&szlig; ich nun, sp&auml;t Abends - ohne einen Fernseher in Blickweite - auf der
Couch. Ich wollte schon immer mit dem kleinen Ding ein wenig spielen; das
Wunderwerk der Technik, der Gigant der Kommunikation hatte es sich soeben 
in meiner Hand bequem gemacht, und wir begannen, die Weiten der 
menschlichen Sph&auml;re im Internet zu ergr&uuml;nden. Von einigen nichtssagenden 
Blabla-Seiten diverser Erotik- und Nachrichtendienste abgesehen fand ich 
au&szlig;er o.g. Chat nichts Interessantes. Das Internet - wie ich es kenne - 
macht um WAP immer noch einen gro&szlig;en Bogen. 

"Das ist auch nicht verwunderlich." , dachte ich mir so, als ich die ersten 
freundlichen S&auml;tze in den Chatraum tippte. "Da kriegt man ja Fingerasthma
von dem Kleingefummel!". Nach jedem f&uuml;nften Aktualisieren flog ich zudem
aus dem Chat. Neu anmelden wurde mir mit dem Hinweis "Nick ist bereits
vergeben" quittiert. Der Server, der mich soeben rausgeschmissen hatte,
konnte es wohl kaum glauben, dass ich schon wieder einen Fingerbruch
riskieren will. 

"Mistding" dachte ich so bei mir. Wenn der Fortschritt bei der 
Miniaturisierung von Gebrauchsgegenst&auml;nden darin besteht, Tasten mindestens 
f&uuml;nffach zu belegen und die Tasten selbst auf Nanogr&ouml;&szlig;e zu verkleinern, 
stelle ich mir ernsthaft die Frage, ob wir diesen Quark wirklich brauchen.
Was sagen die Krankenkassen ob der in Zukunft rapide ansteigenden Kosten 
f&uuml;r Fingereingipsungen? K&ouml;nnen wir uns da dann noch die ach so wichtigen
Anti-Raucher-Pflaster vom Arzt verschreiben lassen? Wird die &auml;ltere
Generation nun ihrer einzigen Kontaktm&ouml;glichkeit - einem Pl&auml;uschchen mit 
dem lieben Onkel Doc - beraubt, weil ich, neben f&uuml;nf anderen Patienten, mit
geschientem rechten Daumen im Wartezimmer herumlungere?   

Ein intellektuell schwieriges Thema tut sich auf. Die Politik sollte sich
damit befassen. Wen interessiert schon BSE oder das bisschen Nitrofen im
Putenschnitzel (Paprikapulver ist ja auch sch&auml;dlich...den eingegangenen
K&auml;fern in der Gew&uuml;rzdose nach zu urteilen!). Wer will schon zwei Jahre
Garantie auf 'ne Stereoanlage haben? Die ist doch ohnehin schon nach einem
Jahr technisch veraltet oder die Endstufe durch Star Wars geschmolzen!!
Nein, ein Ruck muss durch das Land gehen; das Verbraucherschutzministerium
sollte an der Spitze einer Anti-Nanosierungs-Kampagne stehen. Gentech ist
doch pillepalle. Nanotech ist mein Untergang...

...und so nebenbei auch meine gigantisch hohe Handyrechnung von letzten
Monat...


Lebt lang und erfolgreich!

Mit einem gequ&auml;lten L&auml;cheln auf den Lippen,

euer

Ralf Driesner &lt;global-dries@gmx.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
