<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,bruce dickinson,bets of,catacombs">
<title>Bruce Dickinson: Best Of Bruce Dickinson</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Bruce Dickinson: The Best Of Bruce Dickinson 2 CD</font></h1><BR> (63:40 &amp; 71:32 / Metal-Is)</center></P>

<p>Schon vor einiger Zeit k&#252;ndigte Meister Dickinson ein Rarit&#228;ten Album namens &quot;Catacombs&quot; an, aus dem bedauerlicherweise nie etwas geworden ist - Material w&#228;re zweifelsohne gen&#252;gend da gewesen (wenn ich da nur an das &quot;Lost Keith Olsen Album&quot; denke...). Stattdessen ist vor kurzem eine Best Of von Dickinsons Solokarriere erschienen, derren limitierte Erstauflage auch eine CD mit einigen dieser Rarit&#228;ten enth&#228;lt und damit auch f&#252;r Leute interessant ist, die schon s&#228;mtliche Alben seiner Solokarriere besitzen. Das Konzept h&#246;rt sich irgendwie auch recht interessant an, ist dann aber bei n&#228;herem Hinsehen nichts halbes und nichts ganzes. Sicherlich, eine Best Of macht gerade bei der abwechselunsgreichen Solokarriere von Bruce Dickinson Sinn, sollte 
aber bei der &#252;beraus interessanten Solokarriere auch als Doppel CD erscheinen. So sind zwar die wichtigsten St&#252;cke auf der ersten CD dieser Best Of auf der einen Seite enthalten, aber meiner Meinung nach fehlen auf der anderen Seite auch wieder einige Nummern, die ich auf jede Best Of von Mr.Dickinson packen w&#252;rde - insbesondere die &quot;Skunkworks&quot; Phase (siehe auch Oldie Review in dieser Ausgabe) wird doch arg stiefm&#252;tterlich behandelt. Daf&#252;r gibt es mit &quot;Silver Wings&quot; und &quot;Broken&quot; auch noch zwei geile neue Tracks, die stilistisch zwischen den beiden letzten Alben &quot;Chemical Wedding&quot; und &quot;Accident Of Birth&quot; pendeln. Tja, damit h&#228;tten wir den Best Of Teil dieser CD schon abgeschlossen - kommen wir nun zur zweiten CD mit den Rarit&#228;ten. Auch hier finden sich zwar viele interessante Perlen (etwa die Original Version von &quot;Bring Your Daughter To The Slaughter&quot;, diverse unver&#246;ffentlichte Tracks sowie B-Seiten, eine Live Version von &quot;Jerusalem&quot;, Bruces ersten Song &quot;Dracula&quot; aus dem Jahre 1977 sowie eine nette Dokumentation zu den Rarit&#228;ten vom Meister h&#246;chspers&#246;nlich), aber alleine schon die 
Tatsache das das grandiose, zweigeteilte &quot;No Way Out&quot; (vom &quot;Lost Keith Olsen&quot; Album, welches 1994 auf diversen Singles erschienen ist) nur zur H&#228;lfte 
(n&#228;mlich der zweite Teil) hier vertreten ist, ist eine Frechheit. Ebenso vermisse ich pers&#246;nlich noch &quot;The Breeding House&quot; aus der selben &#196;ra, welches mit zu den st&#228;rksten Kompositionen von Herrn Dickinson geh&#246;rt. Um es zusammenzufassen: Die beiden Ideen (Best Of / Rarit&#228;ten) h&#228;tten f&#252;r sich alleine genommen sehr viel mehr Sinn gemacht, als das vorliegende Release. Schlecht ist das ganze sicherlich nicht und Fans sollten hier trotzdem zugreifen, aber so richtig gedient ist mit dieser Mixtur dann doch niemanden...</P>

<p>Fazit: ---</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P>
</Center>

<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
