<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,interview,sa adams">
<title>Interview mit SA Adams</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="blue">Interview: S.A.Adams</font></center></h1></P>

<p>Zwar ist die aktuelle Platte, <b>Stovepipe</b>, der amerikanischen Antwort auf 
Mot&#246;rhead nur via Mailorder vorerst erh&#228;ltlich, doch sollte einem das nicht 
davon abhalten, schnell zuzugreifen, denn der kleine, quirlige Musiker mit den 
gro&#223;en Ideen bietet wirklich alles, was man sich von ehrlicher Heavy Mucke im 
traditionellen Sinne w&#252;nscht. Und stellt man ihm auch nur eine Frage, hat man 
schon den passenden Start f&#252;r ein langes, gutes und informatives Gespr&#228;ch. </P>

<p><i>Man trifft nicht oft Leute, die alle Elemente von verschiedenen Sounds in der Musik 
erkennen k&#246;nnen. Ehrlich gesagt, wei&#223; ich nicht, was in den K&#246;pfen mancher 
Bands vorgeht, wenn sie sich ans Songwriting machen. Vielleicht merken manche 
gar nicht, da&#223; sie kaum &#252;ber den Tellerrand gucken. F&#252;r mich ist einzig 
wichtig, da&#223; eine Platte, die ich mir anh&#246;re, auch gut kickt und mich zum 
Mitwackeln bringt. Ich bin immer noch ein gro&#223;er Metal-Fan und wenn mir etwas 
nicht gef&#228;llt, hole ich mit eine andere CD, haha. Ich bin mir sicher, ein 
wahrer Metalfan wei&#223;, welche Band ehrlich ist und welche nicht. Darum ist 
Amerika in dieser Hinsicht auch nicht so beliebt.</I></P>

<p>Sagt&#180;s und lacht. Recht unkonventionell war der Entstehungsproze&#223; dieser Scheibe: Gemischt am Computer.... </P>

<p><i>Ja, ich habe mit einem Pentium I mit 100 KHZ</I> (werden wohl eher 100 MhZ gewesen sein... - Anmerkung von Kilian Servais)<I> und nur 64 MB 
Arbeitsspeicher gearbeitet. Und ich mu&#223; mich ganz dick bei drei Leuten bedanken: Das Programm, das ich nutze, hei&#223;t 
&quot;N-Track&quot; (gibt&#180;s unter www.fasoft.com) und kostet gerade mal 30 Dollar. Der 
Name des Programmierers ist Flavio Antolini. Der Gebrauch der Software ist 
superleicht und hat es mir sehr einfach gemacht, die Ideen in meinem Kopf exakt 
zu verwirklichen. N-Track verwandelt deinen Computer in ein 
Multi-Track-Programm. Die zweite wichtige Person ist Produzent Michael Wagener, 
der mir gelehrt hat, Musik aus der Sicht eines Produzenten zu sehen. Er hat 
einige Demos der Scheibe geh&#246;rt und gab mir viele wertvolle Anregungen, alles 
aus dem Sound herauszuholen. Er nennt es einen transparenten Sound, den man als 
Musiker so eigentlich gar nicht wahrnimmt. Er hat mir gezeigt, Musik anders zu 
h&#246;ren. Und zu guter Letzt auch Bob Shuster, der mir viel bez&#252;glich der 
Unterschiede zwischen Analog- und Digital-Aufnahmen gezeigt hat. Unterm Strich 
sollte die Scheibe so viel wie m&#246;glich Live-Feeling einfangen. Lange lebe Van 
Halen&#180;s &quot;Women And Children First&quot;.</I></P>

<p>Den Haupteinflu&#223; f&#252;r die Platte sieht S.A. 
in verschiedenen Abschnitten seines Lebens...</P>
 
<p><i>Ein Grund, weshalb jede meiner 
Platten anders klingt, ist, da&#223; ich zu jeder Aufnahmezeit an einem anderen 
Punkt in meinem Leben stehe. &quot;Stovepipe&quot; ist wesentlich feindseliger als die 
Musik, f&#252;r die ich eigentlich bekannt bin. Rocky, einer meiner Mitmusiker, ging 
durch eine harte Scheidung und dem Sorgerechtsstreit f&#252;r sein Kind, ich hatte 
beschissene Job-Situationen seit ich bei den Erwachsenen mitspiele. Es war nie 
leicht f&#252;r mich, Geld zu verdienen. All diese Dinge flie&#223;en emotional in die 
Scheibe mit ein. Musikalisch habe ich aber immer noch die gleichen Einfl&#252;sse: 
New Wave of British Heavy Metal, also Saxon, Raven, Tank, Fist und Mot&#246;rhead, 
gemischt mit dem Punk der fr&#252;hen `80er und Rock&#180;n&#180;Roll-Legenden wie Ted Nugent, 
Eddie Cochran, Blue Cheer,..... aber ich mag auch die deutschen Metal Bands, 
wie Primal Fear und Gamma Ray supergern,</I> bricht der Amerikaner eine Lanze f&#252;r 
die deutsche Heavy-Fraktion. Die f&#252;r ihn bisher wichtigste Zeit sieht S.A, 
zwischen 1986 und 1992.</P> 

<p><i>Damals hatte ich die Chance, vieles zu erleben und 
unter Bands zu sein in einer F&#252;lle, die den meisten Musikern nie m&#246;glich ist. 
1985 habe ich f&#252;r ein Fanzine namens &quot;Kicks Ass&quot; geschrieben und dann wurde ich 
Herausgeber bei einer w&#246;chentlichen New Yorker Unterhaltungszeitung. Meine 
Erfahrung davon, innerhalb der Szene zeigte mir, da&#223; wie das Musikbusiness 
wirklich ist: Entt&#228;uschend, aber akzeptabel. Ich war eine zeitlang Roadie bei 
Thor und habe auch mit Manowar so meine Erfahrungen gemacht. 1988 - 1989 zeigte 
mir den Weg, wie erfolgreiche Bands arbeiten. Und darum finde ich auch, da&#223; 
Manowar eine der gr&#246;&#223;ten Bands &#252;berhaupt sind. Nicht nur wegen dem, was von CD 
und der B&#252;hne kennt, sondern wegen der ganze Arbeit, die die Band hineinsteckt. 
Arbeit, die die normalen Leute niemals sehen werden. Ich spielte w&#228;hrend dieser 
Zeit eine Menge Opening-Gigs f&#252;r gro&#223;e Bands und letztendlich hat mir die 
Erfahrung, die ich bei Studioarbeiten von 1989 bis 1992 machte (Propain mit 
Billy Milano, Dream Theater, Raven, Stone), einiges gezeigt. Ebenso auch die 
Tatsache, wieviele regionale Bands es trotz vieler Bem&#252;hungen nie geschafft 
haben. Und hier eine kleine Exklusivmeldung: Ich habe angefangen ein Buch zu 
schreiben, mit all meinen Erfahrungen: Als Journalist, Roadie und als Sound 
Engineer. Es wird einfach &quot;Rock And Roll&quot; hei&#223;en. Und sollte ich mal gro&#223; 
rauskommen, wird auch das Buch das Licht der Welt erblicken. Ungef&#228;hr sechs bis 
acht Monate nach dem gro&#223;en Schlag.</I></P>

<p>Und r&#252;ckt im n&#228;chsten Atemzug gleich damit 
heraus, da&#223; er absolut &#252;berrascht ist, wenn jemand seine Musik mag.</P> 

<p><i>Ich erwarte 
das nicht. Ich bin echt positiv &#252;berrascht, wenn ich h&#246;re, da&#223; jemand meine 
Musik gerne h&#246;rt. Das ist so, weil ich Musik f&#252;r niemanden au&#223;er f&#252;r mich 
selbst mache. Es schmeichelt mir sehr, wenn ich sehe, da&#223; die Mucke ankommt. 
Das einzige Ziel, das ich bei dieser Scheibe hatte, war, die bestm&#246;gliche 
Aufnahmequalit&#228;t abzuliefern.</I></P>

<p>Nach S.A.&#180;s gibt es eine gro&#223;e Krux in der 
Musikszene: Zu wenig Fans, die sich engagieren und in diesem Business arbeiten 
- oder auch zuviele Leute im Biz, die keine wahren Fans sind.</P> 

<p><i>Meiner Meinung 
nach w&#228;re es wichtig, so viel wie m&#246;glich Hardcore-Fans in der Musikindustrie 
zu haben. Es g&#228;be mehr gute Entscheidungen, die nicht vom Geld dominiert 
werden. Die Musi selbst w&#228;re auch echter. Wenn ich etwas &#228;ndern k&#246;nnte, w&#252;rde 
ich eine dreist&#252;ndige, weltweite Metal-Fernseh-Show auf die Beine stellen. Es 
g&#228;be eine Music Directors-Garde von an die zwanzig Leuten und jeder h&#228;tte einen 
Song nach Wahl in der Show. Ein fan-gesteuertes Programm. W&#228;r&#180; das nicht 
gro&#223;artig?</I></P>

<p>Sicher. Nur leider scheitern erfahrungsgem&#228;&#223; ja schon die kleinsten 
Sachen auch an der Faulheit und dem mangelnden Engagement sogenannter Fans. 
Engagement ist Arbeit und daf&#252;r will man Geld. Und Hobby kann sowieso nicht zur 
Arbeit werden. Lassen wir das. Unter http://members.aol.com/saaback gibt es 
eine Menge News, auch anstehende Konzerte von S.A.  werdet Ihr dort finden. 
Best&#228;tigt ist bereits sein Auftritt beim Bang Your Head-Festival im n&#228;chsten 
Jahr. Und ansonsten.....</P> 

<p><i>Hey Leute: Wenn man nach Musik sucht, die keine Schei&#223;e 
pr&#228;sentiert, nicht alternative angehaucht oder Nu Metal ist, dann la&#223;t 
&quot;Stovepipe&quot; mal `ne Runde in Eurer Anlage drehen. Der n&#228;chste wichtige Punkt: 
20 Mark!!! Zahlt ja nicht mehr f&#252;r die CD, als Ihr m&#252;&#223;t! Es macht mich krank, 
wieviel mehr Geld die Musikindustrie den Fans als n&#246;tig aus der Tasche 
zieht!!!</I></P>

 <p>Nicht nur ein sehr guter Musiker mit einer tollen Metal-Scheibe im 
Gep&#228;ck, sondern auch ein offener Mensch, der aus seinen Ansichten keine 
M&#246;rdergrube macht und zudem mit vielen interessanten Gespr&#228;chsthemen und guten 
Ideen aufwartet. </P>


<p>Interview: Eva Marie Uebelhack</P>


<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
