<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,interview,supreme majesty">
<title>Interview: Supreme Majesty</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="blue">Interview: Supreme Majesty</Font></center></h1></P>
<p>Mit Supreme Majesty ist die melodische Metal-Szene wieder um eine Hoffnung 
reicher. Mit ihrer Mixtur aus manchen Pretty Maids-Anleihen und dezenten 
bombastischen Elementen reihen sich die jungen Skandinavier zudem auch nicht 
einfach in der Serie gesichtsloser Acts ein, die einer wieder andere klingen. 
Noch bevor ich au&#223;er &quot;Hallo&quot; was anderes in den Telefonh&#246;rer texten kann, 
blubbert Basser Daniel Andersson auch schon drauf los:</P> 

<p><i>Ich m&#246;chte gleich mal 
alle Leute einladen, auf unsere Homepage zu gucken: www.suprememajesty.com   . 
Dort befinden sich unter anderem auch diverse Soundfiles, auch falls sich 
jemand nach Lesen der Reviews nicht ganz schl&#252;ssig ist. Diese St&#252;cke beinhalten 
nicht nur aktuelles Material, sondern auch Songs unserer ersten Mini-CD, die 
man au&#223;erhalb von Schweden kaum mehr bekommen kann. Ich hab selbst grad noch 
mal eine Kopie. Unser damaliges Label Loud`n Proud ging pleite.... tja, 
insofern wird das Scheibchen nicht mehr nachgepre&#223;t.</I></P>

<p>In diesem Bankrott sieht 
Daniel aber auch einen gro&#223;en Vorteil f&#252;r die Band.</P> 

<p><i>Dadurch hatten wir auch 
die Chance, an ein anderes Label zu kommen, und mit Massacre und dem, was nun 
f&#252;r *Tales Of A Tragic Kingdom* passiert, sind wir total gl&#252;cklich. Man mu&#223; die 
Aufmerksamkeit der Leute auf sich lenken. </I></P>

<p>Leider besteht so gut wie keine 
M&#246;glichkeit mehr, von der Homepage der Band abgesehen, das neue Material mit 
den &#228;lteren Sachen zu vergleichen. Aber das erledigt an dieser Stelle eben 
Daniel schnell.</P> 

<p><i>&quot;Tales...&quot; ist schlicht in jeder Hinsicht besser: Das 
Songwriting, die Umsetzung aber auch die Produktion. All diese Aspekte sind 
gleich wichtig, wenn eine Platte unterm Strich passen soll. Der Vergleich mit 
manchen Elementen von Pretty Maids ist gar nicht so weit hergeholt, es ist 
sicher eine Combo, die uns beeinflu&#223;t hat. Allerdings wollten wir auch gewisse 
Trademarks der &#180;80er Hardrockszene weiterf&#252;hren. Europe zum Beispiel. Das alles 
sollte einen Mix aus Heavy Metal, `80er-Elementen und eigenem Kopf werden. Eine 
Art &quot;New meets Old&quot;. Es wurden schon einige Stimmen laut, die uns mit Pretty 
Maids vergleichen, doch hat uns noch niemand als Kopie bezeichnet. Es fielen 
lediglich Aussagen wie da&#223; wir manche &#196;hnlichkeiten bez&#252;glich der Dynamik 
h&#228;tten.</I></P> 

<p>Die Operation, aus bekannten S&#228;chelchen etwas Neues zu kreiern, war 
also erfolgreich. Und ein Vergleich mit Ronny Atkins und Ken Hammer ist sicher 
nicht das Schlechteste.</P> 

<p><i>Es standen noch einige Ideen mehr im Raum, die 
allerdings, gesamt gesehen, nicht so recht zu Supreme Majesty gepa&#223;t h&#228;tten. 
Wir nehmen unsere Ideen immer gleich auf und zu Hause ziehen wir uns dann die 
Tapes rein. So merkt man doch relativ schnell, ob etwas zur Band pa&#223;t, oder 
nicht. Und die Parts, die uns nicht vom Hocker rei&#223;en, werden dann eben 
ausgetauscht. Mich w&#252;rde es freuen, wenn sich die Hardrock- und die Metal-Szene 
noch ein St&#252;ckchen n&#228;her kommen w&#252;rden. Man kann aus beiden Richtungen Elemente 
einf&#252;gen. Zum Beispiel Double-Bass: Wir haben es lediglich verwendet, um die 
Dynamik der Songs an manchen Stellen zu steigern. Ich finde, man mu&#223; nicht den 
ganzen Track hindurch poltern. </I></P>

<p>Wie war. Davon kann vor allem unser Markus ein 
Lied singen, der bei anhaltenden Passagen dieser Richtung eiskalt die Flucht 
ergreift. So hat jeder seine Vorlieben. Auf die Frage, welches bisher die 
wichtigste Station f&#252;r die Supreme Majesty war, nennt Daniel vor allem S&#228;nger 
Joakim Olson. </P>

<P><I>Wir dachten uns nach dem Weggang von Rickard Larsson wirklich 
nicht, einen geeigneten Mann in der n&#228;heren Umgebung finden zu k&#246;nnen. Einen, 
der bereits vorhandenes Material entsprechend auf die Kette bekommt, aber auch 
eine eigene Note hat. Aber es hat sich doch alles sehr schnell und einfach 
ergeben.</I></P>

<p>So manchen d&#252;rfte es recht schwer fallen, einen richtigen H&#246;hepunkt 
aus der Platte zu filtern, also einen Song, der meilenweit &#252;ber allen anderen 
steht. Daf&#252;r ist die Scheibe in ihrer Gesamtheit einfach zu gut.</P>

<p><i>Mir selbst 
gefallen auch alle Songs auf der Scheibe</i> (W&#228;re ja auch schlimm, wenn nicht - Anmerkung von Kilian Servais),<i> <b>Let It Go</B> ist aber schon einer 
meiner Faves. Man sollte nicht mit einem St&#252;ck ins Studio zum Aufnehmen 
latschen, wenn einem der Track eigentlich gar nicht gef&#228;llt. Was die Band 
betrifft, herrscht bei uns allerdings das Mehrheitsprinzip: Wenn alle auf eine 
Nummer stehen und nur einer sich nicht damit anfreunden kann, wird das Teil 
trotzdem gespielt. Das funktioniert sehr gut und nat&#252;rlich diskutieren wir 
solche Sachlagen auch vorher. Manchmal geht es einem als Musiker genauso wie 
manchmal als H&#246;rer: Zu Beginn mag man einen Song oder einen Part nicht und nach 
gewisser Zeit freundet man sich damit an oder fri&#223;t einen richtigen Narren 
dran.</I></P>

<p>Interview: Eva Marie Uebelhack</P>





<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
