<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA9.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA11.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>10. AMIGA ver&ouml;ffentlicht Technologiepapier zum AmigaNG</H2>
<P>
Hier zun&auml;chst ein paar einleitende Worte von Jim Collas an die Amiga-
Gemeinde:
</P>
<P>
&raquo;16. Juli 1999
</P>
<P>
Liebe Amigianer,
</P>
<P>
Die n&auml;chste Computer-Revolution zeichnet sich am Horizont ab. Es ist eine
Revolution, welche die volle Power von Computern f&uuml;r die Massen entfesseln
und endlich die Versprechen des Informationszeitalters erf&uuml;llen wird. Sie
wird eine neue Klasse von Rechnern erschaffen, welche Power und einfache
Handhabung kombinieren, um Computer und das Internet zu einem nat&uuml;rlichen
Teil des allt&auml;glichen Lebens zu machen. Sie werden aufregend genug f&uuml;r den
Enthusiasten und gleichzeitig einfach genug f&uuml;r den einfachen Anwender
sein. Sie werden in einer hochintegrierten Arbeitsumgebung, die das Heim,
das Gesch&auml;ft und per Internet die ganze Welt umspannt, nahtlos
zusammenarbeiten, Das ist die Zukunft des Computers und der Grund, warum
wir nicht einfach nur eine alternative Computerplattform entwickeln k&ouml;nnen.
Schnellere Prozessoren und Grafik alleine f&uuml;hren nicht zu einer
revolution&auml;r neuen Computerplattform. Diese sind wichtig, aber nicht
revolution&auml;r. Revolution&auml;res Denken verlangt von uns, alte Einstellungen zu
verlassen uns eine Zukunft vorzustellen, welche zur Zeit noch nicht
existiert. Es verlangt von uns, Technologien und Funktionen zu entwickeln,
welche diese Zukunfts- Vision erm&ouml;glichen. Das ist der Geist von
revolution&auml;rer Innovation. Der selbe Geist, welcher das urspr&uuml;ngliche
Amiga-Entwicklungsteam antrieb.
</P>
<P>
Wir ben&ouml;tigen die Unterst&uuml;tzung der Amiga-Gemeinde, um die Revolution
voranzutreiben. Die Amiga-Gemeinde ist eine der heroischsten,
leidenschaftlichsten und innovativsten Gemeinschaften, welche der
Computerindustrie verblieben ist. Wir brauchen diese Eigenschaften, um
Erfolg zu haben, weil wir ein ehrgeiziges Ziel verfolgen. Wie die
heldenhaften Forscher vergangener Tage, k&ouml;nnen wir keinen neuen Kontinent
entdecken, ohne die das Alte auf lange Sicht aus den Augen zu verlieren.
Dieses bereitet manchen Leuten sehr viel Unbehagen und macht sie besorgt,
aber es ist eine Voraussetzung f&uuml;r Entdeckung und Innovation. Einige von
Ihnen werden sich gen&ouml;tigt f&uuml;hlen, von Bord zu springen und zu den
vertrauten K&uuml;sten zu schwimmen, bevor wir au&szlig;er Sicht segeln. Die meisten
von Ihnen werden aber bleiben, aus Begeisterung f&uuml;r die Reise und den Lohn
der Entdeckung. F&uuml;r diejenigen von Ihnen, die an Bord bleiben: Schlie&szlig;en
Sie die Luken und bereiten Sie sich f&uuml;r die Zukunft vor.
</P>
<P>
Bevor Sie die Technologie-Einweisung lesen, gibt es ein paar Konzepte,
welche Ihnen helfen werden, es aus dem richtigen Blickwinkel zu sehen.
Eines ist die Sicht der Amiga Arbeitsumgebung (Amiga Operating Environment
OE) von einer hohen Stufe. Anstatt an einen einzelnen Computer mit Hardware
und Betriebssystem zu denken, m&ouml;chte ich, da&szlig; Sie sich mehrere
Rechenger&auml;te, zusammengef&uuml;hrt in einem einzigen gro&szlig;en virtuellen Computer,
und eine Arbeitsumgebung oder OE vorstellen, welche diesen &quot;virtuellen&quot;
Computer betreibt. Das OE beinhaltet das OS f&uuml;r ein einzelnes Ger&auml;t, aber
es betreibt auch den ganzen virtuellen Computer, welcher aus mehreren
vernetzten Ger&auml;ten besteht. Jedes verbundene Ger&auml;t ist sowohl ein Baustein,
als auch ein Fenster in diese Rechnerumgebung.
</P>
<P>
Das andere Konzept, das es zu verstehen gilt, ist AmigaObject (TM).
AmigaObject ist eine leistungsf&auml;hige Software-Struktur, welche zum Zugriff
auf Rechenfunktionen und -f&auml;higkeiten verwendet wird. AmigaObjects sind die
Hauptstrukturen zur Erg&auml;nzung des Amiga OE. Sie erm&ouml;glichen die einfache
Einbindung von Technologien wie verteilten Berechnungen (distributed
computing), Hochgeschwindigkeits-Netzwerktransaktionen und der
Kommunikation zwischen Anwendungen innerhalb des OE. Sie sind
leistungsf&auml;hige Software-Bausteine, welche es anderen erm&ouml;glichen, schnell
beeindruckende Anwendungen zu erstellen. AmigaObjects sind portier- und
&uuml;bertragbar zwischen Plattformen, was ihnen erlaubt sich durch das Netzwerk
oder Internet zu verbreiten. Da AmigaObjects durch das Internet
transportierbar und erreichbar sind, kann man das Amiga OE einfach durch
das Internet ausdehnen. Dieses wird kritisch, wenn in Zukunft
Breitband-Internetzugang mehr verbreitet wird. AmigaObjects sind erweiterte
Java- und Jini-Technologie, jedoch speziell optimiert f&uuml;r die Erweiterung
des Amiga OE. Die AmigaObjetcs werden es uns erlauben, unsere revolution&auml;re
Computer-Plattform zu bauen.
</P>
<P>
Die angef&uuml;gte Technologie-Einweisung liefert Ihnen mehr Einzelheiten des NG
Amigas. Bevor Sie diese lesen, mu&szlig; ich deutlich betonen, da&szlig; wir einige der
strategischsten Teile unserer Vision und Technologie nicht ver&ouml;ffentlicht
haben. Die Vorstellung, wie unsere Technologie die Kraft der zuk&uuml;nftigen
Computerei entfesselt, ist umwerfend. Ungl&uuml;cklicherweise w&uuml;rde die
Ver&ouml;ffentlichung unserer kompletten Vision unseren Wettbewerbsvorteil und
gesch&auml;ftlichen Erfolg aufs Spiel setzen, insbesondere, wenn wir diese
Informationen auf unserer Website ver&ouml;ffentlichen w&uuml;rden. Ich hoffe, Sie
haben Verst&auml;ndnis daf&uuml;r, wie wichtig es f&uuml;r uns ist, gewisse strategische
Informationen unseren Wettbewerbern vorzuenthalten. Ich kann nur sagen, da&szlig;
alle der wenigen Leute, welche die gesamte Vision gesehen haben, extrem
beeindruckt waren. Es ist umwerfend und wird die Zukunft der Computerei
vorantreiben. Ich freue mich darauf, mehr strategische Details der Vision
in den kommenden Monaten mit Ihnen zu teilen, beginnend mit der WoA und der
AmiWest.
</P>
<P>
Sincerely,
</P>
<P>
Jim Collas<BR>
President, Amiga&laquo;<BR>
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Hendrik H&ouml;ner, wurde f&uuml;r das
Projekt AIDA (<A HREF="http://www.amiga-club.de/aida/0049.html" TARGET="_TOP">http://www.amiga-club.de/aida/0049.html</A>) vorgenommen und uns
freundlicherweise zur Verf&uuml;gung gestellt.
(Quelle des Originals: AMIGAs
</P>
<P>
Die folgende &Uuml;bersetzung des AmigaNG-Technologiepapiers stammt von Erich
Seifert (<A HREF="mailto:Erich.Seifert@dachau.baynet.de">Erich.Seifert@dachau.baynet.de</A>) und wurde uns freundlicherweise
von ihm zur Verf&uuml;gung gestellt:
</P>
<P>
&raquo;Bitte lesen Sie zuerst Jim Collas' Brief zur Technologie-Einweisung.
</P>
<P>
Amiga Produkt-/Technologie-Einweisung
</P>
16. July 1999
<P>
Einleitung
</P>
<P>
Die Vision und Mission von Amiga ist es, Computer und das Internet zu einem
nat&uuml;rlichen Teil des Alltags zu machen, indem wir eine, auf den
Industrie-Standards basierende Arbeitsumgebung (Arbeitsumgebung) f&uuml;r
heutige und zuk&uuml;nftige Consumer-Computing-Ger&auml;te schaffen, die eine gro&szlig;e
Bandbreite von innovativen Internet-Angeboten erm&ouml;glicht. Wir benutzen den
Ausdruck &quot;Arbeitsumgebung&quot; absichtlich, da diese Software-Infrastruktur das
traditionelle Betriebssystem dahingehend erweitert, dass es eine
Host-Umgebung f&uuml;r eine neue Art von portablen Anwendungen schafft -
Anwendungen die in einer durchgehend vernetzten Computing-Umgebung
existieren, und transparenten Zugang zu Internet-Inhalten und -Angeboten
bieten. Grundlegend kann man sagen, dass eine neue Art von verteilter Home
Computing-Umgebung definieren, welche eine Benutzer-Erfahrung erm&ouml;glicht,
die sehr viel zug&auml;nglicher ist als die der heutigen Personal Computer.
Diese Umgebung wird Personal Computer, Informations-Ger&auml;te, Set-top Boxen,
Multimedia Convergence Computer und Spielekonsolen und eine Vielzahl von
Ger&auml;ten zusammenf&uuml;hren, um die n&auml;chste Phase der Computer-Evolution
(Revolution!) einzul&auml;uten.
</P>
<P>
Unter den Produkten die gerade bei Amiga entwickelt werden befinden sich:
</P>
<UL>
<LI> Amiga Arbeitsumgebung (Amiga OE) - eine verteilte
     Software-Architektur, die traditionelle Betriebssysteme dahingehend
     erweitert, dass sie eine gro&szlig;e Biedienfreundlichkeit, durchgehende
     Vernetzung und ein System f&uuml;r portable Anwendungen bietet, die
     transparent auf Internet-Inhalte und -Angebote zugreifen k&ouml;nnen. Eine
     Untermenge des Amiga OE - die Amiga Informationsger&auml;te-Umgebung
     (Information Appliance Environment, Anm. des &Uuml;b.) - ist auf eine
     Veilzahl von Rechnern und Infomrationsger&auml;ten portierbar.
</LI>
<BR><LI> Amiga Multimedia Convergence Computer (Amiga MCC) - eine
     Hardware-/Software-Plattform, die speziell daf&uuml;r entworfen wurde, um
     mehrere Merkmale in sich zu vereinen: eine au&szlig;ergew&ouml;hnlich hohe
     Performance im Multimedia-Bereich, eine neue Ebene der
     Benutzerfreundlichkeit, transparenten Zugang zum Internet und mittels
     Heim-Vernetzung, Zugriff auf eine wachsende Anzahl Amiga-kompatibler
     Ger&auml;te rund um die Wohnung. Der Amiga MCC wird in zwei Versionen
     vertrieben werden: ein integrierter Multimedia Convergence Computer
     und ein Standard-ATX-Motherboard. Beide bieten die Amiga OE, ein
     zugrundeliegendes Betreibssystem und Unterst&uuml;tzung f&uuml;r digitale
     Videos/DVD, 3D-Grafik, Surround Sound, und aufkommende Breitband- und
     Home Networking-Standards. Der Amiga MCC ist sowohl dazu vorgesehen
     als eine gro&szlig;artige Plattform f&uuml;r Multimedia-Anwendungen, wie
     beispielsweise 3D-Spiele und der Integration von digitalem Video, als
     auch als das Herzst&uuml;ck einer verteilten Home Computing-Umgebung der
     n&auml;chsten Generation zu dienen.
</LI>
</UL>
<P>
Technologie-Philosophie und &Uuml;berblick
</P>
<P>
Amigas langfristiger Gesch&auml;ftserfolg verlangt eine Kombination von
Technologie-Innovation und Technologie-Integration. Um unsere Kr&auml;fte auf
Technologie zu konzentrieren, die der Amiga Arbeitsumgebung einen
einzigartigen Stellenwert verleiht integrieren wir vorhandene
Technologie-Komponenten, wie beispielsweise CPUs der n&auml;chsten Generation,
Micro-Kernel Betriebssysteme, Grafik- und GUI-Bibliotheken und -Systeme,
Chips&auml;tze f&uuml;r Grafik/Video/Kommunikation, verkabelte und kabellose
Subsysteme f&uuml;r die Heimvernetzung und objekt-basierte
Entwicklungsumgebungen. Dienstleistungstechnologien (value-added
technologies) beinhalten: Benutzer-Interaktions-Paradigmen, die weitaus
einfacher und sehr viel intelligenter sind als die der heutigen Personal
Computer; ein &quot;virtuelles Ger&auml;temodell&quot;, das es Software-Anwendungen sehr
einfach erm&ouml;glicht zwischen unterschiedlichen Hardware-Konfigurationen hin-
und herzuwandern; Unterst&uuml;tzung f&uuml;r durchgehende und transparente
Vernetzung und Internet-Anbindung; und die zugrundeliegende
AmigaObject-Architektur, &uuml;ber welche alle genannten Technologien
implementiert und zug&auml;nglich macht.
</P>
<P>
Diese kurze Technologie-Einf&uuml;hrung ist dazu gedacht, einen &Uuml;berblick auf
sehr hoher Ebene &uuml;ber die Entwicklungsrichtung und die Wahl der Technologie
die von Amiga getroffen wurde zu geben. Sie wird dar&uuml;berhinaus
unterst&uuml;tzend durch mehrere tiefergehende Whitepapers und
Produktbeschreibungen erg&auml;nzt werden, sobald die neuen Amiga-Produkte auf
dem Markt erh&auml;ltlich sind. In diesem Dokument, m&ouml;chten wir einen kurzen
&Uuml;berblick &uuml;ber folgende Themen geben:
</P>
<UL>
<LI> AmigaObjects und die Amiga Arbeitsumgebung
</LI>
<BR><LI> Das Amiga MCC-Betriebssystem
</LI>
<BR><LI> Grafik-, Multimedia- und GUI-Systeme
</LI>
<BR><LI> Durchgehende Vernetzung
</LI>
<BR><LI> Software-BlockDiagramm
</LI>
<BR><LI> Hardware-Architektur des Amiga MCC
</LI>
<BR><LI> Entwicklungswerkzeuge und Anwendungen
</LI>
</UL>
<P>
AmigaObjectsTM und die Amiga Arbeitsumgebung
</P>
<P>
Die AmigaObjectsTM sind die Basis auf der alle Dienste der Amiga
Arbeitsumgebung aufbauen. AmigaObjects bieten m&auml;chtige
Komponenten-Baubl&ouml;cke, die es Entwicklern erlauben, schnell eindrucksvolle
und m&auml;chtige Anwendungen f&uuml;r den Amiga zu schaffen. AmigaObjects
erm&ouml;glichen zudem die Integration einer gro&szlig;en Vielfalt von
unterschiedlichsten Technologien unter einem Hut. Vernetzung ist ein
essentieller Bestandteil der AmigaObjects; was bedeutet, dass AmigaObjects
sich frei im Netzwerk bewegen k&ouml;nnen oder Netzwerkdienste benutzen k&ouml;nnen.
Die AmigaObject-Architektur erm&ouml;glicht dank dieser Flexibilit&auml;t eine neue
Art von &quot;netz-bewu&szlig;ten&quot; Anwendungen bei denen es keine klare Grenze
zwischen einem Ger&auml;t und dem Netzwerk gibt.
</P>
<P>
Wir haben Java (TM Sun Microsystems) als unsere Haupt-Programmiersprache
f&uuml;r portable, AmigaObjects-basierte Anwendungen ausgew&auml;hlt (nat&uuml;rlich
werden C und C++ f&uuml;r reine MMC-Anwendungen unterst&uuml;tzt werden). Mit
Java-Technologien wie kJava, pJava, Java2 und Java Enterprise Edition, kann
die AmigaObject-Technologie in Ger&auml;te so klein wie hand-held Computer
eingebettet und bis hin zu gro&szlig;en Servern skaliert werden. Dies ist ein
wirklich revolution&auml;rer Ansatz f&uuml;r das Arbeiten mit Computern; ein Ansatz,
der - wie wir glauben - das Angesicht des Computerns ver&auml;ndern wird.
</P>
<P>
Die AmigaObject-Technologie dient als Grundlage f&uuml;r alle Objekte in der
Amiga Arbeitsumgebung. Die M&auml;chtigkeit und Flexibilit&auml;t des AmigaObjects
&uuml;bertr&auml;gt sich nat&uuml;rlich auf alle anderen Objekte in der Umgebung und gibt
somit allen Objekten im System Netzwerk-Transparenz und die F&auml;higkeit sich
im Netzwerk zu verteilen.
</P>
<P>
Wie bereits oben erw&auml;hnt integrieren AmigaObjects auch andere Technologien
in unser System. Besonders extensiven Gebrauch machen wir davon bei
Technologien von Drittanbietern wo es angemessen ist. Als Beispiele kann
man Java, Jini, OpenGL und mehere Audio- und Video-Codecs nennen. Dies
bef&auml;higt Amiga seine Entwicklungs-Anstrengungen auf die AmigaObjects und
die Arbeitsumgebung zu konzentrieren und weniger darauf Technologien zu
schaffen, die bereits existieren.
</P>
<P>
Das Amiga MCC Betriebssystem
</P>
<P>
Eine unserer &Uuml;berzeugungen ist, dass moderne Betriebssysteme nur eine
Komponente im neuen Zeitalter des Computings darstellen. Die
Wertangelegenheit ist nicht l&auml;nger nur das traditionelle OS, sondern eine
weitreichende Umgebung, die intelligente F&auml;higkeiten und transparente
Dienste f&uuml;r den Endbenutzer bietet. W&auml;hrend der Teil der
Informationsger&auml;te-Technologie an der Amiga Arbeitsumgebung portabel ist
und w&auml;hrend der Zeit auf eine Vielzahl von Betreibssystemen von Amiga und
seinen OEM-Partnern portiert werden wird, mussten wir eine grundlegende
Entscheidung bez&uuml;glich des OS f&uuml;r den Amiga MCC treffen.
</P>
<P>
Es gibt eine Vielzahl von interesanten M&ouml;glichkeiten f&uuml;r die Auswahl des OS
auf dem Markt und man kann sagen, dass wir uns alle angesehen und
analysiert haben. Von traditionellen RTOS-Anbietern wie Wind River und QNX,
&uuml;ber BeOS von Be Systems, &uuml;ber Sun's JavaOS das auf Chorus basiert, bis zu
Linux. Wie bereits fr&uuml;her angek&uuml;ndigt, arbeiteten wir einige Monate lang
mit QNX Software Systems zusammen, um das QNX RTOS auf die Anforderungen,
die ein Multimedia Convergence Computer der n&auml;chsten Generation mit sich
bringt anzupassen. the QNX RTOS to the needs of a next-generation
multimedia convergence computer. Zur selben Zeit arbeiteten wir auch mit
wichtigen Mitgliedern der Linux-Gemeinde zusammmen, um die Vor- und
Nachteile von Linux zu er&ouml;rtern. Als wir uns daran machten einen
erfolgreichen Gesch&auml;ftsplan aufzustellen, wurde uns klar, dass mehr und
mehr unserer Technologie-Partner und Software-Anbieter uns baten uns darauf
zu konzentrieren Linux als OS-Kernel zu benutzen. W&auml;hrend wir von einigen
Elementen in der Technologie von QNX beeindruckt waren (ebenfalls von BeOS
und Chorus), f&uuml;hlten wir, dass es schwierig sein w&uuml;rde mit einem
propriet&auml;ren Betriebssystem die breite Unterst&uuml;tzung der Industrie zu
erhalten, die jedoch gebraucht wird, um &uuml;ber die kommenden Jahre hinweg
erfolgreich zu sein.
</P>
<P>
Linux hat seit letztem Jahr im Markt als konkurrenzf&auml;hige, offene
Alternative zu Windows stetigen Auftrieb erhalten. W&auml;hrend des letzten
Jahres, hat sich die Zahl der Linux-Nutzer mehr als verdreifacht und sowohl
gro&szlig;e Anbieter als auch aufstrebende Unternehmen benutzen Linux als
Grundlage f&uuml;r Ihre Betriebssysteme. Das wachsende Engagement um
Linux-Anwendungen von einer Reihe von of Software-Anbietern und die
voranschreitende Entwicklung und Verf&uuml;gbarkeit von Linux-Ger&auml;tetreibern
durch Hardware- und Peripherie-Lieferanten, machen es zu einer
&uuml;berzeugenden Wahl. Dar&uuml;berhinaus entdeckten wir bei der Portierung unserer
&quot;Higher Level&quot;-Arbeitsumgebung und AmigaObject-Architektur nach Linux
deutliche Geschwindigkeitsvorteile im Linux-Kernel in Bereichen wie etwa
dem Aufrufen verteilter Objekte. Weiterhin, was kein zu untersch&auml;tzender
Vorteil ist, ist Linux das wahrscheinlich stabilste Betriebssystem, das auf
dem Markt verf&uuml;gbar ist.
</P>
<P>
Wegen all dieser Gr&uuml;nde haben wir uns entschlossen, die Amiga MCC-Plattform
der n&auml;chsten Generation auf einer Linux-OS-Basis aufzubauen. Wir w&auml;ren
nachl&auml;ssig wenn wir nicht zug&auml;ben, dass es Probleme in Linux gibt, die es
zu &uuml;berwinden gilt, wie auch in allen anderen zur Wahl stehenden
Betriebssystemen, die wir getestet haben. Zum Beispiel gab es Sorgen
bez&uuml;glich der TCP/IP-Performance, die gerade gel&ouml;st werden, sowie Sorgen
wegen des ben&ouml;tigten Speicherausma&szlig;es. Wie jeder wei&szlig; der sich schon einmal
mit Linux besch&auml;ftigt hat, ist das Gesamtsystem ziemlich gro&szlig;. Wenn wir
jedoch unsere OS-Basis schaffen, werden wir Linux so erweitern das es
unseren Anforderungen gen&uuml;gt und wir sind bereits jetzt zuversichtlich das
die Speicheranforderungen (sowohl auf Datentr&auml;gern als auch im RAM, Anm. d.
&Uuml;b.) relativ vern&uuml;nftig sein werden (Linux wird vermehrt in den
unterschiedlichsten Informationsger&auml;ten eingesetzt und es gibt sogar eine
Version von Linux die auf dem Palm Pilot l&auml;uft!). Daneben gibt es eine
Reihe anderer Performance-Probleme mit Linux, die wir gerade anpacken - wie
auch im Original-Amiga, schaffen wir eine enge Verbindung zwischen dem OS
kernel zu einer spezialisierten, sehr leistungsf&auml;higen Hardware-Architektur
was viele der Sorgen die wir und die Amiga-Gemeinde mit existierenden
Linux-Implementationen l&ouml;st. Der Aufschwung den Linux zur Zeit erh&auml;lt und
die Tatsache, dass Resourcen auf der ganzen Welt damit besch&auml;ftigt sind,
bestimmte Dinge zu l&ouml;sen, gibt uns Zuversicht, dass diese Entscheidung sich
letztendlich als die richtige herausstellen wird.
</P>
<P>
Grafik-, Multimedia- und GUI-Systeme
</P>
<P>
Die Technologie-Strategie f&uuml;r die Graphik bedeutet auch vermehrt wichtige
Partnerschaften mit Firmen die zur Zeit state-of-the-art Komponenten
produzieren. Amiga sch&ouml;pft die Entwicklungserfolge dieser Organisationen
aus, um die Leistungsf&auml;higkeit der Produkte an Amiga-K&auml;ufer weiterzugeben.
Zum Beispiel arbeitet Amiga mit ATI zusammen, um 3D-Rendering-Technologie
in den MCC (siehe auch Abschnitt &uuml;ber die Hardware-Architektur) zu
integrieren.
</P>
<P>
Die weitverbreitete Akzeptanz und das aufstrebende Moment von OpenGL machen
es zur soliden Wahl, um es einem 3D-API zu erm&ouml;glichen die
Renderig-Leistung der Hardware auszureizen. Zudem haben die neusten
Versionen von Java 2 erweiterte F&auml;higkeiten zur Manipulation von 3D-Szenen,
zum Advanced Imaging und zur weitreichenden Koordination von Medien.
AmigaObjects werden zur Zeit entwickelt, um Benutzern ger&auml;teunabh&auml;ngige
Kontrolle dieser verschiedenen Medien mittels Java-Objekten zu geben,
welche wiederum eine Hardware-Beschleunigung der Grafik durch OpenGL wo
immer m&ouml;glich oder erforderlich gestatten. Wenn man &uuml;ber den Zugriff von
AmigaObjects oder Java auf Hardware-beschleunigte APIs, wie OpenGL spricht,
ist es wichtig zu verstehen, dass gro&szlig;er Wert darauf gelegt wurde, um zu
gew&auml;hrleisten, dass die Software auf der Benutzerebene ihnen beim Zugriff
auf die Hardware nicht in die &quot;Quere ger&auml;t&quot;. Wie beim urspr&uuml;nglichen Amiga
ist es die enge Integration von Software und Hardware, die eine hohe
Performance des gesamten Systems bietet.
</P>
<P>
Die Technologie-Strategy f&uuml;r Multimedia ist ebenso ma&szlig;geblich wie die f&uuml;r
die Grafik. Das Hardware-System, das Digitales Multimedia liefert kann eine
3D-Grafik-Engine, ein DVD-Decoder inklusive eines MPEG 2 und AC-3 Digital
Surround Sounds oder Breitband-Internet sein. F&uuml;r eine Komplettl&ouml;sung muss
die benutzte Hardware leistungsf&auml;hig genug sein, um gleichzeitig sowohl
Audio- und Video-Streams aufzuzeichnen als auch abzuspielen. Um dies zu
erreichen baut Amiga Partnerschaften mit den f&uuml;hrenden Hardware-Herstellern
dieser Technologien auf. AmigaObjects werden zur Zeit entwickelt, um
Entwicklern Ger&auml;te-unabh&auml;ngige Kontrolle durch Java zu erm&ouml;glichen. Die
Java-basierten AmigaObjects rufen Methoden auf, um Zugriff auf spezielle
Hardware-Unterst&uuml;tzung und -Beschleunigung entsprechenden Grades zu
erhalten. In F&auml;llen in denen keine weithin akzeptierten APIs bestehen, wie
bei OpenGL, schreiben Amiga und seine Partner eine Vielzahl dieser Methoden
in nativem Code soweit n&ouml;tig. Wie auch bei 3D bietet eine enge Integration
von Soft- und Hardware au&szlig;ergew&ouml;hnliche Unterst&uuml;tzung f&uuml;r Streaming-Medien.
</P>
<P>
Der Informationsger&auml;te-Teil der Amiga Arbeitsumgebung wird auf einem
breiten Feld von Ger&auml;ten eingesetzt werden und es kann von gro&szlig;en
Abweichungen bei interaktiven Natur dieser Ger&auml;te ausgegangen werden. Es
w&auml;re dumm zu versuchen eine einzige Oberfl&auml;che f&uuml;r ein Palm-gro&szlig;es Ger&auml;t
mit einem kleinen, druckempfindlichen, Graustufen-Display und einer relativ
langsamen kabellosen Netzwerkverbindung zu entwerfen; f&uuml;r eine Set-top Box
mit Fernbedienung und Fernseh-Display; und f&uuml;r einen herk&ouml;mmlichen
Multimedia-Desktop-Computer mit voller Tastatur, Maus, hochaufl&ouml;sendem
Monitor und breitbandigem Netzwerk - es ist zweifelhaft, dass nur ein
einziges Design die Bed&uuml;rfnisse von den Benutzern all dieser Ger&auml;te
befriedigen k&ouml;nnte. Stattdessen implementieren wir eine Design-Umgebung,
die ein klares Gef&uuml;hl f&uuml;r die Konsistenz bei der Interaktion zwischen
Ger&auml;ten sichern wird, w&auml;hrend sie die physikalischen Grenzen des Ger&auml;ts
ber&uuml;cksichtigt auf dem eine spezielle Oberfl&auml;che erscheint. Ebenso werden
wir die Anstrengungen minimieren, die Entwickler auf sich nehmen m&uuml;ssen, um
virtuelle Ger&auml;te (Appliances) zu erstellen, welche in der Lage sind auf
einer Vielzahl von Produkten zu laufen.
</P>
<P>
Im Hinblick auf fensterorientierte Umgebungen auf dem Amiga MCC benutzen
wir eine Kombination aus Technologien von Linux und Java. Auf der untersten
Ebene (Verwaltung der Bits auf dem Bildschirm) benutzen wir das neueste
Linux X Windows Fenster-System. Die meisten Benutzer und Entwickler werden
X Windows selbst nie wahrnehmen (anders als bei &auml;lteren UNIX-Systemen, als
X Windows etwas l&auml;stiges war). Die Verwendung von X Windows jedoch wird es
sowohl neuen Anwendungen und Standard-Linux-Anwendungen erlauben
st&ouml;rungsfrei nebeneinander auf dem MCC zu laufen. Auf X Windows aufsetzend
existiert eine wachsende Zahl von Window Managern, die auf dem MCC
verf&uuml;gbar sein werden und Java-Entwickler werden auf die portierbaren Java
Swing GUI-Klassen Zugriff haben, die die zugrundeliegende Komplexit&auml;t unter
einem modernen Programmiermodell verstecken. Schlie&szlig;lich, wird es eine
Reihe von Endbenutzer-Arbeitspl&auml;tzen geben, inklusive einer neuen Amiga
Workbench, die bei Amiga entworfen wird. Es stehen bereits eine Reihe
interessanter Desktop-Umgebungen f&uuml;r Linux zur Verf&uuml;gung und wir
beabsichtigen die Amiga Workbench der Open Source-Bewegung beizusteuern und
die kreativen Amiga- und Linux-Gemeinden dazu zu ermutigen, sie zu
ver&auml;ndern, zu verbessern, zu ersetzen und ganz allgemein kreativ zu werden
wenn es um Desktop-Umgebungen der n&auml;chsten Generation geht (wir galuben,
dass einer der Nachteile der heutigen Windows- und
Macintosh-Personal-Computer die &quot;geschlossene&quot; Natur ihrer
Desktop-Umgebungen ist).
</P>
<P>
Durchgehende Vernetzung
</P>
<P>
Die nahe Zukunft wird vermehrt breitbandige
Hochgeschwindigkeits-Internet-Angebote via Kabel-Modems, xDLS und anderen
neuen Technologien in unsere Haushalte bringen. Indem die Industrie
Technologien f&uuml;r die hemische Vernetzung standardisiert, gibt sie den
Verbrauchern die M&ouml;glichkeit Produkte &uuml;ber die gesmate Wohnung hinweg durch
Standard-Hauskabel und kabellose digitale
Hochgeschwindigkeits-Schnittstellen zu verbinden.
</P>
<P>
Amiga-f&auml;hige Produkte werden diese Standards unterst&uuml;rtzen und nahtlos
untereinander verbunden werden w&auml;hrend sie das gesamte Haus durch unsere
verteilte Objekt-Technologie bereichern. Wir integrieren aufkommende
Standards, wie HomePNA von Broadcom/Epigram in die Amiga Arbeitsumgebung,
das herk&ouml;mmliche Telefonleitungen in nordamerikanischen H&auml;usern benutzt.
Ebenso werden mehrere Initiativen in Europa und Asien verfolgt, die
fortlaufend beobachtet werden. Wir untersuchen auch die Technologien der
Spitzenreiter f&uuml;r digitale kabellose Netzwerke f&uuml;r die heimische
Vernetzung. Die meisten Regionen der Welt werden sich auf einen Standard
bei 2.4Ghz f&uuml;r digitale kabellose Netzwerke einigen, wie den von Proxim's,
die wir unterst&uuml;tzen werden sobald sie von der Industrie angenommen wurden.
Mit der neuen Amiga Objekttechnologie und der Integration dieser Standards,
wird der Haushalt &quot;der Computer&quot; werden, einschlie&szlig;lich einer nahtlosen
Hochgeschwindigkeits-Verbindung zum Internet.
</P>
<P>
Mit AmigaObjects als Grundalge f&uuml;r alle Objekt-Dienste und der Untert&uuml;tzung
f&uuml;r verteiltes Rechnen in der Amiga Arbeitsumgebung, wird das Netzwerk
nat&uuml;rlich durchgehend. Es gibt keinen Unterschied zwischen Ger&auml;ten (z. B.
Festplatten) das lokal existiert zu einem Rechner-Element oder einem
gleichwertigen Ger&auml;t das sich irgendwo im Netzwerk befindet. Die
JiniTM-Technology von Sun Microsystems l&ouml;st viele dieser Probleme mit einer
Architektur, die ein schnelles Zusammenarbeiten von Ger&auml;ten mit einem
Netzwerk wie Laufwerken, Druckern, Scannern, Kameras, usw. erm&ouml;glicht. Wir
kapseln die Jini-Technology f&uuml;r die Arten von Ger&auml;ten bei denen das gut
funktioniert und bieten komplette AmigaObject-L&ouml;sungen f&uuml;r Dienste, die
nicht effektiv von Jini unterst&uuml;tzt werden. Wir werden n&auml;here Details &uuml;ber
die Durchg&auml;ngigkeit von Netzwerk-Diensten zu einem sp&auml;teren Zeitpunkt zur
Verf&uuml;gung stellen.
</P>
<P>
Die eigentliche Auswahl des &Uuml;bermittlungsverfahrens ist unwichtig f&uuml;r die
Software und Anwendungs-Architektur. Wir rechnen damit im Laufe der Zeit
die meisten der weitverbreiteten Netzwerk-Protokolle zu unterst&uuml;tzen, wie
Ethernet, Modem, HomePNA, HomeRF, IEEE 1394 und andere digitale
Hochgeschwindigkeits-Netzwerke. Die einzig wichtige Frage ist die nach
Bandbreite: Verbindungen bei nierigerer Bandbreite neigen dazu die Qualit&auml;t
von anbietbaren Diensten einzuschr&auml;nken. Wie man aus dem Abschnitt &uuml;ber
Hardware ersehen kann, arbeiten wir aktiv an der Bereitstellung von
Netzwerken hoher Bandbreite in unserem Grundsystem und gleichzeitiger
Erm&ouml;glichung einer neuen Generation von Netz-bewu&szlig;ten Anwendungen und
Produkten.
</P>
<P>
Software-Blockdiagram
</P>
<P>
<A HREF="img/sw_block-diagram.jpg"><IMG SRC="thumb/sw_block-diagram.jpg" WIDTH="120" HEIGHT="86" ALT="Bild"  BORDER="0"></A>
</P>
<P>
Die Hardware-Architektur des Amiga MCC
</P>
<P>
Der Amiga MCC wird dahingehend entwickelt, um state-of-the-art Multimedia
zu unterst&uuml;tzen w&auml;hrend er den Ballast des PC-Erbes hinter sich l&auml;sst. Der
MCC wird DVD, high-performance 3D-Grafik, Ethernet-basiertes Home
Networking, Digitales und Traditionelles analoges Video und Audio
unterst&uuml;tzen und USB-Schnittstellen f&uuml;r digitales Zubeh&ouml;r besitzen. Er wird
Platz f&uuml;r mindestens 2 Festplatten haben, 2 PCI-Schnittstellen, 7
USB-Anschl&uuml;sse und einen offenen Laufwerkseinschub f&uuml;r zus&auml;tzliche Hardware
der Enthusiasten unter den Benutzern wie Zip- und Jazz-Laufwerke.
</P>
<P>
Es existiert eine deutliche Unterst&uuml;tzungsbereitschaft f&uuml;r USB (Universal
Serial Bus) in der Industrie. USB ist eine digitale bidirektionale
Schnittstelle die bis zu 10Mb/s unterst&uuml;tzt. Dies erlaubt Spiele-Hardware
Interaktivit&auml;t mit hoher Geschwindigkeit zu unterst&uuml;tzen, einschlie&szlig;lich
Features wie &quot;Force Feedback&quot;, wenn man also ein Auto f&auml;hrt sp&uuml;hrt man den
Reifenwiderstand im Joystick. Es erlaubt automatische Erkennung w&auml;hrend der
Rechner l&auml;uft (&quot;Hot Detection&quot; oder &quot;hot-swapping, Anm. d. &Uuml;b.) von Ger&auml;ten
wie Tastaturen, Druckern, Scannern, Kameras, Spiele-Hardware,
Speichermedien, usw. Tats&auml;ch unterst&uuml;tzt der USB-Standard bis zu 127
Peripherie-Ger&auml;te an einem einzigen Anschluss. Aus diesem Grund
beabsichtigen wir nicht die veralteten seriellen, parallelen, PS/2- oder
analogen Game Ports zu unterst&uuml;tzen. Man kann jederzeit USB-Hubs
hinzuf&uuml;gen, um mehr Ger&auml;te anzuschlie&szlig;en und es gibt Adapter f&uuml;r die alten
Schnittstellen (z.B. USB nach Parallel), um alte Peripherie anschlie&szlig;en zu
k&ouml;nnen, von der man sich in n&auml;chster Zeit nicht trennen will. Es gibt
derzeit sogar Bem&uuml;hungen die n&auml;chste Version von USB zu spezifizieren - mit
bis zu 100Mb/s.
</P>
<P>
Das Design f&uuml;r den MCC wurde von Pentagram durchgef&uuml;hrt, einer
international f&uuml;hrenden Industrial-Design-Firma. Erst k&uuml;rzlich wurden
mehrere Konzept-Skizzen (von ungef&auml;hr 12, die erw&auml;gt wurden) ver&ouml;ffentlicht
und das endg&uuml;ltige Design wird auf den kommenden World of Amiga- und
AmiWest-Shows gezeigt werden.
</P>
<P>
Als Grundlage und Mittelpunkt f&uuml;r die Amiga-Computing-Revolution, wird der
Amiga MCC in zwei Formaten ausgeliefert werden: ein integriertes
Computing-System mit einem attraktiven Design und separater Monitor-Option;
und ein Motherboard im Standard-ATX-Format f&uuml;r Systemh&auml;user,
Software-Entwickler und Enthusiasten, die auf die MCC-Funktionalit&auml;t in
anderen Hardware-Konfigurationen mit h&ouml;herer Aufr&uuml;stbarkeit zugreifen
wollen.
</P>
<P>
Wir haben eine sehr aufregende CPU f&uuml;r den MCC ausgew&auml;hlt, die das
Herzst&uuml;ck eines Prozessor-Subsystem der n&auml;chsten Generation ist. Das
CPU-Subsystem wird mehr als nur traditionelle zentrale Rechendienste zur
Verf&uuml;gung stellen - als wir uns f&uuml;r Linux und Java als zwei unserer
fundamentalen Software-Baubl&ouml;cke entschieden haben, wollten wir ein
CPU-Subsystem, das extrem gut an eine Linux/Java-Software-Basis angepasst
werden konnte, auf dem gleichzeitig aber auch Classic Amiga-Anwendungen
laufen. Wir befinden uns immer noch in strengen Stillschweigeabkommen, und
k&ouml;nnen zur Zeit noch keine Informationen &uuml;ber die CPU preisgeben. Jedoch
glauben wir, dass die Wahl dieser Technologie uns einen einzigartigen
Vorteil f&uuml;r den Amiga verschaffen wird.
</P>
<P>
Wie bereits fr&uuml;her erw&auml;hnt, wird der MCC ein extrem schnelles
3D-Grafik-Subsystem beinhalten, die Integration von Streaming-Medien und
aufkommende Standards f&uuml;r die Heimvernetzung unterst&uuml;tzen die in den
n&auml;chsten zwei Jahren Verbreitung finden werden. Folgendes ist eine
auszughafte Liste von Features, die gerade im Rahmen der
MCC-Hardware-Architektur entwickelt werden:
</P>
<B>Prozessor-Subsystem:</B>
<UL>
<LI> High-performance CPU der n&auml;chsten Generation
<UL>
<LI> Hardware-Unterst&uuml;tzung f&uuml;r den Linux-Kernel, die Java VM und die
        Emulation der Classic Amigas
</LI>
</UL>
</LI>
<BR><LI> 168-pin SDRAM DIMMs -- zuk&uuml;nftig Unterst&uuml;tzung f&uuml;r DDR SDRAM
</LI>
<BR><LI> 32 MB System-RAM ausbaubar bis zu 288 MB (ATX-Zielkonfig. bis zu 1GB)
</LI>
</UL>
<B>Grafik-Subsystem:</B>
<UL>
<LI> Fortschrittlicher superskalar rendernder 2D &amp;
     3D-Hardware-Beschleuniger (unangek&uuml;ndigter next-generation
     ATI-Chipsatz - Specs sind noch unter non-disclosure):
<UL>
<LI> 24-bit true color depth / pixel supporting 640x480 to 1920x1200
        resolutions
</LI>
<BR><LI> Textur-Lighting &amp; Compositing, Alpha-Blending, Vertex- &amp;
        Table-basierter Nebel, Video-Texturen, Reflexionen, Schatten,
        Spotlichter, Bump-Mapping, LOD (Level of Detail: Objekte werden
        mit zunehmendem Abstand gr&ouml;ber, Anm. d. &Uuml;b.)-Biasing,
        Textur-Morphing, Hidden-Surface-Z-Buffering, Dithering,
        Kantengl&auml;ttung, Gouraud- &amp; Specular-geshadete Polygone,
        perspektivisch korrekte MIP (multum in parvo: es werden mehrere
        kleine, gegl&auml;ttete Versionen der urspr&uuml;nglichen Textur bei
        weiteren Entfernungen verwendet, Anm. d. &Uuml;b.)-Map-Texturierung,
        Chroma-Keying, Bilineare &amp; Trilineare Texturfilterung; zus&auml;tzliche
        Features werden noch bekanntgegeben wenn ATI seine next-generation
        Chip-Information ver&ouml;ffentlicht
</LI>
</UL>
</LI>
<BR><LI> 32 MB 128-bit SDRAM-Framebuffer
</LI>
</UL>
<BR>
<B>Audio / Video:</B>
<UL>
<LI> DVD-Laufwerk standardm&auml;&szlig;ig (DVD-RAM wenn verf&uuml;gbar)
</LI>
<BR><LI> DVD-Playback beinhaltet
<UL>
<LI> Hardware-beschleunigte MPEG-2-Dekodierung: Motion Compensation &amp;
        iDCT
</LI>
<BR><LI> Hardware-Halbbild-Dekoder mit interpolierendem Skalar- &amp;
        Alpha-Compositor
</LI>
</UL>
</LI>
<BR><LI> Echtzeit Videokompression inklusive MPEG-2
</LI>
<BR><LI> Beschleungigte Aufzeichnung von Standbildern
</LI>
<BR><LI> Analoges TV: NTSC-PAL-Secam-Eingabe, Digitalisierung und TV-Ausgabe
</LI>
<BR><LI> S-Video &amp; Composite-video E/A
</LI>
<BR><LI> Vollkanal Fernseh-Tuner
</LI>
<BR><LI> 44 kHz, 16-bit CD stereo Audio E/A
</LI>
<BR><LI> AC-3 Dolby Digital 5.1 Kanal-Dekodierung
</LI>
<BR><LI> S/PDIF Dolby Digital-Ausgabe
</LI>
<BR><LI> FM Radio-Tuner in Erw&auml;gung gezogen
</LI>
</UL>
<P>
<B>Telekommunikations-Optionen (in Entwicklung):</B>
</P>
<UL>
<LI> 56Kb/s-Modem mit V.90
</LI>
<BR><LI> 100/10Mb/s Ethernetanschluss
</LI>
<BR><LI> HomePNA 2.0 10Mb/s Heim-Netzwerk
</LI>
<BR><LI> Kabelloses 2.4GHz Digital-Netzwerk
</LI>
<BR><LI> Breitband-Internet-Optionen
<UL>
<LI> 1.5MB/s Kabelmodem
</LI>
<BR><LI> DSL-Modem
</LI>
<BR><LI> ISDN-Modem
</LI>
<BR><LI> Digitale Satelliten-Decoder
</LI>
</UL>
</LI>
</UL>
<B>Massenspeicher:</B>
<UL>
<LI> 2 E-IDE UltraDMA Schnittstellen (Unterst&uuml;tzung f&uuml;r vier Laufwerke)
</LI>
<BR><LI> Unterst&uuml;tzung f&uuml;r 2 Hochkapazit&auml;ts-Festplatten
     (ATX-Benutzerkonfiguration k&ouml;nnte mehr unterst&uuml;tzen)
</LI>
</UL>
<P>
<B>Interne Erweiterung:</B>
</P>
<UL>
<LI> 2 PCI-Slots (ATX-Zielkonfig. 6 PCI slots)
</LI>
<BR><LI> 3.5&quot; offener Einschub f&uuml;r Zip/Jazz/120MB-Floppy oder andere Optionen
</LI>
</UL>
<BR>
<B>E/A:</B>
<UL>
<LI> Infrarot f&uuml;r Fernbedien-Ger&auml;te
</LI>
<BR><LI> Mikrofon-Eingang
</LI>
<BR><LI> Touch-Screen-Display Controller
</LI>
<BR><LI> 7 Universal Serial Bus &quot;USB&quot; 10Mb/s Digital-Anschl&uuml;sse (2 vorne, f&uuml;r
     einfachen Anschluss)
</LI>
<BR><LI> eine 1394 Option wird noch untersucht
</LI>
</UL>
<P>
Hinweis: Volle Software-Unterst&uuml;tzung f&uuml;r diese Features und mehr wird &uuml;ber
die Zeit hinweg stattfinden.
</P>
<P>
Entwicklungswerkzeuge und Anwendungen
</P>
<P>
Wir arbeiten mit mehreren f&uuml;hrenden Entwicklungswerkzeug- und
Anwendungs-Software-Lieferanten, um sicherzustellen, dass es gro&szlig;artige
Werkzeuge und Anwendungen f&uuml;r das Amiga OE und den Amiga MCC geben wird.
Einer der Hauptgr&uuml;nde, dass wir Linux als das zugrundeliegende
Betriebssystem des MCC gew&auml;hlt haben ist der gewaltige Zuwachs von
Linux-basierten Werkzeugen und Anwendungen, von denen viele f&uuml;r den Amiga
MCC verf&uuml;gbar sein werden. In &auml;hnlicher Weise wurde auch unsere
Entscheidung zugunsten Javas f&uuml;r das Amiga OE zum Teil von der Tatsache
beinflusst, dass es einige sehr m&auml;chtige Linux-basierte
Java-Entwicklungsumgebungen gibt, die entweder schon erh&auml;ltlich sind oder
dies in den kommenden Monaten sein werden. Der Amiga MCC wird sofort eines
der bestverkauften Linux-basierten Systeme auf dem Markt sein und Amiga und
seine Partner haben die Absicht sicherzustellen, dass diese Werkzeuge auf
dem MCC verf&uuml;gbar sind.
</P>
<P>
Selbstverst&auml;ndlich k&ouml;nnen wir uns nicht erlauben die Ver&ouml;ffentlichungspl&auml;ne
anderer Firmen zu enth&uuml;llen. Je n&auml;her wir dem Auslieferungsterminen von
Amiga OE und Amiga MCC kommen, desto mehr Firmen, die Anwendungen und
Werkzeuge f&uuml;r die neuen Amigas entwickeln werden ihre eigenen Pl&auml;ne zur
Ver&ouml;ffentlichung von Amiga-Software bekanntgeben.
</P>
<P>
Summary
</P>
<P>
Wir glauben, dass die Amiga Arbeitsumgebung die Entwicklung einer breiten
Palette von Computerger&auml;ten der n&auml;chsten Generation f&ouml;rdern wird. Der Amiga
MCC als die Grundlage, wird den Standard f&uuml;r Multimedia Convergence
Computer in der aufkommenden Home-Computing-Umgebung setzen.
</P>
<P>
Diese kurze Einweisung zeigt in keiner Weise all das, was bei Amiga
passiert. Wir haben einige aufregende Dinge in der Entwicklung, die wir der
Gemeinde gerne enth&uuml;llen w&uuml;rden und werden, wenn es unsere Partner
erlauben. Die Entscheidungen, die getroffen wurden konzentrieren sich auf
die Zukunft, gleichwohl halten wir unseren Blick auch auf Heute und Gestern
gerichtet. Hoffentlich hat diese kurze Einf&uuml;hrung Ihnen einen Einblick in
die Richtung verschafft, in die wir wollen.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Erich Seifert.
(Quelle des Originals: AMIGA)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA9.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA11.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
