<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA11.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA13.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>12. AMIGA-Pr&auml;sident Jim Collas &auml;u&szlig;ert sich zu seinen Aktivit&auml;ten</H2>
<P>
&raquo;[Schnitt - sachliches Wettern von einer Person mit guten Absichten]
</P>
<P>
Warnung! Ich habe es verdient, auch einmal herumzuschimpfen. Also lege ich
jetzt los:
</P>
<P>
Ich wei&szlig;, wir m&uuml;ssen die Kommunikation noch weiter verbessern, doch
augenscheinlich ist die Kommunikation mit einer gro&szlig;en Gemeinde schwierig.
Ich unternehme bedeutende Anstrengungen, um der Amiga-Gemeinde zuzuh&ouml;ren
und sie zu verstehen. Hunderte von Stunden habe ich in den letzten paar
Monaten damit verbracht, der Amiga-Gemeinde zuzuh&ouml;ren und mit ihr zu
korrespondieren. Hier sind einige der Aktivit&auml;ten:
</P>
<P>
1) Ich traf mich mit &uuml;ber hundert Amigianern in mehreren Gruppen in St.
Louis, um deren Beitr&auml;gen zuzuh&ouml;ren.
</P>
<P>
2) Ich habe mich mit mehreren Groups in den USA getroffen, um Eingaben zu
erhalten. Ich habe verschiedene Pressekonverenzen abgehalten, um Eingaben
zu erhalten.
</P>
<P>
3) Ich flog im Mai extra nach Deutschland und England, um mich mit 60 bis
70 prominenten Amigianern zu treffen und deren Beitr&auml;gen zuzuh&ouml;ren. Mehrere
Feedback-Sitzungen von mehreren Stunden Dauer.
</P>
<P>
4) Ich traf mich in England und Deutschland mit Amiga-Entwicklern in
Schl&uuml;sselpositionen.
</P>
<P>
5) Ich las t&auml;glich die bekanntesten Amiga-Newsgroups.
6) Wir haben eigene Foren gestartet, um Eingaben zu erhalten.
</P>
<P>
7) Ich habe t&auml;glich &uuml;ber hundert Emails von der Amiga-Gemeinde gelesen und
viele davon beantwortet.
</P>
<P>
8) Jede Woche spreche ich h&auml;ufig mit Leuten aus der Amiga-Gemeinde.
9) Bill McEwen und Darreck Lisle lasen hunderte von Emails jeden Tag und
fassen die h&auml;ufigsten Eingaben und Fragen f&uuml;r mich und andere
Gesch&auml;ftsf&uuml;hrer zusammen.
</P>
<P>
10) Wir sind dabei, einen Amiga-Beirat aus prominenten Amigianern, die von
der Gemeinde nominiert wurden, einzusetzen.
11) usw. ...
</P>
<P>
Wie Sie sehen k&ouml;nnen, war ich bei tausenden von gemeinsamen Aktionen mit
der Amiga-Gemeinde dabei. Ich frage mich, ob irgendjemand realisiert,
wieviel Anstrengung das an der Spitze der Gesch&auml;ftsleitung ist. Ich frage
mich, ob irgendjemand realisiert, wieviele Reisen, fern von meiner Familie,
das sind. Ich mache das, weil mich das was Sie denken k&uuml;mmert. Ich h&ouml;re der
Gemeinde zu und denke bei der Planung genau &uuml;ber ihre Eingaben nach. Um
unsere Pl&auml;ne besser zu verstehen, sollten die Leute ein paar Dinge
bedenken:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1)&nbsp;</TD><TD VALIGN="TOP">Es gibt in der Gemeinde viele unterschiedliche Meinungen dar&uuml;ber, was zu&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">tun ist. Sehr oft ziehen die Leute in entgegengesetzte Richtungen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2)&nbsp;</TD><TD VALIGN="TOP">Es gibt keinen einheitlichen, konsequenten Satz aus Anforderungen aus&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">der Gemeinde.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3)&nbsp;</TD><TD VALIGN="TOP">Ich versuche die fehlerhaften Entscheidungen von mehreren Jahren&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">wiedergutzumachen. Das machte die Situation sehr schwierig. Durch die&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Unterbrechung k&ouml;nnen wir einfach keine Produktlinie hervorbringen, wie die&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">meisten Firmen dies k&ouml;nnten. Das hei&szlig;t auch, ich bin in eine Gemeinschaft&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">mit wenig Geduld (verst&auml;ndlich) eingetreten.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4)&nbsp;</TD><TD VALIGN="TOP">Eine bedeutende Anzahl von ver&auml;nderlichen Gr&ouml;&szlig;en ist zu bedenken und es&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">ist unm&ouml;glich, diese alle &ouml;ffentlich mitzuteilen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">5)&nbsp;</TD><TD VALIGN="TOP">Es gibt viele Dinge, die die Gemeinde bez&uuml;glich des Vorw&auml;rtskommens der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">neuen Technologie nicht wei&szlig;.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">6)&nbsp;</TD><TD VALIGN="TOP">Wir k&ouml;nnen nicht alle unsere strategischen Pl&auml;ne &ouml;ffentlich teilen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">7)&nbsp;</TD><TD VALIGN="TOP">Dies ist f&uuml;r Wettbewerber eine extrem schwierige Industrie . Es gibt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">viele gro&szlig;e Spieler mit dicken Taschen. Microsoft hat gerade die&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">500-Miliarden-Dollar-Marke &uuml;berschritten. Wir k&ouml;nnen da nicht einfach mit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">einer &quot;Ich auch&quot;-Strategie hereinspazieren.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">8)&nbsp;</TD><TD VALIGN="TOP">Wir sind eine sich aufbauende Firma an der Startlinie, nicht nur ein&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Produkt. Realisieren die Leute, wie schwer das schnell zu machen ist?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">9)&nbsp;</TD><TD VALIGN="TOP">Es gibt Beschr&auml;nkungen bei Budget und Resourcen. Wir arbeiten so&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">effektiv und sorgf&auml;ltig, wie wir k&ouml;nnen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">10)&nbsp;</TD><TD VALIGN="TOP">Es gibt Leute, die auf alles einschlagen werden. Egal was wir tun. Das&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">ist f&uuml;r mich bedauerlich, doch diese Leute haben, wegen der Vergangenheit,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">verst&auml;nlicher Weise die Nase voll.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ich wei&szlig;, das ist frustrierend, aber verurteilen Sie mich nicht f&uuml;r die
vergangenen paar Jahre. Die sind vermasselt worden und ich hatte nichts
damit zu tun. Richten Sie mich nach den letzten 5 Monaten. Ich f&uuml;hre Amiga,
wie sie seit langem nicht gef&uuml;hrt worden ist - als eine aggressive,
unabh&auml;ngige und vision&auml;re Firma. Ich w&auml;ge Technologie, Gesch&auml;ft, Marketing
und Industriedynamik gegeneinander ab, um mit einem Plan hervorzukommen,
der uns eine gro&szlig;e Chance gibt, wieder eine treibende Kraft in der
Computerindustire zu sein. Wir befinden uns in einem sehr schwierigen
Dilemma und ich bin dabei einen sehr starken Plan festzulegen, um uns da
herauszuholen. Es ist nicht einfach, alle Variablen, die in diesen Plan
einflie&szlig;en, zu verstehen. Noch schwieriger ist es, diese &ouml;ffentlich bekannt
zu machen. Dieser Plan erfordert vielschichtige Kompromisse und das Setzen
von Priorit&auml;ten und nicht jeder wird das verstehen oder dem zustimmen.
Bedenken Sie auch, das erste ver&ouml;ffentlichte Produkt wird nicht das Ende
unseres Fahrplanes sein. Das Einzige, was ich Ihnen versichern kann ist,
dass ich mich um die Gemeinde sorge und ihr zuh&ouml;re. Ich werde es
vorantreiben, um den Amiga unnachgiebig und aggressiv als treibende Kraft
zur&uuml;ckzubringen. Es gibt 101 Dinge, die ich mit meiner Cariere machen kann,
aber das ist meine Leidenschaft. Ich brauche die Amiga-Gemeinde dabei im
R&uuml;cken, sonst werden wir scheitern. Wir haben noch einen letzten Wurf. Wir
k&ouml;nnen es uns nicht leisten, uns ablenken oder beunruhigen zu lassen. Wir
M&Uuml;SSEN zusammenhalten, um Erfolg zu haben.
</P>
<P>
Danke f&uuml;r's Zuh&ouml;ren
</P>
<P>
Sincerely,<BR>
Jim&laquo;<BR>
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Martina Jacobs, wurde f&uuml;r das
Projekt AIDA (<A HREF="http://www.amiga-club.de/aida/0051.html" TARGET="_TOP">http://www.amiga-club.de/aida/0051.html</A>) vorgenommen und uns
freundlicherweise zur Verf&uuml;gung gestellt.
</P>
<P>
(Quelle des Originals: Newsgroup comp.sys.amiga.misc)
</P>
<P>
Martina hat der &Uuml;bersetzung einige pers&ouml;nliche Anmerkungen hinzugef&uuml;gt,
denen auch ich nur vollkommen beipflichten kann:
</P>
<P>
&raquo;Ganz gegen meine &uuml;bliche Vorgehensweise, kann ich mich hier eines
Kommentars nicht erwehren. Wie dieses Posting von Jim Collas &uuml;berdeutlich
zeigt, leidet er ganz offensichtlich unter den lauten Unmuts&auml;u&szlig;erungen der
Amiga-Gemeinde. Was auch immer dieser Mann tut und macht, es ist
augenscheinlich einer Vielzahl der Gemeindemitglieder nicht genug oder
nicht gut genug. Ich will hier nicht als Anwalt f&uuml;r Jim Collas auftreten,
jedoch bin ich der Auffassung, dass dieser Mann in den wenigen Monaten,
seit er an der Spitze von Amiga steht, weitaus mehr bewegt hat, als jeder
seiner Vorg&auml;nger. Obendrein empfinde ich es als beachtenswert, dass er sich
die unglaubliche M&uuml;he macht, an den Threads in der Gemeinde teilzunehmen
und ein offenes Ohr f&uuml;r unsere Sorgen und W&uuml;nsche hat.
</P>
<P>
Doch eines d&uuml;rfen wir auf keinen Fall vergessen. Die Amiga-Gemeinde, das
ist nicht nur Du und ich, das sind tausende der unterschiedlichsten
Menschen auf der ganzen Welt, mit den unterschiedlichsten Bed&uuml;rfnissen und
Anspr&uuml;chen. Wer glaubt, dass irgendjemand in der Lage ist, bei so vielen
verschiedenen W&uuml;nschen und Vorstellungen, jeden zufriedenzustellen, der
sollte jetzt innehalten und nachdenken. Was wir erwarten, und was wir
bekommen werden, wird nicht f&uuml;r jeden das gro&szlig;e Ideal sein. Manchen wird es
vielleicht sogar entt&auml;uschen. Aber verge&szlig;t eines niemals: Amiga war immer
auch ein Begirff f&uuml;r Kreativit&auml;t. Die heutigen Amiga-Konfigurationen &auml;hneln
Fingerabdr&uuml;cken - kaum einer ist dem Anderen gleich. Wer die
Technologie-Einf&uuml;hrung aufmerksam gelesen hat, hat sicher erkannt, dass auf
dem Next Generation Amiga diese Kreativit&auml;t und Individualit&auml;t auch
weiterhin ihren Freiraum finden wird.
</P>
<P>
Wir d&uuml;rfen nicht zu sehr an dem Alten, liebgewonnenen festhalten. Das w&uuml;rde
jeden echten Fortschritt verhindern. La&szlig;t uns nach vorne blicken, nicht
zur&uuml;ck. Ganz gewi&szlig; wird das Gute aus unserem jetzigen Amiga in den NG
einflie&szlig;en. Auch das geht klar aus der Technologie-Einweisung hervor.
</P>
<P>
Ich jedenfalls, freue mich schon darauf, auf dem Next Genartion Amiga auf
Endeckungsreise zu gehen - so wie damals mit meinem allersten Computer -
dem C64. Etwas v&ouml;llig Neues und nicht nur die Erweiterung des Alten...
</P>
<P>
Nach all der Aufregung und unseren Forderungen nach &Ouml;ffentlichkeitsarbeit
an Amiga, m&uuml;ssen wir Jim Collas und seinen Mitarbeitern eine reelle Chance
geben. Sie haben ein Ziel und geben sich ganz offensichtlich M&uuml;he uns zu
verstehen. Das allein ist schon sehr viel mehr, als in den vergangenen
Jahren geschehen ist. Das ist meine Meinung.
</P>
<P>
Es w&auml;re nat&uuml;rlich das Beste, wenn Amiga jedem Amigianer seinen pers&ouml;nlichen
Wunschcomputer bauen w&uuml;rde. Doch das ist unm&ouml;glich, wie sicher jeder
nachvollziehen kann. Oder suchen wir gar in jeder Ver&ouml;ffentlichung von
Amiga nach Unzul&auml;nglichkeiten, weil wir uns nach all den Jahren des
Stillstandes garnicht mehr vorstellen k&ouml;nnen, dass diese Leute etwas auf
die Beine stellen, was uns staunen lassen kann.... ?? ;-)
</P>
<P>
mfG, Martina Jacobs&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA11.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA13.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
