<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA12.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA14.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>13. AMIGA gibt Zusammenarbeit mit Corel Corporation bekannt</H2>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;22.7.1999&nbsp;</TD><TD VALIGN="TOP">Amiga gibt Zusammenarbeit mit Corel Corporation bekannt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
22. Juli 1999 - San Diego California - Amiga gibt bekannt, da&szlig; eng mit der
Corel Corporation zusammengearbeitet wird, um zu gew&auml;hrleisten, da&szlig; viele
von Corel's preisgekr&ouml;nten Anwendungsprogrammen mit der neuen
Amiga-Produktlinie, deren Markteinf&uuml;hrung zu einem sp&auml;teren Zeitpunkt in
diesem Jahr geplant ist, kompatibel sind.
</P>
<P>
Diese Bekanntgabe folgt der Ank&uuml;ndigung von Amiga, da&szlig; Linux als neuer
OS-Kernel f&uuml;r das neue Amiga Operating Environment gew&auml;hlt wurde. &quot;Wir sind
sehr gl&uuml;cklich &uuml;ber die Zusammenarbeit mit Corel und deren kompletter
Produktlinie, sagte Jim Collas, Pr&auml;sident und CEO von Amiga, &quot;Dies
gew&auml;hrleistet, da&szlig; unsere Kunden, die die neuen Amiga-System erwerben,
Anwendungssoftware von Weltklasse besitzen werden, wie z.B. das bald
erscheinende WordPerfect Office f&uuml;r Linux.&quot;
</P>
<P>
Es gab &uuml;ber eine Million Downloads von Corel® WordPerfect® 8 for Linux®
seit Corel im vergangenen Dezember dieses Produkt auf deren Website zur
Verf&uuml;gung stellte. &quot;Wir rechneten damit, da&szlig; die Linux-Version erfolgreich
sein w&uuml;rde&quot;, sagte Dr. Michael Cowpland, Chief Executive Officer und
Pr&auml;sident von Corel, &quot;aber eine Million Downloads sind au&szlig;ergew&ouml;hnlich.
Dies spricht nicht nur B&auml;nde f&uuml;r WordPerfect, sondern es ist au&szlig;erdem ein
Hinweis auf die zunehmende Popularit&auml;t von Linux. Wir erwarten, da&szlig; die
Ver&ouml;ffentlichung von WordPerfect Office f&uuml;r Linux Anfang n&auml;chsten Jahres
ein noch gr&ouml;&szlig;erer Erfolg sein wird.&quot;
</P>
<P>
Amiga n&auml;hert sich den Markteinf&uuml;hrungen des neues Amiga Operating
Environments und des Amiga MCC (Multimedia Convergence Computer), und wir
werden weitere Details sowie Erscheinungstermine zu diesen und weiteren
Produkten ank&uuml;ndigen.
</P>
<P>
&Uuml;ber Corel Corporation
</P>
<P>
Corel Corporation ist ein weltweit bekanntes Entwicklungsunternehmen von
preisgekr&ouml;nten Grafik- und Business-Anwendungsprogrammen. Die Entwicklung
von marktf&uuml;hrenden Produkten wie der CorelDRAW® Produktlinie von
Grafikanwendungen und der Corel® WordPerfect® Suite von
Business-Anwendungsprogrammen wird st&auml;ndig weitergef&uuml;hrt, um den
Anforderungen der Firmen- Einzelhandels- und Akademischen M&auml;rkte gerecht zu
bleiben. Corel, stets bedacht auf Wert, Kompatibilit&auml;t, Anspruch und offene
Standards, entwickelt Produkte f&uuml;r die Windows®, Macintosh®, UNIX®, Linux®
und Java-Plattformen. F&uuml;r weitere Informationen zu Corel besuchen Sie bitte
deren Website unter www.Corel.com
</P>
<P>
Corel, WordPerfect, CorelDRAW, Corel PHOTO-PAINT und das Go Further Logo
sind Warenzeichen oder Schutzmarken der Corel Corporation oder Corel
Corporation Limited.&laquo;
</P>
<P>
(Quelle: AMIGA)
</P>
<P>
Wenige Tage sp&auml;ter gab Corel seinerseits eine Presseerkl&auml;rung mit &auml;hnlichem
Wortlaut heraus.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA12.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA14.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
