<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues von AMIGA (in chronologischer Reihenfolge)</H1>
<H2>1. Offener Brief von AMIGA-Pr&auml;sident Jim Collas, dt. Version (Juni/Juli)</H2>
<H3>&raquo;OFFENER BRIEF AN DIE AMIGA-GEMEINDE</H3>
<P>
Juni/Juli 1999
</P>
<P>
Liebe Amiganer,
</P>
<P>
ich entschuldige mich, da&szlig; ich meinen Juni- (jetzt Juni/Juli-) Brief erst
so sp&auml;t ver&ouml;ffentlicht habe. Ich war eigentlich schon in der letzten Woche
so weit, den Brief zu ver&ouml;ffentlichen, habe mich jedoch entschlossen, dies
zu lassen und ihn am vergangenen Wochenende aus vielerlei Gr&uuml;nden neu zu
schreiben. Ein Grund ist das Feedback, das ich aus der Amiga-Gemeinschaft
erhalten habe. Um die W&uuml;nsche der Amiga-Community besser verstehen zu
k&ouml;nnen, habe ich viele der Diskussionen in den Amiga-Newsforen verfolgt
(zus&auml;tzlich zu den Tausenden Emails, die mich erreicht haben). Ich habe
auch selbst in einigen Foren geschrieben, wenn ich das Gef&uuml;hl hatte, da&szlig; es
wichtig war, die Informationen in Bezug auf die Pl&auml;ne von Amiga
klarzustellen. Im Forum &quot;comp.sys.amiga.misc&quot; schrieb ich eine Nachricht,
die um Feedback zu unseren Strategien und Pl&auml;nen bat. Die Nachricht findet
sich unter &quot;Collas and LeFaivre - thanks for talking&quot;. Ich habe als Antwort
viele interessante Einblicke und Meinungen erhalten, jedoch wurde mir beim
Lesen eine Sache immer klarer: ich habe der Amiga-Gemeinschaft nicht
gen&uuml;gend Informationen zum klaren Verst&auml;ndnis unserer Pl&auml;ne gegeben. Die
Gemeinschaft hat immer noch kein klares Verst&auml;ndnis unserer Produktpl&auml;ne,
und von dem, was wir mit der Bezeichnung &quot;Operating Environment&quot; meinen.
Dies ist offensichtlich nicht der Fehler der Gemeinde, sondern meiner, da
ich nicht genug Informationen weitergegeben habe. Und dies ist auch der
Grund, warum ich meinen Originalbrief nochmals &uuml;berarbeitet habe.
</P>
<P>
In den letzten Monaten habe ich versucht, der Amiga-Gemeinde soviel wie
m&ouml;glich bekanntzugeben, ohne unseren Konkurrenten zuviel zu enth&uuml;llen oder
vertrauliche Vereinbarungen mit unseren Technologiepartnern zu brechen. Ich
denke, ich war in dieser Hinsicht, n&auml;mlich die Sache richtig auszuloten,
nicht gerade effektiv, daher habe ich veranla&szlig;t, mehr von unseren Pl&auml;nen
bekanntzugeben: Wir stellen eine f&uuml;nf- bis siebenseitige Produkt- und
Technologie-Einweisung zusammen, die innerhalb der n&auml;chsten Woche f&uuml;r die
Amiga-Gemeinschaft ver&ouml;ffentlicht wird. Diese Einweisung wird allen helfen,
unsere allgemeinen Pl&auml;ne besser zu verstehen, indem weitere Details &uuml;ber
unser neues Amiga Operating Environment (OE) und Multimedia Convergence
Computer mitgeteilt werden. Diese Technologie-Einweisung wird au&szlig;erdem von
neuer und aufregender Amiga-Technologie berichten. Ich werde sp&auml;ter in
diesem Brief etwas mehr &uuml;ber diese Technologie sprechen.
</P>
<P>
Diese Einweisung gibt au&szlig;erdem einige unserer zur Auswahl beteiligten
Firmen bekannt. Wir haben in den letzten vier Monaten mit der Auswertung
von Technologie und der Definition der Hardware-Architektur sowie der
Software-Struktur der n&auml;chsten Generation verbracht. Wir haben die
Architektur und Struktur nun festgelegt. Wir haben au&szlig;erdem unsere
wichtigsten Technologie- und Partnerentscheidungen getroffen. Einen
betr&auml;chtlichen Teil an Aufwand und Mittel investierten wir in die
Auswertung der Technologie von Fremdanbietern - Ihr k&ouml;nntet &uuml;ber einige der
Entscheidungen &uuml;berrascht sein, jedoch bin ich davon &uuml;berzeugt, da&szlig; Ihr
zustimmen werdet, da&szlig; es sich um die richtigen Entscheidungen handelt.
</P>
<P>
Bevor Ihr die Einweisung lest, solltet Ihr verstehen, da&szlig; wir immer noch
nicht die Freiheit besitzen, alle Details unserer Planung zu
ver&ouml;ffentlichen. Ich m&ouml;chte unseren Konkurrenten nicht zuviel bekanntgeben,
au&szlig;erdem sind wir an einen vertraulichen Vertrag mit unseren wichtigsten
Partnern gebunden. Innerhalb dieser Einschr&auml;nkungen werden wir soviel wie
wir k&ouml;nnen bekanntgeben. Der schwierige Teil dabei, nicht zuviel
bekanntgeben zu k&ouml;nnen, besteht darin, da&szlig; einige Entscheidungen nicht viel
Sinn machen, bevor man nicht s&auml;mtliche Informationen hat. Leider haben wir
momentan keine andere Wahl. Als Hintergrundinformation f&uuml;r die
Technologie-Einweisung m&ouml;chte ich au&szlig;erdem das Konzept revolution&auml;rer
Produkte und unsere Strategie der Einf&uuml;hrung des Amiga der n&auml;chsten
Generation diskutieren.
</P>
<P>
REVOLUTION&Auml;RE PRODUKTE
</P>
<P>
re-vo-lu-tio-n&auml;r: Adjektiv; 1: Einsetzen oder Aufbringen eines
grundlegenden oder fundamentalen Wandels in der Art und Weise des Denkens
oder der Vorstellung: ein Paradigmenwechsel, ein revolution&auml;res Produkt.
</P>
<P>
Der Original-Amiga war revolution&auml;r, da er einen fundamentalen Wandel im
Bereich der Computergrafik und -leistung, der M&ouml;glichkeiten und des
allgemeinen Wertes von Computern brachte. Er erm&ouml;glichte es den Leuten,
Dinge zu tun, die sie damals mit keinem anderen System tun konnten. Er
verhalf den Computern einen gro&szlig;en Schritt in die Zukunft, indem er eine
grundlegende Wende in der Art und Weise gebracht hat, wie die Menschen den
Computer sahen. Der Amiga der n&auml;chsten Generation mu&szlig; dasselbe im Kontext
der gegenw&auml;rtigen Computerindustrie erreichen. Schnellere CPUs und
schnellere Grafik allein werden nicht die revolution&auml;re, neue
Computerplattform ausmachen. Diese Faktoren sind wichtig, aber nicht
revolution&auml;r. Revolution&auml;res Denken erfordert von uns, da&szlig; wir von
vergangenen Einstellungen loslassen und uns eine Zukunft vorstellen, die
heute noch nicht existiert. Es verlangt von uns, Technologien und
Funktionen zu entwickeln, die diese Zukunftsvision erm&ouml;glichen. Dieses ist
der Geist revolution&auml;ren Innovationen. Es ist derselbe Geist, der das erste
Amiga-Entwicklungsteam antrieb.
</P>
<P>
Das Problem ist, da&szlig; revolution&auml;re Paradigmenwechsel schwer vorstellbar
sind, bevor sie stattfinden. La&szlig;t mich ein Beispiel anf&uuml;hren:
Als ich Student am College war, hatte ich einen Job als Software-Entwickler
in der Programmierung von Videospielen f&uuml;r den Atari 2600, den Commodore 64
und den Apple II (das war die Zeit vor dem Amiga). Zu dieser Zeit wurden
alle Videospiele in Assembler programmiert. Das war damals toll, denn es
gab dem Entwickler die komplette Kontrolle &uuml;ber die Hardware. Ich konnte
mir nicht vorstellen, ein Spiel in einem hohen Dialekt wie C++ zu
programmieren, weil dieses so unglaublich ineffizient schien. Es sah
einfach wie ein unrealistischer Vorschlag aus. Nun, die Welt hat sich
ge&auml;ndert. Man kann einfach die Komplexit&auml;t und Extravagance heutiger Spiele
nicht in Assembler handhaben. Man braucht hochentwickelte Werkzeuge wie
C++. Hierbei handelt es sich um einen revolution&auml;ren Paradigmenwechsel, der
noch vor einigen Jahren schwer vorstellbar war.
</P>
<P>
Behaltet dies im Kopf und erinnert Euch daran, wenn Ihr die
Technologie-Einweisung, die noch zu ver&ouml;ffentlichen ist, lest. Es ist nicht
genug, ein besseres Produkt herauszubringen. Es mu&szlig; revolution&auml;r sein,
damit es f&uuml;r uns alle einen Erfolg darstellt. Ihr m&uuml;&szlig;t in einer anderen
Dimension denken, um die revolution&auml;re Natur der Amiga-Umgebung der
kommenden Generation zu verstehen. Die Technologie-Einweisung wird Euch
dabei helfen, diese Zukunftsvision zu verstehen. Ich freue mich darauf,
weiterhin Eure Meinungen zu unserer Pl&auml;nen zu erfahren.
</P>
<P>
PRODUKTEINF&Uuml;HRUNGS-STRATEGIE
</P>
<P>
Unsere Strategie, den neuen Amiga einzuf&uuml;hren, besteht darin, die beste
Technologie der Industrie in eine neue, effiziente und revolution&auml;re
Computerplattform zu integrieren, die auf die Zukunft ausgerichtet ist. Es
ist wichtig, diese Strategie zu verstehen, damit Ihr einige unserer
Entscheidungen besser verstehen k&ouml;nnt. Die Computerindustrie von heute
unterscheidet sich sehr von der Zeit, als der erste Amiga entwickelt wurde.
Der urspr&uuml;ngliche Amiga wurde entwickelt, als die Computerindustrie in
ihren Kinderschuhen steckte. Die Computerindustrie ist inzwischen erwachsen
geworden und die Dynamiken haben sich grundlegend ver&auml;ndert. Die Industrie
ist ges&auml;ttigt mit Firmen, die tolle Technologien und Komponenten entwickeln
und den Markt damit versorgen. Zum Beispiel gibt es viele exzellente
Firmen, die hochentwickelte leistungsf&auml;higste 3D-Grafik-Chips anbieten.
Alle diese Firmen haben ein Ziel gemeinsam: die beste 3D-Grafik-L&ouml;sung zu
entwickeln und zu verkaufen. Diese Grafikfirmen unterhalten
Weltklasse-Ingenieure - vertrauen Sie mir, ich kenne diese Unternehmen
genau. Zu glauben, da&szlig; wir einen eigenen, besseren Grafikchip entwickeln
k&ouml;nnten, hat keinen Sinn. Das ist auch der Grund, warum heute alle
f&uuml;hrenden Computerunternehmen (IBM, Compaq, Gateway, Apple, usw.) auf
Drittfirmen, wie Grafikunternehmen, vertrauen. Es war ihnen klar, da&szlig;
interne Mittel nicht mit den in diesem Bereich spezialisierten Firmen
konkurrieren k&ouml;nnen. Das ist der normale Gang einer erwachsen werdenden
Industrie, und es ist der Grund daf&uuml;r, weshalb wir nicht in der
Vergangenheit denken k&ouml;nnen, wenn es darum geht, ein revolution&auml;res Produkt
f&uuml;r die Zukunft herzustellen. Soll dies hei&szlig;en, da&szlig; der Amiga nicht
einzigartig oder f&uuml;hrend in seiner Leistung sein wird? Das hei&szlig;t es absolut
nicht. Zuerst einmal sollt Ihr Leistung nicht ausschlie&szlig;lich nach den engen
Benchmarks der heutigen Industrie definieren. Wir sollten unser Augenmerk
darauf lenken, die n&auml;chste Computerrevolution anzupeilen, anstatt mit der
letzten zu konkurrieren. Zweitens wird eine extrem effiziente Architektur
das letzte aus allgemein genutzten Komponenten wie 3D-Chips herausholen.
Wir k&ouml;nnen eine eindrucksvolle Leistung erreichen, indem wir einen in der
Industrie f&uuml;hrenden PCI-/AGP-Chip mit der hochgradig effizienten
Architektur des neuen Amiga verbinden. Auf der Seite der CPU haben wir
einen Hauptprozessor gew&auml;hlt, der aufregende neue M&ouml;glichkeiten f&uuml;r den
Amiga bringt. Ich darf aufgrund unserer vertraulichen Vereinbarung jetzt
zwar noch nicht bekanntgeben, welchen Befehlssatz er benutzt, aber ich kann
Euch sagen, da&szlig; er sehr aufregend ist und kein x86-Architektur-Prozessor
ist. Wir planen, die CPU in einigen Wochen auf der World Of Amiga und der
AmiWest-Messe bekanntzugeben. Und ich hoffe au&szlig;erdem, alle unsere
Technologiepartner und -Entscheidungen bekanntgeben zu k&ouml;nnen. Um diese
tolle Technologie zusammenzustellen und unsere Plattform der n&auml;chsten
Generation entwickeln zu k&ouml;nnen, entwickeln wir au&szlig;erdem unsere eigene
Technologie f&uuml;r strategische Schl&uuml;sselbereichen. Diese Produkte erlauben
uns, das Produkt einzigartig zu machen, Technologie von Fremdentwicklern zu
integrieren und das letztendlich revolution&auml;re Produkt zu kreieren. Zum
Beispiel:
</P>
<P>
EIN VORGESCHMACK
</P>
<P>
Die Technologie-Einweisung wird auch die Beschreibung neuer
Amiga-Technologien, von denen ich denke, da&szlig; sie unglaublich sind,
enthalten. Es handelt sich um eine objektorientierte von Amiga entwickelte
Technologie namens AmigaObject. AmigaObject stellt eine leistungsstarke
Softwarestruktur dar, die einfache Integration von Technologie, verteiltem
Computing, Hochgeschwindigkeits-Netzwerk-Transaktionen und die
Kommunikation zwischen Applikationen erlaubt. Sie ist au&szlig;erdem eine
leistungsstarke Software, die aus verschiedenen Teilen besteht, die es
erlauben, eindrucksvolle Programme schnell herzustellen. AmigaObjects sind
zwischen Plattformen portierbar und transferierbar, was dem AmigaObjects
erlaubt, sich &uuml;ber das gesamte Netzwerk, das Internet und die gesamte Welt
zu verbreiten. Habe ich bereits Eure Aufmerksamkeit erlangt? Es handelt
sich nur um einen Teil des neuen Amiga-Betriebssystems. Es ist diese Art
der Technologie, die es uns erlauben wird, eine revolution&auml;re
Computerplattform zu entwickeln. Wir k&ouml;nnen diese Technologie offen
diskutieren, da wir nun verbriefte Patente besitzen, die uns einigen Schutz
vor unseren Mitbewerbern gew&auml;hren. Mehr dar&uuml;ber in der
Technologie-Einweisung.
</P>
<P>
ZUSAMMENFASSUNG
</P>
<P>
Die angek&uuml;ndigte Technologie-Einweisung wird Anfang n&auml;chster Woche
ver&ouml;ffentlicht. W&auml;hrend es notwendigerweise auf einem ziemlich hohen Level
gehalten ist, wird es die umfassendste heutige Beschreibung neuer
Amiga-Produkte und des Betriebssystems sein. Ich denke, es wird sehr
n&uuml;tzlich daf&uuml;r sein, damit Ihr Amiga's Zukunft und die neuen Produkte
verstehen k&ouml;nnt. Ich freue mich sehr, diese Informationen zu
ver&ouml;ffentlichen und Eure Meinung dazu zu h&ouml;ren. Nachdem Ihr sie gelesen
habt, denke ich, da&szlig; Ihr mir zustimmen werdet, wenn ich behaupte, da&szlig; der
Amiga und die Amiga-Gemeinschaft eine Chance hat, die n&auml;chste
Computerrevolution auszul&ouml;sen.
</P>
<P>
Alles Gute<BR>
Jim Collas<BR>
President, AMIGA&laquo;<BR>
</P>
<P>
(Quelle: AMIGA)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
