<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA10.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA12.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>11. Dr. Rick LeFaivre und Dr. Allan Havemose wenden sich an die Gemeinde</H2>
<P>
&raquo;Das war eine sehr interessante und aktive Debatte in den letzten
beiden Wochen! Wir LIEBEN die Leidenschaft der (meisten ;-))
Teilnehmer der Online-Gemeinschaft. Linux? X-Windows? PCI? USB? MIDI?
Floppy-Laufwerke? ATI graphics usw. usw.? W&auml;hrend der &uuml;berwiegende
Anteil unserer eMail recht positive Meinungen &uuml;ber die Zielrichtung
von Amiga ausdr&uuml;ckt, gibt es andere, die recht fundierte technische
Einw&auml;nde darstellen, und einen kleinen Teil, der auf alles einpr&uuml;gelt,
was wir tun (mehr &uuml;ber sie sp&auml;ter).
</P>
<P>
Ein positiver Aspekt der Linux-Ank&uuml;ndigung ist der riesige Zufluss an
technischem Talent aus der Linux-Gemeinschaft in das Amiga-Lager. Wie
jeder mit dem entsprechenden technologischen Hintergrund anerkennen
wird, besteht ein begr&uuml;ndeter Anlass f&uuml;r die Hinwendung zu Linux. Ein
positiver Punkt des Linux-Ph&auml;nomens ist, das da hundertausende
Programmierer daran arbeiten, bestehende Probleme zu l&ouml;sen. Es gibt
hunderte Gesellschaften, die an Anwendungsprogrammen, Treibern (und
Hardware) f&uuml;r Linux arbeiten, auf die wir einfach zugreifen k&ouml;nnen.
Ja, es m&uuml;ssen Anpassungen und Test durchgef&uuml;hrt werden, aber die
Vorteile &uuml;berwiegen weitestgehend die Nachteile. Bitte verstehen Sie,
dass die Entscheidung f&uuml;r Linux nicht einfach eine technische war
(jedenfalls nicht &uuml;berwiegend). Es war eine Entscheidung, die durch
eine begr&uuml;ndete Analyse angetrieben wurde, welches zugrundeliegende
Betriebssystem dem Amiga und der Gesellschaft die gr&ouml;&szlig;ten Chancen
bieten w&uuml;rde, am Markt zu bestehen.
</P>
<P>
Verstehen Sie auch, dass wir bei den in den News-Gruppen
angesprochenen technischen Hinweisen noch keinen gesehen haben, den
wir nicht auch schon bedacht hatten und an dem wir nicht schon entweder
hier bei Amiga oder bei einem unserer Partner arbeiten. Wird der Amiga
MCC im Entwicklungsstand ein perfektes Ger&auml;t sein? Nat&uuml;rlich nicht --
bei Ger&auml;ten in der Entwicklung muss man Abstriche machen. Wird er bei
der Auslieferung das Herz der besten Multimedia-Computing-Umgebung
(multimedia computing environment) am Markt in Bezug auf Preis/Leistung/
Anwendungsfreundlichkeit sein? Ja! Und sogar noch wichtiger, der MCC
ist nur ein Teil einer viel weiterreichenden Strategie, &uuml;ber die wir
noch nicht im Einzelnen sprechen wollen. Wenn Jim Collas &uuml;ber
Revolutionen redet, bedeutet das nicht eine Umw&auml;lzung innerhalb des
MCC-Geh&auml;uses (obwohl einige der noch nicht beschriebenen Komponenten
tats&auml;chlich revolution&auml;r sind); es ist die ganze anteilige Heim-
Computer/Internet-Umgebung und -Erfahrung, die &uuml;ber das kommende
Jahr hereinbrechen wird. RICHTEN SIE IHRE BLICKE NICHT NUR AUF GEH&Auml;USE
UND BETRIEBSSYSTEME! (Entschuldigung, dass ich so laut wurde.)
</P>
<P>
Ihnen, die Sie begr&uuml;ndete technische Bedenken &auml;u&szlig;ern, werden wir so
gut wie m&ouml;glich L&ouml;sungen bekanntgeben, so wie sie ausgearbeitet sind.
Und noch besser, helfen Sie uns, diese L&ouml;sungen zu finden. Linux wird
von Woche zu Woche besser, es werden Einzelheiten dar&uuml;ber mit
erstaunlicher Geschwindigkeit bekannt. ATI wird m&ouml;glicherweise nicht
in der Lage sein, ihren neuen Grafik/Video-Beschleuniger (er sieht
gro&szlig;artig aus) rechtzeitig auszuliefern, aber seien Sie beruhigt, wir
haben auch 3dfx und NVidea im Auge. Ja, ein Diskettenlaufwerk wird
vorhanden sein (wahrscheinlich ein 1.44MB/120MB Kombiger&auml;t). Wir
arbeiten an den Ton/MIDI-Anforderungen. Wir h&ouml;ren auf sachliche
Anregungen und bem&uuml;hen uns sehr, die unvermeidlichen Abstriche so zu
behandeln, dass wir das bestm&ouml;gliche System der n&auml;chsten Generation
erschaffen.
</P>
<P>
An euch, die kleine Zahl von Individuen, die uns vulg&auml;re, drohende
Hassbriefe schickten, weil ihr nicht m&ouml;gt, was wir tun, und die ihr
ank&uuml;ndigt, es sei genug und ihr verlasst die Amiga-Gemeinschaft:
Goodbye! Millionen und Abermillionen werden in den kommenden Jahren
Ger&auml;te der Marke Amiga und Amiga-kompatible Produkte erwerben, und es
tut uns leid, dass ihr nicht mehr dazu geh&ouml;rt.
</P>
<P>
Rick LeFaivre, Allan Havemose, und das Amiga-R&amp;D-Team
</P>
<P>
[R&amp;D = Research and Developement = Forschung und Entwicklung]&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: Newsgroup comp.sys.amiga.misc)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA10.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA12.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
