<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. V&sup3; in &ouml;ffentlicher Vorabversion erschienen</H2>
<P>
Ende Juli wurde V&sup3;, die neueste Version des WWW-Browsers Voyager, in einer
Vorabversion f&uuml;r registrierte Anwender ver&ouml;ffentlicht, die sich von
<A HREF="http://v3.vapor.com" TARGET="_TOP">http://v3.vapor.com</A> herunterladen l&auml;sst.
</P>
<P>
Hier einige Hinweise und die wichtigsten Neuerungen des Programms:
</P>
<P>
&raquo;NOTA BENE: Es handelt sich um einen Schnappschuss von einem Projekt
in Arbeit, es ist kein fertiges Produkt. Es kann zusammenbrechen, in
Brand geraten oder eine Atomexplosion ausl&ouml;sen! Es droht Datenverlust
und Haarausfall! Es ist unvollst&auml;ndig! Vorsicht ist angebracht! Wir
haben Sie gewarnt!
</P>
<P>
NOTA BENE&sup2;:
Es fehlt bis jetzt ein betr&auml;chtlicher Teil an jeglicher Dokumentation.
Der Umgang mit dem Programm erfordert eingehende Kenntnisse des AmigaOS
und der Programm-Installierung (obwohl Sie normalerweise einfach das
Ihnen zugegangene Versand-Verzeichnis auf Ihre Festplatte kopieren und es
von dort laufen lassen k&ouml;nnen).
</P>
<P>
NOTA BENE&sup3;:
Diese Version l&auml;uft nur mit einem Keyfile!
Sie akzeptiert Keyfiles der Version 2.95 und NC2, aber verweigert den
Dienst nach dem 31.8.1999. Sie l&auml;uft nur mit CPU 68020 und h&ouml;her.
</P>
<P>
So, genug gewarnt, nun zu den freundlichen Dingen! Was gibt es Neues?
</P>
<UL>
<LI> Javascript.  Javascript 1.3 ist eingebaut als ausgekl&uuml;gelter
   Echtzeit-Bytecode-Compiler, um h&ouml;chste Effizienz aus unseren
   angestaubten Maschinen der 680x0-Klasse herauszuholen.
</LI>
<BR><LI> Deutlich verbessertes GUI, welches die freie Platzierung der Steuer-
   elemente mit Hilfe von Szymon Ulatowski's ausgezeicheten
   Tearoff-Klassen erlaubt. (<A HREF="http://amiga.com.pl/~szulat/" TARGET="_TOP">http://amiga.com.pl/~szulat/</A>). Die Fastlinks
   werden durch Hereinziehen eines URL in die Fastlink-Fl&auml;che erzeugt.
   Die Men&uuml;-Struktur wurde &uuml;berarbeitet, um insgesamt besser angepasst zu
   sein. M&auml;use mit Einstellrad (wheel mice) werden nun unterst&uuml;tzt durch
   den NewMouse-Standard.
</LI>
<BR><LI> Wesentlich verbessertes Plugin-API erlaubt nun die Verwendung eingebetteter
   Objekte (imbedded objects), die jeden MIME-Typ verarbeiten k&ouml;nnen.
</LI>
<BR><LI> Erste Anwendung f&uuml;r das beschriebene Plugin-API:
   Ein Shockwave-Flash-Abspieler. Anders als der frei erh&auml;ltliche
   Spieler, der seit Kurzem zu finden ist, unterst&uuml;tzt
   er die Bearbeitung von eingebetteten Filmen und URL.
</LI>
<BR><LI> SSLv3/TLSv1-Sicherheit wird unterst&uuml;tzt mit Hilfe von OpenSSL
   (<A HREF="http://www.openssl.org" TARGET="_TOP">http://www.openssl.org</A>). K&uuml;mmert sich auch um das neue Reizwort
   &quot;SGC&quot; dadurch, dass 128-Bit-Verschl&uuml;sselung immer geboten wird,
   nicht nur, wenn die US-Crypto-Gesetze das erlauben.
</LI>
<BR><LI> Mannigfaltige modularisierte Bild-Decoder f&uuml;r alle Arten der
   Amiga-Hardware werden geboten. Voyager w&auml;hlt w&auml;hrend des Starts
   automagisch die f&uuml;r Ihr Ger&auml;t am besten Passenden aus. Auch libjpeg
   und libpng sind an die neuesten Versionen angepasst. Es wird nun auch
   &quot;smarte&quot; stufenweise JPG-Decodierung unterst&uuml;tzt.
</LI>
<BR><LI> Ein neues Bookmark-System verwendet CManager.mcc und teilt URL's und
   Sonstiges mit anderen Vapor-Anwendungen.
</LI>
<BR><LI> Verbessertes Cache-System, dass den HTTP/1.1-Header f&uuml;r Verfalldaten
   ber&uuml;cksichtigt. Viel schnelleres Laden bei richtig konfigurierten
   Web-Servern, da die Cache-Aktualit&auml;t nicht verifiziert zu werden braucht.
</LI>
<BR><LI> Zahlreiche weitere &Auml;nderungen. Bitte beachten Sie die detailierte
   Versions-Entwicklung am Ende dieses Dokuments.&laquo;
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">(Quelle des Originals: VaporWare)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
