<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Messebericht</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Tests7.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Messebericht
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Messebericht: World of Amiga 1999 (von Markus Tillmann)</H1>
<P>
&raquo;Seit 1994 bin ich regelm&auml;&szlig;iger Besucher der allj&auml;hrlichen Amiga-Messe in
K&ouml;ln, doch dieses Jahr wollte ich auch unbedingt zum ersten Mal zur World
of Amiga nach London fahren.
</P>
<P>
Die vielen Ank&uuml;ndigungen, vor allem seitens Amiga, sowie die zahlreichen
Meldungen, die in den letzten Wochen auftauchten (QNX/Linux; Corel,
Technology Brief...) lie&szlig;en mich hoffen, endlich wieder mal was neues von
Amiga zu Gesicht zu bekommen und auch neue Entscheidungen direkt zu
erfahren, z.B. bez&uuml;glich des Prozessors.
</P>
<P>
So nahm ich dann eine etwa 9-st&uuml;ndige Busfahrt auf mich und nach einigem
suchen (ausgeschildert war die Messe eigentlich gar nicht, sieht man mal
von kleinen Schildern direkt vor der Kensington Town Hall ab) war ich gegen
9.00 Uhr gl&uuml;cklich am Messegel&auml;nde angelangt.
</P>
<P>
Zu diesem Zeitpunkt (die Messe wurde um 9.45 Uhr er&ouml;ffnet, mit 15 Minuten
Versp&auml;tung, u.a. weil kein/kaum Wechselgeld an der Eintrittskasse vorhanden
war, so da&szlig; zun&auml;chst noch jemand freundlich erkl&auml;rte, da&szlig; man bitte
Kleingeld bereit halten solle, und die, die solches zur Verf&uuml;gung hatten
auch zuerst reinkommen sollten! - spricht wohl nicht gerade f&uuml;r
Professionalit&auml;t und eine angemessene Planung! -) war am Messegel&auml;nde noch
nicht viel los, beim &ouml;ffnen der T&uuml;re hatte sich aber schon bereits eine
kleine Schlange gebildet und nachher war die Messe eigentlich gut besucht,
so da&szlig; man sich schon einige Male durchdr&auml;ngen mu&szlig;te, um weiterzukonmmen.
</P>
<P>
Die Besucher kamen aus allen m&ouml;glichen L&auml;ndern, so da&szlig; man neben den
hiesigen Engl&auml;ndern eine Reihe Deutscher, Schweizer oder auch Italiener
traf. Tja, das zeichnet die Amiga-User wohl aus, da&szlig; ihnen kein Weg zu weit
ist, um endlich etwas Neues zu sehen...
</P>
<P>
Die Halle an sich war folgenderma&szlig;en aufgeteilt: Direkt nachdem man die
Halle betreten hatte, stand man vor dem Amiga-Stand, daneben waren vier
weitere St&auml;nde in dieser &quot;Vorhalle&quot;.
</P>
<P>
Im unteren Bereich tummelten sich mehrere Amiga-Clubs, au&szlig;erdem fand man
dort, die von clickBOOM gesponsorte Games Arena, sowie einen kleinen
Imbisstand.
</P>
<P>
Oben tummelten sich auch ein paar Clubs und Photogenics wurde in der
Version 4.1 pr&auml;sentiert, jedoch war dieser Bereich recht wenig besucht, da
sonst hier kaum interessantes geboten wurde, vielleicht sollte man den
zweiten Imbiss-Bereich noch erw&auml;hnen, ist ja schlie&szlig;lich wichtig, da&szlig; man
wei&szlig;, wo man auf einer Computermesse was zu essen und zu trinken bekommt...
In der Haupthalle waren die meisten Aussteller zuhause, eine genaue Anzahl
zu nennen ist ziemlich schwierig, da sich h&auml;ufig mehrere Firmen einen Stand
teilten, aber im gro&szlig;em und ganzem waren viel zu wenig Amiga-Firmen dort
vertreten, als da&szlig; man euphorisch werden m&uuml;&szlig;te oder gar bereits denken
k&ouml;nnte, eine neue Computerrevolution h&auml;tte begonnen!
In einer guten Stunde konnte man alle St&auml;nde abgeklappert haben und sich
mit den wichtigsten Neuigkeiten vertraut gemacht haben, aber wenigstens
befand sich im Hauptbereich noch eine relativ gro&szlig;e B&uuml;hne, von der aus
Petro Tyschtschenko die Messe kurz vor 10 Uhr offiziell er&ouml;ffnete.
</P>
<P>
Hier fanden z.B. auch die Annex-Auftritte statt, sowie die Vergabe der
AAA-Awards, die dieses Jahr an Ben Vast und Marcel Beck (Yam) gingen, wobei
Marcel selbst nicht anwesend war, mit dem aber zuvor ein Telefongespr&auml;ch
aufgezeichnet wurde, da&szlig; man nach der Wahl abspielte.
</P>
<P>
Der Beifall bewies, da&szlig; die Anwesenden mit der Wahl wohl vollkommen
einverstanden waren.
</P>
<P>
Was gab es zu sehen?
</P>
<P>
Mein erster Gang f&uuml;hrte mich nat&uuml;rlich zum Amiga-Stand und rief auch schon
die erste Entt&auml;uschung hervor!
Ehrlich gesagt, dachte ich zun&auml;chst, da&szlig; dies nicht alles gewesen sein
kann, was Amiga pr&auml;sentiert, aber anscheinend war dem doch so:
Eine Videowand, auf der st&auml;ndig Produkte, wie das neue OS 3.5, Wildfire 7
oder Photogenics 4.1 vorgestellt wurden und auch einen guten Zuspruch
fanden, ein Regal, auf dem die Verpackung des OS 3.5 zu sehen war, sowie
weitere Werbeprodukte, wie z.B. Amiga-Socken oder Shorts, oder die AmiCola,
die zu meiner &Uuml;berraschung sogar recht gut schmeckt!
</P>
<P>
(Mal eine Frage: Was haltet ihr eigentlich von den ganzen Amiga-
Werbeprodukten? Ist da nicht langsam mal das Ende der Fahnenstange
erreicht? Oder seht ihr das als wichtige Einnahmequelle von Amiga?)
</P>
<P>
Dann ein Stand, an dem die Werbeprodukte verkauft wurden; tja, und dann
halt das Design des AmigaMCC in einem Glaskasten, dazu noch einige
Skizzen...
</P>
<P>
<A HREF="img/WoA1.jpg"><IMG SRC="thumb/WoA1.jpg" WIDTH="120" HEIGHT="90" ALT="Bild"  BORDER="0"></A>
<A HREF="img/WoA2.jpg"><IMG SRC="thumb/WoA2.jpg" WIDTH="120" HEIGHT="90" ALT="Bild"  BORDER="0"></A>
<A HREF="img/WoA3.jpg"><IMG SRC="thumb/WoA3.jpg" WIDTH="120" HEIGHT="90" ALT="Bild"  BORDER="0"></A>
</P>
<P>
Das war's! Kein Amiga, auf dem irgendwas gezeigt wurde, keine Firmen wie
auf der Computer 98 in K&ouml;ln, die sich um den Amiga-Stand ansiedelten,
nichts!
Wow, so leitet man also eine neue Computerrevolution ein, nicht schlecht!
</P>
<P>
Also schnell weiter, vielleicht konnte ich an anderen St&auml;nden ja was
interessantes entdecken...
</P>
<P>
Spielemesse?
</P>
<P>
Auffallend fand ich, wie viele Spiele vorgestellt wurden, entweder als
Demoversion oder als bereits erh&auml;ltliche Vollversion.
</P>
<P>
So nahmen Firmen wie Epic oder Alive einen recht gro&szlig;en Platz ein, um ihr
gesamtes Softwareangebot zu pr&auml;sentieren.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Folgende neue Spiele wurden auf der Messe verkauft:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- T-zer0 von clickBOOM, von dem viele eher entt&auml;uscht als begeistert waren,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">welches sich aber trotzdem gut verkaufte und am Stand vom bekanntesten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">englischen Amiga-Mag &quot;Amiga Format&quot; sowie in der Games Arena getestet&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">werden konnte (au&szlig;erdem k&uuml;ndigte clickBOOM auf dem Cover neben Z, auch eine&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Napalm Mission Disk an&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">und Nightlong, ein Adventure, das auf 3 CD's&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">ausgeliefert werden soll)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- Starfighter von Epic, Wing Commander-Clone&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">- Phoenix Fighters von Alive, &auml;hnlich Gravity Force sowie die bereits seit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">einiger Zeit in Deutschland erh&auml;ltlichen wie Wasted Dreams, Superfrog, The&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Prophet, Moonbases, Turbo Racer 3D....&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ein Wort zu den Preisen: Letztes Jahr h&ouml;rte ich, da&szlig; die Preise f&uuml;r Soft-
und Hardware in England teilweise 30% &uuml;ber denen in Deutschland liegen;
best&auml;tigen kann ich, da&szlig; die Preise wirklich h&ouml;her liegen, als in
Deutschland, so zahlte ich f&uuml;r T-zer0 z.B. 28 Pfund, also etwa 85 DM, f&uuml;r
clickBOOM-Spiele eigentlich ein normaler Preis, leider ist das Spiel bei
den deutschen H&auml;ndlern heute (29.7.) noch nicht erh&auml;ltlich, so da&szlig; man
keinen Vergleichswert hat, aber Wasted Dreams kostete genauso viel und dies
wird bei den meisten H&auml;ndlern in Deutschland f&uuml;r ca. 69 DM angeboten! Auch
die Picasso 4 wurde &uuml;berall angeworben und zwar f&uuml;r Preise zwischen 239 und
269 Pfund (weit &uuml;ber 700 DM), hier ist sie bereits f&uuml;r 649 DM zu haben!
</P>
<P>
Aber weiter mit neuen Games:
Alive zeigte zwar kein Demo von Goal 2000, k&uuml;ndigte dies aber genauso wie
Putty Squad f&uuml;r August an, sogar von The Haunted, dem Grafikadventure, da&szlig;
bereits im Amiga Magazin Ausgabe 2/97(!!!) vorgestellt wurde, gab man einen
neuen Ver&ouml;ffentlichungstermin bekannt, n&auml;mlich Ende des Jahres! Wer's
glaubt... Au&szlig;erdem warb Alive mit dem Spruch, da&szlig; jede verdiente Mark
sofort wieder in die Spieleentwicklung gesteckt wird.
</P>
<P>
Zwei weitere Punkte m&ouml;chte ich Alive gegen&uuml;ber noch positiv erw&auml;hnen:
Bei jedem Einkauf bekam man entweder einen Joystick oder eins von zwei
B&uuml;chern kostenlos dazu und als zweites fand ich den Alive Katalog sehr
interessant, der ebenfalls kostenlos verteilt wurde, The Pulse hei&szlig;t und
neben den lieferbaren Spielen auch einige Tests zu neuen Games aufweist,
aber auch z.B. zum OS 3.5 oder zur Ioblix Schnittstellenkarte oder anderen
Hardwareneuheiten.
</P>
<P>
Hier hatte man den Eindruck, da&szlig; sich diese Firma wirklich voll und ganz
dem Amiga widmet!
</P>
<P>
Bei Epic wurde vor allem das Demo zu Virtual Grand Prix ausgiebig
begutachtet, welches zwar noch nicht erh&auml;ltlich war, aber definitiv eine
Woche nach der Messe ausgeliefert werden sollte; desweiteren flimmerten die
beiden Darkage Projekte &uuml;ber den Bildschirm: Tales from Heaven und Alive,
da&szlig; f&uuml;r meinen Geschmack nicht schlechter aussah, als T-zer0!
</P>
<P>
Digital Images zeigte wie versprochen am Stand des neuen englischen Amiga-
Mags AmigActive ein Demo zu Wipeout 2097, das auf einem 1200er mit einer
200 MHz-PPC-Karte und einer B-Vision lief, aber leider h&auml;ufig abst&uuml;rzte.
Laut DI lag dies mit den extremen Temperaturen in der Messehalle zusammen,
mit denen die Grafikkarte nicht fertig w&uuml;rde... Na ja, aber
zugegebenerma&szlig;en: es war verdammt hei&szlig; und stickig in der Haupthalle!
Trotzdem machte das Demo einen guten Eindruck!
Genauso wie das Intro von Space Station 3000, das sie ganze Zeit ablief und
wirklich beeindruckend aussah!
Am selben Stand konnte man auch einen Blick auf FUBAR werfen, das wohl alle
Strategiefans ansprechen d&uuml;rfte, und da&szlig; zurecht, geht man von den
gezeigten Bildern aus!
</P>
<P>
Interessantes gab es auch bei Titan Computer zu sehen. Neben den bekannten
Programmen, wie z.B. Candy Factory, NCoder oder Shadow of the 3rd Moon, die
alle zu g&uuml;nstigen Preisen angeboten wurden, stand auch hier fast alles im
Zeichen neuer Games:
</P>
<UL>
<LI> Evil's Doom S.E., ein RPG, das sehr gut aussieht, aber das tat es auch
</LI>
</UL>
schon vor 2 Jahren! Immer wieder gab und gibt es Probleme mit diesem Spiel,
die laut Titan vor allem mit den kroatischen Programmierern zusammenh&auml;ngen,
deswegen hat es das Spiel trotz zahlreicher Ank&uuml;ndigungen noch immer nicht
in die Verkaufsregale geschafft.
<P>
Der nun angestrebte Ver&ouml;ffentlichungstermin ist Oktober 99, vielleicht
klappt es bis zur Home Electronics World 99 ja...
</P>
<P>
Dazu zeigte man Demos zu Shogo, dem 3D-Shooter, Heretic 2 und Joyride,
einer Racing-Sim, die vor allem durch den Sound zu gefallen wu&szlig;te, aber
auch ansonsten auf ein gutes Spiel hoffen l&auml;&szlig;t.
</P>
<P>
Au&szlig;erdem hing etwas &uuml;berraschend ein Plakat von Ph&ouml;nix am Titan-Stand...
Zur Erkl&auml;rung: Titan nimmt sich der Mac-Umsetzung an!
</P>
<P>
Leider konnte man nichts neues von Claws of the Devil sehen und eine
Amiga-Version schien nach einer Nachfrage mittlerweile sehr fraglich.
Bei Titan war man etwas entt&auml;uscht (genau wie ich) &uuml;ber das, was Amiga auf
der Messe zeigte (Kommentar:&quot;...einen Pappkarton kann ich auch in einen
Schaukasten setzen!&quot;) und wollte erst den weiteren Verlauf der Messe
abwarten, bevor man endg&uuml;ltiges zur Amiga-Version von Claws sagen wollte.
Au&szlig;erdem wartete man dringend auf die Bekanntgabe des Prozessors sowie
weitere Informationen, um Programme entsprechen f&uuml;r die NG-Amigas anpassen
zu k&ouml;nnen.
</P>
<P>
Au&szlig;erdem wurde nicht ausgeschlossen Claws nur noch f&uuml;r die NG-Amigas
herauszubringen, aber in erster Linie konzentriere man sich auf Play
Station- und Mac-Version!
</P>
<P>
Also, als Spielefreak konnte man noch einigerma&szlig;en zufrieden sein,
schlie&szlig;lich wurden sehr interessante und zumeist auch sich der
Fertigstellung n&auml;hernde Demos gezeigt, die fast durchweg &uuml;berzeugen
konnten!
Auch ansonsten wurde dem Zockerherz einiges geboten: In der Games Arena der
T-zer0 Wettkampf, ein Sensible Soccer Turnier und einiges mehr.
</P>
<P>
Aber was gab es sonst noch zu sehen?
</P>
<P>
Zum Beispiel IBrowse 2, das regen Anklang fand, Voyager 3 beide mit
JavaScript-Unterst&uuml;tzung, PFS 3, Power Computing pr&auml;sentierte Punchinello,
einen PC keyboard adapter, sowie RedMars, ein neues Strategiespiel, Ateo
Concepts k&uuml;ndigte die Pixel 64 ZIII, eine neue Grafikkarte an und zwei
Schnittstellenkarten, AteoSCSI und AteoIDE, beide ab September erh&auml;ltlich
und Coyote Flux pr&auml;sentierte ein Programm, mit dem es m&ouml;glich ist, 680x0
source-codes zu PPC source-codes zu konvertieren, also die PPC-
Programmierung deutlich erleichtern soll.
</P>
<P>
Tja, ich glaube zwar nicht, da&szlig; ich damit alles erw&auml;hnt habe, aber etwas
wirklich besonderes neues war auf der Messe auch nicht zu finden.
</P>
<P>
Vielmehr versuchte ich schon bald die Zeit totzuschlagen, bzw. auf die
Annex-Auftritte zu warten, die wie immer hervorragend vom Publikum
angenommen wurden.
</P>
<P>
<A HREF="img/WoA4.jpg"><IMG SRC="thumb/WoA4.jpg" WIDTH="120" HEIGHT="90" ALT="Bild"  BORDER="0"></A>
</P>
<P>
Auch Jim Collas schaute sich den ersten Auftritt sichtlich zufrieden aus
n&auml;chster N&auml;he an...
</P>
<P>
Was mir auch noch auffiel, war, da&szlig; viele Clubs ein eigenes Magazin zur
Messe herausbrachten, die zumeist sehr interessant waren und vielleicht f&uuml;r
einige ein Test sein sollten, um sp&auml;ter ein regelm&auml;&szlig;iges Magazin
herauszubringen.
</P>
<P>
Gegen 17.30 Uhr war die Messe dann auch offiziell beendet und es wurde zur
anschlie&szlig;enden Besprechung eingeladen, an der aber auch nicht alle Leute
teilnehmen konnten, man mu&szlig;te sich am Amigastand in eine Liste eintragen,
solange denn noch Pl&auml;tze frei waren...
</P>
<P>
Aber ob jemand was verpa&szlig;t hat, der nicht dagewesen ist???
</P>
<P>
Tja, alles in allem war ich ziemlich entt&auml;uscht von der World of Amiga 99,
von Amiga selbst, von der ganzen Organisation und auch von der Anzahl der
Aussteller.
</P>
<P>
Na ja, was hei&szlig;t entt&auml;uscht? Man f&uuml;hlte sich ungef&auml;hr so, wie in den
letzten Jahren...
</P>
<P>
Wollen wir hoffen, da&szlig; wenigstens auf der K&ouml;lner Messe etwas mehr zu sehen
sein wird und Amiga uns etwas mehr pr&auml;sentiert, als nur ein Geh&auml;use.
</P>
<P>
Markus Tillmann &lt;<A HREF="mailto:golz@online-club.de">golz@online-club.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Tests7.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
