<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele13.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele15.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Mac-Ecke Review: Exile III: Ruined World</H1>
<P>
Nur den wenigsten d&uuml;rfte der dritte Teil der Ultima-&auml;hnlichen Exile-Reihe
bekannt sein, zumal diese nur als Shareware vertrieben wird. Einen
Vergleich  mit kommerziellen Produkten muss das Rollenspiel jedoch
keinesfalls scheuen, weswegen es auch an dieser Stelle vorgestellt wird.
</P>
<P>
Die Handlung von Exile III l&auml;sst sich in etwa so zusammenfassen: In einer
Fantasywelt wurden alle die Bewohner, die dem herrschenden &quot;Empire&quot;
unangenehm waren, in ein abgeschottetes Exil geschickt, ein riesiges
H&ouml;hlensystem, aus dem es kein Entkommen gab. Die ersten beiden Exile-Teile
schildern den  Kampf der im Exil lebenden mit den Soldaten des Empire,
nachdem mit Hilfe von m&auml;chtigen Zaubern ein Tor in die Oberwelt geschaffen,
und der Herrscher des Empires get&ouml;tet wurde. Mit Hilfe der Vanathai, einem
unterirdisch lebenden Volk mit eigenen magischen Kr&auml;ften, gelang es den
Exilern schlie&szlig;lich, die Truppen des Empire zur&uuml;ckzuschlagen. Einige Jahre
sp&auml;ter beginnt die Handlung von Exile III. Nach einer langen Zeit des
Leidens gelingt es den Magiern des Exils schlie&szlig;lich, ein Portal zu
erschaffen, das eine Reise an die mittlerweile nur noch aus Geschichten
bekannte Oberwelt erm&ouml;glicht. Der Spieler schl&uuml;pft nun in die Rolle einer
Abenteurergruppe, die die Aufgabe erh&auml;lt, die Oberwelt zu erforschen und
eine Besiedlung durch die Bev&ouml;lkerung des Exils vorzubereiten.
</P>
<P>
Wie bereits erw&auml;hnt, erinnert das Spiel vom Prinzip her an die alten
Ultima-Teile. Es gilt, die (riesige) Welt zu erforschen, mit vielen anderen
Menschen zu sprechen und so ganz nebenbei auch noch eine ganze Reihe von
mehr oder weniger starken Monstern und Kreaturen zu besiegen. Das besondere
daran ist die totale Handlungs- und Bewegungsfreiheit, die dem Spieler
zuteil wird. Man hat die M&ouml;glichkeit, der (sehr guten) Handlung zu folgen
und nacheinander die wichtigen Aufgaben zu erledigen - oder man erkundet
zun&auml;chst die riesige Oberwelt mit ihren &uuml;ber hundert Orten und H&ouml;hlen.
Alternativ kann man auch in der Unterwelt Abenteuer erleben, oder sp&auml;ter
auch noch weiter in die Tiefe zum Turm der Magier vordringen.
</P>
<P>
Besonderes Lob verdient das vollkommen intuitive point-and-click-Interface,
welches extrem benutzerfreundlich ist. Vor allem die Gespr&auml;che mit anderen
Personen sind sehr gut gemacht - ein einfacher Klick auf ein Schlagwort in
der Rede des Gegen&uuml;bers reicht aus, um darauf weiter einzugehen. Zahlreiche
Nebenplots und kleinere Aufgaben, sowie die &uuml;berall zu findenden
Geheimg&auml;nge- und Wege lassen das Spiel nie langweilig werden. Die Grafik
ist nicht weltersch&uuml;tternd, aber sehr ansprechend und von professioneller
Qualit&auml;t.
</P>
<P>
Da das Spiel keine &uuml;berm&auml;&szlig;igen Grafikorgien bietet, und ausserdem Runden-
und Felderbasierend ist, l&auml;uft das Ganze in voller Geschwindigkeit und
l&auml;sst so erneut vergessen, dass man es auf einem Emulator spielt. Auch hier
sollte ein langsamerer Prozessor als ein 040er ausreichen, um es in einer
vern&uuml;nftigen Geschwindigkeit spielen zu k&ouml;nnen.
</P>
<P>
Fazit: Da Rollenspiele nicht nur auf dem Amiga schon seit jeher Mangelware
sind, sollte jeder, der dieses Genre mag, mit gutem Gewissen zuschlagen.
Das die Exile-Reihe mit einigen Preisen von Mac-Magazinen ausgezeichnet
wurde, zeugt von der hohen Qualit&auml;t des Spieles. Das einzige Problem ist,
dass man das Spiel in Amerika ordern muss, da es (meines Wissens nach)
nicht in Deutschland vertrieben wird. Wer einfach mal reinschnuppern will,
kann unter &quot;www.spidweb.com&quot; auch ein Demo des Spieles runterladen, und
sich so selbst einen Eindruck schaffen.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele13.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele15.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
