<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele14.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele16.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Mac-Ecke Review: Pirates GOLD!</H1>
<P>
Auch &uuml;ber dieses Spiel muss man nicht allzuviele Worte verlieren,
schlie&szlig;lich gibt es das Ganze auch als CD32-Artikel f&uuml;r den Amiga.
Allerdings kam ich nicht in den Genuss, es einmal auf der Amiga-Seite zu
spielen. Aus diesem Grund kann ich keinen Vergleich zur Mac-Version
herstellen :-(
</P>
<P>
In diesem Spiel, das man vielleicht als &quot;Piraten-Sim&quot; bezeichenen k&ouml;nnte,
geht es darum, in der Karibik des 17ten Jahrhunderts als &quot;Schiffseigner&quot;
sein Gl&uuml;ck zu finden. Dies kann zwar theoretisch auch &uuml;ber den einfachen
Handel mit den St&auml;dten der vier verschiedenen Nationen geschehen, schneller
und interessanter d&uuml;rfte allerdings das wilde Freibeuterleben sein. Hat man
sich dazu entschieden sollte man sich erst einmal nach weiteren
Mannschaftsmitgliedern umsehen, um sich eine Grundlage f&uuml;r das Kapern von
Schiffen und das Erobern feindlicher St&auml;dte zu schaffen. Ist dies geschehen
kann man sofort mit seinem Boot in See stechen. Es wird nicht lange dauern,
bis die ersten Schiffe mit einem deftigen &quot;Sail Ho&quot; am Horizont erscheinen.
M&ouml;chte man ein solches Schiff kapern, folgt eine kleine Seeschlacht, bei
der man durch geschicktes Man&ouml;vrieren und einen guten Einsatz seiner
Kanonen einen ordentlichen Vorteil f&uuml;r das folgende Duell mit dem
gegnerischen Kapit&auml;n erreichen kann. Diesem tritt man mit einer von drei
m&ouml;glichen Klingenwaffen entgegen und hat nun die Wahl zwischen schnellen
und harten Schl&auml;gen, sowie dem Parieren des Gegners. Mit demselben
Zweikampf enden auch Stadterst&uuml;rmungen, nachdem man zun&auml;chst via Schiff
oder zu Fu&szlig; das gegnerische Fort erreicht hat. Die Erst&uuml;rmung der
gegnerischen Festung ist allerdings eine Kunst f&uuml;r sich. Neben dem Gold,
welches man auf Schiffen oder in St&auml;dten pl&uuml;ndert, raubt man auch Waren,
die wiederum im n&auml;chsten freundlich gesonnen Hafen verkauft werden k&ouml;nnen.
</P>
<P>
Ein weiteres Spiel, dem man auf einem 040/40er nicht anmerkt, dass es auf
eine Emulation aufgesetzt ist. Einen Unterschied zu einem Original-Mac gibt
es hier in Sachen Geschwindigkeit nicht.
</P>
<P>
Fazit: Obwohl die Grafik der Mac-Version sehr h&uuml;bsch ist, ist leider noch
etwas an der Steuerung auszusetzen, die recht gew&ouml;hnungsbed&uuml;rftig ist, vor
allem im Zweikampf. Das Gemisch aus Maus- und Tastatursteuerung h&auml;tte
bestimmt an einigen Stellen eleganter gel&ouml;st werden k&ouml;nnen. Ansonsten ist
Pirates Gold allerdings &quot;spielerisch wertvoll&quot; und weiss den Spieler
nachhaltig zu begeistern (zumindest mich) :-)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele14.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele16.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
