<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele12.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele14.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>10. Mac-Ecke Review: Civilization II</H2>
<P>
Das Spielprinzip von Civilization d&uuml;rfte wohl den meisten gel&auml;ufig sein,
zumal der erste Teil auch f&uuml;r den Amiga erh&auml;ltlich ist und wohl ein
Referenzprodukt in der Klasse der Strategiespiele darstellt. Der zweite
Teil ist eine konsequente Weiterentwicklung des Klassikers - alte Fehler
wurden beseitigt, einige Dinge hinzugef&uuml;gt, andere verbessert.
</P>
<P>
Ziel des rundenbasierenden Strategiespiels ist es, auf einer unerforschten
Welt eine Zivilisation zu errichten und diese auf der Zivilisationsleiter
stetig h&ouml;her steigen zu lassen. Dabei stehen zu Anfang nur ein oder zwei
Siedler zur Verf&uuml;gung, mit denen man seine ersten St&auml;dte bauen kann. Diese
wiederum k&ouml;nnen Einheiten produzieren und Stadterweiterungen oder
Weltwunder bauen. Au&szlig;erdem erwirtschaften sie, je nach Gr&ouml;&szlig;e, mehr oder
weniger Steuergelder, Wissen und Luxusg&uuml;ter. Im Laufe der Zeit w&auml;chst die
eigene Zivilisation, und mit ihr der technologische Fortschritt; immer neue
Errungenschaften, wie beispielsweise das Alphabet zu Anfang bis hin zu
Raumfahrt und Gentechnik gegen Ende des Spieles, warten darauf, von euren
Wissenschaftlern entdeckt zu werden. Am interessantesten ist allerdings die
Interaktion mit bis zu sechs anderen, vom  Computer gesteuerten,
Zivilisationen, die ihrerseits versuchen, ihre Macht zu erweitern. Dabei
kann man sowohl eine friedliche Koexistenz anstreben und feste B&uuml;ndnisse
kn&uuml;pfen, oder man entscheidet sich f&uuml;r einen Konfliktkurs, der von einer
Art &quot;kaltem Krieg&quot; bis hin zur totalen Vernichtung einer Seite f&uuml;hren kann.
</P>
<P>
Im Gegensatz zu CivilizationAGA, das auf meinem Rechner peinlich langsam
ist, merkt man Civilization II eigentlich gar nicht an, dass es auf einer
Emulation l&auml;uft. Es ist angenehm schnell, selbst die sehr sch&ouml;n gemachten
Zwischenanimationen, wenn Weltwunder gebaut werden, gehen zwar etwas
ruckelig aber anstandslos &uuml;ber den Bildschirm. Ich vermute sogar, dass das
Spiel schon auf einem nackten 030/xxx fl&uuml;ssig zu  spielen ist. Wenn ihr
Civilization II auf so einer Konfiguration laufen habt, mailt mir.
</P>
<P>
Fazit: Wer einen Mac-Emulator bei sich laufen hat und Civilization mochte,
wird den Nachfolger lieben. Alles, was am ersten Teil irgendwie auszusetzen
war, wurde verbessert, das Ganze spielt sich angenehm fl&uuml;ssig und fesselt
f&uuml;r Tage und Wochen an den Bildschirm.
</P>
<P>
Und wer keinen Mac-Emulator hat: Holt euch einen! Es lohnt sich auf jeden
Fall!
</P>
<P>
Weitere Kommentare oder Testergebnisse auf anderen Systemen sind gerne
wilkommen!
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele12.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele14.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
