<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele9.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele11.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. Kommentar zum Napalm-Test von Manni Froitzheim (von I. Nikitopoulos)</H2>
<P>
Richtig so, Manni Froitzheim, nur weil es derzeit und schon lange
keine guten Amiga-Games mehr gibt muss man wirklich nicht alles gut
finden! Bei den wenigen Games, die in letzter Zeit erschienen sind,
hatte ich den Eindruck gewonnen, die wollen nur mit der Not die
schnelle Mark machen.
</P>
<P>
Eine Grafikflut macht noch lange kein gutes Spiel. Ich habe schon
sehr oft in diveresen PC oder PSX-Magazinen ganz tolle Previews gesehen,
(&quot;boa, was f&uuml;r ne Grafik&quot;) doch als das Game dann ver&ouml;ffentlicht wurde,
entpuppte es sich als spieltechnischer Mega-Flop. Muss denn immer mit
&Auml;u&szlig;erlichkeiten geprotzt werden? Nein! Kaviar sieht schlie&szlig;lich auch
ziemlich sch**** aus, und die Reichen und Sch&ouml;nen stehen da voll drauf.
</P>
<P>
Siedler, eines der besten Games aller Zeiten, hat dies etwa eine
tolle Grafik? Oder tollen Sound? Oder gar tolle Effekte? Nein!
</P>
<P>
Viel gespannter als auf ein neues Game von Click&quot;michweg&quot;Boom bin ich
auf den zweiten Teil von Imperium Terranum, der erste Teil war schon
echt gut gelungen und schon seit einiger Zeit eines meiner Lieblingsgames.
</P>
<P>
Dass der Amiga, vor allem wenn man eine Mindestkonfiguration von AGA,
020er, 8 MB Ram und CD-Rom auf der Verpackung vorsieht (Quake),
als Spielcomputer v&ouml;llig &uuml;berfordert und ungeeignet ist, sollte jedem
klar sein. In so einem Fall ist das Game wirklich nur 30 DM wert.
Nicht dass mir jetzt jemand kommt &quot;ich habe aber nen 060er und Graka&quot;,
jeder der diese Hardware betreibt und dieses Game gezockt hat wei&szlig;,
dass dies eine mittelgro&szlig;e Zumutung sein kann.
</P>
<P>
F&uuml;r nen Hunni kauf' ich mir lieber einen PSX-Titel, so wie am letzten
Freitag Civilization 2. Dort fand ich eine recht mittelm&auml;&szlig;ige
ECS-Grafik, einen standardm&auml;&szlig;igen Amiga-Sound und viiiiiiel
spieltechnische Qualit&auml;t vor, eigendlich ein Game das gerne sagen
wollte &quot;steck mich in Deinen Amiga und ich bereite Dir viele sch&ouml;ne
Stunden voller Fun&quot;.
</P>
<P>
Ich will keine R&uuml;ckkehr zur Rohkost, doch wenn ein Fass aufgemacht wird
dann bitte nicht eines mit sauren Wein. Gameproduzenten sollen keine
R&uuml;ckschritte vornehmen, sie sollten vom Vorhandenen lernen. Stattdessen
werden Games herausgebracht, die eine auf dem Amiga noch nie gekannte
Problematik hervorrufen, Inkompatibilit&auml;t und Unausgegorenheit. Dies war
bislang nur von Dosen-Games bekannt.
</P>
<P>
Der User ist kein Beta-Tester und er sollte nicht &uuml;ber jeden Knochen
den er vor die F&uuml;&szlig;e geworfen bekommt, himmelhochjautzend jubeln!
Bei allem was Amiga (Inc/Int) macht wird kritisch bewertet, meist
ohne zu &uuml;berlegen gemotzt. Bei Games, so auch bei Napalm, werden diese
in den Himmel gelobt, schlie&szlig;lich &quot;sollten wir froh sein, da&szlig; es ein
neues Game gibt&quot;.
</P>
<P>
Ioannis Nikitopoulos &lt;<A HREF="mailto:Ioannis.Nikitopoulos@t-online.de">Ioannis.Nikitopoulos@t-online.de</A>&gt;
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele9.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele11.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
