<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Hyperion Software bringt Heretic II
</LI>
</UL>
<P>
Hyperion Software hat sich einen weiteren 3D Shooter lizensieren lassen.
Diesmal ist es das Spiel Heretic von Activision. Heretic II basiert auf
der Quake II Engine von ID Software und war am PC ein totaler Erfolg
(fast nur &uuml;ber 90% Wertungen). Klar, dass das Spiel PowerPC, Grafikkarte
und CD-ROM vorraussetzt. Auf der Hyperion Software Homepage gibt wurde
k&uuml;rzlich ein Progress Report zu Shogo ver&ouml;ffentlicht, in dem der aktuelle
Status des Ports beschrieben wird.
</P>
<P>
<A HREF="img/Heretic1.jpg"><IMG SRC="thumb/Heretic1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Heretic2.jpg"><IMG SRC="thumb/Heretic2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Heretic3.jpg"><IMG SRC="thumb/Heretic3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> clickBOOM bringt Nightlong
</LI>
</UL>
<P>
clickBOOM will nach eigenen Angaben das wohl umfangreichste Amiga Spiel
seit jeher bringen. Satte 3 CD`s soll die Endversion f&uuml;llen, welche am
PC schon 1998 von Team 17 erschien. Die Amiga Version ist m&ouml;glicherweise
schon Ende dieses Jahres fertig. Das ein Spiel auf 3 CD`s einiges an
Grafik zu bieten hat, d&uuml;rfte wohl jedem klar sein. So darf man sich auf
viele Zwischensequenzen sowie 16 bit Cyberpunk Grafik freuen.
</P>
<UL>
<LI> Foundation wird weiterentwickelt
</LI>
</UL>
<P>
Kurz nachdem Paul Burkey angek&uuml;ndigt hatte, Foundation nicht mehr
weiterentwickeln zu wollen, u.a. wegen des R&uuml;ckzugs des Publishers
Sadeness, gab es gestern die gro&szlig;e Entwarnung. Nach einem Gespr&auml;ch
mit einem anderen Amiga Publisher auf der World of Amiga entschloss
sich Paul Burkey Foundation weiterzuentwickeln. Die neue Version,
die Ende 1999, ver&ouml;ffentlicht werden soll, soll nicht einfach nur
ein Re-Release werden, sondern eine komplett &uuml;berarbeitete Version.
Als Ziele wurden sich vorgenommen: Neuprogrammierung in portierbarem
C/C++, PowerPC Unterst&uuml;tzung, neue Level, neue Musik + Sound und
noch einiges mehr. Auch der langerwartete TCP/IP Support wird in
einem der n&auml;chsten Updates endlich vorhanden sein.
</P>
<UL>
<LI> &Uuml;bler Scherz von Team 17
</LI>
</UL>
<P>
F&uuml;r gro&szlig;e Aufregung hat die Ank&uuml;ndigung von Team 17 gesorgt, dass
man plane, Worms Armageddon f&uuml;r den Amiga umzusetzen. Das ganze sollte
dann auf 17 Disketten ver&ouml;ffentlicht werden. Auf Nachfrage hin
hat Team 17 jedoch erkl&auml;rt, dass es sich hierbei um einen Scherz
handle (britischer Humor....), und dass Worms Armageddon nur f&uuml;r
den Amiga NG kommen w&uuml;rde. Allerdings auch nicht von Team 17,
sondern von einer anderen Firma.
</P>
<UL>
<LI> Space Station 3000 Ver&ouml;ffentlichung verz&ouml;gert sich
</LI>
</UL>
<P>
Die Ver&ouml;ffentlichung des Echtzeit-Weltraum Strategiespektakels
Space Station 3000 von Digital Images verz&ouml;gert sich um weitere
1 bis 2 Monate. Stuart Walker sagte, danach k&ouml;nne man sich sicher
sein, dass Space Station 3000 das beste Strategiespiel f&uuml;r Amiga
und PC sein werde.
</P>
<UL>
<LI> Operation Counterstrike Demo verz&ouml;gert
</LI>
</UL>
<P>
Urspr&uuml;nglich war die spielbare Demoversion von Operation Counterstrike
zur World of Amiga angek&uuml;ndigt, doch wegen einiger Fehler im Spiel
entschloss man sich, noch keine Demo zu ver&ouml;ffentlichen. Man geht
aber fest davon aus, sie in K&uuml;rze auf der Homepage zum Download
bereitzustellen.
</P>
<UL>
<LI> Tales from Heaven News
</LI>
</UL>
<P>
Laut Darkage Software, den Autoren des Mario64 Klons Tales from
Heaven, steht das Spiel kurz vor der Fertigstellung. Auf der World
of Amiga sollte eine fertige Version gezeigt werden. Das Spiel
soll danach in k&uuml;rzester Zeit &uuml;ber Epic-Marketing beziehbar sein.
Ein weiteres Spiel der Gruppe, n&auml;mlich Alive, ein Shoot`em`Up
im Stil von ProjectX und Turrican, wurde vorerst auf Eis gelegt.
Man will die Amiga User &uuml;ber ein Wahlsystem auf der Homepage dar&uuml;ber
entscheiden lassen, ob Alive weiterentwickelt wird. Auch arbeite
Darkage Software momentan an einem anderen Spiel, &uuml;ber das noch
keine Details vorliegen. Aber es werde wieder ein Hammer, der die
Amiga User schockt, wie es damals schon Tales of Heaven getan
hat.
</P>
<UL>
<LI> Spieleentwicklung f&uuml;r den Amiga NG
</LI>
</UL>
<P>
Eine zentrale Frage bei den Spieleank&uuml;ndigungen f&uuml;r den Amiga NG
die letzten Monate war: Wie kann man Spiele f&uuml;r einen Computer
entwickeln, der noch nicht einmal existiert? Die AmigaFlame hat
diese Gelegenheit genutzt, um mal bei Digital Images und Delsyd
Software anzufragen, wie sie ihre Amiga NG Spiele ohne Amiga NG`s
entwickeln. Die Antworten stimmten bei beiden sogut wie &uuml;berein:
Man entwickele die Spiele komplett im einfach-portierbaren C auf,
PPC/WarpOS, so dass man die Endversion auch relativ schnell f&uuml;r
ein neues System, den Amiga NG, auf die Beine stellen k&ouml;nne.
Delsyd Software benutzt dazu noch OpenGL, welches die Portierung
nochmals erleichtert.
</P>
<UL>
<LI> Q-Lab sucht Programmierer
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Bei Q-Lab sucht man Programmierer f&uuml;r Po Po Chicken, die vorzugsweise&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">in C/C++ oder ASM programmieren k&ouml;nnen. F&uuml;r die geleistete Arbeit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">wird man bezahlt und erh&auml;lt eine freie Endversion des Spieles. Auch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">f&uuml;r das Adventure WEL sucht man Programmierer, allerdings darf nur&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">in C programmiert werden, da das Spiel auch f&uuml;r PC erscheinen soll.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Man muss Erfahrung in der 3D Programmierung mitbringen und auch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">existierende 3D Engines verwenden k&ouml;nnen. Interessierte wenden sich&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">an Will Morton &lt;<A HREF="mailto:q@qlab.swinternet.co.uk">q@qlab.swinternet.co.uk</A>&gt;.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Alive Mediasoft News
</LI>
</UL>
<P>
Alive Mediasoft hat Phoenix Fighters ver&ouml;ffentlicht. Die Vollversion
bietet &uuml;ber 200 Level, unterst&uuml;tzt sowohl Ein- als auch Zweispieler
Modi, kommt auf CD-ROM und kann f&uuml;r umgerechnet 45 DM bei Alive Mediasoft
bezogen werden. Au&szlig;erdem hat Alive Mediasoft jetzt Turbo Racer 3D
ins Programm aufgenommen. Dieses Spiel ist bei uns in Deutschland
aber schon l&auml;nger erh&auml;ltlich.
</P>
<UL>
<LI> T Zer0 ver&ouml;ffentlicht
</LI>
</UL>
<P>
clickBOOM hat das neue Shoot`em`Up T-Zer0 ver&ouml;ffentlicht. Entwickelt
wurde das ganze von einem italienischen Team und die endg&uuml;ltige Version
nimmt &uuml;ber 100MB Speicherplatz in Anspruch, kommt allerdings (zum
Gl&uuml;ck) auf CD-ROM. Au&szlig;erdem gibt es animierte Zwischensequenzen und
andere Nettigkeiten. Mit etwas Gl&uuml;ck k&ouml;nnt ihr einen Test schon in
der n&auml;chsten Ausgabe lesen.
</P>
<P>
<A HREF="img/TZero1.jpg"><IMG SRC="thumb/TZero1.jpg" WIDTH="104" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/TZero2.jpg"><IMG SRC="thumb/TZero2.jpg" WIDTH="108" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Pagan Software News
</LI>
</UL>
<P>
Pagan Software plante, zur World of Amiga ein Demo des Zelda-&auml;hnlichen
Spiel Dafel Bloodline herauszugeben, da die Entwicklung des Spiels
momentan sehr gut l&auml;uft. Das Weltraumaction Spiel Scavengers ist leider
nur gerade mal zu 25% fertig. Die neueste Ank&uuml;ndigung, das 3D
Strategiespiel Magerick, soll einen PowerPC ben&ouml;tigen. Au&szlig;erdem sucht
man dringend PPC/WarpOS Programmierer sowie 3D Grafiker. Interessierte
k&ouml;nnen Jason Hayman &lt;<A HREF="mailto:caradog@pagan-games.com">caradog@pagan-games.com</A>&gt; kontaktieren.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
