<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Vorwort (mit R&uuml;ckblick auf den Monat Juli)</H1>
<P>
AMIGA gibt weitere Konzeptzeichnungen zur Ver&ouml;ffentlichung frei +++ AMIGA
stellt Dr. Richard Lipes als 'Director of Multimedia Services' ein +++
AMIGA verwendet Linux- statt QNX-Kernel f&uuml;r das AmigaOE +++ AMIGA
ver&ouml;ffentlicht Technologiepapier zum AmigaNG +++ AMIGA gibt Kooperation mit
Corel bekannt +++ AMIGA stellt Geh&auml;usemodell f&uuml;r den Amiga MCC vor +++
AMIGA verwendet offenbar Transmeta als AmigaNG-Prozessor +++
Ver&ouml;ffentlichung des Amiga OS 3.5 verz&ouml;gert sich voraussichtlich um ein bis
zwei Monate
</P>
<P>
Soweit die Schlagzeilen des Monats Juli (in chronologischer Reihenfolge).
Willkommen damit zur umfangreichsten Ausgabe in der Geschichte von AMIGA
aktuell, nachdem ein wahrhaft aufregender, aber auch stressiger Monat zu
Ende gegangen ist. War die bisherige Zeit der 'Collas-&Auml;ra' schon sehr
interessant, so haben die vergangenen Wochen alles Dagewesene bei weitem in
den Schatten gestellt.
</P>
<P>
Wer sich so ausf&uuml;hrlich mit Amiga-Neuigkeiten befasst wie ich das als
Herausgeber dieses Magazins zu tun pflege, k&ouml;nnte fast meinen, der Amiga
h&auml;tte im Juli den PC in der Medienpr&auml;senz klar auf den zweiten Platz
verwiesen... Ganz so war es nat&uuml;rlich nicht, aber es ist schon beachtlich,
wer alles (teilweise mehrmals) &uuml;ber AMIGAs Neuigkeiten berichtet hat:
CNN, c't, Die Zeit, Forbes, Mac Times, NBC Giga, PC Week, SAP Magazin,
Screen Multimedia, Yahoo, ZDNet, und viele, viele andere. Wohl noch nie
seit dem Konkurs von Commodore hat der Amiga soviel Aufsehen erregt wie in
diesen Wochen.
</P>
<P>
Aber nun zu den Neuigkeiten im Einzelnen:
</P>
<P>
Manchmal beneide ich fast (aber eben nur fast) diejenigen von euch, die
AMIGA aktuell per Post bekommen, weil sie &uuml;ber keinen Netzzugang verf&uuml;gen.
Ihr ahnt ja gar nicht, was sich in den ersten Tagen nach Bekanntwerden von
AMIGAs Entscheidung, nicht QNX sondern einen Linux-Kernel als Basis f&uuml;r die
Amigas der n&auml;chsten Generation zu verwenden, in der Amiga-&Ouml;ffentlichkeit
abgespielt hat. In den Foren und Newsgroups herrschte wahre Hysterie, und
zwar nicht etwa aus Begeisterung, sondern aus Wut auf AMIGA und speziell
dessen Pr&auml;sidenten Jim Collas, der in ihren Augen nur einen weiteren Linux-
Computer auf den Markt bringen wollte.
</P>
<P>
Zwar gab es von Beginn an auch Stimmen, die entweder zur Geduld mahnten
oder die Entscheidung zugunsten Linux begr&uuml;&szlig;ten, aber anfangs konnten sich
diese nicht im geringsten gegen die Ablehnungsfront der breiten Masse
durchsetzen.
</P>
<P>
Dadurch sah sich Jim Collas veranlasst, in den folgenden Tagen mehrere
Statements und Erkl&auml;rungen zu ver&ouml;ffentlichen, was schlie&szlig;lich - auf Kosten
seines Wochenendes - etwas zur Beruhigung der Gem&uuml;ter f&uuml;hrte. Bezeichnend
daf&uuml;r war eine Online-Umfrage, die auf einer Amiga-Internet-Seite
veranstaltet worden ist: Kurz nach Bekanntwerden der Linux-Entscheidung
wurde diese nur von etwa einem Viertel der Teilnehmer unterst&uuml;tzt, bei
Beendigung der Abstimmung jedoch hielten sich Bef&uuml;rworter und Gegner etwa
die Waage.
</P>
<P>
Allein schon dies h&auml;tte vollkommen f&uuml;r einen kurzweiligen Amiga-Monat
ausgereicht, aber da gab es ja noch das Technologiepapier zum AmigaNG, das
wenige Tage sp&auml;ter ver&ouml;ffentlicht wurde und gr&ouml;&szlig;tenteils die Zustimmung der
Anwender fand. Nat&uuml;rlich gab es auch kritische Stimmen sowie vereinzelte
'Totalverweigerer', aber das kann nicht verwundern, die Amiga-
Anwenderschaft ist schlie&szlig;lich keine homogene Gruppe.
</P>
<P>
Insbesondere, was die Serienausstattung des AmigaNG betrifft, gibt es in
der Gemeinde sehr unterschiedliche Ansichten. Ein Teil der Anwender w&uuml;nscht
sich veraltete, aber noch weit verbreitete Technologien, wie eine parallele
oder serielle Schnittstelle, oder auch das in der Leistungsf&auml;higkeit immer
mehr von EIDE/ATA eingeholte SCSI als festen Bestandteil des AmigaNG.
Mein Vorschlag: Warum kaufen sich diejenigen, die diese Anschl&uuml;sse f&uuml;r sich
als notwendig erachten, nicht entsprechende Erweiterungen f&uuml;r USB bzw. PCI?
Insbesondere Boards f&uuml;r letztgenannten Steckplatz sind quasi f&uuml;r &quot;'nen
Appel und 'n Ei&quot; erh&auml;ltlich.
</P>
<P>
Auch das Thema 'Diskettenlaufwerk' erhitzte die Gem&uuml;ter: Ich pers&ouml;nlich
glaube kaum, dass die Anwender sich auf ein Standard-Laufwerk einigen
k&ouml;nnten. Die einen werden das LS120-Drive bevorzugen, eine zweite Gruppe
das Konkurrenzprodukt Zip-Drive und wieder andere Anwender aus
Kostengr&uuml;nden ein simples 1,44MByte-Laufwerk, der Rest will ganz auf eine
Floppy verzichten. Deshalb tut AMIGA aus meiner Sicht gut daran, den
AmigaNG serienm&auml;&szlig;ig mit gar keinem Diskettenlaufwerk zu versehen. Ein 3,5&quot;-
Schacht sollte aber auf jeden Fall vorhanden sein.
</P>
<P>
Den Schlusspunkt des Monats Juli setzten die parallel abgehaltenen Amiga-
Messen World of Amiga in London und Amiwest in Sacramento. AMIGA zeigte
n&auml;mlich (hinter Glas) ein Geh&auml;usemodell f&uuml;r den geplanten Amiga MMC
(Multimedia Convergence Computer), das in der Amiga-Gemeinde breite
Zustimmung gefunden hat. Es &auml;u&szlig;erten sich jedoch auch vereinzelt Anwender,
die das Geh&auml;use f&uuml;r zu schlicht halten oder aber sich ein konventionelleres
Computer-Design w&uuml;nschen. Dank des ATX-Standards d&uuml;rfte einem Umbau in ein
anderes Geh&auml;use aber nichts im Wege stehen, und ob der Amiga MCC
tats&auml;chlich in dem gezeigten Geh&auml;use auf den Markt kommt, ist ja auch noch
die Frage.
</P>
<P>
Vielleicht noch wichtiger als das Geh&auml;usemodell war aber ein Video, das
AMIGA auf diesen Veranstaltungen vorgef&uuml;hrt hat: Darin wurden unter anderem
die Partnerfirmen des Unternehmens bei der Entwicklung des AmigaNG in
schriftlicher Form genannt, neben Sun (Java-Eigner), Pentagram
(verantwortlich f&uuml;r die Geh&auml;usedesigns) und Corel (Bereitstellung von
Anwendungssoftware) auch Transmeta! Damit verdichten sich Spekulationen,
dass im AmigaNG tats&auml;chlich der sagenumwobene Prozessor dieser Firma zum
Einsatz kommen wird. So gut wie niemand wei&szlig;, wie weit die Entwicklung
dieses Chips fortgeschritten ist und welche Leistungsdaten er aufweist.
Ger&uuml;chten zufolge handelt es sich dabei jedoch um eine revolution&auml;re
Prozessorneuentwicklung - und das w&uuml;rde ja bestens zu den Andeutungen von
Jim Collas passen. Eine offizielle Ank&uuml;ndigung von AMIGA zur Verwendung des
Transmeta gibt es zwar noch nicht, aber die Nutzung von Linux, dessen
'Vater' Linus Torvalds heute bei Transmeta t&auml;tig ist, l&auml;sst die Verwendung
dieser CPU im AmigaNG nur als noch wahrscheinlicher erscheinen.
</P>
<P>
Eine Information am Rande: Nach AMIGAs Schwenk zum Linux-Kernel sieht Phase
5 offenbar wieder einmal Chancen zur Etablierung eines Konkurrenz-
Computersystem, das mit dem QNX-Betriebssystem Neutrino ausgeliefert werden
soll (wie &uuml;brigens auch die PPC-G3-Karten des Unternehmens, s.u.). Bleibt
abzuwarten, ob Phase 5 es diesmal schafft, eine Rechnerank&uuml;ndigung auch
wirklich in die Tat umzusetzen - die bisherigen Versuche A\Box und pre\box
scheiterten bekanntlich bereits im Ansatz. Damals jedoch hatte der Amiga
kaum eine Perspektive, da sich kein offizieller Nachfolger in Entwicklung
befand. Die jetzige Situation ist grundlegend anders, deshalb stellt sich
die Frage, wie Phase 5 sein Ziel diesmal erreichen will, wenn es in f&uuml;r das
Unternehmen g&uuml;nstigeren Zeiten bereits zweimal gescheitert ist. Aber lassen
wir uns &uuml;berraschen.
</P>
<P>
Jetzt noch zu einem anderen Thema: Das Schlusswort in der letzten Ausgabe
hat offenbar Wirkung gezeigt - mit Phase 5 und Metabox haben sich zwei der
Unternehmen, die PowerPC-G3-Karten f&uuml;r den Amiga entwickeln, zu Wort
gemeldet. Phase 5 hat die Spezifikationen seiner G3-Karten ge&auml;ndert und
will sie bereits Anfang September auf den Markt bringen, Metabox will mit
der Auslieferung seiner Produkte der 'AmiJoe'-Reihe innerhalb der n&auml;chsten
zwei Monate beginnen.
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Neben dem Gewinnspiel gibt es in dieser Ausgabe noch eine weitere
  Verlosung! Im Spieleteil werden zwei Vollversionen des Weltraum-Action-
  Strategiespiels Phoenix vergeben!
</LI>
<BR><LI> Letztes Mal wurde euch f&uuml;r diese Ausgabe eine neue Rubrik versprochen.
  Tja, das haben wir leider nicht einhalten k&ouml;nnen - es gibt zwei neue
  Rubriken...:
  Kai Weber hat sich bereit erkl&auml;rt, jeden Monat die von mir schon seit
  l&auml;ngerem angestrebte Liste der erschienenen Software-Updates zu
  erstellen.
<P>
  Ralf Driesner schreibt f&uuml;r jede Ausgabe einen Kommentar zu einem
  aktuellen Thema.
</P>
</LI>
<BR><LI> AMIGA aktuell ist ab sofort unter einer eigenen WWW-Domain erreichbar:
  <A HREF="http://www.aakt.de" TARGET="_TOP">http://www.aakt.de</A>. Die zentrale E-Mail-Adresse bleibt jedoch vorerst
  unver&auml;ndert (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>).
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
<P>
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> .
</P>
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
