<html>
<head>
<title> Games - Review EYE OF THE BEHOLDER 2 </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffff00" alink="ff00ff" vlink="ff00ff">


 Spiele Review :  EYE OF THE BEHOLDER 2<br>
 by NUMEN<br>
<br>
 Genre:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rollenspiel<br>
 System:&nbsp;&nbsp;&nbsp;&nbsp;1MB RAM,<br>
 Empfohlen: Festplatte<br>
 Preis:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30 DM<br><br>
 Dieses Spiel mit starken Anleihen an den Klassiker Dungeon Master
spielt in der Welt des Rollenspiels AD&D, und wie so oft bei
Computerumsetzungen von Rollenspielen ist das Regelsystem dadurch sehr
komplex geworden.Es geht um das Schloss Darkmoon in der Nähe der Stadt
Waterdeep (in dessen Kan&auml;len die Helden im Vorg&auml;nger rumgekrochen sind),
das von gutwilligen Paladinen bewohnt wird.Wie sich sp&auml;ter herausstellt
sind diese Paladine aber nicht ganz so gutm&uuml;tig wie es den
Anschein hat...<br><br>
 Nach dem Starten des Programms wird man von einem Intro begr&uuml;&szlig;t, das
jedoch ein bisschen langatmig ausf&auml;llt und von einer etwas unauff&auml;lligen
Musik begleitet wird.Das Men&uuml; f&auml;llt da schon ein bisschen positiver aus,
denn hier kann man seine alte EOB 1 Gruppe in den zweiten Teil
transferieren.Durch diese einfache Option wird das Spiel enorm
aufgewertet.Ansonsten das &uuml;bliche, neues Spiel starten, Laden oder
beenden.Startet man ein neues Spiel kann man eine Heldengruppe 
aus vier Abenteurern erstellen, zwei weitere kann man im Laufe des Spiels
aufnehmen.In der Erstellung der Partie hat man sehr viele Freiheiten,
kaum ein anderes Rollenspiel kann mit einer solchen Menge an Rassen
und Berufen aufwarten.<br><br>
 Das Spiel beginnt in einem Wald, wo die Gruppe gleich in K&auml;mpfe mit
W&ouml;lfen verwickelt wird.Wer auf die Lekt&uuml;re der Anleitung verzichtet hat
wird das also schon hier bereuen, denn bei den teilweise etwas
un&uuml;bersichtlichen Kampf- und Itembildschirmen kann man als Neueinsteiger
schnell die Kontrolle verlieren.Die Handhabung ist bei Dungeon Master
also deutlich besser.Auch der Sound kann nicht so ganz mithalten, die
gelegentlichen Musikeinwürfe bleiben ein bisschen zu unauff&auml;llig, und
die Sound FX sind ebenfalls keine Meisterleistung.Die Grafik wiederum
kann sich auch heute noch durchaus sehen lassen.Wer aber wissen
will, mit wie vielen Bildern ein Gegner animiert wurde, kann es sich
ganz einfach machen: er zählt sie...<br><br>
 Die Storyentwicklung sorgt daf&uuml;r, das man trotz einiger M&auml;ngel
stundenlang an diesem Spiel kleben kann: Man wird sp&auml;ter in Darkmoon
eingeschlossen und erf&auml;hrt, dass die b&ouml;sartigen Dunkelelfen sich darin
eingenistet haben.W&auml;hrend man durch die dunklen G&auml;nge marschiert kann
man auch auf weitere Abenteurer treffen, die die Gruppe verst&auml;rken.<br><br>
 Fazit :<br>
 EOB 2 kann sicherlich nicht mit Ambermoon oder Dungeon Master 2
 mithalten, aber insbesondere AD&D-Fans k&ouml;nnen durchaus Gefallen
 daran finden. Alle anderen sollten auf eines der oben genannten
 Spiele zur&uuml;ckgreifen.<br><br>
<table border=0 width=50%>
<tr><td align=left width=50%> Grafik : </td>
<td align=left width=50%> 63% </td></tr>
<tr><align=left> Sound : </td>
<td align=left> 55% </td></tr>
<tr><td align=left> Sound FX : </td>
<td align=left> 60% </td></tr>
<tr><td align=left> Motivation : </td>
<td align=left> 70% </td></tr>
<tr><td align=left> Animation : </td>
<td align=left> 36% </td></tr>
<tr><td align=center colspan=2><hr width=100% size=2 color="ff0000"></td></tr>
<tr><td align=left> Gesamt : </td>
<td align=left> 61% </td></tr>
</table>
<p align=left><b><font color="00ff00"> NUMEN </font></b></p>
</body>
</html>
