<html>
<head>
<title> Games Preview - Gilbert - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffff00" alink="ff00ff" vlink="ff00ff">
<table border=0 width=100%>
<tr>
<td align=left width=40%> </td>
<td align=center width=60%> PREVIEW: <br> GILBERT GOODMATE <br> (AND THE MUSHROOM OF PHUNGORIA) <br><br>
 Style: Adventure <br><br> Hersteller: Crystal Software/Prelusion </td></tr>
<tr><td align=center colspan=2><a href="http://www.crystal-software.com"> Http://www.crystal-software.com </a></td></tr>
<tr><td align=left> </td><td align=left> System: AGA,2MB CHIPRAM,4MB FASTRAM,68020 PROZESSOR... <br><br>
 Erscheinungstermin: Herbst/Winter`99 </td></tr>
</table><br>
<p align=left><font size=4 color="00ff00"> &quot; Wer braucht LucasArts !? &quot;<br>
 Diese Worte bekommt man in letzter Zeit immer &ouml;fter zu h&ouml;ren.
 Kein wunder,denn die Vergangenheit hat gezeigt das talentierte
 (Adventure-) K&ouml;pfe nicht nur bei den Sch&ouml;pfern der Monkey Island-
 Trilogie zu finden sind.
 &Auml;ltere Vertreter wie -Erben der Erde- oder -Beneath a Steel Sky-,
 aber auch aktuellere Titel wie z.B. -Sixth Sense Investigations-
 haben dies unl&auml;ngst best&auml;tigt.</p>
<p align=left>
 Und obwohl der Amiganer auf einige grosse Klassiker des Genres
 zur&uuml;ckgreifen kann ; nach dem 20. &quot; Walk-through &quot; wird das
 noch so genialste Game langweilig. Neues Futter f&uuml;r die grauen Zellen
 muss also her. Und Crystal Software haben es, und das sogar im
 Doppelpack,denn neben dem hier vorgestellten Gilbert Goodmate befindet
 sich auch noch ein weiteres Abenteuer-Spiel in der Mache (Abducted).
 Da aber zu dem Zeitpunkt, an dem dieses Preview hier geschrieben wurde,
 noch keine genauen Informationen vorhanden waren,begn&uuml;gen wir uns mit den
 ersten Facts zu &quot; Gilbert Goodmate and the Mushroom of Phungoria &quot;.</p>
<p align=left> Die Story: <br><br>
 Es war einmal...<br>
 ...da hatte das Land Phungoria arge probleme und wurde von einem
 b&ouml;sen Magier unterjocht,und nur der mutigen Einsatz eines Helden
 (samt seines Pilzes) machte dem schrecken ein Ende.<br>
 Seitdem feiert das Land diesen ehrw&uuml;rdigen Tag und einmal im Jahr
 steigt ein grosses Fest,das dem Pilz gewidmet ist.<br>
 Und jedes Jahr wird ein neuer Bewohner Phungoria`s beauftragt,
 f&uuml;r die Zeitspanne bis zum n&auml;chsten Fest auf den grossen Pilz
 aufzupassen.Diesmal ist es Gilbert`s Grossvater,dem diese Ehre
 zuteil wird...aber OH SCHRECK,pl&ouml;tzlich verschwindet der Pilz auf
 mysteri&ouml;se art und weise und ward nicht mehr gesehen.
 Der Zorn der B&uuml;rger schl&auml;gt auf Gilbert`s Grossvater nieder,und als
 der K&ouml;nig des Landes sogar die Todesstrafe auf den Mann verh&auml;ngt,
 beschliesst Gilbert sich aufzumachen um Grossvaters Unschuld zu
 beweisen und den geliebten Pilz zur&uuml;ck zu bringen.<br>
 Von hier an übernimmt der Spieler Gilbert`s Part...</p>
<p align=left> Extreme-Adventureing:<br><br>
 In Gilbert Goodmate gibt es über 50 Locations zu erkunden und fast
 genau soviele Charaktere warten auf ein (mehr oder weniger)
 informationsreiches Gespr&auml;ch.Das Spiel beschr&auml;nkt sich dabei nat&uuml;rlich
 nicht nur auf ein stupides herumsuchen nach Indizien (ja,wo ist denn
 nun der Pilz?),sondern es gibt eine menge zus&auml;tzliche Aufgaben,die
 die (scheinbar gelungene) Story vorantreiben.</p>
<p align=left> Steurung:<br><br>
 Prelusion  bedient sich hier der Steuerung,die auch schon in
 Monkey Island 3 auf dem PC zu Zuge kam.<br>
 Klickt man mit der rechten Maustaste auf ein interessantes Objekt oder
 auf eine Person,bekommt man auf dem Screen mehrere m&ouml;glichkeiten
 präsentiert,was man damit alles anstellen k&ouml;nne.
 Bei einem Objekt w&auml;re dies z.B. &quot; nimm &quot; oder &quot; untersuche &quot;.
 Dadurch f&auml;llt ein jonglieren mit Verben weg,wie es bei &auml;lteren Genre
 Vertretern meistens der Fall war.<br>
 Dies hat auch den Vorteil,das man nicht so schnell an einer Stelle
 h&auml;ngenbleibt (weil vielleicht eine bestimmte Kombination von Verben
 von n&ouml;ten w&auml;re).</p>
<p align=left> Das Auge (spielt) mit: <br><br>
 Die fein gezeichneten Locations sind eine wahre Augenpracht und auch
 die gross gewordenen Charaktere zeugen von der Professionalit&auml;t der
 Grafiker (obwohl letztere ein wenig Grobpixelig aussehen). Zu erw&auml;hnen
 sei hier noch,das zu den Pixlern auch ein ehemaliger Mitarbeiter von
 Walt Disney geh&ouml;rt,der auch bei einigen grossen Zeichentrickfilmen
 von Disney Hand angelegt hat.</p>
<p align=left> Was wird uns also mit Gilbert Goodmate erwarten ?<br>
 Nun,vielleicht der Adventure-Hit `99 ! Und bei erfolgreicher
 lokalisierung bietet die Vollversion Sprachausgabe komplett in deutsch,
 als auch Grafikkarten und PPC-Boards-unterst&uuml;tzung.<br>
 Warten wir es ab...</p></font>
<p align=center><font size=6 color="ffff00"> Rainer </font></p>
</body>
</html>
