<html>
<head>
<title> Games - Oldie Review WINGS </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffff00" alink="ff00ff" vlink="ff00ff">

 Spiele Review :  WINGS<br>
 by NUMEN<br><br><br>
 Genre:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Flugsimulation<br>
 System:&nbsp;&nbsp;&nbsp;&nbsp;0.5 MB RAM, 68000<br>
 Empfohlen: 1MB RAM, 68020, Festplatte<br>
 Preis:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10 DM<br><br>
 Diese Flugsimulation spielt im ersten Weltkrieg und ist, obwohl uralt,
trotzdem noch ein Spielchen Wert, vor allem wenn man bedenkt, wie wenige
gute Spiele dieses Genres es für den Amiga gibt.<br><br>
 Man beginnt das Spiel in der Flugschule.Nach einer kurzen Pr&uuml;fung wird der
frischgebackene Soldat (dessen F&auml;higkeiten sich &uuml;brigens individuell
einstellen lassen) dann auch schon in den Squadron beordert und auf
der Seite der Alliierten auf die Welt losgelassen.Es gibt dort 3
verschiedene Arten von Eins&auml;tzen: Den Gro&szlig;teil bilden die 3D-Missionen,
die auch am meisten Spa&szlig; machen, obwohl sie grafisch v&ouml;llig veraltet
sind, und auch eine einzige Waffe (Maschinengewehr) ist nicht so ganz das
wahre (obwohl durchaus verst&auml;ndlich: Zu dieser Zeit gab es
halt noch keine Hellfires und Sidewinders).Man muss entweder Patrolieren
oder Zeppeline oder Bomber zerst&ouml;ren bzw. besch&uuml;tzen.Dabei begleiten
einen meist auch noch ein Paar Kollegen, die den Spieler tatkr&auml;ftig
unterst&uuml;tzen.Dann gibt es noch Bombenmissionen, in denen man Geb&auml;ude,
Br&uuml;cken oder Z&uuml;ge zerst&ouml;ren muss. Dies geschieht aus der Vogelperspektive.
Schlie&szlig;lich w&auml;ren da noch die Strafing-Missionen, in denen
Infanteristen, Konvois oder Z&uuml;ge beschossen werden.<br><br>
 Nebenbei kann man vor jeder Mission im Flight Journal lesen, was im
Krieg und im Squadron so passiert.Einfluss auf die Geschichte kann man
aber nicht nehmen.Wenn ein Einsatz mal daneben geht kommt einfach der
n&auml;chste (allerdings hat das nat&uuml;rlich schlechte Auswirkungen auf die
Karriere), und wenn man stirbt findet man sich in der Flugschule wieder
und kann nach einem Test mit dem neuen Piloten da weitermachen, wo der
alte aufgeh&ouml;rt hat.<br><br>
 Die Absch&uuml;sse werden nat&uuml;rlich alle flei&szlig;ig mitgez&auml;hlt und in einer
Tabelle festgehalten, wo man sie mit denen der Kameraden vergleichen
kann.Schl&auml;gt man sich gut, wird man fr&uuml;her oder sp&auml;ter bef&ouml;rdert.Das
Spiel endet erst bei Kriegsende.<br><br>
 Fazit :<br>
 Wer Wert auf gute Grafik legt sollte lieber die Finger von
 diesem Spiel lassen.F&uuml;r alle anderen kann es aber durchaus noch
 einen Reiz darstellen, vor allem weil man es als Restposten
 oder gebraucht sehr billig bekommen kann.<br><br>
 <table border=0 width=50%>
 <tr><td align=left width=50%> Grafik : </td>
 <td align=left width=50%> 57% </td></tr>
 <tr><td align=left> Sound : </td>
 <td align=left> 62% </td></tr>
 <tr><td align=left> Sound FX : </td>
 <td align=left> 69% </td></tr>
 <tr><td align=left> Motivation : </td>
 <td align=left> 73% </td></tr>
 <tr><td align=left> Animation : </td>
 <td align=left> 61% </td></tr>
 <tr><td align=center><hr size=1 NOSHADOW width=100% color="ff0000"></td></tr>
 <tr><td align=left> Gesamt : </td>
 <td align=left> 62% </td></tr>
 </table><br>
 <p align=center><b><font size=6 color="00ff00"> NUMEN </font></b></p>
 </body>
 </html>
