<html>
<head>
<title> Games - Review AMBERMOON </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffff00" alink="ff00ff" vlink="ff00ff">

 Spiele Review : &nbsp; AMBERMOON<br>
<br>
 by NUMEN<br>
<br><br>
 Genre: &nbsp; &nbsp; Rollenspiel<br>
 System: &nbsp; &nbsp;68000, ca.1MB RAM<br>
 Empfohlen: Festplatte, 68030, 4MB RAM<br>
 Preis: &nbsp; &nbsp; ca. 30DM<br><br><br>
 Ambermoon, der Nachfolger von Amberstar, wurde von Thalion hergestellt
 und ist sicherlich eines der gro&szlig;artigsten Rollenspiele, die es jemals
 auf dem Amiga gab.Das ganze Geschehen spielt sich auf der
 mittelalterlichen Inselwelt Lyramion ab (und dessen Monde, aber ich will
 nicht zu viel verraten...), und hat einen geradezu herrlich komplexen
 Hintergrund, den man aber erst im Laufe des Spiels erf&auml;hrt.Am Anfang
 steht man mit seinem frisch kreierten Helden (die Variationen beschr&auml;nken
 sich leider auf den Namen und das Geschlecht - keine Werteorgie a la
 DSA) vor dem Bett des sterbenden Großvaters (dem Helden aus Amberstar)
 und erf&auml;hrt, dass laut einer Vision, die dieser hatte, die Welt mal
 wieder in Gefahr ist.Wir sollen also erstmal zum Grab des toten Magiers
 Shandra (auch ein Charakter aus Amberstar) gehen und dort weitere Infos
 abholen.<br><br>
 Aber erstmal nehmen wir alles von zuhause mit, was nicht Niet- und
 Nagelfest ist.Dazu geh&ouml;ren unter anderem eine Robe als R&uuml;stung, ein
 paar Heiltr&auml;nke und nat&uuml;rlich ein K&uuml;chenmesser, um es den B&ouml;sewichten
 mal so richtig zu zeigen.Dabei wird alles bei (nach heutigen Ma&szlig;st&auml;ben)
 durchschnittlicher Grafik aus der Vogelperspektive gezeigt.Auf der
 Weltkarte (die &uuml;brigens sehr groß und komplex ist) ebenso, aber aus
 gr&ouml;&szlig;erer Entfernung.In St&auml;dten und Dungeons wechselt die Ansicht in 3D,
 für ein  richtig angenehmes Scrolling empfehle ich aber einen
 68030er Prozessor.<br><br>
 Die Handhabung ist, sobald man erstmal alle Funktionen kennt,
 eigentlich ganz angenehm.Mittels Icons am Rand und dem rechten
 Mausknopf lassen sich solche Dinge ausf&uuml;hren wie &quot;Untersuchen&quot; oder
 &quot;Reden&quot;.Die Kampfsequenzen h&auml;tte man aber wirklich besser machen
 k&ouml;nnen.Strategisch-Rundenbasierend ist angesagt, da spricht eigentlich
 nichts gegen, aber leider ging der ganze Realismus fl&ouml;ten:
 So kann ein K&auml;mpfer zum Beispiel einem mehrere Meter entfernt stehendem
 Kameraden mitten im Kampf einen Heiltrank verabreichen, oder mal
 eben die Stiefel tauschen.Außerdem darf man seine Krieger nur 2 Felder
 vorbewegen, die Felder dahinter sind für Gegner reserviert...<br><br>
 Aber das sind nur Sch&ouml;nheitsfehler.Jedenfalls besteht das Spiel darin,
 mit seiner Heldengruppe, die nach einigen Bekanntschaften &uuml;brigens
 bis zu sechs unterschiedliche Charaktere enthalten kann, von Insel zu
 Insel zu reisen und dabei ineinander verkeilte Abenteuer zu bestehen.
 Einige dieser Questen haben auch gar keine Verbindung zum Hauptproblem,
 sondern können gel&ouml;st werden um ein paar Abenteuerpunkte zu ergattern.<br><br>
 Begleitet wird das Spiel von ansprechender Musik, die an verschiedenen
 Stellen auch verschiedene St&uuml;cke spielt, die nicht so schnell
 langweilig werden (Außer die Kampfmusik.Die wiederholt sich so oft,
 dass man in einem l&auml;ngeren Kampf schnell einen Nervenzusammenbruch
 bekommen kann).<br><br>
 Fazit :<br>
 Ambermoon geh&ouml;rt, trotz grafischer Schw&auml;chen, immer noch zu<br>
 den besten Rollenspielen, und jeder, der das Genre auch nur<br>
 ein bisschen mag, sollte es sich unbedingt noch zulegen, bevor<br>
 es v&ouml;llig aus den Regalen verschwindet.<br>
<br>
<table border=0 width=50%>
<tr><td align=left width=50%> Grafik : </td><td align=left width=50%> 70% </td></tr>
<tr><td align=left> Sound : </td><td align=left> 89% </td></tr>
<tr><td align=left> Sound FX : </td><td align=left> --- </td></tr>
<tr><td align=left> Motivation : </td><td align=left> 86% </td></tr>
<tr><td align=left> Animation : </td><td align=left> 74% </td></tr>
<tr><td align=center colspan=2><hr width=100% size=2 NOSHADOW color="ff0000"> </td></tr>
<tr><td align=left> Gesamt : </td><td align=left> 80% </td></tr>
</table>
<br><br>
<p align=center><b><font size=6 color="00ff00"> NUMEN </font></b></p>
</body>
</html>
