<html>
<head>
<title> Games - Review DUNGEON MASTER 2 </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffff00" alink="ff00ff" vlink="ff00ff">

 Spiele Review :  DUNGEON MASTER 2<br>
<br>
 by NUMEN<br><br><br>
 Genre: &nbsp; &nbsp; Rollenspiel<br>
 System: &nbsp; &nbsp;AGA, 2MB RAM<br>
 Empfohlen: zus.RAM, Festplatte<br>
 Preis: &nbsp; &nbsp; ca. 30DM<br>
<br>
 Dies ist der Nachfolger des erfolgreichen Spiels &quot; Dungeon Master &quot; und
die Programmierer haben auch hier wieder ganze Arbeit geleistet.
Diesmal muss man mit seiner 4 Mann starken Abenteurertruppe in die
Feste Skullkeep eindringen und den bitterbösen Dragoth t&ouml;ten.Das
Geschehen spielt sich im Gegensatz zum Vorg&auml;nger zu gro&szlig;en Teilen im
Freien ab, au&szlig;erdem ist nat&uuml;rlich die Grafik deutlich
besser.Leider muss man aber immer noch ein Feld nach dem anderen gehen,
anstatt wie bei Ambermoon eine &quot; gleitende &quot; 3D-Ansicht bestaunen zu
k&ouml;nnen.Lauff&auml;hig ist der Dungeonspa&szlig; bereits auf einem Standart-1200er,
allerdings zieht sich dadurch die Startprozedur f&uuml;rchterlich hin und
die Animationen werden (noch) ruckeliger.<br><br>
 Das Spiel beginnt in einem Raum voller tiefgek&uuml;hlter Helden, von
denen 3 (der erste ist immer Torham) auch sogleich aufgetaut werden.
Anschlie&szlig;end steigt man eine Treppe hoch und befindet sich in einem
Raum, durch den man nach dem Einsammeln einiger Items und den ersten
Dreh&uuml;bungen an einem Tisch (auch so eine tolle Neuerung) nach drau&szlig;en
kommt.Hier erwarten einen die ersten Pillefitzfeinde, die noch relativ
harmlos sind.Der Kampf ist in Echtzeit, wodurch er ein bisschen
unrealistisch wird, da immer nur einer der 4 K&auml;mpen zuschlagen kann.
Ansonsten aber sehr gut gelungen, pro Waffe stehen verschiedene Schl&auml;ge
zur Auswahl (z.B.Schwert: Schwingen, Durchbohren oder Hacken - Das
l&auml;sst doch jedes Sadistenherz h&ouml;her schlagen, oder nicht?), die alle
unterschiedlichen Schaden anrichten, aber auch unterschiedlich lange
dauern und den Krieger mehr oder weniger Kraft kosten.Auch die Magie
ist gut gemacht.Spr&uuml;che m&uuml;ssen selbst herausgefunden wer-
den, was aber nicht allzu schwer ist.<br><br>
 Nach diesen ersten paar Handgemengen kommen wir zur wahrscheinlich
besten Neuerung: Den L&auml;den! Hier kann sich der Metzels&uuml;chtige Zocker
mit Waffen, R&uuml;stungen, Nahrung, magischen Tr&auml;nken und Zauberutensilien
eindecken.Dabei kann man auch tauschen und feilschen.<br><br>
 Und so k&auml;mpft und knobelt man sich dann durch den Vorgarten von
Skullkeep,wobei die Knobelei  keinesfalls zu kurz kommt, im Gegenteil:
DM2 hat es wirklich in sich.Ich kam ohne Komplettl&ouml;sung nicht einmal bis
in die erste Etage von Skullkeep.<br><br>
 W&auml;hrend des ganzen Spiels wird versucht, eine d&uuml;stere Atmosph&auml;re zu
erhalten,und das mit Erfolg: Die Sounds passen perfekt zu der allseits
herrschenden Dunkelheit und da man selbst mit Zauberspr&uuml;chen nie sehr
weit sehen kann wei&szlig; man nie so recht, was gerade in der N&auml;he geschieht.
Pl&ouml;tzlich bewegt sich ein Baum und holt zum Schlag aus, ein Geist
kommt aus einem Grabstein gefleucht, die Partie bleibt in einem
&uuml;bersehenen Sumpfloch stecken w&auml;hrend ein Rudel W&ouml;lfe hinter
ihr her ist...<br><br>
 Fazit :<br>
 <br>
 Dungeon Master 2 ist sicherlich ein tolles Spiel für jeden,<br>
 der gerne auch ein bisschen knobelt.Für jemanden, der mit<br>
 Ambermoon und EOB 2 unterfordert ist, ist dieses Spiel, das<br>
 auch technisch durchaus noch &uuml;berzeugen kann, genau das<br>
 richtige.Anf&auml;nger sollten entweder eine Komplettl&ouml;sung zur<br>
 Hand nehmen oder die Finger davon lassen, denn durch<br>
 den hohen Schwierigkeitsgrad kann es durchaus passieren,<br>
 dass man au&szlig;er den ersten paar Wiesen nicht viel vom Spiel sieht.<br>
<br>
<table border=0 width=50%>
<tr><td align=left width=50%> Grafik : </td>
<td align=left width=50%> 74% </td></tr>
<tr><td align=left> Sound : </td>
<td align=left> 81% </td></tr>
<tr><td align=left> Sound FX : </td>
<td align=left> 83% </td></tr>
<tr><td align=left> Motivation : </td>
<td align=left> 78% </td></tr>
<tr><td align=left> Animation : </td>
<td align=left> 40% </td></tr>
<tr><td align=center colspan=2><hr width=100% size=2 color="ff0000"></td></tr>
<tr><td align=left> Gesamt : </td>
<td align=left> 71% </td></tr>
</table>
<br>
<p align=center><b><font color="00ff00"> NUMEN </font></b></p>
</body>
</html>
