<html>
<head>
<title> Games - Oldie Review Turrican II </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffff00" alink="ff00ff" vlink="ff00ff">

 Klassiker Review: Turrican II<br><br>
 Genre: Action<br>
 System: alles; lief sogar in meinerm 4000er mit GraKa und 68040<br>
 Empfohlen: um &quot; richtiges &quot; Feeling aufkommen zu lassen, solltet ihr Euren
 alten 500er samt Commdore 1084 (oder &auml;hnlich) entstauben :-))<br>
 Preis: schaut mal in diversen Kleinanzeigen nach..<br><br>
Ach ja, was waren das f&uuml;r den Amiga noch ruhmvolle Zeiten, als jeder zu
Hause einen Amiga 500 stehen hatte und darauf auch zockte, was
das Zeug hielt. In dieser Zeit entstand auch eine mitlerweile zum
Kultstatus avancierte Triologie namens &quot;Turrican&quot;. Besonders der zweite
Teil hat es mir angetan und genau deshalb versuche ich mich an dieser
Stelle auch mal an einem Klassikertest.<br><br>
 Was ist Turrican?<br><br>
In Zeiten von 3D, Animationen und &quot;Multimedia&quot; (ich hasse dieses
&uuml;berstrapazierte Wort langsam) werden sich wahrscheinlich die wenigsten
noch an die 2D Games erinnern k&ouml;nnen, aber es gab (und gibt) diese
doch tats&auml;chlich. Und auch die Turrican Reihe basiert auf 2D (wenn man
mal von dem bald erscheinenden [nur für PC] 4. Teil absieht) und ist
somit ein typischer 2D Shooter; gemischt mit einigen Elementen aus
anderen Genres (Diamanten sammeln, h&uuml;pfen, springen etc.). Ihr habt es
zur Aufgabe, alles was Euch begegnet mit Eurer Wumme
platzumachen, wobei es das Prim&auml;rziel ist, den letzten Endgegner
(&quot;The Machine&quot;) aus dem Universum zu bef&ouml;rdern...<br><br>
Das ganze l&auml;&szlig;t sich mit Eurer Kanonen recht simpel l&ouml;sen. Durch diverse
Add-ons kann man auch verschiedene Arten von Sch&uuml;ssen bekommen; auch die
Intensität l&auml;&szlig;t sich so steigern. Daneben steht Euch auch ein 180 Grad
Laserschuss zur Verf&uuml;gung, der ebenfalls erweiterbar (= mehr
Reichweite ) ist.<br><br>
Das alles ist ziemlich typisch f&uuml;r die damalige Zeit, aber Turrican II
kann noch mit einem weiteren Extra aufwarten: Nach 4 absolvierten Levels
(jeweils mit Endgegner) seit ihr nicht mehr der Einzelheld zu Fu&szlig;,
sondern steigt in einen Raumgleiter um, der (bis auf den 180 Grad
Laser) &uuml;ber die selben Waffen verf&uuml;gt, wie der Einzelk&auml;mpfer. Der
einzige Unterschied ist der, daß die 4 Levels nun selber scrollen, was
das ganze etwas stressiger macht. Praktisch ein integriertes R-Type....<br><br>
Danach geht es erneut f&uuml;r 4 Level als Einzelk&auml;mpfer weiter, wobei Euch
im letzten Level nach einigen &quot;Aufzugsfahrten&quot; der Endgegner erwartet.<br><br>
 Bum, bum, bum...<br><br>
Ballern ist zwar die oberste Direktive in Turrican (wohl dem, der
Dauerfeuer hat), aber teilweise ist auch Denken gefragt: immerhin gibt
es auch einige Secret Roomes zu entdecken, in denen man z.B. Extraleben
und / oder zus&auml;tzliche Diamanten findet. Und da wir gerade bei Leben
sind: Vor kurzem habe ich das Game mal wieder durchgezockt und
hatte am Ende noch 25-30 Leben auf dem Konto; zu schwierig
d&uuml;rfte das ganze also auch nicht sein.<br><br>
 Grafik &amp; Sound:<br><br>
Da das Game noch f&uuml;r den A500 konzipiert wurde, darf man keine alzu großen
Anspr&uuml;che an die Grafik stellen. Trotzdem &uuml;berrascht es mich doch ein wenig,
wenn ich sehe,was teilweise in diesen alten Kisten steckte. Entweder die
Coder von Turrican II sind besser als heutige oder der AGA Chip ist dem OCS
Chip unterlegen ;-)) Nein aber im Ernst: Die Grafik ist zwar an heutigen
(3D) Ma&szlig;st&auml;ben gemessen nicht mehr die beste, kann aber zumindest mich (der
mehr auf Spielspa&szlig; denn auf Grafik steht) volkommen &uuml;berzeugen. Ich w&uuml;rde
diese sogar als sehr liebevoll zusammengepinselt bezeichnen; einige der
heutigen Games kommen da noch nichtmal dran...<br><br>
Was den Sound betrifft: Dieser wurde vom Meister Chris H&uuml;lsbeck
h&ouml;chstpers&ouml;nlich komponiert und ist so ziemlich das beste, was ich jemals
auf dem Computer an Sound geh&ouml;rt habe. Die abwechselungsreiche Musik (die
man sich im Men&uuml; auch einzeln vorspielen lassen kann) geh&ouml;rt zu einer der
wenigsten F&auml;llen, wo die akkustische Untermalung das Spielgeschehen
positiv unterst&uuml;tzt. Sicherlich ein Meilenstein im Computerbereich....<br><br>
 Fazit:<br><br>
Wer auf kurzweilige Action steht und nicht unbedingt einen zu herben
Schwierigkeitsgrad w&uuml;nscht, der soll es mit diesem Game ruhig mal
probieren. Mir hat es, auch nach all den Jahren (ich wei&szlig; noch, wo ich
Turrican II zum ersten mal gezockt habe...), immer noch sehr gut
gefallen; Spielspa&szlig; kam auf jeden Fall auf; teilweise sogar mehr,
als bei aktuellen Games. Ich glaube, da&szlig; sagt wohl alles, oder?<br><br>
<p align=center><b><font color="00ff00"> Kilian &quot;The Bruce&quot; Servais</font></b></p>
</body>
</html>
