<html>
<head>
<title> Amiga 4ever - Metal Corner ( Japan SPECIAL ) - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left>
 Japan Special<br><br>
In dieser Ausgabe m&ouml;chte ich Euch als &quot; Special &quot; zwei weitere CD
Kritiken zu CD`s liefern die lediglich in Japan erh&auml;ltlich sind und
demzufolge nur &uuml;ber Mailorder bzw. &uuml;ber das Internet bezogen werden
k&ouml;nnen. Aber Vorsicht: Die Preise sind recht happig!</p>
<p align=left>
 Michael Kiske: Readiness To Sacrifice<br><br>
In den Anf&auml;ngen des deutschen Power Metals stand eine Band an deren
Spitze, die zwar auch heute noch aktiv ist, aber damals ein ganz
anderes Gesicht, sprich Line-up, hatte. Die Rede ist von Helloween,
die seinerzeit mit den beiden Keeper Of The Seven Keys Alben sich
selbst unsterblich gemacht haben.<br>
Wesentlichen Anteil am Erfolg hatte auch die pr&auml;gnante Stimme des
damaligen Lead S&auml;nger Michael Kiske, auf denen sich heutzutage viele
junge Bands berufen und nicht selten zieht man seine Stimme auch zum
Vergleich heran.</p>
<p align=left>
1993 l&ouml;ste sich allerdings die jahrelange Beziehung zwischen Michael
Kiske & Helloween nach zwei experementellen Alben (Pink Bubles Go
Ape & Chameleon) in Wohlgefallen auf und Michael Kiske suchte sich
keine neue Band. Stattdessen ver&ouml;ffentlichte er 1996 sein erstes
Soloalbum &quot; Instant Clarity &quot;, da&szlig; einerseits h&auml;rtere Songs enthielt,
andererseits aber auch starke Parallelen zum rockigen Helloween Album
&quot; Chameleon &quot; enthielt; kein Vergleich also mit dem klassischen Power
Metal von Helloween zu FETT Keeper Zeiten.</p>
<p align=left>
Danach geriet der charismatische S&auml;nger allerdings immer weiter in
Vergessenheit; nicht zuletzt weil Helloween wieder auf dem aufsteigenden
Ast waren. Aber 1999 meldete er sich mit einem neuen Album,
betitelt mit &quot; Readiness To Sacrifice &quot;, zur&uuml;ck.</p>
<p align=left>
Einige m&ouml;gen jetzt denken, daﬂ es Michael Kiske im Zuge des Metal
Revivals lediglich um Geld geht, aber schon beim ersten durchh&ouml;ren der
CD wird klar, daﬂ das ganze sicherlich kein Abklatsch von alten
Helloween Tugenden ist. Vielmehr hat &quot; R.T.S. &quot; (Kurzform) so gut wie
nichts mehr Helloween oder Power Metal im allgemeinen zu tun; bei
&quot; R.T.S. &quot; handelt es sich um gut gemachten Rock mit einem leichten
Blues Touch; nicht mehr, aber auch nicht weniger. Alte Helloween Fans
wird das ganze zwar weniger gefallen, aber wenn man sich das erste
Studioalbum so anschaut, wird man die Weiterentwicklung
nachvollziehen k&ouml;nnen.</p>
<p align=left>
Musikalisch gesehen geht das ganze aber dennoch voll in Ordnung; egal
ob es nun der Opemer &quot; Could Cry &quot; (der in die Kerbe von
&quot; Be True To Yourself &quot; vom Vorg&auml;ngeralbum schneidet), das sanftere
&quot; Where Wishes Fly &quot; oder auch das einfach struktuierte &quot; it &quot; ist; alle
Songs sind hervorragend ausbalanciert und k&ouml;nnen vollkommen
&uuml;berzeugen. Richtige Ohrw&uuml;rmer sind zwar nicht am
Start, aber die tolle Lyrik macht das ganze auf jeden Fall wieder wett.</p>
<p align=left>
Das das ganze z.Zt. leider nur als Japan Import erh&auml;ltlich ist, d&uuml;rfte
der Preis von 60 DM einige potentielle K&auml;ufer abschrecken. Nat&uuml;rlich,
60 DM f&uuml;r eine sehr ungew&ouml;hnliche CD auszugeben ist nicht jedermans
Sache und Helloween Fans sollten auch nicht blind zugreifen. Aber wer
den Vorg&auml;nger mochte und etwas toleranter in Sachen Musik ist (bzw.
nicht stur auf Metal fixiert ist), wird die CD m&ouml;gen.</p>
<p align=left>
 Fazit: 9 von 10 Punkten<br><br><br>
 Angra: Rainy Nights - Single<br><br>
Nachdem der letzte Longplayer &quot; Fireworks &quot; der brasilianischen Power
Metaller von Angra schon recht ordentlich geknallt hatte (auch wenn
die Qualit&auml;t von ihrem bisherigen Meisterwerk &quot; Holy Land &quot; nicht
erreicht wurde), legen die Jungs gleich eine neue Single mit dem
Titel &quot; Rainy Nights &quot; nach.</p>
<p align=left>
Ganze drei Tracks finden sich auf der Single, die &uuml;brigens in einem
Pappschuber (wie man ihn von den RockHard CD`s kennt) ohne CD Tray
geliefert. Nun aber zu den Tracks:</p>
<p align=left>
 1. Rainy Nights - Radio Edit<br><br>
 2. Rainy Nights - Album Version<br><br>
 3. Rainy Nights - Instrumental Version<br><br>
Fangen wir dann mal bei der Radio Edit an: Diese ist, im Vergleich zur
&quot; regul‰ren &quot; Version etwas gek&uuml;rzt und klingt typisch Angra m&auml;&szlig;ig: Power
Metal mit Prog. Elementen in einer perfekten Symbiose. In Italien scheint
das Ding recht gut geflutscht zu sein; immerhin ist die Single dort relativ
gut eingestiegen und ab und an wird der Song sogar im Radio gespielt...</p>
<p align=left>
Der zweite Track ist etwas irref&uuml;hrend: Eine &quot; Album Version &quot; gab es n&auml;mlich
bisher von &quot; Rainy Nights &quot; nicht - demzufolge m&uuml;sste es bald einen neuen
Longplayer geben, was angesichts der Tatsache, da&szlig; die letzte CD erst Ende
`98 erschienen ist, etwas verwunderlich ist. Wie dem auch sei,
musikalisch ist die etwas l&auml;ngere Version ebenfalls &uuml;ber jede Kritik
erhaben.</p>
<p align=left>
Zum Abschluss w&auml;re da noch die Instrumentalversion, die nett mitanzuh&ouml;ren
ist, aber auch nicht mehr. Eher etwas f&uuml;r Karaoke Fans :-)</p>
<p align=left>
Tja, was soll man dazu schon gro&szlig; sagen? Diese Single, die in Deutschland
bisher nicht erh&auml;ltlich ist, ist halt nur etwas f&uuml;r Angra Fans. F&uuml;r
schlappe 35 Eier wird man sich diese als Au&szlig;enstehender ohnehin nicht
zulegen; auch wenn musikalisch alles in Ordnung geht. Angra Fans mit
etwas breiterem Geldbeutel sollten aber dennoch zugreifen.<br><br>
 Fazit: ----<br>
<hr size=2 NOSHADOW color="00ff00" width=80%>
<table border=0 width=100%>
<tr><td align=center width=50%><a href="indexhmc8.htm" target="rechts">Index Metal Corner </a></td>
<td align=left width=50%><a href="that_0.htm" target="rechts"> Index That¥s Life </a></td></tr>
</table>
</body>
</html>
