<html>
<head>
<title> Amiga 4ever - Metal Corner ( CD Review: Heavens Gate ) - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left>
 Heavens Gate: Boxed (Doppel CD)<br><br>
Nicht zuletzt weil vielleicht das neue Output &quot; Menergy &quot; (Test in
der letzten Ausgabe) nicht der erwartete Kracher geworden ist, hat man
sich bei der Plattenfirma dazu entschieden, nochmal haufenweise
&auml;lteres Material mit Bonustracks auf den Markt zu bringen. Wer nun
aber denkt, da&szlig; hier mal wieder die schnelle DM gemacht werden
sollte, der irrt sich gewaltig: Nahezu alle Songs, die auf beiden
CD`s verewigt sind, waren hier in Deutschland noch nie oder nur mit
gro&szlig;en Aufwand (und viel Geld) auf CD erh&auml;ltlich. Somit schonmal ein
klarer Pluspunkt für dieses CD Set, da&szlig; aus folgenden
CD`s besteht: Die erste CD (&quot; Boxed &quot;) enth&auml;lt neben dem Erstalbum &quot; In
Control &quot;  auch noch die EP`s &quot; Open The Gate And Watch &quot; und &quot; More Hysteria &quot;.
Zus&auml;tzlich pr&auml;sentiert sich der Bonustrack &quot; Rising Sun &quot; als Live Version
auf dieser 78 Minuten umfassenden ersten CD des Sets. Eine wirklich
geile CD, die wirklich nur schwer zu bekommende Tracks enth&auml;lt, die
obendrein sogar noch absolut gelungen sind; auch was die (hammerm&auml;&szlig;ige)
Produktion betrifft. Bei der zweiten der Box
beiliegenden CD handelt es sich um das urspr&uuml;nglich nur f&uuml;r den
japanischen Markt gedachte Accustic Album &quot; In The Mood &quot; aus dem Jahre
1997. Dies enth&auml;lt neben dem neuen Song &quot; In The Mood &quot; auch noch drei
Songs vom 96er Output Planet E. (&quot; Noah`s Dream &quot;, &quot; Planet Earth &quot; und
&quot; The Children Play &quot;) sowie ein Medley aus &auml;lteren Klassikern.
Abgerundet wird die CD mit einer Live Version von der &Uuml;berballade
&quot; Don`t Bring Me Down &quot;. Die Qualit&auml;t dieser zweiten CD ist ebenfalls
gelungen, auch wenn sich in den Accustic Versionen schon
zahlreiche stilistische &Ouml;ffnungen befinden, die dann ja auch konsequent
auf dem aktuellen Output &quot; Menergy &quot; zu finden sind.
Lobenswert erw&auml;hnt werden sollten meiner Meinung nach excellenten
Bookletts, die die beiden CD`s jeweils erhalten. Auch hier wurde mit
sehr viel Liebe zum Detail gearbeitet, was mich insgesamt zu dem Fazit
bringt, daß dieses Set einfach nur megastark ist. Auch der Preis
liegt erfreulicherweise in sehr humanen Grenzen bei ca. 30 DM (was dem
Preis einer &quot; normalen &quot; CD entspricht). Eines kann man aber mit
Sicherheit festhalten: Der Gedanke, m&ouml;glichst schnell Kohle zu machen,
war mit Sicherheit nicht der Grund f&uuml;r dieses (&uuml;brigens limitierte)
Release!<br><br>
 Fazit: 10 von 10 Punkten</p>
<hr size=2 NOSHADOW color="00ff00" width=80%>
<table border=0 width=100%>
<tr><td align=center width=50%><a href="indexhmc8.htm" target="rechts">Index Metal Corner </a></td>
<td align=left width=50%><a href="that_0.htm" target="rechts"> Index That´s Life </a></td></tr>
</table>
</body>
</html>
