<html>
<head>
<title> Amiga 4ever - Metal Corner (CD Review: Labyrinth ) - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left>
 Labyrinth: Timeless Crime<br><br>
Wer sich jetzt fragt, ob eine der &Uuml;berraschungen im Bereich des
Melodic Metals aus dem letzten Jahr eine neue Scheibe eingespielt hat,
den muss ich leider entt&auml;uschen. Bei &quot; Timeless Crime &quot; handelt es
sich nur um eine normale EP (in anderen Quellen auch als Mini Album
bezeichnet), die 5 Songs enth&auml;lt. Neben einer neu eingespielten
Accustic Version von &quot; Falling Rain &quot; (von der `98er Scheibe &quot; Return
To Heaven Denied &quot;) und &quot; In The Shade &quot; (vom Debut &quot; No Limits &quot;), gibt`s
mit dem neuen St&uuml;ck &quot; Save Me &quot; einen Track, der ganz in der
Tradition von &quot; Return To Heaven Denied &quot; liegt, und dementsprechend gut
gelungen ist, auch wenn Stratovarius Einfl&uuml;sse recht deutlich sind.
Zus&auml;tzlich fand auch ein St&uuml;ck vom ersten Demo namens &quot; Out Of Memory &quot;
seinen Weg auf die CD.<br>
&quot; Soweit so gut &quot;, werden sich viele sagen, aber wo ist die in
der Werbung versprochene Live Version und die Sanctuary Coverversion
&quot; Die For My Sins &quot;? Erstere ist &uuml;berhaupt nicht auf der CD zu finden,
letztere im Anschluss an den letzten Track &quot; Falling Rain &quot;. Diese
Vorgehensweise ist total irref&uuml;hrend, da die Tatsache, da&szlig; das
Vorhandensein nirgendwo erw&auml;hnt wird, irgendwie komisch ist. Zudem
h&auml;tte man auch bitte zwei einzelne Tracks daraus machen k&ouml;nnen und
nicht erst eine kurze Pause und dann den n&auml;chsten Track
(dann k&ouml;nnte man ja bald alle Songs in einer Audio Spur unterbringen)....
Na ja, das alles w&auml;re ja noch in Ordnung, wenn der Spa&szlig; nicht glatte 20
M&uuml;cken kosten w&uuml;rde. Die Musik ist zwar &uuml;ber jede Kritik erhaben,
aber 20 M&auml;rker sind f&uuml;r 5 Tracks doch etwas viel. Eingefleischte
Labyrinth Fans k&auml;nnen (und sollten) sich die EP nat&uuml;rlich zulegen;
allen anderen, die Interesse an Stratovarius-like Melodic Metal haben,
sollten sich den (sehr guten) Vorg&auml;nger &quot; Return To Heaven Denied &quot;
oder gar das (etwas progressivere) Debut &quot; No Limits &quot; auf ihrem
Kaufzettel notieren.<br><br>
An den Label sei hier noch vermerkt, daﬂ man mit einer solchen
Marktpolitik weder sich noch der Band dienlich ist; f&uuml;r einen
&quot; normalen &quot; Preis von 12 DM h&auml;tten sicherlich einige Fans mehr zugegriffen.<br><br>
 Fazit:----</p>
<hr size=2 NOSHADOW color="00ff00" width=80%>
<table border=0 width=100%>
<tr><td align=center width=50%><a href="indexhmc8.htm" target="rechts">Index Metal Corner </a></td>
<td align=left width=50%><a href="that_0.htm" target="rechts"> Index That¥s Life </a></td></tr>
</table>
</body>
</html>
