<html>
<head>
<title> Amiga 4ever - Metal Corner 9/99 (CD Review: Primal Fear ) - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left> Primal Fear: Jaws Of Death</p>
<p align=left>
Als Primal Fear Anfang `98 ihr selbstbetiteltes Debut ver&ouml;ffentlichten,
konnte niemand der Erfolg absehen, den die Mannen um Ralf Scheppers
(ex-Gamma Ray) und Mat Sinner (Sinner) haben w&uuml;rden. Deswegeb erstaunte es
nicht sonderlich, da&szlig; Primal Fear Anfang `99 wieder ins Studio gingen, um
einen amtlichen Nachfolger zusammenzuschustern. Das Resultat
&quot; Jaws Of Death &quot; liegt jetzt verkaufsbereit in den L&auml;den und f&uuml;hrt
konsequent die auf dem Vorg&auml;nger eingeschlagene Linie fort. Allerdings
gab es auch eine wesentliche Ver&auml;nderung: Mit Stefan Leibing stie&szlig;
ein weitere Gitarrist zur Band, was sich nat&uuml;rlich positiv auf den
Sound auswirkte, der nun mit mehr Power aus den Boxen dr&ouml;hnt.</p>
<p align=left>
Dies merkt man schon bei dem Opener &quot; Final Embrace &quot;, der extrem kraftvoll
aus den Boxen dr&ouml;hnt und unmissverst&auml;ndlich die Trademarks von Primal Fear
offenbart: Statt Bombast (wie es z.Zt. &uuml;blich ist) wird auf harte Riffs
gesetzt; eine wahrlich gute Entscheidung, wie sich im nachfolgenden
herausstellen wird: Denn neben &quot; Final Embrace &quot; gibt es mit
&quot; Save A Prayer &quot;, &quot; Under Your Spell &quot;, dem m&auml;chtigen &quot; Church Of Blood &quot;
und dem treibenden &quot; Nation In Fear &quot; noch weitere wahre Power Granaten.
Zwar kommen im letzten Drittel auch einige durchschnittliche Nummern
zum Zuge, aber die hervorragende Rainbow Coverversion &quot; Kill The King &quot;
entsch&auml;digt das voll und ganz. &Uuml;ber dem allen steht der nach wie vor
perfekt Gesang von Ralf Scheepers, der nach wie vor zu einem der besten
deutschen Lead S&auml;nger geh&ouml;rt. Auch an der Produktion gibt`s,
erwartungsgem&auml;&szlig;, nichts zu n&ouml;rgeln, so da&szlig; unter dem Strich mit
&quot; Jaws Of Death &quot; ein w&uuml;rdiger Nachfolger das Licht der Welt erblickt
hat; auch wenn die eine oder andere Speed Nummer der CD sicherlich
gut getan h&auml;tte. Na ja, trotzdem kann man den Jungs eine sehr
gute Leistung attestieren und sich sicher sein, da&szlig; Primal Fear sich
endg&uuml;ltig in den Top 10 des deutschen Power Metals etablieren konnten.</p>
<p align=center> Fazit: 8 von 10 Punkten</p>
<hr size=2 NOSHADOW align=center color="ffff00" width=100%>
<table border=0 width=100%>
<tr><td align=center width=50%><a href="indexhmc9.htm" target="rechts">Index Metal Corner </a></td>
<td align=left width=50%><a href="that_0.htm" target="rechts"> Index That´s Life </a></td></tr>
</table>
</body>
</html>
