<html>
<head>
<title> Amiga 4ever - Metal Corner 9/99 ( News ) - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left> News:</p>
<p align=left>
- Bei Rage ist es nun endg&uuml;ltig aus: Nachdem schon letzten Monat
berichtet wurde, da&szlig; Sven Fischer und Spiros Efthimiadis bei Rage
ausgestiegen sind, hat auch Spiros Bruder Chris N&auml;gel mit K&ouml;pfen
gemacht und ist bei der Herner Formation ausgestiegen. Als bisher
einzigen neuen Gitarristen stellte Peavy Wagner, einziges
verbleibendes Bandmitglied, Victor Smolski (ex-Mind Odysee)
vor. Als neuen Drummer wird mitlerweile Mike Terrana (u.a. Metalium,
Roland Grapow etc.) gehandelt.</p>
<p align=left>
- Mike Terrana ist offensichtlich bei Metalium rausgeflogen: Nachdem Mike
Terrana beim With Full Force Festival nicht aufgetaucht war und die
Band sozusagen im Regen stehen lie&szlig;, wurde bandintern &uuml;ber den weiteren
Verbleib von Terrana abgestimmt, mit dem Ergebniss, da&szlig; f&uuml;r ihn kein
Platz mehr bei Metalium sei. Als Nachfolger wird Dr.Butcher Drummer
John Osborn gehandelt, der seinerseits Interesse bekundet hat und
schon beim With Full Force Festival aushalf.</p>
<p align=left>
- Atrocity haben einen neuen Drummer namens Martin Schmidt an Bord,
der ein langj&auml;hriger Freund von Bassist Chris Lukhaupt ist.</p>
<p align=left>
- Bei Kiss gibt`s ebenfalls interne Probleme: Gitarrist Ace Frehley will
nach der kommenden Tour (die von September bis Sylvester dieses Jahre
l&auml;uft) bei Kiss aussteigen. Gr&uuml;nde daf&uuml;r gibt`s sicherlich einige,
auch wenn der Hauptgrund sicherlich in der Machtstellung des
Duo`s Stanley / Simmons liegen d&uuml;rfte...</p>
<p align=left>
- Royal Hunt, die sich k&uuml;rzlich von ihrem langj&auml;hrigen S&auml;nger D.C.
Cooper getrennt hatten, sind offenbar an den Diensten von Fernando
Garcia (z.Zt. bei Victory) interessiert. Offiziell ist das ganze zwar
noch nicht, aber man kann davon ausgehen, daß am Ende Fernando Garcia
bei Royal Hunt einsteigen wird.</p>
<p align=left>
- Die n&auml;chste Iron Maiden Platte (geplant für Anfang 2000) wird von Kevin
Shirley produziert, der in der Vergangenheit schon Acts wie Dream Theater,
Silverchair und Aerosmith betreute. Na ja, ob das gut geht wird sich noch
zeigen m&uuml;ssen, aber in anderen Bereichen l&auml;uft es f&uuml;r Iron Maiden besser,
als nie zuvor: Mit dem Label Columbia hat man jetzt endlich wieder einen
Major im R&uuml;cken, der den Eisernen Jungfrauen sicherlich gut tun wird.
Allerdings soll via Columbia jetzt auch der komplette Iron Maiden
Backkatalog neu ver&ouml;ffentlicht werden (zum 4. Mal !!!).</p>
<p align=left>
- Die Gothic Band My Dying Bridge hat sich von Gitarrist Calvin Robertshow
getrennt.</p>
<p align=left>
- Neben der schon in der letzten Ausgabe angek&uuml;ndigten Single &quot; I Want Out &quot;
(mit Kai Hansen und Udo Dirkschneider), wollen die True Metaller von
HammerFall auch ein Video / DVD mit dem Titel &quot; The Final Crusade &quot; auf den
Markt schmei&szlig;en. Darauf werden Live Tracks und rares Material zu
sehen sein. Sowohl das Video als auch die Single sind ab dem 2.8.
erh&auml;ltlich.</p>
<p align=left>
- Steel Prophet haben ihren Drummer Pat Magrath vor die T&uuml;r gesetzt. Ab
September geht`s trotzdem wieder ins Studio und eine neue Scheibe
k&ouml;nnte uns demzufolge schon Anfang des n&auml;chsten Jahres erfreuen.</p>
<p align=left>
- Ex-Judas Priest Frontsirene Rob Halford scheint wieder auf Kurs in
Richtung Metal zu gehen. So klingt der brandneue Demo Track
&quot; Silent Screams &quot; `ne ganze Ecke klassischer und die uns&auml;glichen
Industrial Einfl&uuml;sse, die auf dem Erstlingswerk &quot; Voyeurs &quot; noch
vorherrschend waren, sind auch verschwunden. Das alles ist doch recht
verwunderlich, wenn man sich gar nicht mal so alte Aussagen
von Rob Halford (&quot; Metal ist schei&szlig;e. Da passiert nix mehr...&quot;) mal
durch den Kopf gehen l&auml;&szlig;t.</p>
<p align=left>
- Ger&uuml;chten zufolge, steht uns eine Soundgarden Reunion bevor. N&auml;hrboden
erh&auml;lt das ganze noch durch Aussagen von ex-Vocalist Chris Cornell
demzufolge die Jungs immer noch beste Freunde w&auml;ren. Mal sehen,
was daraus wird...</p>
<hr size=2 align=center color="ffff00" width=100%>
<table border=0 width=100%>
<tr><td align=center width=50%><a href="indexhmc9.htm" target="rechts">Index Metal Corner </a></td>
<td align=left width=50%><a href="that_0.htm" target="rechts"> Index That´s Life </a></td></tr>
</table>
</body>
</html>
