<html>
<head>
<title> Amiga 4ever - Metal Corner ( NEWS ) - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left>
* Wie in der letzten Ausgabe bereits vermeldet, ist der Split bei Rage
nun auch offiziell: Die beiden Gitarristen Spiros und Sven haben die
Band nun definitiv verlassen. &Uuml;ber den Verbleib von Efti (Bruder von
Spiros) ist bisher zwar noch nichts bekannt, aber man kann davon
ausgehen, da&szlig; auch er die Band verlassen wird. Das mitlerweile
fertiggestellte Album &quot; Ghost &quot; (erneut mit Klassik Einfl&uuml;ssen) wird
allerdings noch mit diesem Line-up laufen;
&uuml;ber entsprechende Nachfolger ist noch nichts bekannt.</p>
<p align=left>
* Am 30 April ist leider Nazareth Drummer Darrel Sweet verstorben :-(((</p>
<p align=left>
* Alice in Chains wollen demn&auml;chst einen 15 Song Sampler ver&ouml;ffentlichen,
auf dem sich auch einige Rarit&auml;ten befinden (Demos etc.). Ebenfalls in
Planung ist ein Boxset mit 44 Songs; ebenfalls wieder mit Rarit&auml;ten.<br>
Fans sollten schon mal anfangen zu sparen!</p>
<p align=left>
* Die d&auml;nischen Melodic / Prog. Metaller Royal Hunt haben sich von ihrem
S&auml;nger D.C. Cooper getrennt. &Uuml;ber einen Nachfolger ist bisher noch
nichts (offizielles) bekannt.</p>
<p align=left>
* Auch bei den wiedererstarkten Metal Church gibt`s Zoff:
Gr&uuml;ndungsmitglied Craig Wells (Gitarre) verlie&szlig; nach monatelangen
Streitigkeiten die Band. Ersetzt wird dieser durch John Marschall, der
fr&uuml;her schonmal bei der Band t&auml;tig war. Aufgrund des Wechsels
verschiebt sich auch das Release von dem neusten Album
(vorraussichtlich mit &quot; Masterpeace &quot; betitelt) auf den 26.
Juli.</p>
<p align=left>
* Wie in einer der letzten Metal Corner`s verk&uuml;ndet wurde, haben
HammerFall eine neue Single namens &quot; At The End Of The Rainbow &quot;
rausgedr&uuml;ckt, die nur auf Vinyl erscheinen wird. Ersteres ist richtig,
letzteres mitlerweile nicht mehr: Im Hause Nuclear Blast hat man sich
nun offenbar dazu &quot; durchgerungen &quot; (finanzielle Hintergedanken wollen
wir den Jungs mal nicht unterstellen :-)), die neue Single auch auf
CD anzubieten. Mit dabei ist &uuml;brigens auch Deutschlands Metal Gott
Kai Hansen (ex-Helloween; Gamma Ray), der den True Metallern dabei
hilft, die Helloween Coverversion &quot; I Want Out &quot; (eine Kai
Hansen Komposition) einzuspielen. Hoffentlich &uuml;bernimmt er dann auch
gleich die Vocals...</p>
<p align=left>
* Seine Karriere hat sich im letzten Jahr gewaltig nach oben verlagert:
Metalium Leads&auml;nger Henne Basse wurde als Gast Vocalist f&uuml;r das dritte
Output des Trans-Siberian Orchestra verpflichtet, was mehr als
bemerkenswert ist. Immerhin hat Mastermind Paul O`Neill (u.a. auch
als Strippenzieher bei Savatage bekannt) schon viele S&auml;nger nach
Hause geschickt und geh&ouml;rt zweifelsohne zu den anspruchsvollsten der
Szene.</p>
<p align=left>
* Bei Exciter ist wieder alles im Lot: Für den abgewanderten Lead S&auml;nger
Jacques Belanger hat man nun Steve Carter (ex-Deadcalm) verpflichten
k&ouml;nnen.</p>
<p align=left>
* Einige &Auml;nderungen im Line-up gab`s auch bei Dio: Gitarrist Tracy G.
machte freiwillig Platz f&uuml;r Carig Goldy (der fr&uuml;her schonmal bei
DIO t&auml;tig war) und einen weiteren Axeman namens David Rock (ex-Elf;
damals zusammen mit Dio`s Cousin Ronni). Zum aktuellen Line-up geh&ouml;ren
ferner noch Simon Wright (ex-AC / DC, ex-UFO; Drums), Larry Dennyson
(Bass) und Scott Warren (Keys). Das n&auml;chste Studioalbum &quot; Magica &quot;
wird vorraussichtlich am 5.Oktober erscheinen...</p>
<p align=left>
* Bruce Dickinson, der sich mehr als wohl f&uuml;hlt bei Iron Maiden, will im
Fr&uuml;hherbst noch eine Live Scheibe, mitgeschnitten auf der letzten Tour,
rausdr&uuml;cken. Bei Iron Maiden arbeitet man &uuml;brigens schon wieder an neuem
Material (!), das auf dem n&auml;chsten Longplayer, der vorraussichtlich
Anfang 2000 erscheint, verewigt sein wird.</p>
<p align=left>
* Dream Theater Goldkehlchen James La Brie wird als letztes Traumtheater
Mitglied nun auch im Nebenprojekt Gesch&auml;ft t&auml;tig. Gegen Ende August wird
unter dem Namen Mullmuzzler die erste CD dieses Projektes (u.a. mit Carl
Cadden James von Shadow Gallery) zu h&ouml;ren sein; &uuml;ber die n&auml;chste Dream
Theater CD herrscht demhingegen immer noch Unklarheit.</p>
<p align=left>
* Bei den Herner Power Metallern Custard (eine der besten Bands
&uuml;berhaupt!) ist Gitarrist / Vocalist Dirk
Wierczorek aufgrund gesundheitlicher Probleme ausgestiegen und wurde
mitlerweile durch einen neuen Gitarristen ersetzt. Angeblich soll der
Junge noch besser sein...</p>
<p align=left>
* Auf die glorreiche Idee 5 &auml;ltere Scheiben mit Bonus Tracks aufpoliert zum
regul&auml;ren Preis in die trendverseuchten L&auml;den zu stopfen, sind die
ansonsten &uuml;beraus korrekten und alles andere als geldgeilen Running
Wild gekommen. Insgesamt geht es um 14 (!) Bonus Tracks, die auf den
(Re-Releasten) Alben &quot; Death Or Glory &quot;, &quot; Pile Of Skulls &quot;, &quot; Blazon Stone &quot;,
&quot; Black Hand Inn &quot; und &quot; Masquerdae &quot; zu finden sind. Wie man aber den
sympatischen (da immer konsequent sein Ding durchziehenden) Chef
Rolf Kasparek kennt, wird er sich f&uuml;r seine Fans schon was einfallen
lassen.</p>
<p align=left>
* Wie man diversen Berichten / Publikationen / Sendungen entnehmen kann,
war das Dynamo Open Air alles andere als ein organisatorischer Erfolg.
Mit Wartezeiten bis zu 10 Stunden und brennenden Klo`s mussten hier die
Fans fertig werden. Vom musikalischen her war allerdings alles wieder
erste Sahne!</p>
<p align=left>
* Iron Savior werden im September einige Gigs (wahrscheinlich zusammen
mit Riot und Wardog) geben; &uuml;ber genaue Daten ist bisher noch nix
bekannt (zu 99 % offiziell).</p>
<hr size=2 NOSHADOW color="00ff00" width=80%>
<table border=0 width=100%>
<tr><td align=center width=50%><a href="indexhmc8.htm" target="rechts">Index Metal Corner </a></td>
<td align=left width=50%><a href="that_0.htm" target="rechts"> Index That´s Life </a></td></tr>
</table>
</body>
</html>
