<html>
<head>
<title> PD Review: Fayoh 2 </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="00ff00" alink="ffff00" vlink="ff00ff">

<p align=left> PD Review : A NEW ADVENTURE - FAYOH 2 (Shareware)<br>
<br>
 by NUMEN</p>

<table border=0 width=80%>
<tr><td align=left width=20%></td><td align=left width=10%></td>
<td align=left width=70%></td></tr>
<tr><td align=right> Genre: </td><td align=left></td><td align=left> Jump`n Run </td></tr>
<tr><td align=right> System: </td><td align=left></td>
<td align=left> Festplatte, 2 MB RAM, AGA oder Graka </td></tr>
<tr><td align=right> Empfohlen: </td><td align=left></td>
<td align=left> zus. RAM </td></tr>
<tr><td align=right> Bezugsquellen: </td><td align=left></td>
<td align=left> Amiga Future CD 18, Aminet </td></tr>
</table>
<p align=left>
 Der gr&uuml;ne Kaugummi FaYoh wurde von seinem schwarzen Artgenossen Don
Jockface bestohlen: Die Kaugummimaschine, in der FaYoh seine
Sternesammlung lagerte, wird vom B&ouml;sewicht f&uuml;r die Suche nach alten
M&uuml;nzen missbraucht.Deshalb muss der Weichgummiheld ganz nach oben in
Jockface`s Turm, der sich dort mit der Maschine versteckt h&auml;lt.Unterwegs
muss FaYoh auch noch alle Sterne aufsammeln, die
hat der Erzschurke n&auml;mlich einfach achtlos fallengelassen.</p>
<p align=left>
 Das Spiel beginnt in einem farbenfrohen Men&uuml;, das von guter Musik begleitet
wird.Gro&szlig;artige Optionen gibt es aber nicht, mit Wohlwollen stellen
wir aber fest, dass es offensichtlich eine Speicherm&ouml;glichkeit gibt.<br>
Kommen wir also zum eigentlichen Spiel:</p>
<p align=left>
 Am Anfang befindet FaYoh in dem Flur vom Schloss.Hier kann man ein Level
w&auml;hlen, das man durch einen Spiegel betritt.In der unregistrierten Version
stehen leider nur vier zur Auswahl, in der Vollversion gibt es deutlich
mehr und au&szlig;erdem noch ein paar Bosse.Ganz unten im Flur sind noch zwei
weitere offene R&auml;ume, in einem speichert eine Hexe f&uuml;r einige Punkte
den Spielstand, in dem anderen kann man f&uuml;r Punkte Extraleben gewinnen.</p>
<p align=left>
Die Level sind ziemlich lang und haben einen durchschnittlichen
Schwierigkeitsgrad.FaYoh kann wie SuperMario Gegner durch einen Sprung
auf den Kopf ins Jenseits bef&ouml;rdern.Auch sonst sind gewisse
&Auml;hnlichkeiten mit Nintendos Klassiker nicht zu &uuml;bersehen, vor allem was
das Design mancher Gegner anbelangt.Das Ziel jedes Levels ist das
Einsammeln aller Sterne, Kirschen und Taler.Hat man das
erledigt kann man das Level durch den Eingang wieder verlassen.
Schlie&szlig;lich gibt es noch eine Levelstatistik, die in Prozent den Erfolg
der Suche angibt.</p>
<table border=0 width=100%>
<tr><td align=left width=30%></td><td align=left width=70%></td></tr>
<tr><td align=left valign=top> Fazit: </td>
<td align=left> FaYoh 2 ist ein tolles Spiel, mit einer für PD-Ma&szlig;st&auml;be recht
 guten Grafik.Die vier Level sind aber schnell durchgespielt,
 so dass man &uuml;ber das Anschaffen der Vollversion nachdenken
 sollte.Die ist schon f&uuml;r 5 DM bei NC.Gamez zu haben, und die
 ersten zehn Registrierten erhalten au&szlig;erdem noch drei Bonusspiele.</td></tr>
</table>
<table border=0 width=50%>
<tr><td align=left width=50%></td><td align=left width=50%></td></tr>
<tr><td align=left> Grafik : </td><td align=left> 70% </td></tr>
<tr><td align=left> Sound : </td><td align=left> 74% </td></tr>
<tr><td align=left> Sound FX : ></td><td align=left> 67% </td></tr>
<tr><td align=left> Motivation : </td><td align=left> 62% </td></tr>
<tr><td align=left> Animation : </td><td align=left> 69% </td></tr>
<tr><td align=center colspan=2><hr size=2 NOSHADOW color="c0c0c0"></td></tr>
<tr><td align=left> Gesamt : </td><td align=left> 69% </td></tr>
</table>
<p align=center><font size=6 color="00ff00"><b> NUMEN </b></font></p>
<br>
<p align=left> Noch ein Nachtrag: <br><br>
 Wie ich inzwischen wei&szlig; befindet sich die Vollversion von
 FaYoh 2 auch auf der AminetCD 31.Wer sich diese CD kaufen 
 will kann sich das Registrieren also sparen.</p>
</body>
</html>
