<html>
<head>
<title> PD-Review: Super Bubble Remix </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="00ff00" alink="ffff00" vlink="ff00ff">

<table border=0 width=100%>
<tr><td align=left width=70%></td><td align=left width=30%></td></tr>
<tr><td align=left> PD Review : SUPER BUBBLE REMIX </td>
<td align=right> (Shareware) </td></tr>
<tr><td align=left colspan=2> by NUMEN </td></tr>
</table>
<br>
<table border=0 width=100%>
<tr><td align=left width=40%></td><td align=letf width=10%></td>
<td align=left width=50%></td></tr>
<tr> Genre: </td><td align=left></td><td align=letf> T&uuml;ftelspiel </td></tr>
<tr> System: </td><td align=left></td>
<td align=left>68020, 1.75 MB RAM, davon 1MB ChipRAM </td></tr>
<tr> Empfohlen: </td><td align=left></td><td align=left> zus.RAM </td></tr>
<tr> Bezugsquellen: </td><td align=left></td>
<td align=left> Amiga Future CD 18, Aminet </td></tr>
</table>
<br>
<p align=left>
 Der kleine Burggeist Bubble (der &uuml;brigens verd&auml;chtig an ein Kondom
erinnert) f&uuml;hlt sich durch den neuen Hauseigent&uuml;mer des Schlosses derer
van Bubbles bel&auml;stigt, der will n&auml;mlich ein Hotel draus machen.Also
zieht Bubble aus, wobei er eine kleine empfindliche Blase mitnehmen
muss, da sie seine Seele beinhaltet. Leider haben Geister nun einmal
aber keine H&auml;nde, und so bleibt Billy Boy Bubble nichts anderes &uuml;brig
als seine Seele durch die engen Schlossg&auml;nge zu pusten.Auf-
grund vieler Gegner ubd Fallen gestaltet sich dieses Vorhaben jedoch
als &auml;u&szlig;erst schwierig, denn bei der kleinsten Ber&uuml;hrung zerplatzt
die Blase.</p>
<p align=left>
 Soweit die Vorgeschichte.Im Men&uuml; l&auml;sst sich die Anzahl der Leben,
der Interlace Mode, der Sound und die Screenart (Es gibt Normal,
Old Movie und Game Boy - aber was soll das eigentlich?) einstellen.
Anschlie&szlig;end finden wir uns in den G&auml;ngen vom Schloss wieder, zusammen
mit ein paar Gegnern und einer Blase.Die Grafik verr&auml;t gleich, dass
offensichtlich eine junge Zielgruppe angestrebt wurde.Egal,
weiter geht`s.Der Geist l&auml;sst sich mit der Maus problemlos &uuml;ber den
ganzen Screen bewegen, ungeachtet aller Mauern und Gegner.Mit dem
linken Mausknopf dreht er sich nach links, mit dem rechten nach
rechts, und mit Space pustet er.Nun visiert man die Blase an und
pustet sie in Richtung des Nebenraumes.Jede Ber&uuml;hrung mit irgendetwas
wird sofort mit dem Verlust eines Lebens geahndet.Hat man das Ziel
erreicht, kommt der n&auml;chste von insgesamt 40 R&auml;umen.</p>
<p align=left>
 Die Grafik ist ganz nett, die Musik auch okay und sehr
abwechslungsreich und die Sound FX einfach Klasse.Jedesmal wenn die
Blase zerplatzt grummelt der Geist so toll, dass man fast versucht
ist sie nochmal gegen die Wand zu pusten.Der Schwierigkeitsgrad wird
aber schon ab dem f&uuml;nften Raum schlagartig so hoch, das einen leicht
der Mut vergehen kann.Gl&uuml;cklicherweise gibt es aber alle zwei Level
ein Passwort, mit dem das ganze doch noch ganz gut wird.</p>
<br>
<table border=0 width=100%>
<tr><td align=left width=35%></td><td align=left width=65%></td></tr>
<tr><td align=left valign=top> Fazit: </td>
<td align=left> Normalerweise w&auml;re SBRemix ein tolles Spiel für j&uuml;ngere
 Semester, weil es so schwer ist kann ich es aber nur geduldigen
 K&ouml;nnern empfehlen.Ansonsten haben die Jungs von Anonym Software
 aber ganze Arbeit geleistet, mein Respekt.</td>
</table> <br>
<table border=0 width=40%>
<tr><td align=left width=40%></td><td align=left width=10%></td><td align=left width=50%></td></tr>
<tr><td align=left> Grafik : </td><td align=left></td><td align=left> 63% </td></tr>
<tr><td align=left> Sound : </td><td align=left></td><td align=left> 73% </td></tr>
<tr><td align=left> Sound FX : </td><td align=left></td><td align=left> 78% </td></tr>
<tr><td align=left> Motivation : </td><td align=left></td><td align=left> 53% </td></tr>
<tr><td align=left> Animation : </td><td align=left></td><td align=left> 69% </td></tr>
<tr><td align=left colspan=3><hr size=2 NOSHADOW color="c0c0c0">
<tr><td align=left> Gesamt : </td><td align=left></td><td align=left> 66% </td></tr>
</table>
<br><p align=center><font size=6 color="00ff00"><b> NUMEN </b></font></p>
</body>
</html>
