<html>
<head>
<title> PD-Review: Tiger´s Bane </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="00ff00" alink="ffff00" vlink="ff00ff">

<table border=0 width=100%>
<tr><td align=left width=30%></td><td align=left width=70%></td></td>
<tr><td align=left> PD Review :<font color="00ff00"> TIGER`S BANE </font></td>
<td align=right> (Shareware) </td></tr>
<tr><td align=left colspan=2> By NUMEN </td></tr>
</table>
<br>
<table border=0 width=60%>
<tr><td align=left width=30%></td>
<td align=left width=70%></td></tr>
<tr><td align=left> Genre: </td>
<td align=left> 2D Flugsimulation </td></tr>
<tr><td align=left> Bezugsquellen: </td>
<td align=left> Amiga Future CD 17 </td></tr>
</table><br><br>
<p align=left>
 In Tiger`s Bane muss man sich als F&uuml;hrer eines Teams aus vier
Helikoptern in einer zweidimensionalen Welt beweisen.In der
Shareware-Version k&ouml;nnen allerdings nur zwei von insgesamt sechs
Szenarien gespielt werden.Da jedes aus mehreren Missionen besteht,
ist aber auch das schon eine Herausforderung.Ansonsten muss
man eben die Registrierungsgeb&uuml;hr von 17 DM zahlen.</p>
<p align=left>
 Das Men&uuml; hat eine ganze Menge an Optionen, insbesondere was die
Steuerung betrifft.Man kann entweder mit einem Joystick steuern und
schie&szlig;en (nicht zu empfehlen, da man nur schlecht beides gleichzeitig
tun kann), mit einem Joystick steuern und einem anderen schie&szlig;en
(meine Lieblingssteuerung, aber sehr gew&ouml;hnungsbedürftig), auf die
gute alte Tastatur zur&uuml;ckgreifen oder ein Gamepad benutzen.Au&szlig;erdem
lassen sich die Gr&ouml;&szlig;e der Explosionen, die Men&uuml;musik (eigentlich
nicht schlecht, wiederholt sich nur leider etwa alle fünf Sekunden)
und einiges mehr einstellen.Danach w&auml;hlt man dann eines von den zwei
Szenarien, die zur Auswahl stehen und einen Schwierigkeitsgrad und
auf geht`s in den Kampf.</p>
<p align=left>
 Man erh&auml;lt ein Missionbriefing vor jeder Mission (auf englisch),
in dem man ein bisschen Hintergrund sowie ein prim&auml;res und ein
sekund&auml;res Einsatzziel erf&auml;hrt (meistens das Zerst&ouml;ren einer bestimmten
Feindformation oder einer Br&uuml;cke, seltener das Retten einer Person
oder der Transport von Infanteristen).Danach begibt man sich in die
Waffenkammer, wo mehrere verschiedene Hubschrauber zur Aus-
wahl stehen.Davon werden vier ausgew&auml;hlt, einen &uuml;bernimmt man
pers&ouml;nlich und drei der Computer, die er auch ganz sinnvoll einsetzt.</p>
<p align=left>
 Das Schlachtfeld ist wie schon gesagt zweidimensional, man betrachtet
seine Hubschrauber also von der Seite.Das Handling ist nach einer
kurzen Gew&ouml;hnungszeit ganz gut, man muss nur erstmal lernen mit den
bis zu vier Waffensystemen umzugehen.Hat man alles erledigt oder wurde
man zum R&uuml;ckzug gezwungen (die Feinde sind sehr schie&szlig;w&uuml;tig) fliegt
man zur&uuml;ck zum Startplatz.Es folgt eine Statistik zum Einsatz in
Prozent, verlorengegangene Hubschrauber bleiben verloren, 
sollte der eigene zerst&ouml;rt werden, ohne dass man rechtzeitig den
Schleudersitz bet&auml;tigen konnte ist das Spiel nat&uuml;rlich zuende.
Besch&auml;digte Vehikel werden mehr oder weniger schnell repariert.Am
Ende eines Szenarios wird angegeben, zu wieviel Prozent man es
insgesamt geschafft hat.Dazu gibt es noch einen Kommentar
(z.B. good, very good oder average).</p>

<table border=0 width=100%>
<tr><td align=left width=30%></td><td align=left width=70%></td></tr>
<tr><td align=left valign=top> Fazit: </td>
<td align=left> Tiger`s Bane lohnt auf jeden Fall einen genaueren Blick,
 Kampagnen k&ouml;nnen auch mehrmals durchgespielt werden, ohne dass
 sie langweilig werden, da die Missionen zuf&auml;llig aus einer
 breiten Palette gew&auml;hlt werden.</td></tr>
</table>
<br>
<Table border=0 width=40%>
<tr><td align=left width=40%></td><td align=left width=10%></td>
<td align=left width=50%></td></tr>
<tr> Grafik : </td><td align=left></td><td align=left> 61% </td></tr>
<tr> Sound : </td><td align=left></td><td align=left> 49% </td></tr>
<tr> Sound FX : </td><td align=left></td><td align=left> 63% </td></tr>
<tr> Motivation : </td><td align=left></td><td align=left> 61% </td></tr>
<tr> Animation : </td><td align=left></td><td align=left> 59% </td></tr>
<tr><td align=center colspan=3><hr size=2 NOSHADOW color="c0c0c0"></td></tr>
<tr> Gesamt : </td><td align=left></td><td align=left> 61% </td></tr>
</table>
<br>
<p align=center><font size=6 color="00ff00"><b> NUMEN </b></font></p>
</body>
</html>
