<html>
<head>
<title> That´s Life - TableTop Games - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left>
 by NUMEN<br><br>
 Moin, ihr Scharen von Lesern die ihr mich bewundert und verehrt !<br><br>
 In meiner unendlichen G&uuml;te habe ich beschlossen heute ein wenig &uuml;ber
die sog. Tabletop-Spiele (f&uuml;r die die`s nicht wissen: &quot; Tischplattenspiele &quot;)
zu schreiben. Wahrscheinlich kennt jeder in seiner Umgebung eine solche
Spielergruppe (zu den bekanntesten Tabletop-Spielen z&auml;hlen Warhammer,
Warhammer 40.000 und Warzone, au&szlig;erdem gibt es neuerdings auch eins,
das den Hintergrund des Rollenspiels DSA benutzt).Mitglieder solcher
Gruppen l&ouml;sen h&auml;ufig blankes Unverst&auml;ndnis bei Au&szlig;enstehenden aus,
deshalb will ich mit diesem Artikel ein bisschen Licht in das
Hobby bringen.</p>
<p align=left>
 Erstmal zum Namen: Man nennt diese Art von Gesellschaftsspielen so,
weil man sie nicht wie gew&ouml;hlich auf einem Spielbrett, sondern auf einem
Tisch spielt. Ob man einen flachen Tisch oder eine Platte voll mit
Modellgel&auml;nde benutzt bleibt jedem freigestellt, letzteres macht
nat&uuml;rlich mehr Spa&szlig;, aber auch mehr Arbeit und mehr Platz ins
Portemonnai.Hat man eine Spielfl&auml;che braucht man als n&auml;chstes eine
Armee von Metall- und Plastikminiaturen, die besten stellt sicher-
lich Citadel her, die sind aber (noch) teurer als andere (2-20 DM
muss man f&uuml;r ein 30mm Fig&uuml;rchen schon blechen, je nach Material und
Detailreichtum mehr oder weniger).Die Zusammenstellung einer
Streitmacht kann eine Menge Spa&szlig; machen. Erstmal muss man sich ein
Volk aussuchen, bei Warhammer stehen zum Beispiel unter anderem
Imperium, Zwerge, Orks, Hochelfen, Chaos und Skaven (Rattenmenschen)
zur Auswahl.Für jedes Volk gibt es ein Armeebuch, in dem die
Geschichte und die spielerischen Eigenschaften erkl&auml;rt werden.Am
wichtigsten ist aber die Armee-liste, in der alle Truppentypen
inklusive Werte und Sonderregeln aufgez&auml;hlt sind.Au&szlig;erdem erf&auml;hrt man
hier die Punktkosten für jedes Modell (damit niemand einen Vorteil
aufgrund einer gr&ouml;ßeren Armee hat, gibt die Punktzahl eines Mo-
dells die spielerische Qualit&auml;t wieder, so sind zwei Armeen immer
ungef&auml;hr gleich stark.Ein einfacher Orkkrieger kostet beispielsweise
acht Punkte, ein Chaoskrieger vierundzwanzig.Der Chaosspieler wird
also gegen Orks einer ungef&auml;hr dreifachen &Uuml;bermacht gegen&uuml;berstehen,
da er eine Elitestreitmacht f&uuml;hrt).Mit den Informationen aus dem
Armeebuch kann man sich dann eine individuelle Streitmacht
zusammenstellen, die sich in jedem guten Hobbyladen oder per Bestellung
einkaufen l&auml;sst.Normalerweise bemalt man seine Miniaturen noch
(eine Besch&auml;ftigung, die sehr viel Spa&szlig; machen kann), aber die ersten
paar Spiele wird man in der Regel mit einer unbemalten Armee
austragen.Wenn man einen Gegner gefunden hat kann`s losgehen...</p>
<p align=left>
 Das Spiel l&auml;uft in Spielz&uuml;gen ab, und jeder Kontrahent kann w&auml;hrend
seines Spielzugs alle seine Einheiten bewegen.Dazu hat jede Miniatur
einen Bewegungswert, au&szlig;erdem gibt es noch Werte wie Kampfgeschick,
Ballistische Fertigkeit (Schie&szlig;en), St&auml;rke, Widerstandskraft,
Lebenspunkte, Attacken, Initiative und Moralwert (Das waren jetzt
die Werte bei Warhammer und Warhammer 40K, sie variieren nat&uuml;rlich
von System zu System).So ein Spiel l&auml;uft also nach ebenso stren-
gen Regeln ab wie ein gew&ouml;hnliches Gesellschaftsspiel, sie sind halt
nur viel komplexer.Im Laufe der Schlacht muss man dann versuchen den
Gegner durch taktisches Geschick (Der W&uuml;rfel spielt nat&uuml;rlich auch
eine Rolle, aber man muss halt auch mal ein Risiko eingehen) zu
schlagen.Je nach System wird das Auftragsziel vor dem Spiel
ausgew&uuml;rfelt oder ausgew&auml;hlt oder es steht pauschal fest.
Am Ende einer Schlacht (Die je nach Gr&ouml;&szlig;e der Armeen unterschiedlich
lange dauert, ein durschnittliche 1500 Punkte Warhammer-Spiel etwa
3-4 Stunden) wird der Sieger ermittelt, wobei Faktoren wie Anzahl
der ausgeschalteten Gegner und Erreichen des Missionsziel eine Rolle
spielen.Um Miniaturen oder gar Geld wird in aller Regel nicht
gespielt, auf einem Turnier besteht aber die M&ouml;glichkeit
einen Preis zu gewinnen.</p>
<p align=left>
 Urspr&uuml;nglich stammt die Spielidee aus England (von Games Workshop,
um genau zu sein), in Deutschland ist sie noch ziemlich jung.Aber
besonders in Nordrhein-Westfalen erlebt sie in letzter Zeit einen
gewaltigen Aufschwung, vor allem Warhammer scheint sehr beliebt zu
sein.Inzwischen finden auch in Deutschland in vielen St&auml;dten Turniere
und Ligen statt, die Seuche breitet sich aus...<br>
Noch etwas zum Alter: Tabletopspiele sind meistens ab 14 oder 15,
tats&auml;chlich sind es aber haupts&auml;chlich Erwachsene, die diesem Hobby
fr&ouml;hnen.Bei dem zugegeben etwas brutalem Hintergrund ist
das wohl auch besser so.</p>
<p align=left>
 So, f&uuml;r einen kurzen (sehr kurzen) Einblick sollte das gen&uuml;gen.
Vielleicht schreibe ich ein anderes Mal wieder ein bisschen zu
diesem Thema.Falls jemand noch Fragen zum Thema Tabletop hat, kann er
mich ruhig kontaktieren (auch telefonisch).Ich verstehe mich auf dem
Gebiet n&auml;mlich als eine Art Spezialist (wo kommt blo&szlig; dieser
pl&ouml;tzliche Gestank her?).</p>
<br><p align=left><font size=6 color="00ff00"> NUMEN </font></p>
<br>
<table border=0 width=100%>
<tr><td align=left valign=top width=5%>PS:</td>
<td align=left> Falls es au&szlig;er mir noch ein Tablet&ouml;ppler unter uns geben<br>
 sollte so m&ouml;ge er bitte Laut geben, vielleicht k&ouml;nnen wir ja im<br>
 Usertalk ein paar Erfahrungen austauschen.</td></tr>
</table>
</body>
</html>

