<html>
<head>
<title> That´s Life - ( Kurzgeschichte ) Der Transfer - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<p align=left><u> Der Transfer </u><br><br>
 &quot;Alle Systeme bereit, Parameter innerhalb der zugelassenen Toleran-
 zen, Energiezufuhr gesichert. Wins, bist Du soweit?&quot;, klang es blechern
 aus den Lautsprechern.<br><br>
  Winston lie&szlig; die letzten drei Jahre noch einmal revue passieren. Am
 13.12.2061 hatte er eine geniale Idee. Ausgel&ouml;st durch eine scherzhafte
 Diskussion mit seinen Freunden Sam und Thomas &uuml;berlegte er
 sich, wie es m&ouml;glich w&auml;re, eine gesamte Pers&ouml;nlichkeit, alles Wissen
 und die Erfahrung einer Person zu kopieren, im Computer zu speichern
 und auf Jemand anderen zu &uuml;bertragen. Sie spielten weiter mit dem
 Gedanken und stellten sich vor, die &quot; Kopie &quot; m&ouml;glicherweise sogar
 modifizieren zu k&ouml;nnen. Man k&ouml;nnte negative Eigenschaften einfach
 l&ouml;schen und das beste, man k&ouml;nnte die Pers&ouml;nlichkeit eines totgeweihten
 Kranken sichern und auf einen Spenderk&ouml;rper &uuml;bertragen. Damals ging
 diese Diskussion in Bier und Gel&auml;chter unter, doch Winston verfolgte
 diesen Gedanken und rief das Projekt &quot; Mindtransfer &quot; ins Leben.
 Zusammen mit seinen beiden Freunden und einem 18 köpfigen
 Forschungsteam arbeiteten sie am Institute of Computer and Electronic,
 kurz ICE, an diesem Projekt.</p>
<p align=left>
  Und nun sitzt er in der kleinen sechseckigen Kapsel, schlie&szlig;t sich mit
 einigen Handgriffen an die Ger&auml;tschaften an und hebt z&ouml;gerlich die
 Hand, w&auml;hrend er mit dem Zeigefinger und Daumen ein deutliches &quot; o &quot;
 formt. Er schaut nocheinmal zu Sam und Thomas, die ihm, &quot; viel Gl&uuml;ck &quot;
 gestikulierend, durch die dicke Glaswand aus dem etwa vier Meter
 h&ouml;hergelegenen Kontrollraum aus beobachten. Dann beginnt sich das
 Metallschott mit dem kleinen Bullauge vor der Kapsel abzusenken.
 Jetzt, kurz vor Beginn des Experiments kommen ihm pl&ouml;tzlich Zweifel.
 Zwar hat die Menschheit seit dem Zusammenschlu&szlig; der Welten 2046
 erstaunliches erreicht, so zum Beispiel die M&ouml;glichkeit, große universelle
 Kraftfelder zu erzeugen und unglaubliche Neuerungen in der Raumfahrt
 hervorzubringen, doch ein komplettes Backup einer Pers&ouml;nlichkeit
 schien ihm jetzt doch etwas hochgegriffen.</p>
<p align=left>
  Mit einem dumpfen aber nicht weniger lauten rumpsen schlie&szlig;t sich
 das Schott und wird verriegelt. Das unscheinbare leise Summen wird
 nun immer lauter. Leitungen, die an der Kapsel angeschlossen sind beginnen
 zu zucken und das Labor taucht in ein warnendes rotes Licht.
 &quot; Sam, es wird Zeit für das dritte Protokoll. &quot;  &quot; Leg los Tom! &quot;
 Thomas beginnt eine Checkliste durchzugehen und Sam tippt auf einer Tastatur
 ein. Er best&auml;tigt jeden Punkt der Checkliste und Thomas hakt ihn ab.
 Das gesamte Team wirbelt durch den Kontrollraum, hier etwas regulierend,
 dort etwas einstellend. Die Ger&auml;tschaften scheinen in der selben
 Hektik, wild flackernd und Monitore unverst&auml;ndliche Daten
 ausspuckend, zu arbeiten.</p>
<p align=left>
  Ein schriller Signalton rei&szlig;t das Forschungsteam aus seinem Rhythmus.
 &quot; Was ist los? &quot;, fragt Tom hecktisch. &quot; Ein Fehler in der
 Transfermatrix. Ich glaube etwas mit dem Interface ist nicht in Ordnung. &quot;
 Sie schauen zur Kapsel herunter und k&ouml;nnen hinter dem Bullauge
 Winstons schmerzverzerrtes Gesicht erkennen.  &quot; Wir müssen abbrechen,
 Sam! &quot;  &quot; Du wei&szlig;t doch genau, da&szlig; das jetzt nicht mehr m&ouml;glich ist. &quot;
 Winstons Schrei l&auml;&szlig;t das gesamte Team zusammenfahren und Thomas
 verliert nun vollkommen die Fassung. Er rei&szlig;t Sam vom Computer
 und hackt auf die Tastatur ein. &quot; TOM, NICHT!!! &quot;
 Nocheinmal zieht sein ganzes Leben an ihm vorbei. Er sieht sich in
 seiner Schulzeit, seiner isolierten Jugend , er erlebt nocheinmal den
 Augenblick, als er seine geliebte Alena kennenlernte, ihre Hochzeit und
 die wunderbaren Jahre die sie ihm schenkte.<br>
 Ein ungeheurer Schmerz durchzuckt ihn nocheinmal vom Kopf bis in die
 letzten Adern und Sehnen seines Körpers; dann wird es dunkel.</p>
<p align=left>
  Langsam und behutsam &ouml;ffnete Winston seine Augen. Seine Frau liegt
 neben ihm und streichelt ihn zärtlich. &quot; Alena...was... &quot;
 &quot; Ist schon gut... &quot;, beruhigt ihn Alena mit ihrer warmen,
 einf&uuml;hlsamen Stimme, &quot; du hast nur getr&auml;umt. &quot;
 Wintson versucht sich gerade zu sammeln und das erlebte zu verarbeiten
 als Alena ihn in seinen Bem&uuml;hungen stoppt: &quot; Na komm Wins, du
 mu&szlig;t jetzt aufstehen. Ihr habt doch heute euer großes Experiment! &quot;</p>
<p align=right> ©MCMXCIX - Marco Schuldt </p>
</body>
</html>
