<html>
<head>
<title> That´s Life - B&uuml;chertest - </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p align=left> B&Uuml;CHERTESTS<br><br>
 by NUMEN<br><br>
 Durch Kilian Servais mit seinen CD-Tests animiert, habe ich beschlossen
in jeder Ausgabe dieses Magazins ein paar B&uuml;cher vorzustellen und
gegebenenfalls zu empfehlen.Jedes Buch bekommt au&szlig;erdem eine Note
(Schulnotensystem) von mir.Diesmal sind folgende f&uuml;nf B&uuml;cher dran :</p>
<br>
<p align=left> - Die Stadt der schwarzen Krieger (W.Hohlbein) <br>
 - Voll im Bilde (T.Pratchett)<br>
 - Christine (S.King)<br>
 - Aus dunkler Tiefe (B.B&uuml;chner)<br>
 - Der Richter und sein Henker (F.D&uuml;rrenmatt)<br>
 - Maria Stuart (F.Schiller)<br></p>
<p align=left>
Insbesondere das letzte Buch wird euch wahrscheinlich ein wenig
verwundern, aber ich gebe mir M&uuml;he die ganze Palette zu ber&uuml;cksichtigen,
die es auf dem B&uuml;cher-markt so gibt und dazu geh&ouml;ren eben auch solche
&auml;ltere Exemplare, die ich pers&ouml;nlich nur sehr selten lese.Aber
vielleicht gibt es ja unter euch jemanden, der diese alten B&uuml;cher mag.<br>
Solltet ihr diesen Teil meines Artikels jedoch partout 
ablehnen, so bin ich nat&uuml;rlich bereit ihn in Zukunft wegzulassen.</p>
<br><br>
<table border=0 wuidth=50%>
<tr><td align=left width=20%></td><td align=left width=80%></td></tr>
<tr><td align=center colspan=2> DIE STADT DER SCHWARZEN KRIEGER <br>
 (erster Roman der Saga von Garth und Torian)</td></tr>
<tr><td align=right> Art: </td><td align=left> Fantasy </td></tr>
<tr><td align=right> Autor: </td><td align=left> Wolfgang Hohlbein </td></tr>
<tr><td align=right> Verlag: </td><td align=left> Tosa Verlag </td></tr>
<tr><td align=right> Preis: </td><td align=left> ca. 15 DM </td></tr>
<tr><td align=right> Umfang: </td><td align=left> 169 Din A5 Seiten </td></tr>
</table><br>
<p align=left>
 Wolfgang Hohlbein ist sicherlich einer der besten deutschen
Schriftsteller, der zwar eine Menge B&uuml;cher geschrieben hat, darunter
aber auch eine Menge Schrott. Dieses Buch kann man etwa in der Mitte
einordnen.Es ist der erste Teil der Reihe &quot;Die Saga von Garth und Torian&quot;,
ist aber eine zusammenh&auml;ngende Geschichte. Hier lernen sich die beiden
Hauptakteure kennen, Garth, ein Dieb und Torian, ein M&ouml;rder.Zusammen
treffen sie in einer W&uuml;ste auf die Ruinen einer Stadt, wo sie sich
unter mysteri&ouml;sen Umst&auml;nden pl&ouml;tzlich in der Vergangenheit wiederfinden,
als die Stadt noch bewohnt wurde.Dummerweise liegt ein
vernichtender Angriff kurz bevor, und dann werden die Helden auch
noch als Spione des Feindes von den Stadtwachen festgenommen...
 Das Buch ist f&uuml;r eine Fantasygeschichte ein bisschen zu kurz.Eine
ordentliche Lekt&uuml;re, der Autor hat aber schon besseres geschrieben.</p>
<br><p align=center> Note : GUT - BEFRIEDIGEND </p>
<br><br>
<table border=0 width=40%>
<tr><td align=left width=20%></td><td align=left width=80%></td></tr>
<tr><td align=center colspan=2> VOLL IM BILDE </td></tr>
<tr><td align=right> Art: </td><td align=left> Satire/Fantasy </td></tr>
<tr><td align=right> Autor: </td><td align=left> Terry Pratchett </td></tr>
<tr><td align=right> Verlag: </td><td align=left> Goldmann Verlag </td></tr>
<tr><td align=right> Preis: </td><td align=left> 18 DM </td></tr>
<tr><td align=right> Umfang: </td><td align=left> ca.300 Din A5 Seiten </td></tr>
</table><br>
<p align=left>
 Terry Pratchett, der in Deutschland noch nicht ganz so bekannt ist,
wie er es verdient h&auml;tte, hat bereits eine ganze Menge an Romanen
geschrieben, die in der Scheibenwelt spielen.Dabei hat er einen sehr
witzigen Schreibstil, der an den Großmeister Douglas Adams erinnert.
Die Scheibenweltromane erreichen allerdings nicht ganz die Qualit&auml;t
von dessen Bestseller &quot; Per Anhalter durch die Galaxis &quot;.<br>
 &quot; Voll im Bilde &quot; ist das erste Buch aus dem Reich der Scheibenwelt,
die sich &uuml;brigens in beliebiger Reihenfolge lesen lassen.Es geht um
die geniale Erfindung eines Alchemisten, der das Geheimnis des Kinos
entdeckt hat.Aber die Magier von Ankh-Morpork (der Hauptstadt der
Scheibenwelt) sch&ouml;pfen Verdacht und finden den heimlichen Drehort der
Alchemisten, ein &Ouml;rtchen namens &quot; Holy Wood &quot;.Sie beschlie&szlig;en den
Erfolg ihrer Konkurrenten, den Alchemisten, zu sabotieren.W&auml;hrenddessen
&uuml;bernimmt ein ehemaliger W&uuml;rstchenverk&auml;ufer die Leitung der
Filmbranche und stellt die Produktion von Bildungsfernsehen auf
Unterhaltung um.Doch das hat f&uuml;rchterliche Folgen, denn immer mehr
Filme werden Realit&auml;t.Der Fluch von Holy Wood erf&uuml;llt sich...</p>
<table border=0 width=100%>
<tr><td align=left valign=top width=30%>&Uuml;brigens: </td>
<td align=left width=70%> Zur Scheibenweldreihe gibt es für Playstation und PC zwei
 Adventures, Discworld und Discworld 2.Diese Spiele geh&ouml;ren zu
 den besten und lustigsten Vertretern ihres Genres, sehr zu empfehlen!</td></tr>
 </table><br><p align=center> Note : SEHR GUT </p>
<br><br>
<table border=0 width=100%>
<tr><td align=left width=20%></td><td align=left width=80%></td></tr>
<tr><td align=center colspan=2> AUS DUNKLER TIEFE </td></tr>
<tr><td align=right> Art: </td><td align=left> Fantasy (Buch zum Rollenspiel &quot; Das Schwarze Auge &quot;) </td></tr>
<tr><td align=right> Autor: </td><td align=left> Barbara B&uuml;chner </td></tr>
<tr><td align=right> Verlag: </td><td align=left> Heyne Verlag </td></tr>
<tr><td align=right> Preis: </td><td align=left> 12,90 DM </td></tr>
<tr><td align=right> Umfang: </td><td align=left> 235 Din A5 Seiten </td></tr>
</table><br>
<p align=left>
 Dieses Buch geh&ouml;rt zu den vielen, die in der Welt des Schwarzen Auges
spielen. Es geht um den Metzger Gille und seine Schwester, die
Kriegerin Alwen.Ihr Vater starb unter mysteri&ouml;sen Umst&auml;nden am Ufer
eines großen Sees in Trallop, denn der Schwarzmagier Barstopal ist aus
Selem zur&uuml;ckgekehrt und hat ein unbesiegbares Seemonster beschworen.
Zusammen mit dem Elfen Fingal macht sich die kleine Gruppe auf den Weg
nach Donnerbach, um dort bei den Magiern um Hilfe zu bitten und den
Zauberer mit seinem Monster zu t&ouml;ten.</p>
<p align=left>
 Ein spannendes Buch, das sich auch gut lesen l&auml;sst, wenn man
ansonsten mit DSA nichts zu tun hat.</p>
<p align=center> Note : GUT </p>
<br><br>
<table border=0 width=45%>
<tr><td align=left width=20%></td><td align=left width=80%></td></tr>
<tr><td align=center colspan=2> CHRISTINE </td></tr>
<tr><td align=right> Art: </td><td align=left> Horror </td></tr>
<tr><td align=right> Autor: </td><td align=left> Stephen King </td></tr>
<tr><td align=right> Verlag: </td><td align=left> Heyne Verlag </td></tr>
<tr><td align=right> Preis: </td><td align=left> ca.18 DM </td></tr>
<tr><td align=right> Umfang: </td><td align=left> 651 Din A5 Seiten </td></tr>
</table><br>
<p align=left>
 Stephen King d&uuml;rfte jedem bekannt sein, es gibt kaum einen Horrorautor,
der auf der ganzen Welt so beliebt ist.Um so entt&auml;uschter war ich von
diesem Buch, das das erste und wahrscheinlich auch letzte war, das ich
von diesem Autor gelesen habe.</p><p align=left>
 Es geht um den jugendlichen Au&szlig;enseiter Arnie, der sich einen
gebrauchten 58er Plymouth bei einem Ex-Soldaten namens LeBay gekauft
hat.Er steckt seine ganze Arbeit in die Reperatur des heruntergekommenen
Wagens, den er Christine nennt, und verliert dabei seinen einzigen
Freund Dennis Guilder und seine Freundin Leigh.Nebenbei geschehen immer
wieder unaufkl&auml;rbare Morde, die alle irgendwie mit dem alten Wagen
zusammenh&auml;ngen.Als Arnie dann aber mit dem Geist des inzwischen
verstorbenen LeBay zu verschmilzen scheint, beschlie&szlig;en seine
Ex-Freunde etwas gegen den Plymouth zu unternehmen, von dem alles &Uuml;bel
ausgeht. Stephen King beweist einen tollen Schreibstil, aber eine
Einleitung von etwa 400 Seiten, die zudem absolut langweilig ist, halte
ich für ein bisschen &uuml;bertrieben.Dass das Buch anschlie&szlig;end sehr
spannend und unheimlich weitergeht kann das micht ganz zu entsch&suml;digen.</p>
<p align=center> Note : AUSREICHEND </p>
<br><br>
<table border=0 width=80%>
<tr><td align=left width=20%></td><td align=left width=80%></td></tr>
<tr><td align=center colspan=2> DER RICHTER UND SEIN HENKER </td></tr>
<tr><td align=right> Art: </td><td align=left> Krimi </td></tr>
<tr><td align=right> Autor: </td><td align=left> Friedrich D&uuml;rrenmatt </td></tr>
<tr><td align=right> Verlag: </td><td align=left> rororo </td></tr>
<tr><td align=right> Preis: </td><td align=left> 7,90 DM </td></tr>
<tr><td align=right> Umfang: </td><td align=left> 117 Din A5 Seiten </td></tr>
</table><br>
<p align=left>
 Der Schweizer Polizeibeamte Schmied wird in seinem Auto ermordet und
sein ehemaliger Kollege B&auml;rlach muss das Verbrechen aufkl&auml;ren.Bei
seinen Ermittlungen trifft er mit Hilfe von Tschanz auf einen alten
Bekannten, Gastmann, den er schon einmal nicht für seine Verbrechen
&uml;berführen konnte.Alles deutet darauf hin, dass er der M&ouml;rder ist, aber
B&auml;rlach z&ouml;gert noch. Ein nettes Buch mit einem einfallsreichen Clou.
Leider l&auml;sst der Schreibstil des Autors ein wenig zu w&uuml;nschen &uuml;brig.</p>
<p align=center> Note : BEFRIEDIGEND - AUSREICHEND </p>
<br><br>
<table border=0 width=45%>
<tr><td align=left width=20%></td><td align=left width=80%></td></tr>
<tr><td align=center colspan=2> MARIA STUART </td></tr>
<tr><td align=right> Art: </td><td align=left> Schauspiel/Trag&ouml;die </td></tr>
<tr><td align=right> Autor: </td><td align=left> Fridrich Schiller </td></tr>
<tr><td align=right> Verlag: </td><td align=left> Reclam </td></tr>
<tr><td align=right> Preis: </td><td align=left> 6 DM </td></tr>
<tr><td align=right> Umfang: </td><td align=left> 137 Din A6 Seiten </td></tr>
</table><br>
<p align=left>
 Dieses kurze Buch vom ber&uuml;hmten Schriftsteller Schiller behandelt
die (leicht verf&auml;lschte) Lebensgeschichte der versto&szlig;enen
Schottenk&ouml;nigin Maria Stuart.Nachdem sie ihren Mann umbrachte floh sie
nach Frankreich zu einem mit ihr verwandten Kardinal, der sie ins
protestantische England unter K&ouml;nigin Elisabeth schickt.Elisabeth, auch
eine enge Verwandte Maria`s, l&auml;sst sie aber gefangennehmen, da sie wegen
ihrer Religion und ihrem Anspruch auf den Thron (von dem zuvor
niemand etwas wusste) f&uml;r eine Menge Unruhe im Land sorgt.Nun stellt
sich die Frage, ob sie hingerichtet werden soll, w&auml;hrend ihre Anh&auml;nger
einen Staatsstreich planen.<br>
 Aufgrund der alten und sehr poetischen Sprache ist dieses Buch nur
für gebildetere Leser zu empfehlen.Spannende Actionszenen sucht man
vergebens.Das Buch zeigt den historischen Ablauf in einer anderen
Sichtweise, in der Maria die &quot; Gute &quot; darstellt, was sehr
interessant sein kann.</p>
<p align=center> Note : BEFRIEDIGEND </p>
<br>
<p align=center><font size=6 color="00ff00"> NUMEN </font></p>
</body>
</html>
