<html>
<head>
<title> 4ever Werbung Team Page </title>
</head>

<body background="gif/hintergrund.gif" text="ffffff" link="ffff00" alink="ff00ff" vlink="ff00ff">

<p align=left><B><h1> The </p><p align=center> Team </p><p align=right> Page </p></b></h1>
<p align=center><h4><a href="http://www.tu-darmstadt.de/~amazing"> www.tu-darmstadt.de/~amazing </a></p>
<p align=center> Mirror :<a href="http://www.delax.webjump.com"> delax.webjump.com </h4></a></p>

<p align=left><b><h5> MT - the team page .! <br><br> FAQ - 1.1 </b></p>
<p align=left> Man glaubt es kaum - wir bekommen Mails! Aber dieses FAQ soll nicht nur
denen dienen, die die Fragen gestellt haben, sondern auch allen anderen, die noch
&uuml;berhaupt nichts von uns wissen! </h5></p>
<p align=center><H4><U> Was ist die Team Page ??? </u></h4></p>
<p align=left><h5> Die Team Page ist eine Internet Seite, die Informieren soll.
Klingt einfach - ist einfach!</h5></p>
<p align=center><h4><U> Ein Online Mag? </u></h4></p>
<p align=left><h5> Die team page ist KEIN Online Mag und wird auch nicht an bestimmten
Tagen geupdated. Wenn es etwas neues gibt, dann wird es sofort eingebunden!</h5></p>
<p align=center><U><h4> Und was ist da so besonderes dran? </h4></u></p>
<p align=left><h5> Das Besondere ist der Inhalt.. Die Team Page hat nicht nur Informationen
&uuml;ber EIN Computersystem, sie bem&uuml;ht sich vielmehr &uuml;ber ALLE Systeme das
neuste zu berichten. Ganz nebenbei werden nicht nur Computersysteme behandelt,
sondern es gibt Leserteile, Storys, Quotes, und und und...</h5></p>
<p align=center><h4><u> Wieso &uuml;berhaupt &quot; team page &quot; ??? </u></h4></p>
<p align=left><h5> Um eine vern&uuml;nftige Berichterstattung &uuml;ber mehrere Systeme
zu gew&auml;hrleisten ist es klar, da&szlig; wir dabei Hilfe benötigen - zumindest bei den
Systemen, die keiner von uns hat. :-) Also haben wir einfach ein paar Freunde und
Bekannte aus Chats angesprochen, die ihr pers&ouml;nliches Spezialgebiet in die Page
einbringen. </h5></p>
<p align=center><u><h4> Wieviele Leute arbeiten daran? </h4></u></p>
<p align=left><h5> Theoretisch jeder, der uns schreibt ... <br><br><br>
Fest an der Page besch&auml;ftigt sind 3 Leute: ein HTML-Ersteller
(&quot; Programmierer &quot; darf man ja nicht sagen), eine Grafikerin und ein
Layouter. Des weiteren haben wir 3 Leute, die uns mit Informationen &uuml;ber
 Computer versorgen und ncoh einige, die uns regelm&auml;&szlig;ig ihre Meinung
 sagen, was wir alles falsch machen :-)</h5></p>
<p align=center><u><h4> Kann man mitmachen? </h4></u></p>
<p align=left><h5> Ja. In dem Moment, wo ihr uns schreibt macht ihr schon mit.
Kritiken werden ebenso ernstgenommen, wie Themen- und Feature Vorschl&auml;ge.
Generell machen wir uns &uuml;ber Neuigkeiten Gedanken und binden sie
schlie&szlig;lich in die Page ein. Wenn die Rubrik gut geht - prima. Wenn nicht
 wird sie wieder entfernt. Auch Artikel nehmen wir gerne!</h5></p>
<p align=center><U><h4> Warum tut ihr das? </h4></u></p>
<p align=left><h5> Vielleicht wei es sonst keiner macht? Keine Ahnung - wissen
wir auch nicht :-) </h5></p>
<p align=center><u><h4> Kann man sich mit euch mal unterhalten? </h4></u></p>
<p align=left><h5> Auch hier ein &quot; ja &quot;. Allerdings nur &uuml;ber
Chat. Wir sind in <a href="http://www.chatcity.de"> www.chatcity.de </a> im
Channel &quot; PC-KAPUT &quot; erreichbar. Die Nicks sind die gleichen, wie
auf der Page. </h5></p>
<p align=center><u><h4> Ist die Page noch in einem anderen Format erhältlich? </h4></u></p>
<p align=left><h5> Nein. Aufgrund unserer Plattformunabh&auml;ngigkeit bleiben wir
bei HTML. Was wir allerdings machen können: f&uuml;r diejenigen, die noch kein
Netzzugang haben bieten wir an, euch die komplette Page per Post zu schicken.
 Fragt halt mal danach...</h5></p>
<p align=center><u><h4> Euer Design ist Mist! </h4></u></p>
<p align=left><h5> Ist zwar keine Frage, bekommen wir aber auch dauernd zu
 h&ouml;ren... Kein Wunder - wir versuchen &uuml;berfl&uuml;ssigen Schnickschnack
 zu vermeiden. Auch Netscape oder Explorer-interne Befehle neh,men wir nicht!
 Wir wollen, da&szlig; die Page mit möglichst vielen Browsern optimal zu lesen ist.
 Sei es nun Netscape, Explorer, iBrowse, AWeb, Lynx, Capcalla, und wie sie alle
 hei&szlig;en. Abgesehen davon ist uns Bandbreite und Geschwindigkeit eben lieber
 als coole Filme! Und last but not least haben wir gerade Design - m&auml;&szlig;ig
 ziemlich zugelegt :-) </h5></p>
<p align=center><u><h4> Wie w&auml;rs mit mehr downloadbarer Software? </h4></u></p>
<p align=left><h5> Wie w&auml;rs, wenn man uns Web-Space schenkt??? :-) Nein,
ernsthaft: wir arbeiten an einem FTP-Verzeichnis, aber das dauert wohl noch
ein paar Tage.... </h5></p>
<p align=center><U><h4> Mach ihr einen Link auf meine Seite? </h4></u></p>
<p align=left><h5> Wenn sie gut ist ja.</h5></p>
<p align=center><u><h4> Kinkt ihr meine obercoole Warez Site? </h4></u></p>
<p align=left><h5> Definitiv nicht !!!! </h5></p>
<p align=center><u><h4> Wieso schmei&szlig;t ihr nicht Crackerz und Hackerz
Infos auf eure Site? </h4></u></p>
<p align=left><h5> Weil sich jeder VNC und WinNuke aus dem Netz ziehen kann.
 Eigentlich wollen wir eine Page mit ein klein wenig Anspruch erstellen! Was
 vern&uuml;nftige Hacker Infos betrifft: Die kommen, sobald wir uns intern auf
 eine Definition von Hacker geeinigt haben! </h5></p>
<p align=center><u><h4> Das wars! </h4></u></p>
<p align=left><h5> Kommt auch in fast jeder Mail vor! Ich stimme zu: das wars!
<br><br><br>
Hoffentlich hat euch das ein wenig Klarheit verschafft!<br><br>
Bie!</h5></p>
<br><br><br>
<p align=center><b><h3> Delax </h3></b></p>

</body>
</html>

