<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 4.1.1999   -->
<HTML>
<HEAD>
<TITLE>
Eternity online: Eternity und der Amiga
</TITLE>
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#EEEEEE" LINK="#FF4444" VLINK="#7A8BBD" BACKGROUND="../images/back.gif">
<CENTER>
<TABLE WIDTH="95%" CELLSPACING=10 CELLPADDING=10>
<TR>
<TD>
<P>
Sehr geehrter Kunde,<P>
die Zeiten f&uuml;r Amiga sind hart. Heutzutage gibt es im schnellebigen und preisg&uuml;nstigen PC-Markt kaum noch
Argumente f&uuml;r einen Amiga, denn der Zahn der Zeit hat an fast allen Komponenten des Amiga seine Spuren
hinterlassen.<BR><P>
<IMG WIDTH=151 HEIGHT=121 SRC="../images/pict_a4000.gif" ALIGN=LEFT> Rein &auml;u&szlig;erlich steht ein Amiga nach PC-Regeln sehr schwach da. Taktfrequenzen zwischen 14-50 Mhz,
Prozessoren auf 386er, 486er oder Pentium-Basis, AGA-Grafik, die schon bei VGA-Aufl&ouml;sung sehr schnell langsam
wird und ein Soundchip mit gerade Mal 8 Bit sind Fakten, die nicht unbedingt f&uuml;r diesen Rechner sprechen.<BR><P>
Und doch gibt es Sie immer noch. Nicht unterzukriegende Amiga-User, die Ihr System lieben und es um nichts
auf der Welt missen m&ouml;chten. Freaks, die f&uuml;r Demos das letzte aus dem Rechner rausholen. User, die st&auml;ndig
mit kleinen Tools Ihre Arbeitsoberfl&auml;che effektiver und sch&ouml;ner machen. PD & Shareware-Programmierer, die
immer wieder selbst effektivste PC-Software in den Schatten stellen und nicht zu vergessen Amiga-H&auml;ndler,
die immer wieder scheinbar unm&ouml;gliches aus dem Rechnern mit neuen Hardwareerweiterungen rausholen.<BR><P>
<IMG WIDTH=110 HEIGHT=116 SRC="../images/pict_a1200.gif" ALIGN=RIGHT> Amiga-User haben heutzutage einen Kultstatus unter den Computer-Benutzern. Sie sind die Rebellen der Computer-Scene.
Sie sind der aktuelle Beweis, das man auch mit weitaus schw&auml;cherer Hardware durchaus zurande kommt und
nicht unbedingt alle zwei Jahre einen neuen Rechner kaufen mu&szlig;, um die Dinge zu realisieren die man im
t&auml;glichen Hausgebrauch oder auch im B&uuml;ro ben&ouml;tigt.<BR><P>

Und besteht &uuml;berhaupt der Grund, Tr&uuml;bsal zu blasen ? Wir denken: Nein! Ein Amiga kann auch heutzutage noch mit
<A HREF="lists/grafikkarte.html">Grafikkarten</A> (1280*1024/24Bit), <A
HREF="lists/soundkarte.html">Soundkarten </A>(16Bit/Full Duplex), <A
HREF="lists/turbokarte.html">Turbokarten </A>(PPC 225 Mhz/DualProzessor-System)
und sonstigen aktuellen Erweiterungen aufwarten. Amiganer, die diese Hardware vorweisen k&ouml;nnen, sind durchaus
in der Lage den PC in die Schranken zu verweisen. Vielleicht nicht &uuml;berall, aber zumindest in vielen Punkten.<BR><P>
Unser Vorstellung ist es nun Ihnen das Leben mit dem Computer Ihrer Wahl, dem Amiga,
so angenehm wie m&ouml;glich zu machen.<BR><P>
<A HREF="projects.html">
<IMG WIDTH=190 HEIGHT=123 SRC="../images/tales2.gif" ALIGN=LEFT BORDER=0>
</A>
Auf den folgenden Seiten werden Sie Hard und Software zu hoffentlich aktuellen Preisen finden. Sie werden
bemerken, da&szlig; gerade Standard-PC-Artikel vielleicht etwas teurer als bei Ihrem PC-H&auml;ndler um die Ecke sind.<BR><P>

Daf&uuml;r sind unsere Produkte aber von uns pers&ouml;nlich am Amiga getestet.<BR>
<P>
Und vielleicht schauen Sie auch einfach mal auf der <A HREF="projects.html">Tales
of Tamar</A> homepage vorbei.
<BR>
 Lassen Sie sich &uuml;berraschen !
<BR CLEAR="ALL">
<P>
Mit freundlichen Gr&uuml;ssen,<BR><P>



Wolf<BR>
Fa. Eternity<BR><P>
<P>
<CENTER>
Sollte Sie Fragen haben, so schicken Sie ihre mail bitte an <A
HREF="mailto:Eternity@pride.de">Eternity@pride.de</A>
</TD>
</TABLE>
<BR CLEAR="ALL">
<P>
<FONT SIZE=-1>
| <A HREF="../cgi-bin/html_web_store.cgi">Online-shop</A> |
<A HREF="offer.html">Monatsangebot</A> |
<A HREF="about.html">&Uuml;ber uns</A> |
<A HREF="news.html">Neuigkeiten</A> |
<A HREF="links.html"> Links</A> |
<A HREF="projects.html"> Projekte</A> |
<A HREF="contact.html"> Kontakt</A> |
<A HREF="settings.html"> Einstellungen </A>|
<A HREF="orderformn.html"> Bestellformular </A>|
<A HREF="../cgi-bin/mguest.cgi"> G&auml;stebuch </A>|
</P>
<FONT>
</BODY>
 </HTML>
