<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 9.Oct.1997   -->
<HTML>
<HEAD>
<TITLE>
Eternity online: Kommentar von Martin Wolf
</TITLE>
</HEAD>
<BODY BGCOLOR="#000000" TEXT="#EEEEEE" LINK="#FF4444" VLINK="#7A8BBD" BACKGROUND="../images/back.gif">
<BR CLEAR="ALL">
<CENTER>
<TABLE WIDTH="90%" CELLSPACING=0 CELLPADDING=0>
<TD ALIGN=LEFT>
<CENTER>
<H1>Kommentar von Martin Wolf zur Politik von Amiga International und Jeff Schindler</H1>
</CENTER>
<P>
Zur Politik von Amiga Inc kann ich nur eines sagen :<P>
<B>Treten Sie zur&uuml;ck, Herr Schindler! </B>
<P>
Es sind mal wieder eineinhalb Jahre vergangen ohne das sich etwas
Nennenswertes tat. Wenn eine Firma wie Amiga Inc. in einer solchen
Zeitspanne keine Erfolge vorweisen kann, sollte der Manager gehen !
<P>
Pers&ouml;nlich kann ich es in keinster Weise tolerieren mit welcher
Ignoranz Herr Schindler und Konsorten gegen&uuml;ber bestehenden
Amiga-Entwicklern und H&auml;ndlern aufgetreten sind. Wenn wir uns
die letzten eineinhalb Jahre noch einmal vor Augen f&uuml;hren, sehen wir
nichts anderes als Mismanagment und Unprofessionalit&auml;t.
<P>
Angefangen hat das ganze mit der Computer 97. Sicherlich noch
die beste Pr&auml;sentation von Amiga. Wir haben neue Projekte
wie den A5000 & A6000 gesehen, haben den Boxer bewundern k&ouml;nnen,
die Blizzard PPC stand vor der T&uuml;r und Software-Entwickler holten
aus zum gro&szlig;en Relaunch des Amiga im Spiele-Sektor.
<P>
Fast alle diese Projekte, sind im Laufe dieses Jahres aus dem einen
oder anderen Grunde gescheitert. Lediglich Phase 5 hatte genug Power
den eigenen Weg wenigstens zum Teil bestreiten zu k&ouml;nnen.
Das Traurige an der Sache
ist aber, das zum Scheitern dieser Projekte entweder Amiga International
oder Amiga Inc. erheblich beigetragen hat !
<P>
Ich meine was sollte z.B. diese absolut unprofessionelle Ank&uuml;ndigung
auf der World of Amiga ? Und was sollten die st&auml;ndig wechselnden &Auml;u&szlig;erungen
bez&uuml;glich der Zukunft des PPC im Classic Amiga ? Der Amiga-User wurde dadurch
doch nur verunsichert. Der potentielle PPC-Kunde will seine Investition
gesichert wissen,zumal er f&uuml;r diese Karten einen stolzen Preis bezahlt.
Ich meine zwei Jahre sind im Computersektor eine lange Zeit und solange ist
und bleibt der PPC-Prozessor f&uuml;r uns das Ma&szlig; aller Dinge. Punkt.
<P>
Sollte sich Phase 5 in Zukunft eher auf anderen M&auml;rkten umsehen, so liegt
dies zum gro&szlig;en Teil an Amiga Inc. und dieser Ank&uuml;ndigung.
<P>
Und wo ist jetzt &uuml;berhaupt das sogenannte Entwicklungs-System ? War es OS4,
nein OS5.Dev, und wie war das noch ? Das neue OS ist nicht kompatibel zu
OS3.1, oder doch ?
<P>
<B>Das alles sind doch Unklarheiten, die durch Amiga Inc. erst entstanden sind ! </B>
<P>
Ich wei&szlig; nur eines. Um z.B. Erfolg mit einem neuen OS haben zu k&ouml;nnen, mu&szlig;
man sehr viel mehr vorweisen als Amiga Inc. dies zur Zeit kann. Am Wettbewerb
mit Windows-Systemen  sind schon Firmen wie IBM ( OS2 ) oder Be  ( BeOS )
gescheitert, wobei deren finanziellen Ressourcen mit Sicherheit wesentlich
gr&ouml;&szlig;er sind.
<P>
Und wenn es &uuml;berhaupt ein Budget seitens Gateway gibt, dann wissen wir
auch wo dieses Geld zur Zeit hinflie&szlig;t. In die Taschen der sogenannten
Amiga-Entwickler. Produktives ist dabei noch nicht entstanden.
Wie lange schaut sich das Gateway noch an ?
<P>
Dabei ist es doch relativ simpel. Der Amiga und dessen User verf&uuml;gen &uuml;ber
zwei un&uuml;bertroffene Eigenschaften. Ein gro&szlig;er PD-Markt (Aminet) mit
vielen kleinen kreativen Entwicklern und einige Hardwareschmieden mit
Erfindungsreichtum. Wo bitte ist z.B. das Problem solche Firmen finanziell
zu unterst&uuml;tzen um Erstauflagen f&uuml;r Hardware in h&ouml;herer St&uuml;ckzahl zu
erm&ouml;glichen und somit die Verkaufspreise zu senken ? Kleinere Hersteller
w&uuml;rde dies das Leben erheblich vereinfachen.
<P>
Letztendlich ist auch Amiga-OS 3.5, das nun ja doch kommen soll, nichts anderes
als das langersehnte Zusammenwirken von Entwicklern und Amiga Inc..
Aber warum hat man f&uuml;r diese einfache Entscheidung solange gebraucht ?
F&uuml;r diesen Entschlu&szlig; brauchen also 5-10 K&ouml;pfe ein ganzes Jahr ?
<P>
Und ist diese Ank&uuml;ndigung nicht heimlich eine Entschuldigung f&uuml;r ein
nichtexistierendes OS5.DEV ? Man kann mich auf der Computer 98 eines
besseren belehren, aber ich behaupte man wird nichts davon zu sehen
bekommen. Nicht umsonst gibt es f&uuml;r Entwickler bis jetzt keine wesentlichen
Informationen bez&uuml;glich OS5.
<P>
Fazit : La&szlig;t da lieber den Petro wieder ans Ruder. Der wei&szlig;
wenigstens wie sich Amiga zu pr&auml;sentieren hat und wo selbst aus einem
A1200 heute noch Geld rauszuholen ist. Noch besser w&auml;re allerdings
ein Steve Jobs (Apple) des Amiga.
<P>
Desweiteren sollten sich manche Jungs von Amiga Inc. mal einen ordentlichen
Schneider zulegen. Wer glaubt schon an die hochgesteckten Ziele einer solchen
Firma wenn die Vertreter der Firma in Turnschuhen rumrennen, die kleine rote
B&auml;lle tragen.
<P>
Ist ja wirklich witzig gemeint, mag auch sicher einigen Mitmenschen gefallen.
In erster Linie ist Amiga aber ein Homecomputer und sollte durch gute Hard- und
Software gl&auml;nzen und nicht durch Modeartikel, Hupfdolls oder sonstigen
Schnickschnack.
<P>
Kritik bitte an <A HREF="mailto:eternity@pride.de?Subject=[AmigaINC Kommentar]">eternity@pride.de</A>
<P>
Wolf<P>
Eternity
<CENTER>
</TD>
</TABLE>
<BR CLEAR="ALL">
<FONT SIZE=-1>
| <A HREF="../cgi-bin/html_web_store.cgi">Online-shop</A> |
<A HREF="offer.html">Monatsangebot</A> |
<A HREF="about.html">&Uuml;ber uns</A> |
<A HREF="news.html">Neuigkeiten</A> |
<A HREF="links.html"> Links</A> |
<A HREF="projects.html"> Projekte</A> |
<A HREF="contact.html"> Kontakt</A> |
<A HREF="settings.html"> Einstellungen </A>|
<A HREF="orderformn.html"> Bestellformular </A>|
<A HREF="../cgi-bin/mguest.cgi"> G&auml;stebuch </A>|
</P>
<FONT>
</BODY>
 </HTML>

