<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://batman.jypoly.fi/~saku/">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><a name="top"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/thoriel.jpg" alt="Anu" height="193" width="187" border="1"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jos ei viime Sakun j&auml;lkeen ole Amiga-maailmassa tapahtunutkaan mit&auml;&auml;n isompaa - tavanomaisen hypetyksen, julkaisuajankohtien siirtyilyn ja ep&auml;m&auml;&auml;r&auml;isten huhujen lis&auml;ksi - niin ainakin yhdistyksemme porskuttaa tasaisen varmasti eteenp&auml;in. Kun kev&auml;&auml;ll&auml; saimme pankkitiliasiat viimein ojennukseen, nyt on vuorossa iso askel kirjanpidossa. Yhdistyksen s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;isess&auml; vuosikokouksessa on vihdoin tarkoitus vahvistaa viiden ensimm&auml;isen tilikauden tilinp&auml;&auml;t&ouml;kset ja my&ouml;nt&auml;&auml; kyseisten kausien hallituksille vastuuvapaus.<br>
							<br>
							Parempi my&ouml;h&auml;&auml;n kuin ei silloinkaan? Ehdottomasti! T&auml;m&auml; jos mik&auml; osoittaa haluamme jatkaa toimintaamme vastuullisena ja j&auml;seni&auml;&auml;n arvostavana yhdistyksen&auml;. Mit&auml; paremmassa kunnossa yhdistyksen asiat ovat, sit&auml; helpompi meid&auml;n on jatkossa keskitt&auml;&auml; voimavaramme siihen yhdistystoimintaan, joka j&auml;senillemme ja meille itsellemmekin eniten merkitsee:&nbsp;rakkaaseen Saku-lehteemme ja ennen kaikkea k&auml;ytt&auml;j&auml;tapaamisiin ja erilaisiin tapahtumiin.<br>
							<br>
							L&auml;hes v&auml;litt&ouml;m&auml;sti Saku 2001:n j&auml;lkeen aloimme saada kyselyj&auml; seuraavasta tapahtumasta:&nbsp;milloin j&auml;rjestet&auml;&auml;n, miss&auml;, ket&auml; sinne tulee jne. Kahden vuoden tauko oli selv&auml;sti j&auml;tt&auml;nyt suomalaisiin amigisteihin janon, jota ei yhdell&auml; tapahtumalla sammuteta - varsinkaan, kun tapahtumassa ei lopulta ollut aivan kaikkea sit&auml;, mit&auml; teille ja meillekin etuk&auml;teen luvattiin. Olemme koko kuluvan vuoden ajan vastailleet k&auml;rsiv&auml;llisesti, ett&auml; Amiga-maailman tilanne n&auml;ytt&auml;&auml;, millaiseen toimintaan meid&auml;n kannattaa panostaa ja ett&auml; todenn&auml;k&ouml;isesti suuntaamme tarmomme pienempiin mutta laadukkaisiin tapaamisiin. Nyt se aika on viimein tullut.</font>
						<div align="center">
							<p><a href="../ajankohtaiset/vuosikokous.html" target="_top"><img src="../ajankohtaiset/kuvat/vuosikokous_banneri.jpg" alt="" height="178" width="500" border="1"></a></p>
						</div>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Vuosikokous p&auml;&auml;tyi toista kertaa per&auml;kk&auml;in Ouluun sen vuoksi, ett&auml; muita varteenotettavia vaihtoehtoja ei ollut tarjolla. Ideoita tuli jokusia, ja niit&auml; otetaankin aina vastaan, mutta niill&auml; ei viel&auml; saada tapahtumaa aikaiseksi:&nbsp;tarvitaan my&ouml;s paikallinen iskuryhm&auml;, joka saa j&auml;rjestelyt rullaamaan. Siksi j&auml;lleen Oulu, tuo Suomen amigistien kultala. J&auml;rjestelyporukalla on jo hommasta n&auml;ppituntumaa ja tilakin on tuttu, sama kokouspaikka kuin viime vuoden vuosikokouksessa.<br>
								<br>
								T&auml;ll&auml;kin kertaa olemme j&auml;rjestelyiss&auml; panostaneet enemm&auml;n laatuun kuin m&auml;&auml;r&auml;&auml;n. Thendic-France on alustavasti ilmoittanut l&auml;hett&auml;v&auml;ns&auml; kokoukseen Pegasos-tietokoneen esittelylaitteiston MorphOS-k&auml;ytt&ouml;j&auml;rjestelm&auml;ll&auml; varustettuna. Tarjoamme kokouksessa my&ouml;s Saku 2001:n j&auml;lkeen paljon pyydetyn Vaporwaren Internet-ohjelmien rekister&ouml;intipalvelun. Uskollinen Amiga-j&auml;lleenmyyj&auml;mme Gentle Eye saapuu j&auml;lleen paikalle. Luvassa on my&ouml;s IRC-yhteys sek&auml; kuvia ja ensimm&auml;isen kerran my&ouml;s &auml;&auml;nt&auml; suoraan verkkoon niille, jotka eiv&auml;t p&auml;&auml;se paikan p&auml;&auml;lle. Lis&auml;tietoja saat <a href="../ajankohtaiset/vuosikokous.html">Vuosikokous-artikkelista</a>, ja aina tapahtumap&auml;iv&auml;&auml;n asti kannattaa seurata yhdistyksen kotisivuja, joilla tiedotamme kokouksesta lis&auml;&auml; sit&auml; mukaa kuin uutta tietoa tulee.<br>
							</font><br>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Vuosikokouksessa tavataan!<br>
								<br>
								Anu Seilonen<br>
								
								Puheenjohtaja<br>
							</font></p>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font></td>
				</tr>
			</table>
		</center>
	</body>

</html>