<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Interna Infernale</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Interna Infernale</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<H3><U>Interna allgemein</U></H3>
<P>Die Beteiligung am Preisausschreiben war entt&auml;uschend gering (<A HREF="game.htm">s. dort</A>),
ebenso, obwohl schon ein einfacher Leserbrief gen&uuml;gt h&auml;tte. Hey, motiviert
uns ein bi&szlig;chen und belohnt ein wenig unsere M&uuml;he, in dem ihr uns mal
eine eMail schickt, auch wenn es dieses Mal nichts zu gewinnen gibt!</P>
<HR WIDTH="50%">
<P>Wichtig! Zur <B>Mailingliste</B>: Einige der eMail-Adressen sind nicht mehr
korrekt, darunter auch die unserer Support-Box in Seeshaupt.</P>
<P>Sie sind nachfolgend aufgef&uuml;hrt:</P>

<UL>
<LI>MILAN@POWER.MCNET.DE             (Florian Praetsch)</LI>
<LI>a.schappert@cww.de               (Andreas Schappert)</LI>
<LI>robert@tomahawk.futurebyte.net   (Robert Sterff)</LI>
<LI>CLendzian@t-online.de            (Christian Lendzian)</LI>
</UL>

<P>Bitte meldet Euch, damit wir die Angaben &auml;ndern k&ouml;nnen!</P>

<P>Zu dieser Ausgabe gibt es ein paar Neuigkeiten - s.unten!</P>


<H3><U>Hinweise zu dieser Ausgabe #6</U></H3>
<B>Neues zu - HTML-Ausgabe:</B>
<P>Ab dieser Ausgabe gibt es auf der ersten Hauptseite (Ausgaben-Auswahl)
einen zus&auml;tzlichen Eintrag, unter dem die Gewinner der <B>AmZeiger-Awards</B>
aufgef&uuml;hrt sind, also die Produkte, die bei unseren Tests die Bestnoten
`1` und `2` erreicht haben.</P>
<HR WIDTH="50%">
<P>Au&szlig;erdem ist innerhalb der Link-Seite ein Verweis auf eine <A HREF="../splink.htm">Extraseite</A>,
auf der sich eine chronologische Auflistung der in der Spiderman-Rubrik
vorgestellten interessanten Webadressen befindet.</P><P>
Das erleichtert das Browsen dort, ohne sich f&uuml;r eine bestimmte Adresse
erst durch die verschiedenen Ausgaben w&uuml;hlen zu m&uuml;ssen.</P>
<HR WIDTH="50%">

<H3>Neues allgemein:</H3>

<B>WICHTIG F&Uuml;R KREATIVE!</B>

<P>Ab dieser Ausgabe richten wir in der Coder's Corner-Rubrik eine
<A HREF="../cc/9809pb.htm">Projektb&ouml;rse</A> ein, in der Grafiker, Musiker, Programmierer oder
was auch immer, von Entwicklerteams/Firmen gesucht werden k&ouml;nnen
oder selbst welche suchen k&ouml;nnen.</P><P>
Durch die Publizierung und den direkten Kontakt zwischen den
Interessenten entf&auml;llt jede etwaige Verz&ouml;gerung durch unsere
Erscheinungsweise.</P><P>
Schreibt uns, wenn Ihr Interesse habt und dort etwas Hineinsetzen
wollt (und wie lange es erscheinen soll bzw. auch wenn die Anzeige
gegenstandslos geworden sein solle)!</P>


<H3><U>Hinweise zur letzten Ausgabe #5</U></H3>
<B>Korrektur zu - MUI++:</B>

<P>Der Autor des Artikels, Stephan Manske, machte uns darauf aufmerksam,
da&szlig; es nachfolgend an markierter Position...</P>
<P>&quot;Um zu zeigen, da&szlig; auch fern ab von jeder graphischen
Darstellung die MUI-Klassen voll funktionsf&auml;hig in C++ sind,
<U>habe ich</U> diese Funktion geschrieben. Sie stellt den Inhalt...&quot;</P>
<P>...statt &quot;habe ich&quot; eigentlich &quot;wurde&quot; hei&szlig;en mu&szlig;.</P>

<H3><U>Hinweise zur n&auml;chsten Ausgabe #7</U></H3>

<P>Voraussichtlich wird es in der n&auml;chsten Ausgabe u.a. Tests von 17-Zoll-
Monitoren, von dem Paloma-Modul (f&uuml;r die Picasso-Grafikkarte), von dem
Spiel `Wasted Dreams`, GoldEd 5.0 und einen Artikel zum Thema Gesundheit
am Computer geben, sowie nat&uuml;rlich die Fortsetzung des Installer und
Blitz-Basic-Kurses geben.</P>

<P>Sie wird aller Voraussicht nach Neujahr erscheinen.</P>
<P>Mit W&uuml;nschen, Hinweisen oder sogar eigenen Artikeln, einfach <A HREF="../kontakt.htm">hier</A> melden!</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="game.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


