<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Interview: Marcel Beck</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Interview</U></H1><P ALIGN="CENTER">mit<BR>Marcel Beck</P>

<P>
Marcel Beck, Programmierer von <A HREF="http://www.yam.ch">YAM</A>, des mit Abstand anerkanntesten
und beliebtesten eMail-Programms f&uuml;r den Amiga beantwortete mir
einige Fragen.</P>

<P>
AmZ: Gregor Franz<BR>
MB : Marcel Beck
</P>

<HR WIDTH="50%">
<P>
<TABLE BORDER="1">
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD> Gerade YAM hat Dich in der Amiga-Gemeinde bekannt gemacht. Wie
     sieht eigentlich Deine Computer-Historie aus?  Auf welchen
     Systemen hast Du begonnen, welche sonstigen nennenswerten
     Programme entwickelt?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD><P>Begonnen habe ich 1982, im zarten Alter von 13 Jahren, auf dem
     Sinclair ZX-81 meines Vaters. Heute ist es schwer vorstellbar,
     was man mit 16 MB RAM alles anstellen kann...</P><P>
     Der erste eigene Computer war ein Sinclair Spectrum, auf dem ich
     alle m&ouml;glichen Dinge in Basic und Z80-Assembler programmierte.
     1987 musste ich mich entscheiden, ob ich Sinclair treu bleiben
     will und mir einen QL kaufe, oder ob ich das Lager wechsle und
     auf einen Amiga 500 umsteigen will. Beide Computer hatten eine
     68000er CPU. Gl&uuml;cklicherweise entschied ich mich f&uuml;r die zweite
     Option. Der 500er wurde dann noch mit einer 20MB Platte und einer
     2MB Speichererweiterung ausgestattet.</P><P>
     Als alter Basic-Profi entwickelte ich meine ersten Progr&auml;mmchen
     in AmigaBasic (Vokabeltrainer, Datenbank, einfachere Spiele und
     dergleichen). Da die Geschwindigkeit jedoch zu w&uuml;nschen &uuml;brig
     liess, erlernte ich die Programmiersprache C.</P><P>
     Die n&auml;chste grosse Anschaffung war ein Amiga 2500 (was eigentlich
     bloss ein mit einer Festplatte und einer Commodore 68020-Turbokarte
     ausgestatteter A2000 war). Das gr&ouml;sste Projekt, welches ich in
     dieser Zeit programmierte, war das Sharewareprogramm 'Statistica',
     welches zur statistischen und grafischen Auswertung von Messdaten
     diente und f&uuml;r einige Zeit sogar in Maxons Lowcost-Software-Serie
     verkauft wurde. Andere, sehr spezifische Programme habe ich f&uuml;r
     Kollegen und Verwandte geschrieben, aber nie ver&ouml;ffentlicht.</P><P>
     Seit 2-3 Jahren bin ich nun Besitzer eines Amiga4000T/040, der zur
     Zeit wie folgt konfiguriert ist:</P><p>
     18 MB Ram, 1 GB Festplatte (SCSI), 4fach CD-ROM von Sony (SCSI)
     Picasso II, VLab Digitizer, Multiface Card 3, Scandoubler, Claxan
     15S Monitor, ZIP Drive (SCSI), Commodore A10 Aktivboxen, OS/WB 3.1,
     Picasso 96, MagicWB</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>YAM ist relativ unangefochten das f&uuml;hrende Internet-Mailprogramm
     auf dem Amiga. Wie erkl&auml;rst Du Dir diesen Erfolg, der in dieser
     Form, wenn man sich die Situation auf anderen Systemen ansieht,
     ziemlich einmalig ist?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD><P>Der anf&auml;ngliche Erfolg (der mich &uuml;brigens ziemlich &uuml;berrumpelt hat)
     war wohl mit der einfachen Konfigurierung und Bedienung zu erkl&auml;ren.</P><P>
     Vor drei Jahren war die Installation von Internetanwendungen auf
     dem Amiga f&uuml;r weniger erfahrene Benutzer eine Qual (da gab es noch
     kein Miami, und die Mailer waren portierte UNIX-Programme). Das YAM
     heute noch so erfolgreich ist, liegt vermutlich am Freeware-Status.
     Die meisten vergleichbaren Produkte sind eingeschr&auml;nkte Shareware.
     Auch habe ich stets versucht, Anfragen von Benutzern m&ouml;glichst
     schnell zu beantworten und bin auf viele Vorschl&auml;ge eingegangen.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Die gegenw&auml;rtige Beta macht schon einen guten Eindruck (s. auch Test
     in Ausgabe #5). Wann ist mit der endg&uuml;ltigen 2.0 zu rechnen und sind
     bis dahin noch gr&ouml;&szlig;ere &Auml;nderungen zu erwarten?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD>Im Gegensatz zu anderen Programmierern lasse ich nicht gerne Alpha-
     Versionen auf die grosse Benutzerschar los. Nicht jeder ist ein
     langj&auml;hriger Amigaprofi, der weiss, wie man auftretende Probleme
     behebt. Das heisst, das ich jetzt vor allem noch die bekannten Bugs
     ausmerzen will (sind so um die 50 St&uuml;ck, wobei sich nicht alle auf
     meinem System reproduzieren lassen). Wie lange das dauern wird, kann
     ich nicht sagen (h&auml;ngt u.a. davon ab, wieviel Stunden meiner knappen
     Freizeit ich in die Programmierung stecken will).
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Was sind Deine Planungen f&uuml;r die Zukunft? Wird YAM kontinuierlich
     weiterentwickelt und/oder fa&szlig;t Du andere Projekte ins Auge?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD>Die Liste der Vorschl&auml;ge f&uuml;r YAM 3 hat bereits eine beachtliche
     L&auml;nge erreicht, d.h. es wird wohl weiter gehen. Andere Projekte
     leiden deshalb darunter. Was ich gerne programmieren w&uuml;rde, ist
     eine Toolsammlung f&uuml;r WWW-Surfer und Webmaster (externer Linkchecker,
     URL Reminder, Offline-Browser etc.). Selbstverst&auml;ndlich gibt es
     solche Programme bereits als einfache ARexx-Skripts, ich m&ouml;chte das
     ganze jedoch in eine benutzerfreundliche MUI-Umgebung einbetten.

     <P>Ein anderes Projekt in der Warteschlange ist AmigaETV, ein Programm,
     welches den Zugriff auf das elektronische Telefonbuch der Schweiz
     erm&ouml;glicht.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wann hast Du Dich bei YAM f&uuml;r die Verbreitungsform als Freeware
     entschieden? Bist Du gegen das Shareware-Konzept, willst Du den
     Usern etwas Gutes tun? :)
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD><P>Freeware ist bequem: man muss keine Disketten versenden, hat keine
     Verpflichtungen seinen Usern gegen&uuml;ber und man macht sich beliebt ;-)
     Der Nachteil ist, dass man kein Geld daf&uuml;r erh&auml;lt, aber da ich die
     &quot;Armer Student&quot;-Phase hinter mir habe und Programmieren eigentlich
     ein Hobby ist, verlange ich kein Geld f&uuml;r YAM.</P><P>
     Das Shareware-Konzept finde ich gut, weil der Benutzer damit nicht
     die Katze im Sack kauft. Das Statistica-Programm habe ich damals
     (1991) auch als Shareware vertrieben, es sind etwa 30 mal 20 Mark
     zusammengekommen.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Es ist zwar bereits etwas Zeit ins Land gegangen seit der WOA
     in London. Trotzdem, was h&auml;ltst Du von den &Auml;u&szlig;erungen bzw.
     Bekanntmachungen der Amiga Inc.? Gibst Du ihren Pl&auml;nen bzw.
     dem Amga an sich f&uuml;r die Zukunft eine Chance?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD> Eigentlich interessiert es mich jetzt noch nicht, was Ende 1999
     sein wird. Bis dahin sind es noch 16 Monate, und in dieser Zeit
     kann sich sehr viel ereignen. Die Ank&uuml;ndigung von AI ist mir zu
     vage und erscheint im Vergleich mit dem A1000 von damals nicht sehr
     innovativ. Umso erfreulicher ist es, dass gerade in Deutschland die
     Hardware-Fabrikanten zusammenspannen und L&ouml;sungen anbieten, die
     *jetzt* verf&uuml;gbar sind.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Besitzt Du ein PPC-Board oder wirst Du Dir eines anschaffen? Denkst
     Du, da&szlig; Phase 5 zusammen mit Haage & Partner eine Alternative bieten
     k&ouml;nnen, die es zu unterst&uuml;tzen lohnt?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD>Ja, siehe oben. Die Anschaffung eines PPC-Board habe ich mir noch
     f&uuml;r dieses Jahr vorgenommen.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Was denkst Du eigentlich &uuml;ber andere 'direktere' Kommunikationsformen
     im Internet, wie IRC und ICQ? Kommen sie f&uuml;r Dich in Frage?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD>IRC und ICQ haben sicher ihre Daseinsberechtigung, wobei ich Email
     f&uuml;r das effizientere Kommunikationsmedium halte als z.B. IRC. F&uuml;r
     Leute, die sich einfach die Zeit mit rumquatschen vertreiben wollen,
     ist es sicher toll. IRC benutze ich nicht; ICQ habe ich installiert,
     lasse es aber nicht st&auml;ndig laufen.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD> Gibt es ein Leben neben dem Computer? ;) Was machst Du 'beruflich'?
     Was f&uuml;r weitere Hobbys und Leidenschaften fordern Dich?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD><P>Ich arbeite als Chemiker im Bereich Umweltanalytik. Meine
     Computererfahrung kann ich auch dort einfliessen lassen, d.h. ich
     bin unter anderem f&uuml;r unsere Labordatenbank verantwortlich.</P><P>
     Sportlich bet&auml;tige ich mich v.a. als Velofahrer: so fahre ich mit
     Bike zur Arbeit, unternehme gerne Fahrradtouren und mach einmal im
     Jahr Veloferien.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Und in welcher Gegend radelst Du umher? Meint, wo wohnst Du? :)
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD>Aufgewachsen bin ich am Thuner See (Berner Oberland). Heute wohne
     ich in F&uuml;llinsdorf, das liegt zirka 10 km s&uuml;d&ouml;stlich von Basel.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Die unvermeidliche Frage zum Schlu&szlig;: Kanntest Du den AmZeiger,
     bevor ich mich das erste Mal bei Dir gemeldet habe und was h&auml;ltst
     Du von ihm?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>MB:</TH>
    <TD>Den Amzeiger kannte ich bisher nicht (ich lese fast nie Online-
     Magazine). Hier meine Eindruck: Ich finde ihn gelungen; das
     schn&ouml;rkellose Design, das ein schnelles Laden und angenehmes Lesen
     erm&ouml;glicht, f&auml;llt als erstes positiv auf. Die Themen sind bunt
     gemischt, so dass f&uuml;r jeden etwas dabei sein sollte. Vorbildlich
     ist auch das Artikelverzeichnis und dass die Ausgaben als Archiv
     zum Download angeboten werden.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Was soll man da noch sagen? ;) Danke f&uuml;r das Interview.</TD>
</TR>
</TABLE>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9809fax.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
