<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - AmPuls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> <A HREF="#Hardware">Hardware</A> <A HREF="#Spiele">Spiele</A></P>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>

<P>Dieses Jahr findet die <A HREF="http://www.computer98.de">Computer 98</A>-Messe vom 13. von 15. November
zwischen 10 bis 18 Uhr wie immer in K&ouml;ln statt. Messemotto ist
&quot;Marktplatz Multimedia&quot;. Der ICP-Verlag (Amiga Plus) geh&ouml;rt &uuml;brigens
nicht mehr zu den Veranstaltern.</P>
<HR WIDTH="50%">
<P>Die bekannte englische Amiga-Zeitschrift <B>CU Amiga</B> wurde eingestellt.</P>
<HR WIDTH="50%">
<P>Die <B>AUGS</B>, die Amiga User Group Switzerland, hat eine neue Internet-
Adresse: <A HREF="http://www.augs.ch">http://www.augs.ch</A>. Die neue eMail-Adresse lautet:
webmaster@augs.ch</P>
<HR WIDTH="50%">
<P>Die neue Programmiersprache <A HREF="http://www.rebol.com">REBOL</A> des Amiga-Exec-Entwicklers Carl Sassenrath
ist jetzt in der Version 1.0 für diverse Plattformen (inkl. Amiga) erschienen.</P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>

<P><B>Studio Professional 2.2</B> ist erschienen und bietet neben einigen
Verbesserungen Druckertreiber f&uuml;r die meisten g&auml;ngigen Drucker.
Der Preis f&uuml;r die Vollversion betr&auml;gt 69 DM, f&uuml;r das Update 15 DM.</P>
<P>Die <B>Aminet 26</B> enth&auml;lt als Bonusprogramm das 24-Bit-Grafikprogramm
<B>XiPaint 4.0</B> als Vollversion. Sie kostet 25 DM.</P>

<A HREF="http://www.schatztruhe.de">http://www.schatztruhe.de</A>

<HR WIDTH="50%">

<P><B>Diavolo Backup</B> soll auf der Computer 98 in einer neuen Version 5.0
erscheinen, die alle aktuellen Entwicklungen beachten soll. Es wird
eine Unterteilung in eine Pro- und eine Standardversion geben.</P>
<P><B>UltraConv</B>, die Grafik- und Animationsformat-Konvertiersoftware, ist
ab der Version 3.0 keine Shareware mehr, sondern wird f&uuml;r 89 DM bei
<A HREF="http://www.rbm.de">RBM</A> vertrieben. Es kann u.a. IFF-ANIM, FLI, AVI, MPEG, XFA, GIF-ANIM,
QT, AnimBrush sowie diverse Einzelbildformate wie PCX, ILBM, GIF, BMP,
JPEG und PNG konvertieren. Zahlreiche Effektm&ouml;glichkeiten, AREXX-Port
und Map-Editor runden die F&auml;higkeiten von UltraConv 3.0 ab.</P>
<HR WIDTH="50%">
<P>Der britische Distributor der <B>Emulatoren</B> Fusion und PCx, Blittersoft,
hat bekanntgegeben, da&szlig; der Hersteller <A HREF="http://microcode-solutions.com">Microcode Solutions</A> an den
PowerPC-Versionen arbeite, die als Upgrade-Module erscheinen sollen.</P>
<P>
Der Preis der aktuellen Versionen ist gesunken. Fusion 3.1 kostet
120 DM und PCx 1.1 98 DM. (Vertrieb in Deutschland &uuml;ber <A HREF="http://www.haage-partner.com">H&amp;P</A>.)</P>

<HR WIDTH="50%">

<P>Die gerade erschienene neue Textverarbeitung <A HREF="../sw/9809aw.htm">AmigaWriter</A> von
<A HREF="http://www.haage-partner.com">Haage &amp; Partner</A> konnte nicht als EasyWriter erscheinen, da es auf dem PC
schon ein Programm gleichen Namens gibt.</P>

<HR WIDTH="50%">

<P>Mit dem <B>StormC DSK</B> (Developer Survival Kit) bietet <A HREF="http://www.haage-partner.com">Haage &amp; Partner</A> nun
ein neues Komplettpaket an, das alle bekannten StormC-Komponenten und
die neuesten Entwicklungen f&uuml;r PowerPC und 3D ineinander vereint. Mit
dem neuen `Warp3D` wird ein hardwareunabh&auml;ngiges Treibersystem f&uuml;r
Amiga-3D-Karten und mit `PowerPC 68k` eine Betaversion eines 68k-CPU-
Emulators bereitgestellt. Neben einer angepa&szlig;ten Version der `Amiga
Developer CD` gibt es auch ein 300-seitiges englischsprachiges Handbuch.
</P><P>
Preise: 698 DM f&uuml;r die Commercial-Edition und 498 f&uuml;r die Private-
Edition, mit der keine kommerzielle Software erstellt werden darf,
von der man aber upgraden kann.</P>

<HR WIDTH="100%">
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>

<P><A HREF="http://www.villagetronic.com/">Villagetronic</A> hat eine Nachfolgerin der bekannten <B>Ariadne</B>-Netzwerkkarte
f&uuml;r den Zorro-II-Bus angek&uuml;ndigt. Sie soll neben 10MBit Geschwindigkeit,
TP/BNC-Anschl&uuml;ssen und FlashRom (booten &uuml;bers Netzwerk m&ouml;glich) unter
anderem mit einem g&uuml;nstigen Preis gl&auml;nzen.</P>
<HR WIDTH="50%">
<P><A HREF="http://www.micronik.de/">Micronik</A> hat mit dem <B>Infinitiv</B>-II einen Nachfolger zu dem bekannten
Towerumbausatz herausgebracht, der auf Metall basiert und ein ge&auml;ndertes
Design besitzt. Der alte Infinitiv I wird nun f&uuml;r 189 DM angeboten.</p>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>

<P><A HREF="http://www.marble-eyes.dk/">Marble Eyes</A>, das d&auml;nische Entwicklerteam, nimmt f&uuml;r sich in Anspruch, die
erste 24-Bit-Engine f&uuml;r ein Amiga-Spiel anzubieten. Es handelt sich um
ein 100 KB-Archiv f&uuml;r `<B>Genetic Species</B>`, das also dann &uuml;ber 16 Millionen
Farben anzeigen k&ouml;nnen soll und das bei lediglich geringf&uuml;gig schlechterer
Performance.</P><P>
Das AddOn ist von der Homepage downloadbar.</P>
<HR WIDTH="50%">
<P><A HREF="http://www.vulcan.co.uk/">Vulcan</A>-Neuigkeiten:</P>
<P>Das D.S.P. Entwicklungsteam, verantwortlich f&uuml;r das Amiga CDRom-Spiel
'<B>Almagica Scions of a Forgotten World</B>' hat die Entwicklung aufgegeben,
ebenso wie Black Flag, verantwortlich f&uuml;r das CD-Spiel `<B>Caveman Species</B>`
und Imij Software, die `<B>Hard Target</B>` programmieren wollten. Allesamt
aus wirtschaftlichen Gr&uuml;nden und wegen der schwindenden Amiga-Userzahl.</P>
<HR WIDTH="25%">
<P>`<B>Wasted Dreams</B>` soll dagegen kurz vor der Auslieferung stehen, eine
Demoversion ist verf&uuml;gbar.</P>
<HR WIDTH="25%">
<P>Aus Anla&szlig; des dreij&auml;hrigen Bestehens, bringt Vulcan Software zum Budget-
Preis eine auf 500 St&uuml;ck limitierte <B>Compilation-CD</B> heraus, auf der sich
zehn Titel der Amiga-MiniSerie befinden sollen.</P>
<HR WIDTH="50%"><P>
`<A HREF="http://eternity.amiga-software.com/deutsch/tot/index.html">Tales of Tamar</A>` ist ein neues Projekt des <B>Eternity</B>-Teams, das dieses
neue Fantasy-Strategiespiel erstmals auf der Computer 98 pr&auml;sentieren
will. Es soll Standards setzen und konsequent Netzwerkspielm&ouml;glichkeiten
nutzen. Eine identische PC-Version ist auch geplant.</P>
<HR WIDTH="50%"><P>
<A HREF="http://www.clickboom.com">ClickBOOM</A> hat auf seiner Webseite eine Demo des neuen C&C-Klones
<B>`Napalm`</B> ver&ouml;ffentlicht (ca. 6,5 MByte).</P>
<HR WIDTH="50%"><P>
Auch `<B>Operation Counterstrike</B>`, ein weiterer Command &amp; Conquer-Klone,
soll neben `Forgotten Forever` bei <A HREF="http://www.sadeness.demon.co.uk">Sadeness Software</B> erscheinen.</P>

<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="intern.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
