<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Der alte Postsack</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN=CENTER><U>Der alte Postsack</U></H1>

<PRE>
         <B>&gt;&gt; Absender : trippler@gmx.net (Stefan Trippler) &lt;&lt;</B>

ST&gt; Ein dickes Lob f&uuml;r den AmZeiger! Sowas &auml;hnliches wollen wir (eine
ST&gt; Gruppe Amiga-Fanatiker aus Berlin) vielleicht auch aufziehen...

Danke f&uuml;r das Lob. Vielleicht k&ouml;nnt Ihr ja lieber uns unterst&uuml;tzen,
als ein weiteres &quot;neues&quot; Zeitschriftenprojekt zu starten.

ST&gt; Sehr interessant fand ich beim ersten &Uuml;berblick den Zorro-Artikel,
ST&gt; da stand mal ein bi&szlig;chen was technisches drinn, nicht nur so
ST&gt; oberfl&auml;chliche Informationen wie in Zeitschriften (&quot;Ja, also es
ST&gt; gibt einen Zorro-2-Bus und einen Zorro-3-Bus. Der Zorro-3-Bus ist
ST&gt; schneller.&quot;)

Hallo Thomas? Hast Du das gelesen? :)

<HR>

<B>     &gt;&gt; Absender : GrafikArtStudio@t-online.de (J&uuml;rgen Rosch) &lt;&lt;</B>

JR&gt; Das Ihr Super seid braucht ja wohl keinen weiteren Kommentar - oder ?
JR&gt;

Tja, hm. Eigentlich nicht. ;)

JR&gt; Eure Artikel bereiten Euch sicherlich viel Arbeit (!) und sind gut
JR&gt; lesbar und vor allem verst&auml;ndlich erkl&auml;rt....
JR&gt;

Ja, stimmt. Der Aufwand und die Arbeit, die dahinterstecken, sind
sicher gr&ouml;&szlig;er, als gemeinhin angenommen wird. Und es geh&ouml;rt auch
einige Disziplin des Teams dazu, so etwas regelm&auml;&szlig;ig und
einigerma&szlig;en termingerecht in der Freizeit durchzuziehen.

JR&gt; W&uuml;nschen w&uuml;rde ich mir einen Einsteiger-Kurs im Programmieren....

Wenn Du jetzt nicht zuf&auml;llig BlitzBasic-Programmierer bist... ;)
(Da l&auml;uft ja gerade ein Kurs.) Eine Einf&uuml;hrung in bestimmte Aspekte
von C, MUI und einigem mehr (ab Ausgabe #2) helfen hoffentlich ein
wenig.

JR&gt; Biba - CU
JR&gt; J&uuml;rgen
JR&gt;
JR&gt; PS: Weiter so...

--
&amp;
--

JR&gt; Hi Ihr Lieben,
JR&gt;
JR&gt; Ich w&uuml;nschte, es g&auml;be einen Artikel &uuml;ber das LS120 mit IDE-Fix...
JR&gt; mit Daten und Fakten.

Das haben wir uns auch gew&uuml;mscht und Du hast uns den Wunsch dann
sogar erf&uuml;llt. Danke daf&uuml;r auch noch einmal an dieser Stelle.

JR&gt; Wann ist es denn soweit mit der neuen Ausgabe.. Ich kann es ja
JR&gt; kaum noch erwarten.

M&uuml;&szlig;te jetzt, wo man das hier lesen, gerade neu herausgekommen sein. ;)

JR&gt; Gru&szlig;
JR&gt; J&uuml;rgen

<HR>

               <B>&gt;&gt; S.Manske@gmx.de (Stephan Manske) &lt;&lt;</B>

SM&gt; Also, Ihr wollt meine Meinung?

Also, hm, naja... ;)

SM&gt; Der Mui++-Artikel war einsame Spitze ! ;-&gt;
SM&gt; (O.k. nicht schlagen &lt;wegduck&gt;)

Ich hab doch gewu&szlig;t, da&szlig; da gleich der Holzhammer kommt! :)
(F&uuml;r alle Unkundigen s. Ausgabe #5.)

SM&gt; Nein im Ernst, es ist immer wieder sch&ouml;n Eurer Magazin zu lesen,
SM&gt; und auch die non-computer-Teile wie Media mal X sind lesenswert.

Sch&ouml;n, da&szlig; dies auch beachtet wird. Wir wollen ja schlie&szlig;lich keine
reinen Fachi...nteressenten sein, oder? 8)

SM&gt; BTW, &quot;2000 AD-Ein Jahr lang April?&quot; war echt gut, auch wenn der
SM&gt; Artikel im Z-Netz zerrissen worden ist (h&auml;tten ihn halt mal lesen
SM&gt; sollen!).

Das haben wir erst durch Dich erfahren. Wir haben wohl keine
regelm&auml;&szlig;igen Netzleser in unseren Reihen.

Bemerkenswert fand ich, da&szlig; dort lediglich die Ank&uuml;ndigung der
aktuellen Ausgabe incl. des Artikels verrissen wurde. Wie der
ganze Disput offensichtlich werden lie&szlig;, haben die Beteiligten
den Artikel (wie Du schon richtig erkanntest) &uuml;berhaupt nicht
gelesen.

Zitat: &quot;Unterstes Doesenblatt-Niveau...&quot;

Das fand ich schon sehr interessant. Sagt viel &uuml;ber die Toleranz
und Fachkenntnis mancher Amiga-User aus, die mit ihren Scheuklappen
nicht einmal die Frage nach Problemen erlauben wollen. Aber das
gerade in diesen Diskussionsforen sich h&auml;ufig viele sogenannte
&quot;Schwarze Schafe&quot; produzieren, ist ja altbekannt.

Also sollen sie sich ruhig aufregen. Publicity kann ja nur gut sein.

SM&gt; Ach ja, ich bin der Stephan Manske und komme aus Berlin. :-)

Ach der bist Du. :)

SM&gt; MfG, Stephan

<HR>

                    <B>&gt;&gt; Janssen@fh-brandenburg.de &lt;&lt;</B>

HJ&gt; Guten Tag verehrte AmZeiger-Redakteure !!!

Guten Tag auch lieber Holger,

HJ&gt; Ich bin eben zufaellig ueber eure HP gestolpert und da ist mir
HJ&gt; doch gleich das Gewinnspiel aufgefallen...

Ja, ja. Diese seltsamen Zuf&auml;lle manchmal. ;)

HJ&gt; Da ich den Namen des ersten Amiga's schon wieder (zum 3.Mal)
HJ&gt; vergessen habe, kann ich den 1. Teil schonmal abhaken, oder?

Yep. Von wegen Preisausschreiben: Da m&uuml;&szlig;test Du aber erst einmal
Deinen Amiga &quot;entmotten&quot;. Oh, hab ich Dich jetzt geoutet? :)

HJ&gt; Ich finde die Seiten sonst recht gut gelungen, auch wenn es
HJ&gt; natuerlich aus bekannten Gruenden an Aktualitaet etwas mangelt.
HJ&gt; Besonders nett finde ich die &quot;Unser Dank an ...&quot;-Seite  :-)  Da
HJ&gt; gibt's naemlich einen, der genauso heisst, wie ich - hihi

Zufall?

HJ&gt; Achja - da Hintergrundbild sollte mal diskutiert werden: Ich sitze
HJ&gt; hier zwar vor einem 19&quot;-Monitor, aber die Grafikkarte kan max. 256
HJ&gt; Farben bei 1280x1024 darstellen, wodurch vom Hintergrundbild nicht
HJ&gt; viel erkennbar ist (nur 3 weisse &quot;Spritzer&quot; auf grauem Grund).
HJ&gt; Aber vielleicht ist eine laengere Diskussion zu dem Thema noetig -
HJ&gt; ich bin sogar fest davon ueberzeugt ;-)

Das ist eine indiskutable Grafikkarte! Klares Foul!

HJ&gt; ciao .. Holger
HJ&gt;
HJ&gt; PS: Der zweite Server ist viel schneller bei mir, als der erste !!!

Vielleicht, weil es ganz &quot;zuf&auml;llig&quot; (!) auf &quot;Deinem&quot; liegt? :))

<HR>

Dies also f&uuml;r dieses Mal.

In der Zwischenzeit (bis die n&auml;chste Ausgabe erscheint) kann ich Euch
nur mit einem <B>flammenden Appell</B> darum bitten, Euch doch aufzuraffen
und die zugegebenerma&szlig;en energieraubende T&auml;tigkeit eine kurze eMail
an uns abzusenden, auszu&uuml;ben! Motiviert uns ein bi&szlig;chen!

Euer<BR>
<A HREF="mailto:AmZeiger@gmx.de">Alter Postsack</A>
</PRE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="uhl.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="wanted.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


