<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - Fr. Gisela's Problemecke</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<TABLE BORDER=0 WIDTH="100%">
<TR>
<TD><H1>Frau Gisela`s Problemecke</H1></TD><TD ALIGN="RIGHT"><IMAGE SRC="../images/frg.gif"></TD>
</TR></TABLE>

<P><B>Dies ist eine Rubrik</B>, in der diverse Fragen gestellt oder Probleme
geschildert werden k&ouml;nnen. Da Frau Gisela in dieser Ausgabe (wie immer)
gerade bei einer bekannten deutschen Frauenzeitschrift unabk&ouml;mmlich ist,
werden gezwungenerma&szlig;en wir versuchen zu helfen bzw. den Sachverhalt
hier ver&ouml;ffentlichen, um jemanden zu finden, der dies kann.
</P><HR>
<B>Drei wichtige Anmerkungen:</B>
<UL>
<LI>Wir weisen noch einmal daraufhin (s. <A HREF="impres.htm">IMPRESSUM</A>), da&szlig; f&uuml;r die
Richtigkeit von Angaben, in diesem Fall f&uuml;r Tips, Hinweise, Scripte
o.&auml;., <B>keine Gew&auml;hr bzw. Haftung</B> f&uuml;r eventuelle Folgen &uuml;bernommen
werden kann.</LI>
<LI>Sollten jemandem Fehler, Bugs oder sonstige Ungereimtheiten auffallen,
oder er selbst praktische Tips oder Probleml&ouml;sungen kennen, so w&uuml;rden
wir uns &uuml;ber eine Nachricht sehr freuen.</LI>
<LI>Und wer Probleme hat, sollte sich nicht scheuen, Sie uns zu schildern,
weil ihm drei Monate Wartezeit zu lang sind. Die Redaktion versucht
selbstverst&auml;ndlich sofort zu helfen.</LI>
</UL>
<HR><P>
Dieses Mal stellt <B>Thomas Heinrich</B> ein neues Filesystem vor, so da&szlig; diese
Rubrik gef&uuml;llt ist, auch wenn keiner unserer Leser im Moment irgendwelche
Probleme mit seinem System hat. (Mu&szlig; ja wohl so sein.)</P>
<P><B>Schneller Dateizugriff? Aber sicher!</B></P><P>
Die Dateisysteme des Amiga sind in die Jahre gekommen und nicht sonderlich
sicher. St&uuml;rzt der Rechner beim Schreiben auf Diskette oder Festplatte ab,
sind erstens die geschriebenen Daten futsch, zweitens auch die Daten, die
vorher unter dieser Datei abgelegt waren und drittens, wenn eine gro&szlig;e
Partition betroffen ist, hat man einige Minuten Wartezeit in Kauf zu
nehmen, bis die Partition wieder validiert ist.
</P><P>
Seit kurzem gibt es neben den kommerziellen Filesystemen das
<B>SmartFileSystem</B> (im Aminet unter disk/misc/sfs_beta.lha) in der Version
0.85. Wie man sehen kann, ist es noch eine Betaversion, sie ist aber
schon recht stabil.</P><P>
<B>VORSICHT</B>: Ein neues Dateisystem zu installieren ist nicht einfach ! Wer
die Anleitung nicht -vorher- und -genau- durchliest, braucht sich nicht
zu wundern, wenn nachher alle Daten hin sind.
</P><P>
Es lohnt sich aber, den Aufwand zu betreiben. Das SFS (SmartFileSystem)
erlaubt Dateinamen mit bis zu 100 Zeichen L&auml;nge, bietet ein extrem
schnelles Verzeichnisscannen und maximale Sicherheit bei eventuellen
Abst&uuml;rzen. Ein Validieren entf&auml;llt. Dadurch ist es geradezu ideal f&uuml;r
Cache-Verzeichnisse und andere Schubladen mit vielen Dateien, z.B. f&uuml;r
den Internetbrowser-Cache oder die EMail-Postf&auml;cher. Nat&uuml;rlich kann man
vom SFS auch booten, allerdings nicht von Diskette, da Disketten keinen
RDB (RigidDiskBlock = &quot;Bootblock&quot; f&uuml;r Festplatten) haben, in dem das
SFS vermerkt wird.
</P><P>
Der Vorteil von SFS gegen&uuml;ber dem DC-FFS ist vor allem die h&ouml;here
Geschwindigkeit beim Lesen und Schreiben von Dateien und die
Absturzfestigkeit. Gegen&uuml;ber den kommerziellen Filesystemen &uuml;berzeugt
der niedrige Preis (Freeware :-). Au&szlig;erdem geht das SFS effizienter mit
den Verwaltungsinformationen des Dateisystems um, so da&szlig; mehr Platz f&uuml;r
die eigentlichen Daten auf der Partition zur Verf&uuml;gung steht, auch wenn
das direkt nach dem Formatieren nicht so aussieht. Das SFS legt n&auml;mlich
sofort alle ben&ouml;tigten Verwaltungsbl&ouml;cke an, w&auml;hrend das FFS erst beim
tats&auml;chlichen Bespielen zus&auml;tzlichen Speicherplatz reserviert.
</P><P>
Zum Vergleich: Beim testweisen Beschreiben einer Diskette (880KB, DC-FFS)
mit vielen kleinen Dateien konnte ich nebenher gem&uuml;tlich Mittagessen
(kein Scherz !). Dasselbe mit einer 880kB SFS-Diskette dauerte etwa 4
Minuten. Nebenbei bemerkt, auf der SFS-Diskette hatten 10 Dateien mehr
Platz, als auf der DC-FFS-Diskette. Und ein Verzeichnisscan war auf der
SFS-Disk doppelt so schnell.
</P><P>
[F&uuml;r genaue Vergleichsmessungen von FFS und DC-FFS siehe auch den
Artikel &quot;Filesysteme a la Carte&quot; in Ausgabe #1, d. Chefred.]
</P><P>
Wer das SFS benutzen will, sollte folgendes unbedingt vorher bedenken:
</P><P>
   &#183;  Ein gel&ouml;schte Datei ist futsch. Es gibt noch keine Tools, um
      versehentlich gel&ouml;schte Dateien zur&uuml;ckzuholen.
</P><P>
   &#183;  Ein Fehler in den Verwaltungsdaten (z.B. eine defekte Diskette
      oder Festplatte) kann die ganze Partition unbrauchbar machen.
      Auch hier gibt es noch keine Rettungstools. ALLE Daten der
      Partition sind dann unwiderruflich zerst&ouml;rt.
</P><P>
   &#183;  Bei Manipulationen an Paritionsdaten, wie sie zur Installation
      von SFS n&ouml;tig sind, besteht immer die hohe Gefahr, durch eine
      Fehlbedienung ALLE Partitionen zu zerst&ouml;ren. Ein Backup vor der
      Installation ist deshalb absolut notwendig.
</P><P>
   &#183;  Je mehr User das SFS benutzen und den Autor John Hendrikx
      (http://www.xs4all.nl/~hjohn/SFS) unterst&uuml;tzen, umso stabiler
      wird das Dateisystem, und umso eher gibt es Dateirettungstools
      daf&uuml;r.
</P><P>
Trotzdem viel Spa&szlig; mit dem SFS!
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../mmx/9809fil3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="postsack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
