<html>
<head>
<title> "Neuer Mitsumi-Brenner im Test"</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"> <b> Mitsumi-Brenner </b>
</font></p>

<p>Nachdem ich versucht hatte so billig wie jeder herk&ouml;mmlich PC-User
wegzukommen indem ich mir einen neuen CD-Brenner f&uuml;r meinen Amiga beim
Karstadt um die Ecke kaufe, musste ich nach insgesamt vier Fehlk&auml;ufen
wegen Inkompatibilit&auml;t einsehen, dass ich um den etwas teueren
Amigafachhandel wohl nicht herumkommen w&uuml;rde. </p>

<p>Also rief ich bei KDH an und zwei Tage sp&auml;ter hatte ich einen
Philips CDRW 1200 in meinen Tower eingef&uuml;hrt nur um gleich darauf -
inzwischen mit der Software und dem Installieren neuer Laufwerke vertraut -
festzustellen, dass dieser besch&auml;digt war und AudioCDs nicht
fehlerfrei einlesen konnte. Aber so etwas ist bei KDH kein Problem:
Zur&uuml;ckgeschickt und daf&uuml;r das neu hereingekommene Mitsumi
CR-48x8TE bestellt, dass hier und jetzt vorgestellt werden soll. </p>

<p>Zu Anfang eine kurze Bemerkung &uuml;ber die verwendete Brennersoftware:
MakeCD (ich besitze V3.2c und arbeite mit der V3.2d Public Beta 9) scheint
zu Anfang recht kompliziert f&uuml;r Unge&uuml;bte, dies sollte aber
niemandem Angst machen, da man das Programm auf Anf&auml;ngermodus schalten
kann, bzw. sich das Programm nach der Installation schon in diesem
befindet, bei dem man nicht viel falsch machen kann. Doch als Experte
wei&szlig; man mit der Zeit die vielen zus&auml;tzlichen "Kleinigkeiten"
sehr zu sch&auml;tzen. Die Laufwerke werden damit auch meist automatisch
erkannt, nur bei ganz Neuen wird man um den Standard-SCSI-Treiber nicht
herumkommen, der aber leider auch kein Allesk&ouml;nner ist! </p>

<p>Als Testcomputer kam ein A1200 im Elboxtower mit Blizzard 060/50mhz und
64MB Ram zum Einsatz, der au&szlig;er zwei Festplatten, die mittels
IDEFix97 verbunden sind, einem externen HD-Floppy, einem Flickermagic-T und
dem zu testenden CD-Brenner noch recht leer ist. </p>

<p>Beim &Ouml;ffnen des Packetes musst ich leider gleich als erstes
feststellen, dass wie immer bei Amigah&auml;ndlern weder eine deutsche
Beschreibung (in diesem speziellen Falle war zwar ausnahmsweise eine dabei,
nur leider in keiner mir bekannten Sprache), noch leere CDRs,
Brenner-Software oder Kabel zur Verbindung mit einer Soundkarte beigelegt
waren, wie man es beim Kauf eines CDRs im PC-Handel in der N&auml;he
gewohnt ist. Aber da es von einem erfahrenen Amigah&auml;ndler kam bestand
die berechtigte Hoffnung, das es auch wirklich funktioniert. </p>

<p>Als zweites viel mir auf, wie unglaublich h&auml;sslich dieser kleine
Asiate war. Nat&uuml;rlich soll man nicht vom &Auml;u&szlig;eren auf die
Funktionalit&auml;t schlie&szlig;en, aber etwas mehr &Auml;stethik war ich
von allen anderen Modellen die ich bisher gesehen hatte schon gewohnt.
Nunja, daf&uuml;r ist das Mitsumi im typischen Amigabeige gehalten anstatt
im dunkleren PC-Grau. </p>

<p>Der Einbau verlief ohne Probleme und die Konfiguration am IDEFix,
zweiter Strang Port 1, war schnell erledigt. Das Fertigungsdatum war laut
Stempel August 2001, was ziemlich lange her war daf&uuml;r das ich es im
Dezember als Neuware gekauft hatte. Das Lesen von DatenCDs klappte auch
sofort und ging recht flott, subjektiv betrachtet. SCSI-Bench lieferte
neben der Revision V1.1B entsprechend gute Ergebnisse f&uuml;r ein
IDE-Ger&auml;t am Amiga ohne Expressoption. Die &Uuml;bertragungssrate lag
bei 1300cps bis 1600cps. Die Fehlk&auml;ufe waren zwar etwas schneller,
aber hatten daf&uuml;r andere Probleme. Aber auch die blieben bei dem
Mitsumi nicht lange unentdeckt. Die Geschwindigkeiten waren vom Hersteller
mit 48-fach Lesen, 8-fach Brennen und 4-fach Wiederbeschreiben angegeben,
wogegen KDH mir am Telfon die folgenden Werte mitgeteilt hatte: 12-fach
Lesen, 8-fach Brennen und 4-fach Wiederbeschreiben. Nungut, auch diese
Werte w&auml;ren mir recht gewesen, aber es sollte anders kommen... </p>

<p>Nach einigen Abbr&uuml;chen beim Testbrennen mit MakeCD wegen
Bufferunderruns, die ich mir nicht erkl&auml;ren konnte da ich 50MB Ram zur
Verf&uuml;gung stellte und auch die Chunks angepasst waren - das genaue
Lesen der Softwareanleitung hatte sich hier wirklich bezahlt gemacht -
musste ich feststellen, dass das Laufwerk einfach nur 4-fach Schreiben
kann. Sp&auml;ter erkannte ich, dass MakeCD nicht wie bei anderen
Laufwerken den Puffer schneller bedient, sondern dass das Laufwerk stehts
mit h&ouml;herer Geschwindigkeit schreibt, als Daten in den Puffer geladen
werden. Dies kann man allerdings auch mit herabsetzen der
Brenngeschwindigkeit nicht &auml;ndern, was sicher am Befehlsatz und/oder
der Priorit&auml;t des Laufwerkes liegt. </p>

<p>Mit 4-facher Geschwindigkeit konnte ich mich ja noch abfinden, aber beim
Schreiben von DatenCDs mit vielen kleinen Dateien, tauchte das selbe
Problem leider auch in dieser niedrigen Geschwindigkeit auf. Trotz meines
gro&szlig;en Puffers wurde dieser bis zum Ende des Brennvorgangs nicht
immerwieder ganz aufgef&uuml;llt, was ich dem kleinen - vom Hersteller aber
leider nirgendwo angegebenen - internen Speicher des Laufwerkes zuschreiben
w&uuml;rde. Die einzige L&ouml;sung hierf&uuml;r ist das Anlegen einer
Imagedatei, was die Brennzeit nat&uuml;rlich verdoppelt. </p>

<p>CDRs Wiederbeschreiben funktioniert mit diesem Laufwerk auch, aber das
ist noch problematischer und &auml;u&szlig;erst langsam. Au&szlig;erdem
entstehen - bei mir zumindest - durch die obengenannten
Geschwindigkeitsprobleme oft fehlerhafte Medien. Da ist es dann doch
billiger, umweltschonender und weniger nervenaufreibend, 50 Eurocent mehr
f&uuml;r einen weiteren "normalen" Rohling auszugeben! </p>

<p>In jedem Falle sollte man es aber vermeiden etwas anderes als vielleicht
Textverarbeitung neben dem Brennvorgang zu machen. Besonders CPU-lastiges
ist nicht zu empfehlen, denn dann klappt es mit dem Mitsumi &uuml;berhaupt
nicht und man kann gl&uuml;cklich sein im Testmodus gebrannt zu haben wenn
mal wieder ein Track nicht vollst&auml;ndig geschrieben wurde! </p>

<p>Aber es ist eine Fehlinformation, die in diversen Amiganewsgroups
rumgeht und unbedingt beseitig werden muss, dass man mit dem Amiga generell
nur 4-fach brennen kann. Ich selbst habe mit den neuesten Laufwerken in
Geschwindigkeiten h&ouml;her als 8-fach gebrannt, nur leider wurden diese
nicht direkt von MakeCD unterst&uuml;tzt, sodass z.B. kein DAO-Modus
(Disc-At-Once) verf&uuml;gbar war. </p>

<p>Beispiele daf&uuml;r sind der neue Acer (48-fach Lesen, 24-fach
Schreiben und 16-fach Wiederbeschreiben), ein alter HP (8-fach, ohne
Wiederbeschreiben) und der neue Ricoh. Diese hatten 1A-Geschwindigkeiten
auf dem selben Computer und haben das System minimal belastet, sodass ich
neben dem Brennen ohne Probleme LZX-Archive packen, Musikabspielen,
Kopieren von Datein auf der Festplatte UND Texte verarbeiten konnte.
Allerdings hatten alle leider das Problem, dass es keine direkten Treiber
gab und das der Standardtreiber von Make CD keine f&uuml;r sie
vollst&auml;ndigen Befehls&auml;tze hatte, sprich dass z.B. DAO nicht
m&ouml;glich war und im TAO-Modus (Track-At-Once) die 2 Sekunden Pause aus
Pfeift&ouml;nen bestand. </p>

<p>Fazit: Das neue Mitsumi-CDR tut trotz seines unangenehmen
&Auml;u&szlig;eren seine Arbeit. Es ist leider nicht das Beste
(Komfortabelste), das man sich w&uuml;nschen kann und auch nicht das
Schnellste, doch man kann es am Amiga nutzen. Ich bin zwar nicht wirklich
zu frieden mit der Geschwindigkeit und der Systemauslastung, aber ein
anderes IDE-Laufwerk hatte KDH leider nicht mehr vorr&auml;tig, also habe
ich mich damit abgefunden nur 4-fach brennen zu k&ouml;nnen und bei
DatenCDs mit der doppelte Brennzeit zu rechen um eine Imagedatei anzulegen
und so den Bufferunderun zu vermeiden. </p>

<p>von Marc "Zito" Oberst </p>

</td></tr></table>
<br>
</body>
</html>
