<!-- saved from url=(0022)http://internet.e-mail -->
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
	<title>8Bit-Museum</title>
</head>

<body text="#FFFF00" link="#FF0000" vlink="#00FF00" bgcolor="#000000">
<table width="95%" align="CENTER">
<tr align="CENTER">
	<td><img src="mm_8bit-museum.gif" width=500 height=50 border=0 alt=""></td>
</tr>
<tr>
	<td><p title="" align="JUSTIFY">
<br>Auf meiner Reise durch die Webseiten bin ich an einer sehr interessanten Seite h&auml;ngengeblieben. Und zwar war es die Seite <a href="http://www.8bit-museum.de">http://www.8bit-museum.de</a>.<br><br>
Das 8 Bit-Museum existiert als virtuelles Museum seit 1988 im Web und geh&ouml;rt zu den gr&ouml;ssten Web-Museen weltweit, die sich mit der Geschichte der Videospiele und Heimcomputer besch&auml;ftigen.<br>
<br>
Das 8Bit-Museum besteht aus zwei Abteilungen:<br>
<br>
In der ersten gibt es einen ausf&uuml;hrlichen &Uuml;berblick &uuml;ber die Entstehung der Videospiele. Angefangen von dem ersten Tennis-Spiel, das als Ausgabemedium noch ein Oszilloskop vewendete, &uuml;ber die ersten Arcade-Automaten und Heimkonsolen, bis zu den Heimcomputern, die in den 80er Jahren eine Revolution ausl&ouml;sten, erf&auml;hrt man fast alles &uuml;ber die Entstehung der Videospiele.<br>
<br>
Die zweite Abteilung besh&auml;ftigt sich mit der &quot;Geschichte der Heimcomputer&quot;. Hier findet man &uuml;ber 30 Firmengeschichten. Auf unz&auml;hligen Seiten erf&auml;hrt man ales &uuml;ber die Unternehmensgr&uuml;ndung und wer die Hardware entwickelte. Es gibt &Uuml;bersichten &uuml;ber die hergestellten Computermodelle, Screenshots von damals noch top-aktuellen Spielen, Bilder von Werbeanzeigen aus der damaligen Zeit und nat&uuml;rlich vielen Bilder von den &quot;alten&quot; Ger&auml;ten.<br>
<br>
Stephan Slabihoud, der hinter dem 8Bit-Museum steckt( geb. 1970, Diplom-Informatiker), entdeckte schon im Alter von 11 Jahren sein Interesse an diesen Ger&auml;ten. Damals bekam er seinen ersten Computer geschenkt, einen ZX81 von der Firma Sinclair, den er heute noch in seiner Sammlung besitzt. Es folgten schnell ein ZX Spectrum, Atari-ST, Atari TT und noch ein paar andere, bis er irgendwann bei einem &quot;ordin&auml;ren&quot; PC ankam. &quot;Zu dieser Zeit begann auch meine Leidenschaft, alte Ger&auml;te zu sammeln.&quot;, erinnerte sich Stephan Slabihoud, &quot;Irgendwann Anfang der 90er Jahre habe ich diese Ger&auml;te wieder aus dem Keller geholt und in eine Vitrine gestellt. In den n&auml;chsten Jahren bekam ich viele Ger&auml;te geschenkt oder erstand diese g&uuml;nstig auf Flohm&auml;rkten.&quot; Mittlerweile besitzt das 8Bit-Museum &uuml;ber 400 Exponate. Alle Ger&auml;te sind liebevoll restauriert worden und man k&ouml;nnte fast meinen, dass diese gerade aus dem Werk kommen. &quot;Die Restauration eines Computers dauert in der Regel zwischen 2 bis 10 Stunden, je nach Zustand&quot;, best&auml;tigt Stephan Slabihoud, der den gr&ouml;ssten Teil seiner Freizeit mit diesem exotischen Hobby verbringt.<br>
<br>
Die Highlights dieser virtuellen Ausstellung sind einige &quot;Exoten&quot;, wie z.B. ein japanischer Commodore Computer mit dem Namen MAX-Machine und der Enterprise ein &quot;Design-Computer&quot; aus England. Aber auch alle anderen (bekannten) Computer sind vertreten: Der C64 und Amiga in allen Varianten, die beliebten Heimcomputer des Sir Clive Sinclair ZX81 und ZX Spectrum und nat&uuml;rlich die Atari-Computer wie z.B. 800XL und 1040ST.<br>
<br>
Aber das 8Bit-Museum soll nicht virtuell bleiben. Nach ein paar kleineren Ausstellungen , ist Stephan Slabihoud bem&uuml;ht, einen geeigneten Raum f&uuml;r eine dauerhafte Ausstellung zu finden. &quot;Leider fehlen mir immer noch ein paar Ger&auml;te, die ich f&uuml;r eine umfangreiche Ausstellung ben&ouml;tige&quot;, gibt Stephan Slabihoud zu. &quot;Aber durch den Internet-Auftritt melden sich fast t&auml;glich Leute, die ihr Ger&auml;t spenden m&ouml;chten&quot;. Als &quot;Dankesch&ouml;n&quot; gibt es &uuml;brigens die 8Bit-Museums CD-ROM, die nur exklusiv an Personen abgegeben wird, die das 8Bit-Museum z.B. mit einem Computer unterst&uuml;tzt haben.<br>
<br>
Wer sein Wissen &uuml;ber die Computerhistorie mal testen m&ouml;chte, den bietet das 8Bit-Museum mehrere Quize aus den Themengebieten &quot;Videospiele&quot;, &quot;Automatenspiele&quot;, &quot;Heimcomputer&quot; und Computergeschichte.<br>
<br>
Und wer jetzt online einen Blick ins 8Bit-Museum werfen m&ouml;chte kommt <a href="http://www.8bit-museum.de">hier</a> rein.<br><br>
<table border="5" cellpadding="5" align="CENTER">
<tr>
	<td>Rainer Wrieden</td>
	<td>E-Mail: <a href="mailto:spezis@terra.es">spezis@terra.es</a></td>
</tr>
</table><br>


</body>
</html>
