<html>
<head>
<title>Interview3</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Team Chaos</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> Total Chaos: Battle at the Edge of Yesteryear</td></tr>
<tr><td valign=top> Version: </td>
<td> 4.03 </td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://users2.ev1.net/~jconwell/TotalChaosAGA/chaos.html</td></tr>
<tr><td valign=top> Email: </td>
<td valign=top> JamesConwell@Yahoo.com
</td></tr>
</table>
</p></center>

<p><b> Bitte stelle Dich den Lesern vor!</b><br>
 
Mein Name ist James Conwell. Ich bin der Anf&uuml;hrer von Team Chaos. Mein
einziger Lebenszweck ist, das beste Strategiespiel der Welt zu machen.
Daf&uuml;r m&uuml;ssen aus offensichtlichen Gr&uuml;nden ein Amiga benutzt
werden. F&uuml;r diesen Zweck baue ich eine Armee aus Grafik-Magiern,
Code-Zauberern, Toningenieuren, Animationsgrafikern und
Fantasy-K&uuml;nstlern auf. Wir haben einige sehr talentierte Leute in
unserem Team, aber wir brauchen noch mehr, insbesondere k&ouml;nnten wir
einige talentierte 3D Renderer-Animatoren und andere gebrauchen. Unser Ziel
ist, die Welt der Strategiespiele zu erobern, sie zu unterwerfen und mit
eiserner Faust zu regieren. Wir k&ouml;nnen (und werden) das mit oder ohne
Dich machen, aber es w&uuml;rde die Sache beschleunigen und mehr Spass
machen, wenn Du uns aushelfen w&uuml;rdest. :) Schick mir eine Mail wenn Du
Interesse hast, ein Heiliger Krieger in der Armee des Chaos zu werden. </p>
  
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Im September 1985, als der erste Amiga 1000 herauskam. I fing sofort an,
ihn in einem &ouml;rtlichen Computerladen zu demonstrieren und mit den
unglaublichen musikalischen und grafischen F&auml;hhigkeiten zu protzen.
Bevor der Amiga herauskam, kaufte ich jedes einzelne Magazin, das ich
&uuml;ber den Amiga finden konnte und verschlang sie. </p>
  
<p>Amiga rettete mich vor den qu&auml;lenden Beschr&auml;nkungen des C64!
Jam Miner rules f&uuml;r imma! </p>
  
  
<p><b>Welches Amiga-Modell besitzt Du?</b><br>
 
Momentan besitze ich einen A1200T, A3000, A1200, A2000 und 2 A500er. Ich
besitze auch einen kaputten A4000 :( Ich hatte noch einen A3000 und einen
weiteren A2000, aber die habe ich vor langer Zeit verkauft. Meinen A1000
und meinen dritten A500 abe ich vor langer Zeit verschenkt. </p>
  
  
<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>
 
Ich verwende OS 3.9 auf dem A1200T und OS 3.1 auf dem A3000. </p>
  
  
<p><b>Welche Software entwickelst Du?</b><br>
 
Total Chaos: Battle at the Edge of Yesteryear. Das ultimative
Strategiespiel. Ultimativ im Spass, aber nicht der Kompliziertheit. :) </p>
  
  
<p><b>Welche Sprachen unterst&uuml;tzt Dein Spiel?</b><br>
 
Es ist vollst&auml;ndig spielbar in Englisch, Deutsch, Franz&ouml;sisch,
Ungarisch, Polisch und Italienisch dank der riesigen Unterst&uuml;tzung
f&uuml;r das Spiel in diesen L&auml;ndern und der harten Arbeit der
&Uuml;bersetzer, die die 150KB an Texten &uuml;bersetzt haben. </p>
  
  
<p><b>Wie viele Spieler unterst&uuml;tz Dein Spiel?</b><br>
 
1 bis 8 Spieler. Jeder der Spieler kann menschlich oder vom Computer
gesteuert werden. Ihr k&ouml;nnt in Teams oder jeder f&uuml;r sich selbst
spielen. </p>
  
  
<p><b>Kannst Du uns sagen, worum es bei Deinem Spiel geht?</b><br>
 
Total Chaos ist ein Strategiespiel &uuml;ber die ewige endlose Schlacht
zwischen Gut und B&ouml;se, Licht und Dunkelheit, Leben und Tod. Es geht um
macht und Vorherrschaft, Tod und Zerst&ouml;rung, Monster und Chaos. Es
geht um die Kr&auml;fte der Magie und die Herrscher der Dunkelheit in hohen
Posten. </p>

<p>Wenn Ihr detaillierter Informationen wollte, solltet Ihr die
Readme-Datei im Aminet lesen. :) Oder Ihr k&ouml;nnt unsere Website
besuchen, zum Downloadsbereich gehen und den Readme-Link klicken. </p>

<p>http://users2.ev1.net/~jconwell/TotalChaosAGA/chaos.html Vergesst
nicht, die Screenshots abzuchecken. </p>
  
  
<p><b>Wie erstellst Du die Grafiken f&uuml;r Dein Spiel?</b><br>
 
Meistens erstelle ich die Grafiken nicht. Ich habe eine kleine
Armee m&auml;chtiger GrafikKrieger, die das f&uuml;r mich machen. Sie
bringen die klotzigen Pixel zur Strecke, sie st&ouml;bern ruckelige
Aminationen auf und zerst&ouml;ren sie! Sie marschieren hinaus zur Schlacht
und singen "Tod den LoRes-Grafiken"! Sie sind ziemlich t&ouml;dlich und
effektiv bei ihrer Arbeit, aber es gibt so viel zu tun, dass ich nicht
sicher bin, dass es jemals fertig wird. Das Hauptproblem ist, dass Total
Chaos hunderte Monster und hunderte seelen¸lose Gegenst&auml;nde und
hunderte Zauberspr&uuml;che und Spezialeffektgrafiken enth&auml;lt. </p>
  
<p>In den seltenen F&auml;llen, in denen ich pers&ouml;nlich Grafiken
f&uuml;r das Spiel mache, wie z.B. dem Punkte-Spruch, verwende ich Deluxe
Paint 5. </p>
  
 
<p><b>Was brachte Dich auf die Idee, dieses Spiel zu entwickeln?</b><br>
 
Das Verlangen, das beste je von menschlicher Zivilation erstellte
Strategiespiel zu kreieren. Aussderdem wollte ich schon immer ein Spiel
machen, das den AGA-Chipsatz anst&auml;ndig ausnutzt. Die meisten
AGA-Strategiespiele waren im Super LoResModus 320x256 wie Civilization AGA
oder liefen im HiRes-Modus und waren megal&auml;cherlich langsam wie z.B. Sim
City 2000 AGA oder A-Train AGA. Thotal Chaos hat die vierfache Aufl&ouml;sung
von Cibilization AGA und ist auch noch viel schneller. </p>
  
  
<p><b>Wie lange hat die Entwicklung bislang gebraucht?</b><br>
 
Ich habe seit Januar 1997 st&auml;ndig daran gearbeitet. Ich habe in der Zeit
viele neue Monster, Zauberspr&uuml;che, Merkmale und F&auml;higkeiten hinzugef&uuml;gt.
Mein Programmierpartner (mittlerweile im Ruhestand) hat davor jahrelang
daran gearbeitet. </p>
  
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
Ihr k&ouml;nnt gar nichts von zuk&uuml;nftigen Versionen erwarten, solange nicht
jemand das Spiel registriert und fordert, dass neue Versionen produziert
werden. </p>
  
  
<p><b>Welche Art Spiele magst Du und spielst sie auf dem Amiga?</b><br>
 
Also, in der alten Zeit liebte ich all die heissen Spiele wie Turrican 2,
Superfrog, Hired Guns, Stunt Car Racer, Dune II, Pinball Dreams, Another
World und zahllose andere. Ich k&ouml;nnte ein grosses Buch &uuml;ber all die tollen
Amiga-Spiele schreiben, die ich seit 1985 gespielt habe!!!!! Ich erinnere
mich an die Zeit als Amigas in Videospielautomaten verwendet wurden f&uuml;r
Sidewinder und Space Ranger und viele andere! YEAH!! Amiga Rules! </p>

<p>Als ich &auml;lter wurde sehnte ich mich nach mehr Strategie und weniger
Action. Aber es gibt meiner Meinung nach sehr wenige wirklich gute
Strategiespiele f&uuml;r Computer. Zugegeben, ich bin sehr w&auml;hlerisch in was ich
mag und was nicht in Spielen und bin eine sehr schwer zufriedenzustellende
Person. Seit 1996 ist Total Chaos das Spiel, das ich haupts&auml;chlich spiele.
Ich habe von 1996 bis 2002 viele andere Spiele auf vielen verschiedenen
Systemen gespielt, aber keins konnte meine Aufmerksamkeit so halten, wie es
Total Chaos tut. Ich bekomme Emails von Amiga-Usern (und vielen
nicht-Amigausern), die mir mehr oder weniger dasselbe sagen. </p>

<p>Ein typisches "wirklich fantastisch tolles Spiel" h&auml;lt mein Interesse
f&uuml;r einen vollen Monat, vielleicht maximal 2. Das wird es Zeit, weiter zu
ziehen. Aus irgend einem Grund aber wird mir Total Chaos nie langweilig. Es
muss diese geheime Zutat sein, die in das Programmierungsrezept
hineingekocht habe. ;) </p>
  
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>
 
Meine Haupt-Entwicklungssoftware ist: SAS/C 6.58, CygnusEd Professional,
YAM 2.0, IBrowse 2.2, Deluxe Paint 5, SampleZ, GfxConv, DevPac Assembler
und wahrscheinlich jede Mange sonstige grossartige Amiga-Software, die zu
erw&auml;hnen ich vergessen habe. </p>
  
<p>Meine Grafik-Kompanie nutzt einen weiten Bereich hochgez&uuml;chteter
AmigaSoftware-Artillerie in den Chaosischen Schlachten wie PPaint 7.1,
Photogenics und viele andere sowie spezialangefertigte Grafiksoftware. </p>
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?</b><br>
 
AmigaOS. Ich bin zu 100% AmigaOS-Coder. Total Chaos: Battle at the Edge of
Yesteryear ist ein 100%iges AmigaOS-Spiel. Intuition(tm) rockt! Exec rules!
</p>
  
<p><b>Welches OS wirst Du zuk&uuml;nftig unterst&uuml;tzen?</b><br>
 
AmigaOS. 100% 32-bit Multitasking seit 1985! Wahoo! </p>
  
<p><b>Was ist der Grund f&uuml;r die Unterst&uuml;tzung dieses OS?</b><br>
 
  1. Es funktioniert. <br>
  2. Es ist schnell. <br>
  3. Ich habe es auf meinem Computer. <br>
  4. Jedes St&uuml;ck software, das ich besitze, ist dazu kompatibel. <br>
  5. Was ist daran falsch? </p>  
  
<p><b>Welche Merkmale vermisst Du am AmigaOS f&uuml;r das Entwickeln? </b><br>
 
Oh, ich vermisse das Merkmal, dass Windows 95, 98 und 2000 haben, wo Dein
System jeden Monat r&auml;tselhafterweise abst&uuml;rzt und Du Dein komplettes OS neu
installieren musst, ein paar Deiner Programme und einen Haufen
Einstellungen verlierst und jeden Monat eine Million Stunden daf&uuml;r
verschwendest, Dein System neu aufzubauen und neu dahin zu konfigurieren,
wo es vorher war und... MOMENT! AUA! Was sage ich da!?!?!? Das Merkmal
vermisse ich gar nicht!!! <br>

&laquo; Haut sich selbst vor den Kopf &raquo;
  
<p><b>Welche Markmale w&uuml;nscht Du Dir f&uuml;r das AmigaOS?</b><br>
 
  Alles und jedes vorstellbare, so lange wie: <br>
  1. Sie tats&auml;chlich funktionieren. <br>
  2. Sie schnell sind. <br>
  3. Sie n&uuml;tzlich sind. </p>
  
  
<p><b>Verlierst Du nicht den Spass und das Interesse am Programmieren, wenn
Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
erh&auml;ltst?</b><br>
  
So etwas wie "geringe Resonanz" aus dem Amiga-Markt gibt es nicht. Mehrere
Millionen Amigas wurden verkauft. Offensichtlich sind mindestens einige
100.000e von ihnen noch in Gebrauch. Ich erhalte jede Menge Resonanz.
Vielleicht bekomme ich nur so viele R&uuml;ckmeldungen, weil das Spiel so
beliebt ist. </p>
  
<p><b>Verlierst Du nicht den Spass und das Interesse am Programmieren, wenn
Du die geringe Anzahl an Registrierungen siehst, die Du aus dem kleinen
Amiga-Markt erh&auml;ltst?</b><br>
  
Ungl&uuml;cklicherweise ist die Antwort manchmal "ja". :( </p>
  
<p><b>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software?</b><br>
 
Ich bekomme tonnenweise R&uuml;ckmeldungen von vielen Total Chaos-Spielern
weltweit. Mehr ist allerdings immer willkommen. :) Es ist nicht
ungew&ouml;hnlich, dass ich pro Tag 20 Emails wegen des Spiels erhalte. Manchmal
sind es sogar 40. (!) </p>
  
<p>Resonanz ist nicht das Problem. Registrierungen sind das Problem. Ich
habe gut &uuml;ber $150.000,00 f&uuml;r die Entwicklung dieses Spiels ausgegeben. Es
w&auml;re nett, wenn hin und wieder ein paar Leute das Spiel das Spiel
registrieren w&uuml;rden, anstatt es einfach nur gratis zu spielen. </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?</b><br>
  
Amiga OS 3.9 + Developer CD. </p>
  
<p><b>Welche Software verwendest Du noch?</b><br>
 
Haupts&auml;chlich die Programme, die ich bereits aufgef&uuml;hrt habe. </p>
  
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen?</b><br>
 
Ich habe kein Geld. Ich bin pleite. Ich kann nicht "planen", irgendwas zu
kaufen. </p>
  
<p>Falls jemand _mir_ etwas Hardware kaufen m&ouml;chte, k&ouml;nnte ich wirklich eine
PCI Voodoo 3 2000 oder besser gebrauchen, oder 2 MB RAM Chips f&uuml;r meine
alte PCI S3 Virge DX, oder falls Du eine alte S3 Virge DV oder Voodoo 3 im
Schrank rumliegen hast, k&ouml;¶nntest Du sie mir spenden, und das w&auml;re sehr
willkommen, und dann k&ouml;nnte ich vielleicht beginnen, an einer
Grafikkarten-Version f&uuml;r 2004 zu arbeiten. </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>
 
Hoffentlich. :) </p>                            
  
<p><b>Deine abschliessenden Worte an die Leser?</b><br>
 
Amiga Rules! Total Chaos Rules! Amiga Users Rule! </p>

<p> © Amiga Arena 04/2002 <br>
(aus dem Englischen von Christian Busse)</p>

</td></tr></table>
<br>
</body>
</html>

                           
