<html>
<head>
<title>Interview1</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> &Aacute;lmos Rajnai</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> Petunia - 68k Emulator</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://amigos.amiga.hu/rachy</td></tr>
<tr><td valign=top> Email: </td>
<td valign=top> racs@fs2.bdtf.hu
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor! </b><br>
 
Ich bin Programmierer und Lehrer an einer Hochschule im Westen Ungarns. Ich
begann meine Coder-Karriere als ich etwa 8-9 Jahre alt war, zun&auml;chst
auf einem Commodore Plus/4. Heute, nach fast 20 Jahren Programmieren
arbeite ich haupts&auml;chlich an Web-basierten und Multimedia-Anwendungen
in meinem VollzeitJob und bringe den Studenten Multimedia-Programmierung
bei. Amiga-Progrmamierung ist nur mein Hobby, ich liebe diesen Computer
wirklich, habe aber leider nicht genug Zeit zum Programmieren. Mein Traum
war, ein gro&szlig;er Amiga-Coder zu werden, etwas wichtiges f&uuml;r die
Amiga-Community zu machen, nun werde ich diesen Traum hoffentlich wahr
machen... :) </p>

<p>Ich bin haupts&auml;chlich an Low-Level-Programmierung interessiert, in
Assembler und in C, besonders Emulatoren. </p>
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>
 
Das war vor etwa 10 Jahren, um 1992. Lange Zeit war ich "nur" ein
Demo-Coder, aber nach ein paar Jahren passiver Arbeit fand ich heraus,
da&szlig; ich eigentlich Anwendungs- und Toolentwicklung dem Effekt-Coden
vorziehe. </p>
  
<p><b>Welches Amiga-Modell besitzt Du? </b><br>
 
Ich habe einen Amiga 1200 in einem riesigen (und hackigen)
Server-Geh&auml;use mit BlizzardPPC 603e-160/680LC40-25, 64MB Fast RAM,
Mediator PCI-Karte mit einer Voodoo3-2000. (Und nat&uuml;rlich dem Rest,
wie Festplatte, Monitor usw. :) </p>
  
<p><b>Welche Betriebssystem-Version l&auml;uft auf Deinem Computer?
</b><br>
 
AmigaOS 3.1 </p>

<p><b>Welche Software entwickelst Du? </b><br>
 
Es ist ein Just In Time-Kompilierungs-basierter Motorola 68040-Emulator
f&uuml;r die PowerPC-Prozessoren (Codename: Petunia). </p>
  
<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht? </b><br>
 
Sie wird im AmigaOS4 verwendet werden, um den 68K-Prozessor f&uuml;r
AltlastAnwendungen, -Tools, -Systemteile und -Treiber in akzeptabler
Geschwindigkeit zu emulieren. </p>
  
<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln? </b><br>
 
Wie ich bereits sagte, mache ich gerne Emulatoren. Nachdem ich meinen
Commodore Plus/4-Emulator gemacht hatte, dachte ich an die
M&ouml;glichkeit, moderne Techniken in einem 68k-Emulator zu
implementieren. </p>

<p>Ich sah 68k-Emulatoren in MorphOS und MacOS und war &uuml;ber deren
Leistung ziemlich entt&auml;uscht. Ich konnte einfach nicht glauben,
da&szlig; das alles war, wozu ein PowerPC in der Lage sein sollte. Also
begann ich, nach einer langen Denk- und Planungsphase, ein experimentelles
Projekt. </p>

<p>Nach 3 Monaten Arbeit schien es, da&szlig; die JIT-Technik meine
Erwartungen erf&uuml;llen w&uuml;rde, und der Emulator begann zu
funktionieren. Seitdem konnte ich einfach nicht mehr mit dem Programmieren
aufh&ouml;ren... ;) </p>
  
<p><b>Wie lang hat die Entwicklung bisher gedauert? </b><br>
 
Ich begann das Projekt am 27. Dezember 2000. Es ist noch nicht fertig, aber
die endg&uuml;ltige Version steht kurz bevor. </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln? </b><br>
 
Ich verwende pasm von Frank Wille und das VBCC-Paket f&uuml;r C-Code. (95%
des Codes ist PowerPC-Assembler wegen der Geschwindigkeit. Ich liebe es,
meinen Code von Hand zu optimieren, ich traue den Optimierungsmethoden der
Compiler nicht.) </p>
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?
</b><br>
 
Nur AmigaOS, ich habe nicht vor, MorphOS zu unterst&uuml;tzen. AmigaDE ist
von meinem Profil etwas zu weit entfernt, vielleicht einmal in meinem
VollzeitJob... </p>
  
<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?
</b><br>
 
Nur AmigaOS, da es der einzige offizielle Weg ist, den man auf dem Amiga
gehen kann. </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>
 
Das ist schwer vorherzusagen, die aktuelle Version hat keine
MMUUnterst&uuml;tzung, die will ich implementieren. Und ich m&ouml;chte
mehr spezifische Optimierungen f&uuml;r die verschiedenen
PowerPC-Versionen, z.B. durch AltiVecNutzung auf G4-PPCs. </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
erh&auml;ltst? </b><br>
  
Nein. Es ist wahr, da&szlig; ich alle R&uuml;ckmeldungen an meinen zehn
Fingern abz&auml;hlen kann (ok, vielleicht mu&szlig; ich auch noch meine
Schuhe ausziehen ;), aber ich habe die meiste meiner Software f&uuml;r mich
selbst geschrieben, einfach nur um Spa&szlig; damit zu haben. Die eigene
Software-Entwicklung hat einen riesigen Vorteil: Du kannst implementiern,
was auch immer Dir einf&auml;llt, also mu&szlig;t Du nie auf jemanden
warten... :) </p>
  
<p><b>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software? </b><br>
 
Eigentlich schon. Petunia ist nicht fertig, also rechnete ich mit keiner
Resonanz, die einzige &ouml;ffentlich Information gibt es auf meiner
Webseite. Ein paar meiner Freunde probierten die Betas aus, die fragen
immer nach neuen Versionen. </p>

<p>Auf dem gro&szlig;en Treffen (Fyanica) letzten Sommer hier in Ungarn
stellte ich Petunia der &Ouml;ffentlichkeit (ungef&auml;hr 500 Amiganer)
vor, nach dieser "Schau" bekam ich genug R&uuml;ckmeldungen, um mich auf
dem Weg voran zu treiben. </p>
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt? </b><br>
 
Ich benutze ihn nat&uuml;rlich gerade jetzt... :) (Was f&uuml;r eine
Frage... Sagen wir vor 0,1 Sekunden, ich kann ziemlich schnell tippen... ;)
</p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>
 
Puh! Das ist ziemlich lange her, ein Aminet-Set. Ich bekam ein paar
Programme f&uuml;r meine Arbeit auf dem Amiga (z.B. machte ich ein paar
&Uuml;bersetzungen f&uuml;r ATO). </p>
  
<p><b>Welche Sofwtare verwendest Du noch? </b><br>
 
Ich verwende gr&ouml;&szlig;tenteils freie Software. Als Programmierer ist
das VBCCPaket das meistgenutzte Programm auf meinem Amiga. </p>
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen? </b><br>
 
Hardware: AmigaOne Entwickler-Board. <br>

Software: Hmm... Ich wei&szlig; nicht, vielleicht mal einen guten Browser.
</p>
  
<p><b>Glaubst Du an ein Comeback von Amiga? </b><br>
 
Definitiv. :) <br>

Ich habe das Gef&uuml;hl, da&szlig; Amiga nach langer und schmerzhafter
Stille wieder am Leben ist. </p>
  
<p><b>Deine letzten Worte an die Leser? </b><br>
 
Bitte verliert nicht den Glauben an Amiga, unterst&uuml;tzt weiterhin Eure
Entwickler! Eine kleine R&uuml;ckmeldung, nur eine Email &uuml;ber das
Programm, das Ihr m&ouml;gt, ganz zu schweigen von Shareware-Geb&uuml;hren,
ermutigen Entwickler sehr. (Und zerst&ouml;rt die Regenw&auml;lder nicht...
:) </p>


<p> © Amiga Arena 3/2002 <br>
(aus dem Englischen von Christian Busse)</p>

</td></tr></table>
<br>
</body>
</html>

                           
