<html>
<head>
<title>Interview5</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Laszlo T&ouml;r&ouml;k</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> MOOVId</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.dfmk.hu/~torokl/</td></tr>
<tr><td valign=top> Email: </td>
<td valign=top> torokl@alpha.dfmk.hu
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Ich bin Systemadministrator in unserer Landesbibliothek in Zalaegerszeg (im
Westen Ungarns, nah der &Ouml;sterreichischen Grenze) und bin der
Anf&uuml;hrer des &ouml;rtlichen H-Bone (Ungarischer Internet-Bone)
Netzwerk-Hauptquartiers. Ich schreibe Programme zum Spa&szlig;,
haupts&auml;chlich f&uuml;r etwas besondere Computer. Meine zweitliebste
Besch&auml;ftigung ist das Sammeln (und benutzen) von Oldieoder besonderen
Computern (wie alte Unix-Maschinen, die Digital Alphas, Siemens
RISC-Server, SGI-Sachen usw.). </p>

<p>Oh, und fast h&auml;tte ich's vergessen: Ich mag auch besondere Autos ;)
(mein Traum ist es, endlich einen Citroen XM 3.0 V6 zu kaufen - das ist
meine alte Auto-Liebe...)
 
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Ich kaufte meinen ersten Amiga 1992 (9. September :) und nachdem ich etwas
damit gespielt hatte (mit Pinball Dreams, Super Cars II und ein paar Sachen
von Sierra), habe ich angefangen, Programme daf&uuml;r zu schreiben (am 10.
September 1992 ;) </p>
  
<p><b>Welches Amiga-Modell besitzt Du?</b><br>
 
Ich habe eine (relativ) gro&szlig;e Amiga-Sammlung: Mein Hauptcomputer ist
ein A4000 mit Picasso IV/Paloma/Pablo/Concierto, Cyberstorm MKII 060/50 mit
SCSI, CD-R, 21"-Monitor usw. usw. </p>
  
Meine anderen Amigas sind: <br>
2x A1000 (jawoll, ich habe 2 A1000er ;) <br>
A2000 mit 030, Picasso II <br>
CDTV (mit ein paar Extras) <br>
CD32 (leider konnte ich daf&uuml;r kein MPEG-Modul finden :/ <br>
A1200 mit EC030/40  <br>
2x A500  <br>
(und eine Menge Ersatzteile) </p>
  
<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>
 
AmigaOS 3.1 (A4000/A1200/A2000) </p>
  
<p><b>Welche Software entwickelst Du?</b><br>
 
Mein erstes &ouml;ffentliches Programm war der 'Savage'-Videotreiber
f&uuml;r ShapeShifter (das war ein MMU-beschleunigter C2P-Wandler), und ich
habe ein paar Programme f&uuml;r die Picasso IV/Paloma-Kombination gemacht:
PIV-MooVId (MooVIds Spezialversion mit Overlay-Unterst&uuml;tzung),
PalomAVI (Echtzeit AVI-CaptureProgramm mit Soundunterst&uuml;tzung),
PalomaPEG (Echtzeit MPEG1 Video-Capture f&uuml;r das Paloma AV-Modul), und
nat&uuml;rlich den AVI/MOV-Abspieler 'MooVId' (und ich habe einen
AVI-Abspieler f&uuml;r PalmOS namens 'PalMooVId' gemacht). </p>
  
<p><b>Kannst Du uns sagen, worum es bei MooVId geht?</b><br>
 
Es ist ein in Assembler programmierter AVI/MOV-Abspieler f&uuml;r AmigaOS
mit 68Kund PPC-Unterst&uuml;tzung (und die n&auml;chste Version
unterst&uuml;tzt auch die ber&uuml;hmten DivX-Codecs! :). </p>
  
<p><b>Was brachte Dich auf die Idee, den Abspieler weiter zu
entwickeln?</b><br>
 
Ich habe mich schon immer f&uuml;r digitales Audio/Video-Playback
interessiert, ich denke das war einer der kreativsten/innovativsten
Bereiche von Computern. Mitte der 90er gab es f&uuml;r Amiga nur ein paar
AVI/QT-Abspieler, und davon waren die meisten wirklich langsam und nicht
wirklich Amiga-like, also wollte ich ein besseres Programm schreiben. </p>
  
<p><b>Wie lang hat die Entwicklung bis jetzt gedauert?</b><br>
 
Hmm... ich habe mit der Entwicklung 1996 begonnen, und in den ersten 2-3
Jahren hat sie meine GESAMTE Freizeit in Anspruch genommen. Nur mal damit
Ihr Euch die Gr&ouml;&szlig;e des Programms vorstellen k&ouml;nnt: Die
Hauptdatei (68K) des Quellcodes ist z.Z. 861.370 Byte lang, und ohne Makros
ist sie 49.402 Zeilen lang (der zus&auml;tzliche PPC-Code und externe
Bibliotheken sind nochmal etwa genau so gro&szlig;, insgesamt also ca. 2MB
Assembler-Quellcode). </p>
  
<p><b>Welche Software verwendest Du?</b><br>
 
F&uuml;r meine Programmierung? Haupts&auml;chlich Asm-One/Asm-Pro (f&uuml;r
68K-Programmierung), PASM (PPC-Assembler-Teile), VBCC (PPC-C-Teile wie
Bibliotheks-Header) und manchmal CED f&uuml;r Quellcode-Editierung und
Pila/PilRC (Amiga-Portierung des Freeware-PalmOS-Assemblers) f&uuml;r
Palm-Projekte. </p>
  
<p><b>F&uuml;r welches System entwickelst Du?</b><br>
 
Haupts&auml;chlich (90%) f&uuml;r AmigaOS, 8% f&uuml;r PalmOS und 2%
f&uuml;r andere (Win, Unix). UND 0% f&uuml;r MacOS :) (Grr, MacOS...) </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
Mehr Codecs (MPEG4-basierte Codecs (DivX, andere MPEG4-Varianten)),
Unterst&uuml;tzung f&uuml;r mehr Dateiformate (MPEG1/MPEG2, ASF, WMV) und
bessere Sound-Unterst&uuml;tzung (AC3/MPEG audio) und h&ouml;here
Abspielgeschwindigkeit. </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Entwickeln
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
erh&auml;ltst?</b><br>
  
Gute Frage... Manchmal wollte ich meine Amiga-Programmierarbeit schon
aufgeben... haupts&auml;chlich aus finanziellen Gr&uuml;nden (mit meinem
ersten Verleger war ich sehr ungl&uuml;cklich...), aber ich habe immer
weiter gemacht... Ich mag Amiga einfach, und ich schreibe gern Programme
f&uuml;r Amiga: AmigaOS ist immer noch eines der besten Betriebssysteme die
es gibt, man mu&szlig; nur ein paar Features hinzuf&uuml;gen, um es in
bester Form zu halten. &Uuml;ber die Resonanz: Gl&uuml;cklicherweise
bekam/bekomme ich genug... Danke daf&uuml;r an die Amiga-Community! </p>
  
<p><b>Bekommst Du genug Resonanz f&uuml;r Deine Software?</b><br>
 
Ja... wenn ich eine neue Version rausbringe bekomme ich eine richtig
gro&szlig;e Email-'Attacke' ;) <br>
(Danke Leute! :) </p>
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>
 
Hm? Ich benutze ihn jetzt gerade! :) (auf IRC chatten, Oldie-MODs abspielen
und diesen Text in CED tippen). </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga
gekauft?</b><br>
 
Hmmm... es war ein Spiel... AFAIR 'WET' :) Gew&ouml;hnlich verwende ich
freie Sachen f&uuml;r meine Entwicklung (oder ich schreibe eine, wenn ich
nichts passendes finde). </p>
  
<p><b>Welche Software verwendest Du heute noch?</b><br>
 
Haupts&auml;chlich freie Entwicklungs-Sachen wie Asm-One/Pro, PASM, VBCC,
Pila. </p>
  
<p><b>Welche Soft-/Hardware hast Du vor zu kaufen?</b><br>
 
Ich w&uuml;rde gern eine PPC-Karte (Oldie-Dual-CPU-Zeug) oder ein neues
AmigaOneBoard kaufen. </p>
  
<p><b>Glaubst Du an ein Comback von Amiga?</b><br>
 
JA! :) </p>


<p> © Amiga Arena 04/2002 <br>
(aus dem Englischen von Christian Busse) </p>

</td></tr></table>
<br>
</body>
</html>

                           
