<html>
<head>
<title>Briefe von Poldi</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8> <tr><td> <p>( Eigentlich sollte
dieser Text in der letzten NC stehen, aber leider ist meine Diskette beim
Kilian defekt angekommen. Auch die Mail vom Kilian konnte nichts daran
&auml;ndern, da ich meistens nur 1 mal im Monat ins Internetcafe gehe
und zwar zwischen dem 5. und 10. eines Monats. Ich wollte diesmal
fr&uuml;her ins Internetcafe, aber das Cafe war wegen Ferien geschlossen:-(
)</p>

<p align=center><font color="#000080" size="7"><b>Hallo Ihr Amiganer
!!!</b></font></p>

<p>Bei mir hat sich leider der 2 monatliche Rhythmus eingeschlichen, so
da&szlig; es sein kann, nur alle 2 Monate etwas von mir zum Lesen zu
bekommen:-) Aber das ist ja nicht so schlimm, es wird erst schlimm wenn ich
mir einen PC kaufen sollte, dann h&ouml;rt und liest man von mir nichts
mehr. (War nur ein Joke.) </p>

<p>Vielen Dank an Charly, der meinen Text auf Platz 2 setzte und an Yonder,
bei dem der Text sogar auf Platz 1 kam. Sehr sch&ouml;n wenn man erkennt
da&szlig; die Texte gelesen werden, ich werde jetzt auch mit einer Top 6
anfangen! </p>

<p>Auch werde ich ab jetzt die Briefe an die anderen User immer in einen
Text zusammen legen, alle anderen machen das ja schon seit l&auml;ngerer
Zeit so. Sollte aber mal ein Brief l&auml;nger werden, mache ich ihn wieder
extra. </p>

<a name="top"></a>
<ul>
<li> <a href="#a1"> An Murmel</a></li>
<li> <a href="#a2"> An Charly</a></li>
<li> <a href="#a3"> An Andreas Guldner</a></li>
<li> <a href="#a4"> An Rolf Nue aus Wue</a></li>
<li> <a href="#a5"> An Wolf Zimmer</a></li>
<li> <a href="#a6"> Top 6 der NC 96</a></li>
<li> <a href="#a7"> Top 6 der NC 97</a></li>
</ul>

<hr>

<p><a name="a1"></a> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<b><font size="+1"> Hallo Murmel,</font></b></p>

<p>mir fehlt auch ungef. 1 Million, ich habe aber vergessen wo ich sie das
letzte Mal ablegte:-) </p>

<p>Die Versprechungen von anderen Usern hatte ich auch gelesen, so etwas
wie: Ich werde mich nochmal melden. Und solche Sachen. Mit 2 - 3 Leuten ein
Magazin zu machen, ist nat&uuml;rlich sehr albern. Leider haben die vielen
Fragen nicht geholfen, ich dachte, da&szlig; die Leute wenigstens auf die
Fragen eingehen werden! </p>

<p>Mich nervt die Bastelei am Amiga auch schon lange, wenn man etwas
f&uuml;r den Amiga bekommt, kann man noch lange basteln und hinterher ist
alles so wackelig, da&szlig; ich Angst habe den Amiga mal falsch
anzufassen. Obwohl es vor ein paar jahren noch schlimmer war, dauernd wurde
vom User erwartet da&szlig; er noch Lust hat zu l&ouml;ten. Mir soll es
aber erst einmal egal sein, wenn es nichts neues mehr geben sollte, werde
ich niemals den Amiga mit einem PC emulieren, dann w&auml;re es wirklich
vorbei und ich w&uuml;rde nur noch den PC mit der PC-Software nutzen. Aber
soweit wird es hoffentlich nicht so schnell kommen! Jetzt habe ich es auch
geschafft Heretic-2 zum laufen zu bewegen und das Spiel ist so geil,
dagegen kann man die Playstation wegwerfen:-) </p>

 <p>Noch etwas zum neuen Amiga: <br>

Soweit ich wei&szlig; soll der neue Amiga gerade einmal 300 - 400 Mhz.
haben oder zumindest einer der angek&uuml;ndigten Ger&auml;te
(Pegassos/AmigaOne). Jetzt frage ich Dich was mich dazu bewegen sollte
solch eine lahme Kiste zu kaufen, da warte ich auf eine neue PPC-Karte und
kann damit dann mit einem Amiga aus dem Jahre 1992 den Amiga aus dem Jahr
2002 abziehen. Ist das nicht irgendwie l&auml;cherlich? Gleich werden sich
noch einige Leser aufregen:-) Wenn es nach mir ginge, k&auml;me in einen
neuen Amiga ein AMD oder INTEL Prozessor rein, solange die Software nicht
Windows hei&szlig;t und die alte Amiga-Software l&auml;uft, soll es mir
egal sein !!! Der Schritt vom 68XXX zum PPC war doch auch nichts anderes!
F&uuml;r den PPC (au&szlig;er beim Mac) wird doch sowieso keiner etwas
herstellen, der Amigamarkt ist zu klein, auch in absehbarer Zeit wird sich
daran nichts &auml;ndern. Die PPC Prozessoren die in den Mac kommen und
&uuml;ber 700 Mhz. haben, sind leider auch nicht das neueste, solange es
keinen PPC-Proz. gibt der von der Tacktung her schneller ist als jeder
andere Proz., wird kein PC-ler diesen Proz. ernst nehmen !!! Aber es geht
um die PC-ler, die ja zum Amiga zur&uuml;ck gelockt werden sollen, aber das
wird niemals etwas werden. (Huck ich habe geschrieben!) :-))) Du sollst
aber noch wissen, da&szlig; ich mir wirklich schon lange Gedanken
dar&uuml;ber mache, aber ich komme immer nur zu dem Ergebnis, da&szlig; die
geplanten Sachen, egal von welchem Hersteller, keinen Erfolg haben
k&ouml;nnen. </p>

<p>Dann noch das OS4.0, erst wurde angek&uuml;ndigt, da&szlig; es etwa 50
Euro kosten soll, jetzt ist die Rede von 80 - 90 Euro. Auch wenn man gerne
den Amigamarkt unterst&uuml;tzt, ist doch irgendwann das Geld der User leer
!!! </p>

<p>Hier in der Gegend werden es auch immer mehr Amiganer (kaum zu
glauben?), so da&szlig; ich wenigstens denen noch mit Soft- und
HardwareProblemen helfen kann. Wie langweilig war es vorher, als ich mit
anderen &uuml;ber den Amiga reden wollte und die immer nur so bl&ouml;d
lachten! Da&szlig; es mehr Amiganer werden liegt aber nur daran, da&szlig;
diese Leute irgendwo alte Amigas kaufen, wenn die dann merken, da&szlig;
der Kumpel auch einen Amiga hat, bleiben sie erst einmal dabei. Dies wird
ein Ende finden, wenn der erste Kerl einen PC kauft. </p>

<p>F&uuml;r dieses mal h&ouml;re ich auf zu schreiben und w&uuml;nsche Dir
alles Gute: Poldi </p>

<p>P.S.: Wolltest Du mir nicht nochmal Privat schreiben? </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p><a name="a2"></a> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <b><font
size="+1"> Moin Charly,</font></b></p>

<p>sch&ouml;n da&szlig; Du mir geschrieben hast, darauf mu&szlig; ich Dir
aber noch etwas schreiben. Zwar habe ich ein Modem, aber es ist kein
USB-Modem, sondern ein serielles, da ich kein Festnetztelefon habe, bin ich
auch nicht von Zuhause im Internet. Wenn ich ins Internet will, gehe ich
ins Internetcafe, im Normalfall einmal im Monat. </p>

<p>Zwar k&ouml;nnte ich auch im Internet meine Fragen los werden, aber dann
gibt es einen Text weniger f&uuml;r die NoCover, au&szlig;erdem habe ich es
nicht so eilig und kann schonmal einen Monat warten. </p>

<p>Da bei mir immer die Leistung der Grafikkarte in den Keller geht,
haupts&auml;chlich wenn alle Ger&auml;te im Einsatz sind, kann es nur an
der Stromversorgung des Mediator liegen, mit den anderen Ger&auml;ten habe
ich keinen &Auml;rger, au&szlig;er da&szlig; der Sound von der TV-Karte
erst geht, wenn der Amiga 10 - 15 Min. an war und ich dann einen Reset
machte. Ich glaube auch da&szlig; es nicht die Watt´s sind, sondern eher
die Ampere, leider wei&szlig; ich es aber nicht genau und deshalb wollte
ich es erst mit einem st&auml;rkeren Netzteil testen. Da&szlig; so ein 250
- 300 Watt Netzteil kaum zu finden ist, wei&szlig; ich schon, die einzige
M&ouml;glichkeit w&auml;re dann ein gebrauchtes zu kaufen. An einem
Netzteil w&uuml;rde ich aber niemals herum basteln, ist echt zu
gef&auml;hrlich, schlie&szlig;lich m&ouml;chte ich meinen Amiga noch einige
Zeit behalten. </p>

<p>Zu meinem 040/25 Proz. mu&szlig; ich Dir folgendes schreiben: Im Test
mit SysInfo ist der Proz. 2 mal so schnell wie ein 030/50 (hatte ich auch
schon). Beim arbeiten auf der Workbench merkt man auch den Unterschied, nur
bei meinen Laufwerken ist die &Uuml;bertragungsgeschwindigkeit gesunken.
Die Librarys und Datatypes tauschte ich schon alle aus, aber ohne Erfolg.
Auch den 4-fach-IDE-Adapter tauschte ich vor 2 Wochen aus, alles ohne
da&szlig; sich etwas &auml;nderte! </p>

<p>Oh Oh, die Screenpromoter Progs. kenne ich schon, aber damit geht es
nicht. Diesen Rat gab ich schon dem Rolf Nue! Bei Spielen hat man sehr
selten damit Gl&uuml;ck, deshalb dachte ich da&szlig; jemand einen anderen
Trick kennt. Da meine GraKa. keinen Scandoubler hat, werde ich mir wohl so
ein Ger&auml;t kaufen m&uuml;ssen und dauernd den Monitor umstecken:-( </p>

<p>Nun folgt die obligatorische Fragestellung:-) Mich wundert es da&szlig;
Du es schaffst in Deinen Amiga 256 MB Speicher zu machen, sind die wirklich
mit dem Amiga verbunden oder liegen 128 MB nur im Amiga herum?:-) War nur´n
Witz, aber es interessiert mich wirklich, gab es etwa mal 128 MB PS/2
Module? </p>

<p>Also, soweit ich wei&szlig; hat der Chrism&auml;n das Starmag erfunden
und nicht von einem anderen &uuml;bernommen, aber ab der Ausgabe 22 hat es
der Murmel &uuml;bernommen! </p>

<p>Mach es gut, bis bald! Poldi</p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>


<p><a name="a3"></a> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<b><font size="+1"> Guten Tag Andreas,</font></b></p>

<p>Ach Du Sch..., was Du mir da alles erkl&auml;rst, damit kann ich fast
nichts anfangen. Aber trotzdem, vielen Dank f&uuml;r die Hilfe. Da ich (wie
schon oben geschrieben) nie an Sachen herum experimentiere von denen ich
keine Ahnung habe, dazu z&auml;hlen alle Sachen die mit Strom zu tun haben,
lasse ich lieber die Finger von diesen Netzteilen. Ich wollte nur ein
Netzteil und dieses einbauen, alles andere w&auml;re mir zu
gef&auml;hrlich, unsereins hat so seine Erfahrungen gesammelt, seit ich sah
wie mein Vater die Treppen nach oben flog und ein verbranntes Gesicht hatte
(war das eine Stichflamme, die da aus dem Sicherungskasten kam, Junge
Junge), lasse ich meine unlegalen Finger von Strombasteleien:-) </p>

<p>Zumindest werde ich mich weiterhin nach einem st&auml;rkeren Netzteil
umh&ouml;ren und hoffen da&szlig; alles besser funktioniert. Nur habe ich
wieder mal keine Ahnung warum bei dem Adapterkabel, das ich von KDH
habe, ein Kabel nicht da ist. Das Adapterkabel ist am Netzteil vom
Infinitiv-Tower und zweigt dann ab zu dem Stecker mit P8 und P9, aus 8
Kabeln werden auf einmal 11, aber andere Netzteile mit P8 und P9 haben 12
Kabel!? An P8 fehlt ein Kabel (orange), was mache ich bei einem normalen
AT-Netzteil? Mu&szlig; ich dort das orangene Kabel auch abmachen? </p>

<p>Zu den Spielen: Diese Tips waren schon besser f&uuml;r mich, jetzt
m&uuml;&szlig;te ich nur noch wissen wo ich solch einen Umschalter bekommen
kann? Da ich eine Voodoo habe, ist dort kein Scandoubler dran. Kann man mit
diesem Umschalter zwischen einer Voodoo und dem Scandoubler, der das
Amigasignal verdoppelt, umschalten oder w&auml;re dort noch andere Hardware
notwendig? </p>

<p>Tsch&uuml;&szlig; und eine sch&ouml;ne Zeit noch: Poldi</p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>


<p><a name="a4"></a> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<b><font size="+1"> Gr&uuml;&szlig; Dich Rolf,</font></b></p>

<p>sehr sch&ouml;n da&szlig; ich Dir helfen konnte. Wenn ich wieder mal
jemandem helfen kann, werde ich mich auch melden. Amiganer sollten auch
einen Amiga im Einsatz haben, eine Emulation ist lange noch kein Amiga!
Wollen wir mal hoffen da&szlig; es wirklich bald einen sehr
leistungsf&auml;higen Amiga geben wird, so da&szlig; niemand mehr
gen&ouml;tigt wird eine Emulation zu benutzen. Zumindest benutzt Du jetzt
wieder den Amiga:-) Leider kann ich Dir mit dem Monitor auch nicht helfen,
aber ich kann Dir sagen: Wenn Du noch l&auml;nger den Monitor schlagen
mu&szlig;t, wird es immer schlimmer. Ich hatte auch einen 1438S und
mu&szlig;te wegen dem Wackelkontakt immer &ouml;fter zuschlagen und dann
war er ganz im Eimer:-( Frag doch mal bei DCE nach, die sind doch so gut im
reparieren, Du wirst den Monitor wohl nicht selbst &ouml;ffnen k&ouml;nnen
ohne das Geh&auml;use zu zerst&ouml;ren, bei mir ging es auf jeden Fall
nicht! </p>

<p>Bis zum n&auml;chsten mal: Poldi </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>


<p><a name="a5"></a> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<b><font size="+1"> Halli hallo Wolf,</font></b></p>

<p>jetzt folgt ein kleiner Text von mir zu meiner Rechtschreibung. <br>

Die Regel mit dem s, ss, und &szlig; kenne ich zwar, bin aber immer zu faul
mir dar&uuml;ber Gedanken zu machen. Und mit der Zeichensetzung, gerade die
Kommas, habe ich so meine Probleme, hoffe aber da&szlig; es Dich nicht
wirklich nervt. Bis jetzt kam ich so immer recht gut durch das Leben und
denke da&szlig; ich es auch weiterhin so schaffen werde:-) Au&szlig;erdem
kann ich die Rechtschreibreform nicht leiden, da ich nicht gefragt wurde,
genau wie bei dem doofen Euro, gegen den Euro kann ich mich nicht wehren,
aber gegen die Rechtschreibreform. Mit dieser Reform hat man sich doch den
Anal-phabeten:-) angepasst und das in dem Land der Dichter und Denker!!!
Ich m&ouml;chte jetzt nicht noch weiter in die Politik eingehen, aber Du
solltest wissen da&szlig; ich versuche die neue Rechtschreibung nicht zu
nutzen, au&szlig;er alle Politiker nehmen meine Rechtsprechreform an !:-)
(Wir leben schlie&szlig;lich nicht in einer Diktatur, zumindest nicht
offiziell.) </p>

<p>Du darfst aber weiterhin meine Fehler beseitigen, wenn es Dir Spa&szlig;
macht, dann stehe ich nicht so doof da:-) </p>

<p>Bist oder warst Du eigentlich Lehrer? Das Du f&uuml;r Schulen etwas
machst, hatte ich schon gelesen! </p>

<p>Jetzt noch etwas &uuml;ber meinen Eintrag in der Mitgliederliste: <br>

Irgendwie ist dort etwas durcheinander geraden, eigentlich sollte es anders
aussehen, auch hat sich mal wieder etwas an meinem Amiga ge&auml;ndert:
</p>

<table border=0 cellspacing=3 cellpadding=3 width=100%>
<tr>
 <td width=20>&nbsp;</td>
 <td valign=top> E-Mail: </td>
 <td>Amiga1300@web.de </td><td align=right>Passwort:  **********  (Hahaha)</td>
</tr>
<tr>
 <td></td>
 <td valign=top> Config: </td>
 <td colspan=2> Amiga1300-Infinitiv, PPC-603e/175Mhz.-040/25Mhz, <br>
    146 MB Gesammtspeicher, ZIP-100, ZIP-250, Modem, <br>
    40*CD-ROM, 2,1GB-HD, IDE-Wechselrahmen, Topolino-III, <br>
    Mediator-PCI-Board, USB-Controller, SB-128, Voodoo-3-3000, <br>
    Pinnacle-PCTV-Studio-Pro, Canon-BJC-250, Peacock Monitor. <br>
    (USB-Karte leider noch ohne Treiber.) </td>
</tr>
<tr>
 <td></td>
 <td valign=top> Interessen: &nbsp; &nbsp; </td>
 <td colspan=2> Amiga, Amiga-Guide Bastelleien, Magazine lesen, &uuml;ber den
Amiga reden und schreiben, Videos aller Art gucken. </td>
</tr></table>

<p>Nichts f&uuml;r ungut, aber wenn das mit dem USB-Treiber mitten in der
Configliste steht, sieht es einfach nicht gut aus. Dann nat&uuml;rlich noch
eine Frage:-) Warum kann man ein Rufzeichen angeben, wenn es dann aber
einige nicht benutzen? Jeder kann doch an Hand der Spitznamen ersehen wer
den Text verfasst hat, auch kann man doch einen Link &uuml;ber den
Spitznamen zur Mitgliederliste machen, es w&auml;re doch egal ob der
Realname oder der andere Name darunter steht!? Manchmal komme ich zwar auch
durcheinander, aber ich kann ja nochmal in die Mitgliederliste nachsehen.
</p>

<p>(Falls hier etwas zweideutig zu verstehen sein sollte, auch in allen
anderen Texten, schreibe ich folgendes: Ich mache niemanden an, bitte
versteht alles positiv. Manchmal schreibe ich so bl&ouml;d, wenn ich den
Text hinterher nochmal lese, denke ich selbst schon da&szlig; andere diesen
Text als Anmache deuten k&ouml;nnten!!!) </p>

<p>Tsch&uuml;&szlig;ikowski und bis demn&auml;chst: Poldi </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>


<p><a name="a6"></a> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <b><font
size="+1"> Top 6 der NC 96:</font></b></p>

<p> 1.) DSL, von Higgins </p>

<p> 2.) Epson Drucker, von Higgins </p>

<p> 3.) USB, von Higgins </p>

<p> 4.) Browser von Charly </p>

<p> 5.) Spiele M und P von Andreas Guldner </p>

<p> 6.) Alle anderen Texte </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>


<p><a name="a7"></a> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <b><font
size="+1"> Top 6 der NC 97:</font></b></p>

<p>

<p> 1.) Parnet, von ??? </p>

<p> 2.) Atari, von Rainer Wrieden </p>

<p> 3.) Spiele s1, von Andreas Guldner </p>

<p> 4.) Spiele s2, von Andreas Guldner </p>

<p> 5.) RPG Kampf 9, von Andreas Guldner </p>

<p> 6.) Alle anderen Texte. </p>


<p>Die Letzte Ausgabe war aber nicht gerade sehr voll, da finde ich ja kaum
meine Top 6 zusammen, echt schade. Waren etwa die Ferien daran Schuld? Da
m&uuml;ssen die Ferien eben verboten werden:-) </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>


</td></tr></table>
<br>
</body>
</html>
