<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Heute ist man sogar zum Rechnen zu dumm</title>
</head>
<body background="wolf2.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td width=80> &nbsp; </td><td>
<p align=center><font color="#000080" size="7"><b>Dyskalkulie</b></font></p>

<p><img src="st_dyskalk1.jpg" border=0 height=132 width=118 hspace=6
align=left>Dyskalkulie ist die Bezeichnung f&uuml;r die Unf&auml;higkeit,
einfachste mathematische Zusammenh&auml;nge zu begreifen. Sie ist f&uuml;r
Mathematik das selbe, wie Legasthenie f&uuml;r Lesen und Schreiben. Die
Bezeichnung Dyskalkulie ist insofern problematisch, dass man annehmen
k&ouml;nnte, es handle sich hierbei um eine Krankheit, deren Beseitigung
mit standardisierten Methoden (Medikament&ouml;ser, didaktischer oder
psychologischer Art) m&ouml;glich ist. <b>Dies ist jedoch NICHT der
Fall.</b> Dennoch ist die Dyskalkulie als Krankheitsbild in den
International Catalogue Of Diseases ICD aufgenommen worden, um so eine
rechtliche Grundlage zu schaffen, dass ihre Behandlung grunds&auml;tzlich
auch von Krankenkassen bezahlt werden kann. In Deutschland werden die
Kosten von den Jugend&auml;mtern einiger St&auml;dte und Gemeinden
&uuml;bernommen. </p>

<p><b>Andere Bezeichnungen f&uuml;r Dyskalkulie sind Rechenschw&auml;che
und Arithmasthenie</b>. </p>

<hr width="100%">

<p><b><font size=+1>Ursachen</font></b></p>

<p><img src="st_dyskalk2.jpg" height=262 width=294 align=left hspace=6>Es
gibt zwei Arten von Dyskalkulie. Mit der durch Hirnsch&auml;digung
entstandenen Form, wo bereits vorhandene mathematische F&auml;higkeiten
verlorengegangen sind, will ich mich hier nicht befassen. Von Interesse sei
hier der Fall, da&szlig; mathematische Fertigkeiten bzw. mathematisches
Verst&auml;ndnis erst gar nicht entstanden sind bzw. ist. <br>

Die Ursachen f&uuml;r das <b>Nicht-Erlernen von Rechnen</b> k&ouml;nnen
vielf&auml;ltig sein: <br clear=all>

<ul><li> Wahrnehmungsschwierigkeiten wie schlechtes Augenlicht oder
Schwerh&ouml;rigkeit, unterentwickelter Tastsinn oder mangelnde motorische
F&auml;higkeiten. </li>

<li>Wenn das Kind eine dominante rechte Gehirnh&auml;lfte hat, die
Entfaltung der damit verbundenen Linksh&auml;ndigkeit aber unterdr&uuml;ckt
wurde </li>

<li> Fehlerhafte
sensorische Integration (z.B.: Sich vorstellen, wie ein gef&uuml;hlter
Gegenstand aussieht)  </li>

<li> Wenn das Kind in seiner Entwicklung nicht oder mit ungeeigneten Reizen
konfrontiert war </li>

<li> Wenn das Kind die vorhandenen Reize nicht verarbeiten konnte, weil es
stark emotional beansprucht wurde, z.B. durch Ehestreit oder
Todesf&auml;lle in der Familie </l>

<li> Durch Leistungsdruck aus dem famili&auml;ren Umfeld oder in der Schule.
</li></ul></p>

<hr width="100%">
<p><b><font size=+1>Auswirkungen auf das Kind</font></b></p>

<p>Betroffene Kinder haben verschiedene Arten, mit dem Problem umzugehen.
Viele Kinder entwickeln ausgefeilte <b>Strategien</b>, um ihre Probleme
zu verstecken. Sie reagieren auf leichteste emotionale Regungen, die ihnen
verraten, wann ihr Gegen&uuml;ber mit der pr&auml;sentierten Antwort zufrieden
ist. Sie korrigieren falsche Aussagen geschickt (notfalls mehrmals innerhalb
weniger Sekunden) nach, wenn die Signale des Gespr&auml;chspartners die
Richtigkeit der Aussage nicht best&auml;tigen. </p>

<p>Gravierender sind die <b>oft auftretenden psychischen Probleme</b>,
die sich mehr oder weniger direkt &auml;u&szlig;ern. Um einige Beispiele
zu nennen: Migr&auml;ne, Durchf&auml;lle, Magenprobleme, zunehmende Probleme
in den anderen F&auml;chern in der Schule, Todeswunsch. Diese
 diesbez&uuml;glichen
&Auml;usserungen der Kinder sind durch das Lehrpersonal sehr ernst zu nehmen.
</p>

<hr width="100%">

<p><b><font size=+1>Wie erkenne ich, ob mein Kind betroffen ist?</font></b></p>

<p><img src="st_dyskalk3.jpg" height=139 width=186 align=right> 
Es gibt hier keine sicheren Zeichen, aber eine H&auml;ufung von den
oben aufgelisteten und nachfolgend beschriebenen Symptomen sollte Sie veranlassen,
sich an Die Klassenlehrerin zu wenden, an Eltern mit ebenfalls betroffenen
Kindern (eventuell diagnostiziert, d.h. mit bewiesener Dyskalkulie), oder
andere Fachkundige, z.B. speziell ausgebildeten Psychologen (Schulpsychologischer
Dienst). Auch ich stehe gerne zu Nachfragen zur Verf&uuml;gung, weise aber
darauf hin, dass eine Ferndiagnose nicht zuverl&auml;ssig ist, sondern
lediglich Orientierungshilfe bieten kann. </p>

<p><b>Weitere Symptome von Dyskalkulie</b>: <br>

Die Eltern brauchen recht lange, um dem Kind bei seinen Mathe-Aufgaben zu helfen,
und beim n&auml;chsten Mal ist alles wieder vergessen; Es kommt schnell zum
Streit, wenn man mit dem Kind mathematisch arbeitet; Es lehnt
Baukl&ouml;tze und andere Konstruktionsspielzeuge ab; Es zeigt wenig
Antrieb, selbst daraus Gegenst&auml;nde zu bauen, will sagen: solche, die
nicht in der Bauanleitung gezeigt werden; Es gibt erhebliche
Schwierigkeiten beim R&uuml;ckw&auml;rtsz&auml;hlen, der
R&uuml;ckw&auml;rts-Zehner&uuml;bergang gelingt nicht; Zahlen werden
vertauscht (32 statt 23); Schriftliche Rechnungen der Art 36-31=05;
und viele weitere Beispiele. </p>

<hr width="100%">

<p><b><font size=+1>Die Wahrnehmung der Mathematik durch das Kind
</font></b> </p>

<P>Der Grundstein der Mathematik ist das spontane Erfassen der Anzahl von
Gegenst&auml;nden, das durch darauf spezialisierte Neuronen erfolgt.
Anzahlen von ein bis drei Objekten k&ouml;nnen auch spontan wahrgenommen
werden, w&auml;hrend, wenn man des Z&auml;hlens nicht f&auml;hig ist, 4
Dinge auch wie 3, 5 oder 6 wirken k&ouml;nnen. Man denke nur daran, wie
unm&ouml;glich es ist, zu erkennen, ob da 4 oder 5 Fliegen um die Lampe
fliegen. Anzahlen werden nur grob wahrgenommen. </p>

<p>Z&auml;hlen ist f&uuml;r rechenschwache Kinder blo&szlig; das
zeitgleiche Durchf&uuml;hren eines Abz&auml;hlreims mit einer Zeigehandlung
und dann gelungen, wenn der Lehrer das Ergebnis als richtig bezeichnet.
Warum es wichtig sein soll, ob ein Abz&auml;hlreim bei 23 oder 24 endet,
ist v&ouml;llig unklar, zumal beide Mengen doch gleich aussehen. Addition
wird als Weiterz&auml;hlen "gelernt". Erfolgreiche Rechnungen sind
lediglich feste Algorithmen, die ohne auch nur ein oberfl&auml;chliches
Verst&auml;ndnis f&uuml;r die Funktionszusammenh&auml;nge durchgef&uuml;hrt
wurden. Die Interpretation der Ergebnisse von Rechnungen erfolgt nur in
formelhafter Rezitation von formal gelernten Antworts&auml;tzen der Art
"Zusammen sind es also 18 Bonbons". <b>Kinder bringen es in der formalen
Befolgung von auswendig Gelerntem zu solcher Meisterschaft, dass
Dyskalkulie lange unerkannt bleiben kann. </b> </p>

<hr width="100%">

<p>Dies ist ein Auszug aus einem Vortrag des Herrn Hendrik Simon für
Lehrer/Lehrerinnen der Grundschule. </p>

<center>
<table border="8" width=100% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff"> <td>Autor: &nbsp;<br> <font color="#0000ff">
<b>Wolf Zimmer</font></b> </td> 
<td>E-Mail:<br> <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <br><font color="#0000ff"><b> http://www.wozim.de </font></b>

</td></tr></table>
</td></tr></table>
<br>
</body>
</html>
