<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="6"><b>Neuer Wegweiser
zur Riester-Rente</b></font><br>
<font color="#000080" size="-1">gefunden: www.bdb.de/presse/ </font></p>

<p>Die Bundesregierung hat den Einstieg in die private Altersvorsorge
beschlossen. Den B&uuml;rgern stellen sich nun viele Fragen. <br>
(Hinweis: Hier im Text wurde das Euro-Zeichen verwendet, vormals  ASCII-
Zeichen 164. Wer sein System noch nicht angeglichen hat, muss sich das
Euro-Zeichen denken.) </p>

<p><b>1.&nbsp;Wozu dient das Altersverm&ouml;gensgesetz &uuml;berhaupt?</b>
<br>

Auf Grund der demographischen Entwicklung kann der Staat die
Rentenzahlungen im Umlageverfahren nicht im bisherigen Umfang
aufrechterhalten. Das Versorgungsniveau wird zur&uuml;ckgehen. Mit dem
vorliegenden Gesetz er&ouml;ffnet der Staat die M&ouml;glichkeit, privat
vorzusorgen, und gew&auml;hrt hierf&uuml;r F&ouml;rderungen. Es ist der
Einstieg in die so genannte private kapitalgedeckte Altersvorsorge, bei der
der B&uuml;rger nur f&uuml;r sich selbst spart. </p>

<p><b>2.&nbsp;Worin liegt denn der Vorteil?</b> <br>

Der Vorteil liegt darin, dass ab dem Jahr 2002 f&uuml;r
freiwillige Beitr&auml;ge zur privaten Altersvorsorge Zulagen gezahlt
werden und der Zulageberechtigte die Aufwendungen vom zu versteuernden
Einkommen absetzen kann (vgl. Frage 3).</p>

<p> Die Zulagen steigen parallel zu den freiwilligen Beitr&auml;gen in
jeweils Zwei-Jahres-Schritten an. </p>

<p>Wenn im Jahr 2008 die Vollstufe erreicht ist, betr&auml;gt die
Grundzulage danach pro Jahr 154 ¤ f&uuml;r jeden Steuerpflichtigen,
f&uuml;r ein Ehepaar damit prinzipiell 308 ¤ und f&uuml;r jedes Kind
185 ¤. F&uuml;r ein Ehepaar mit zwei Kindern belaufen sich die Zulagen
danach grunds&auml;tzlich auf 678 ¤. </p>

<p><b>3. &nbsp;Wie erfolgt der Sonderausgabenabzug?</b> <br> Die
freiwilligen Beitr&auml;ge k&ouml;nnen im Rahmen bestimmter
H&ouml;chstgrenzen vom zu versteuernden Einkommen abgesetzt werden. Diese
H&ouml;chstgrenzen betragen: </p>

<p>Die jeweils auf den Vertrag gezahlten Zulagen sind bereits in diesen
Beitr&auml;gen enthalten. Der Sonderausgabenabzug wirkt sich je nach
individuellem Einkommensteuersatz unterschiedlich aus. Es steht dem
Vorsorgesparer frei, ob er &uuml;ber die Zulage hinaus den
Sonderausgabenabzug geltend machen will, je nachdem, was f&uuml;r ihn
g&uuml;nstiger ist. Diese so genannte G&uuml;nstigerpr&uuml;fung wird durch
das Finanzamt vorgenommen und entspricht dem Verfahren bei der Ermittlung
des Kindergeldes. </p>

<p><b>4.&nbsp;Bekommt jeder Vorsorgesparer eine steuerliche
Verg&uuml;nstigung?</b> <br> Grunds&auml;tzlich k&ouml;nnen alle
rentenversicherungspflichtigen Besch&auml;ftigten die steuerlichen
Verg&uuml;nstigungen erhalten. Die Regelungen gelten zudem auch f&uuml;r
Versicherungspflichtige nach dem Gesetz &uuml;ber die Alterssicherung der
Landwirte, die nicht in der gesetzlichen Rentenversicherung
pflichtversichert sind. Auch Beamte, Richter, Soldaten und Bezieher von
Amtsbez&uuml;gen k&ouml;nnen eine F&ouml;rderung erhalten. Voraussetzung
ist allerdings eine Einverst&auml;ndniserkl&auml;rung gegen&uuml;ber der
f&uuml;r die Besoldung oder die Amtsbez&uuml;ge zust&auml;ndigen Stelle zur
Weitergabe der f&uuml;r Ermittlung der Zulagenberechtigung notwendigen
Daten und die maschinelle Verarbeitung durch die Zentrale Zulagenstelle
f&uuml;r Altersverm&ouml;gen (ZfA). Leben Ehegatten zusammen und ist nur
ein Ehegatte durch die F&ouml;rderung beg&uuml;nstigt, so ist auch der
andere Ehegatte berechtigt, Zulagen zu erhalten, wenn ein auf seinen Namen
lautender Altersvorsorgevertrag besteht. Keine steuerliche
Verg&uuml;nstigung erhalten Selbst&auml;ndige und berufsst&auml;ndisch
Versicherte. </p>

<p><b>5.&nbsp;Wie hoch ist der Mindesteigenbeitrag?</b> <br>

Um in den vollen
Genuss der Zulagen zu kommen, muss jeder berechtigte Vorsorgesparer einen
Mindesteigenbeitrag leisten. Dieser betr&auml;gt: <br>

&nbsp;in den Jahren 2002 und 2003 &nbsp;&nbsp;1 % <br>

&nbsp;in den Jahren 2004 und 2005 &nbsp;&nbsp;2 % <br>

&nbsp;in den Jahren 2006 und 2007 &nbsp;&nbsp;3 % <br>

&nbsp;ab dem Jahr 2008 j&auml;hrlich &nbsp;&nbsp;4 % </p>

<p>der im vorangegangenen Kalenderjahr erzielten beitragspflichtigen
Einnahmen, jedoch nicht mehr als die sonderabzugsf&auml;higen Betr&auml;ge
(vgl. Frage 3), jeweils vermindert um die Zulage. Bei Beamten, Richtern und
Soldaten wird die Besoldung, bei Empf&auml;ngern von Amtsbez&uuml;gen
diese, zugrunde gelegt. </p>

<p>Wenn der Vorsorgesparer also im Jahr 2007 35.790 ¤ verdient hat,
betr&auml;gt der Mindesteigen-beitrag f&uuml;r 2008 4 % von 35.790 ¤, also
1.432 ¤. Dieser Betrag liegt auch unter dem sonder-abzugsf&auml;higen
Betrag von 2.100 ¤. Der so errechnete Mindestbetrag vermindert sich um die
gew&auml;hrten Zulagen. Erh&auml;lt ein Ehepaar mit zwei Kindern eine
Zulage in H&ouml;he von 678 ¤, so ist dieser Betrag vom Mindestbetrag
abzuziehen. Die Differenz in H&ouml;he von 754 ¤ ist dann der
Mindesteigenbeitrag, den der Vorsorgesparer auf seinen Vorsorgevertrag
einzahlen muss. Die Zulagen werden von der ZfA an den Anbieter direkt
&uuml;berwiesen, der die Zulage dem Altersvorsorgevertrag gutschreibt. </p>

<p>In jedem Fall muss ein so genannter Sockelbetrag geleistet werden.
Erzielt ein Anspruchs-berechtigter nur ein sehr geringes Einkommen, zum
Beispiel weil er erst zum Ende des Jahres eine Besch&auml;ftigung
aufgenommen hat, muss er diesen Sockelbetrag zahlen. Die Regelung dient
dazu, dass Geringverdiener, die in den Genuss der Zulagen kommen wollen,
zumindest einen kleinen Eigenbetrag leisten. Der Sockelbetrag liegt in den
Jahren 2002 bis 2004 bei 45 ¤ und ab 2005 bei 90 ¤ f&uuml;r Alleinstehende,
f&uuml;r Zulageberechtigte mit einem Kind zun&auml;chst bei 38 ¤ und ab
2005 bei 75 ¤ sowie f&uuml;r Zulageberechtigte mit zwei oder mehr Kindern
in den Jahren 2002 bei 30 ¤, ab dem Jahr 2005 bei 60 ¤. </p>

<p><b>6. &nbsp;Was passiert, wenn ich meinen &nbsp;Mindesteigenbeitrag nicht
oder nur teilweise leiste?</b> <br>

In diesem Fall wird die Zulage nach dem Verh&auml;ltnis der
Altersvorsorgebeitr&auml;ge zum Mindesteigenbeitrag gek&uuml;rzt. Das
bedeutet, dass der Anspruchsberechtigte, der nur 60 % des
Mindesteigenbeitrages geleistet hat, auch nur 60 % der ihm zustehenden
Zulagen erh&auml;lt. </p>

<p><b>7. &nbsp;K&ouml;nnen Beitr&auml;ge zur Verm&ouml;gensbildung f&uuml;r
die staatlich gef&ouml;rderte Altersvorsorge verwendet werden?</b> <br>

Nein. Denn zu den Altersvorsorgebeitr&auml;gen z&auml;hlen keine
Aufwendungen, f&uuml;r die eine Arbeitnehmersparzulage nach dem 5.
Verm&ouml;gensbildungsgesetz gew&auml;hrt wird. Da Beitr&auml;ge nach dem
5. Verm&ouml;gensbildungsgesetz ebenfalls gef&ouml;rdert werden, l&auml;ge
sonst eine nicht zul&auml;ssige Doppelf&ouml;rderung der Beitr&auml;ge vor.
</p>

<p><b>8. &nbsp;Wie bekommt man die Zulage?</b> <br>

Jeder Anspruchsberechtigte muss einen amtlich vorgeschriebenen Vordruck mit
allen wesentlichen Angaben ausf&uuml;llen: unter anderem beitragspflichtige
Einnahmen des Vorjahres, Familienstand, Zahl der Kinder. Diesen reicht der
Vorsorgesparer dem Anbieter von Altersvorsorgeprodukten, also bei einer
Bank, einer Investmentgesellschaft oder einer Versicherung, ein. Alles
Weitere erledigt der Anbieter zusammen mit der neuen Beh&ouml;rde, der ZfA.
Der Zulagebetrag wird dem Altersvorsorgevertrag gutgeschrieben. </p>

<p> Der Anspruchsberechtigte ist dar&uuml;ber hinaus verpflichtet, dem
Anbieter unverz&uuml;glich eine &Auml;nderung der Verh&auml;ltnisse
mitzuteilen, die zu einer Minderung oder zum Wegfall des Zulageanspruchs
f&uuml;hrt (z. B. Scheidung, Wegfall des Kindergeldanspruchs etc.). Er
sollte dar&uuml;ber hinaus auch &Auml;nderungen mitteilen, die zu einer
Erh&ouml;hung des Zulageanspruchs f&uuml;hren (z. B. Geburt eines Kindes).
</p>

<p><b>9. &nbsp;Wer erh&auml;lt die Kinderzulage?</b> <br>

Bei Eltern, die zusammenleben, wird die Kinderzulage der Mutter zugeordnet,
auf Antrag beider Eltern dem Vater. Dieser Antrag kann nur jeweils f&uuml;r
ein Beitragsjahr gestellt und nicht zur&uuml;ckgenommen werden. Leben die
Eltern getrennt, wird die Zulage an den Zulageberechtigten ausgezahlt, der
das Kindergeld erh&auml;lt. </p>

<p><b>10.&nbsp;Welche Angebote wird es geben?</b> <br>

Angeboten werden Investmentfondssparpl&auml;ne, Banksparpl&auml;ne und
Rentenversicherungen. F&uuml;r welches Produkt sich der Vorsorgesparer
entscheidet, h&auml;ngt von der individuellen Lebenssituation ab.
Tendenziell gilt: Banksparpl&auml;ne und klassische Rentenversicherungen
sind f&uuml;r sicherheitsorientierte Anleger empfehlenswert.
Investmentfonds bieten unter Ber&uuml;cksichtigung von Marktschwankungen
die M&ouml;glichkeit langfristig h&ouml;herer Renditen. Es wird sicherlich
Mischprodukte geben, also Investmentfondssparpl&auml;ne mit
Versicherungsbausteinen, und fondsgebundene Rentenversicherungen.
J&uuml;ngere Anleger, die auf eine langfristige Renditeoptimierung Wert
legen, sind gut beraten, am Anfang in Investmentfonds zu investieren. Sie
gehen zwar ein begrenztes Risiko im Hinblick auf die Ertr&auml;ge ein, aber
je l&auml;nger in den Altersvorsorgevertrag eingezahlt wird, desto geringer
wird das Anlagerisiko. </p>

<p><b>11. &nbsp;Ist die Anlage denn sicher? </b><br>

Ja. Alle Anbieter sind gesetzlich dazu verpflichtet, dem Anleger zumindest
die eingezahlten Beitr&auml;ge mit Beginn der Auszahlungsphase zur
Verf&uuml;gung zu stellen. </p>

<p><b>12. &nbsp;Ab wann d&uuml;rfen denn Auszahlungen aus dem
Altersvorsorgeverm&ouml;gen &nbsp;&nbsp;erfolgen?</b> <br>

Fr&uuml;hestens ab dem 60. Lebensjahr. Als Auszahlungsbeginn kann auch der
Zeitpunkt vereinbart werden, zu dem der Vorsorgesparer in den Ruhestand
geht und die gesetzliche Rente oder eine Pension bezieht. </p>

<p><b>13. &nbsp;Kann im Rahmen des Vorsorgevertrages auch eine verminderte
Erwerbsf&auml;higkeit abgesichert werden?</b> <br>

Altersvorsorgeprodukte k&ouml;nnen mit einer Absicherung verminderter
Erwerbst&auml;tigkeit oder der Versorgung von Hinterbliebenen im Todesfall
kombiniert werden. Dies h&auml;ngt von den Bedingungen des jeweiligen
Produktes ab. Auszahlungen aus diesen Versicherungs-vertr&auml;gen
k&ouml;nnen unmittelbar ab Eintritt des versicherten Risikos erfolgen. Bei
der Auswahl eines Produktes ist zu ber&uuml;cksichtigen, dass die
Absicherung dieser so genannten biometrischen Risiken in der Regel die
Rendite des Altersvorsorgeproduktes verringert. Das hat zur Folge, dass
f&uuml;r die reine Alterssicherung zu Beginn der Rente weniger Geld zur
Verf&uuml;gung steht. </p>

<p><b>14. &nbsp;Wie sind die Auszahlungsmodalit&auml;ten? </b><br>

Bei einer Versicherung erh&auml;lt man lebenslang eine gleich bleibende
oder steigende Rente. Bei einem Banksparplan oder einem
Investmentsparvertrag kann ein Auszahlungsplan bis zum 85. Lebensjahr
vereinbart werden. Dar&uuml;ber hinaus muss zu Beginn der Auszahlungsphase
ein Teil des Altersvorsorgeverm&ouml;gens in eine Rentenversicherung
eingezahlt werden, die dem Altersvorsorgesparer ab Vollendung des 85.
Lebensjahres eine gleich bleibende oder steigende lebenslange Leibrente
gew&auml;hrt, die an den Auszahlungsplan nahtlos anschlie&szlig;t. Die
monatlichen Rentenzahlungen m&uuml;ssen mindestens so hoch sein, wie die
letzte monatliche Auszahlung aus dem Auszahlungsplan. Es werden also zu
Lasten des Vorsorgeverm&ouml;gens einerseits bis zum 85. Lebensjahr
monatliche Raten ausgezahlt. Andererseits wird als Einmalzahlung zu Beginn
der Auszahlungsphase Geld an eine Rentenversicherung geleistet, die
ihrerseits die monatlichen Rentenzahlungen ab dem 85. Lebensjahr
garantiert. </p>

<p><b>15. &nbsp;K&ouml;nnen Gelder auch variabel ausgezahlt werden?</b>
<br>

Bei Banksparpl&auml;nen und Investmentsparpl&auml;nen sind in der
Auszahlungsphase - neben betragsm&auml;&szlig;ig zugesagten gleich
bleibenden oder steigenden Teilraten - variable Teilraten
m&ouml;glich. Diese variablen Teilraten bleiben bei der Bestimmung der
H&ouml;he der sp&auml;teren Rentenzahlungen aus der Rentenversicherung
au&szlig;er Betracht. </p>

<p> Mindestens 60 % des bei Beginn der Auszahlungsphase vorhandenen
gef&ouml;rderten Kapitals (mindestens jedoch die Summe der eingezahlten
Altersvorsorgebeitr&auml;ge) m&uuml;ssen f&uuml;r die Zahlung fester oder
steigender monatlicher Raten sowie f&uuml;r den Abschluss der
zus&auml;tzlichen Rente ab dem 85. Lebensjahr verwendet werden. Von den
dar&uuml;ber hinaus m&ouml;glichen variablen Teilraten muss au&szlig;erdem
die H&auml;lfte in regelm&auml;&szlig;ige monatliche Auszahlungen
flie&szlig;en. D. h. maximal 20 % des zu Beginn der Auszahlungsphase
gebildeten gef&ouml;rderten Kapitals k&ouml;nnen auf einmal entnommen
werden. Diese Beschr&auml;nkungen beziehen sich nur auf das aus
gef&ouml;rderten Beitr&auml;gen gesparte Kapital - nicht auf
&Uuml;berzahlungen in Form von nicht gef&ouml;rderten Beitr&auml;gen. <br>
<br>

<b>16. &nbsp;Was passiert, wenn der Vorsorgesparer vor Eintritt in den
Ruhestand verstirbt?</b> <br>

Bei Bank- und Investmentfondssparpl&auml;nen sowie bei Rentenversicherungen
mit Beitragsr&uuml;ckgew&auml;hr gehen die Anspr&uuml;che auf die Erben
&uuml;ber. Jedoch sind die bisher angefallenen steuerlichen Vorteile
zur&uuml;ckzuzahlen, da das Ziel - die Absicherung des Lebensstandards des
Zulageberechtigten im Alter - nicht erreicht werden konnte. Man nennt dies
eine "sch&auml;dliche Verwendung" (vgl. Frage 17). Eine Ausnahme gilt
f&uuml;r zusammenlebende Ehegatten: Wird im Falle des Todes des
Zulageberechtigten das angesparte Altersvorsorgeverm&ouml;gen auf einen auf
den Namen des &uuml;berlebenden Ehegatten laufenden Altersvorsorgevertrag
&uuml;bertragen, kann das Vorsorgeverm&ouml;gen, ohne dass die bislang
angefallenen Ertr&auml;ge zu diesem Zeitpunkt versteuert werden m&uuml;ssen
und ohne die nachteiligen Folgen der "sch&auml;dlichen Verwendung",
&uuml;bertragen werden. </p>

<p><b>17.&nbsp;Was bedeutet "sch&auml;dliche Verwendung"?</b> <br>

Eine "sch&auml;dliche Verwendung" liegt immer dann vor, wenn das angesparte
Verm&ouml;gen im Ergebnis nicht dem Zweck der Sicherung des Lebensstandards
im Alter zugef&uuml;hrt wird. Das ist zum Beispiel der Fall, wenn der
Vorsorgesparer in Notf&auml;llen auf seinen Verm&ouml;gensstock
zur&uuml;ckgreifen muss. Dies ist ihm im Einvernehmen mit dem Anbieter
jederzeit erlaubt, er muss aber dann die auf den Entnahmebetrag anteilig
entfallenen Zulagen und etwa dar&uuml;ber hinausgehende Steuervorteile aus
dem Sonderausgabenabzug an den Staat zur&uuml;ckzahlen. Allerdings braucht
er auf den zur&uuml;ckzuzahlenden Steuervorteil keine Zinsen zu entrichten.
Dar&uuml;ber hinaus sind die in dem auszuzahlenden Betrag enthaltenen
Ertr&auml;ge und Wertsteigerungen als sonstige Eink&uuml;nfte zu
versteuern. (Eine Entnahme aus Kapital, das auf ungef&ouml;rderten
Beitr&auml;gen beruht, ist m&ouml;glich, ohne dass die steuerliche
F&ouml;rderung zur&uuml;ckgezahlt werden muss. Allerdings sind die
Ertr&auml;ge aus ungef&ouml;rderten Beitr&auml;gen bei Auszahlung als
sonstige Eink&uuml;nfte zu versteuern.) </p>

<p><b>18.&nbsp;Was passiert, wenn ich im Alter auswandere
("Mallorca-Rente")?</b> <br>

Endet die unbeschr&auml;nkte Steuerpflicht des Zulageberechtigten durch
Aufgabe des inl&auml;ndischen Wohnsitzes oder gew&ouml;hnlichen
Aufenthalts, gilt dies als "sch&auml;dliche Verwendung". Es erfolgt
allerdings keine R&uuml;ckzahlung der steuerlichen F&ouml;rderung auf einen
Schlag, sondern es werden von jeder monatlichen Zahlung 15 % einbehalten,
bis die staatliche F&ouml;rderung zur&uuml;ckgezahlt ist. Zinsen werden
nicht berechnet. </p>

<p><b>19.&nbsp;Wer ber&auml;t mich beim Abschluss von
Vorsorgevertr&auml;gen?</b> <br>

Sie sind immer gut beraten, mehrere Angebote einzuholen. Ansprechpartner
sind Versicherungen, Kapitalanlagegesellschaften oder Ihre Bank. Wie immer
gilt: Vergleichen Sie die Angebote, und &uuml;berlegen Sie sich vorher,
welches dieser Produkte Ihrem Risikoprofil und Ihren Lebensumst&auml;nden
entspricht. </p>

<p><b>20. &nbsp;Wie kann ich die Altersvorsorgevertr&auml;ge f&uuml;r selbst
genutztes Wohneigentum nutzen?</b> <br>

Jeder darf von seinem gef&ouml;rderten Kapital Betr&auml;ge zwischen 10.000
und 50.000 ¤ entnehmen, um ihn f&uuml;r den Kauf oder Bau einer Wohnung
oder eines Hauses zu eigenen Wohnzwecken zu nutzen. Allerdings sind Anleger
verpflichtet, den entnommenen Betrag bis zur Vollendung des 65.
Lebensjahres wieder zur&uuml;ckzuzahlen. Zur&uuml;ckzuzahlen ist nur der
Kapitalbetrag, keine Zinsen. Die R&uuml;ckzahlung erfolgt mindestens in
gleichen monatlichen Raten bis zum 65. Lebensjahr. Eine h&ouml;here und
damit fr&uuml;here Tilgung ist zul&auml;ssig. Erfolgt keine
vollst&auml;ndige R&uuml;ckzahlung bis zum 65. Lebensjahr, muss der
Vorsorgesparer auch hier anteilig die steuerlichen Vorteile an die
&ouml;ffentliche Hand zur&uuml;ckzahlen. Wer beabsichtigt, sein
Altersvorsorgeverm&ouml;gen vor&uuml;bergehend f&uuml;r die Anschaffung
einer eigenen Wohnung zu nutzen, sollte in Investmentfondssparpl&auml;ne
oder in Banksparpl&auml;ne investieren. Der Vorsorgesparer sollte
allerdings genau rechnen, ob nicht eine Immobilienfinanzierung die bessere
Alternative ist. Denn durch die Entnahme verz&ouml;gert sich der
Verm&ouml;gensaufbau erheblich, da der Hebel der steuerfreien Wiederanlage
der Ertr&auml;ge f&uuml;r den entnommenen Betrag nicht mehr wirkt. </p>

<p><b>21.&nbsp;Was passiert, wenn ich die R&uuml;ckzahlungsraten nicht mehr
aufbringen kann?</b> <br>

Ger&auml;t der Vorsorgesparer mit mehr als dem Gegenwert von zw&ouml;lf
Monatsraten in Zahlungsr&uuml;ckstand, muss er die auf den nicht
zur&uuml;ckgezahlten Betrag entfallenen steuerlichen Vorteile
zur&uuml;ckzahlen (vgl. Frage 17). Dar&uuml;ber hinaus wird ein Betrag
durch Verzinsung (Zins und Zinseszins) des nicht zur&uuml;ckgezahlten
Altersvorsorge-Eigenheimbetrags mit 5 % f&uuml;r jedes volle Kalenderjahr
zwischen dem Zeitpunkt der Verwendung und dem Eintritt des
Zahlungsr&uuml;ckstands errechnet, der im Rahmen der sonstigen
Eink&uuml;nfte mit dem individuellen Steuersatz versteuert wird. Grund
hierf&uuml;r ist, dass durch die Entnahme des Betrages zum Zwecke des
Erwerbs von Wohneigentum der Vorsorgesparer ansonsten f&auml;llige
Kreditzinsen spart, die ihrerseits dem Zinseszinseffekt unterliegen. Da die
R&uuml;ckzahlung der erhaltenen steuerlichen Vorteile zuz&uuml;glich der
fiktiven Besteuerung einen durchaus erheblichen Aufwand darstellt, sollte
der Vorsorgesparer sicherstellen, dass er im Fall des Falles zur
ordnungs-gem&auml;&szlig;en R&uuml;ckzahlung des entnommenen Betrages in
der Lage ist. </p>

<p><b>22.&nbsp;Was geschieht, wenn ich eines Tages diese Wohnung verkaufe oder
nicht &nbsp;&nbsp;mehr selbst nutze?</b> <br>

Dann m&uuml;ssen Sie den entnommenen Betrag binnen eines Jahres wiederum in
eine Wohnung zu eigenen Wohnzwecken investieren oder aber den entnommenen
Betrag auf einen Altersvorsorgevertrag einzahlen. Andernfalls m&uuml;ssen
Sie die erhaltenen steuerlichen Vorteile zur&uuml;ckzahlen (vgl. Frage 17).
</p>

<p><b>23.&nbsp;Was ist eigentlich eine Zertifizierung?</b> <br>

Zum Nachweis der F&ouml;rderf&auml;higkeit von Altersvorsorgeprodukten hat
der Gesetzgeber eine Zertifizierung vorgesehen. Das bedeutet, dass eine
Zertifizierungsstelle beim Bundesaufsichtsamt f&uuml;r das
Versicherungswesen pr&uuml;ft, ob die Altersvorsorgevertr&auml;ge die
gesetzlich vorgeschriebenen Bestandteile enthalten. Nur dieser
vollst&auml;ndige Inhalt wird zertifiziert. Die Zertifizierung bedeutet
nicht, dass die Zertifizierungsstelle die Wirtschaftlichkeit und das
Erreichen eines bestimmten wirtschaftlichen Erfolges garantiert. Das
hei&szlig;t, dass die Zertifizierung kein G&uuml;tesiegel darstellt, da
alle ordnungsgem&auml;&szlig; formulierten Altersvorsorgevertr&auml;ge
zertifiziert werden. Auch im Bereich der Altersvorsorge ist nicht
auszuschlie&szlig;en, dass Anbieter aus dem grauen Kapitalmarkt versuchen,
sich einen Zugang zu dem neuen Gesch&auml;ftssegment zu verschaffen.
Pr&uuml;fen Sie daher die Seriosit&auml;t des Anbieters, und seien Sie
vorsichtig, wenn Sie gebeten werden, Ihr Geld ins Ausland zu
&uuml;berweisen. Pr&uuml;fen Sie genau, wenn Ihnen
&uuml;berm&auml;&szlig;ige Renditen in Aussicht gestellt werden. Auch dies
ist ein Zeichen mangelnder Seriosit&auml;t. Die negativen Erfahrungen, die
im Bereich des Verm&ouml;gensbildungsgesetzes gemacht worden sind, sollten
sich gerade bei der Altersvorsorge nicht wiederholen, da die B&uuml;rger im
Alter auf diese zus&auml;tzliche Einkommensquelle angewiesen sein werden.
</p>

<p><b>24.&nbsp;Ab wann werden Altersvorsorgevertr&auml;ge angeboten?</b>
<br>

Gef&ouml;rdert werden Einzahlungen auf Altersvorsorgevertr&auml;ge, die ab
dem 1. Januar 2002 erfolgen. Es werden heute bereits
Altersvorsorgevertr&auml;ge angeboten. F&uuml;r eilige Entschl&uuml;sse
gibt es allerdings keinen Grund. Ein zu Beginn des Jahres 2002
abgeschlossener Vertrag bietet nicht mehr Vorteile als ein Ende des Jahres
2002 abgeschlossener Vertrag. </p>

<p> Wichtig ist nur, dass im Laufe des Jahres 2002 ein solcher Vertrag
abgeschlossen und der Mindesteigenbeitrag eingezahlt wird. Es empfiehlt
sich daher, mit dem endg&uuml;ltigen Vertragsabschluss zu warten, bis ein
gr&ouml;&szlig;eres Angebot an Produkten verf&uuml;gbar ist, was
m&ouml;glicherweise erst im Laufe des Jahres 2002 der Fall sein wird. Man
sollte daher die Zeit nutzen, die Angebote zu vergleichen. </p>

<p><b>25.&nbsp;Werden auch Altvertr&auml;ge ohne Ausnahme bezuschusst?</b>
<br>

Wenn Altvertr&auml;ge den gesetzlich vorgeschriebenen Kriterien angepasst
werden, werden sie auch bezuschusst. Es ist allerdings nicht davon
auszugehen, dass alle Anbieter bereit sind, Altvertr&auml;ge umzustellen,
da eine solche Umstellung teuer ist. Prinzipiell ist zu empfehlen, die
Altvertr&auml;ge parallel fortzuf&uuml;hren, wenn dies m&ouml;glich ist.
Ist daf&uuml;r die finanzielle Belastung zu hoch, kann man einen Altvertrag
auch ruhen lassen. Bei Lebensversicherungen sollte man dies allerdings nur
dann machen, wenn sie bereits einige Jahre laufen. Durch die Praxis der
Lebensversicherungen, die Kosten zu Beginn des Vertrages zu belasten,
w&uuml;rden bei kurz laufenden Vertr&auml;gen erhebliche Anspruchsverluste
entstehen. </p>

<p><b>26.&nbsp;Kann ich den Anbieter w&auml;hrend der &nbsp;Vertragslaufzeit
wechseln?&nbsp;</b> <br>

Altersvorsorgevertr&auml;ge sind mit einer Frist von drei Monaten zum
Quartalsende k&uuml;ndbar. Die zu diesem Zeitpunkt angesparte Summe muss
jedoch auf einen anderen Altersvorsorge-vertrag &uuml;bertragen werden.
Andernfalls sind die Zulagen oder steuerlichen Vorteile
zur&uuml;ckzuzahlen. Ein Wechsel des Anbieters verursacht Kosten, die dem
Vorsorgesparer in Rechnung gestellt werden k&ouml;nnen. Dar&uuml;ber hinaus
ist darauf zu achten, dass nur der letzte Anbieter vor Eintritt in die
Auszahlungsphase garantiert, dass die bei ihm eingezahlten Beitr&auml;ge
auch tats&auml;chlich zu Beginn der Auszahlungsphase zur Verf&uuml;gung
stehen. Er haftet nicht f&uuml;r etwaige Unterdeckungen aus
Vertragslaufzeiten mit anderen Anbietern. </p>

<p><b>27.&nbsp;Wie viele Vertr&auml;ge kann ich abschlie&szlig;en?</b> <br>

Die Zulage kann f&uuml;r maximal zwei Vertr&auml;ge in einem Jahr beantragt
werden. Sie wird dann entsprechend dem Verh&auml;ltnis der auf diese
Vertr&auml;ge geleisteten Beitr&auml;ge verteilt.<br> <br> Durch amtliche
Bestimmungen zur Konkretisierung des Gesetzes, durch Rechtsverordnungen
oder nachfolgende Gesetzgebungsverfahren k&ouml;nnen noch weitere
&Auml;nderungen bei der F&ouml;rderung der privaten Altersvorsorge
eintreten. </p>

</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>

<br>
</body>
</html>
