<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>SMS die neue Mode</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>SMS-Spr&uuml;che</b></font></p>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Ausreden </font></b></td></tr>
<tr><td width=35 align=right valign=top> 1. </td>
<td> Reden ist Silber, Ausreden sind Gold.</td></tr>
<tr><td width=35 align=right valign=top> 2. </td>
<td> Tut mir leid, der Weckdienst hat verschlafen.</td></tr>
<tr><td width=35 align=right valign=top> 3. </td>
<td> Ich dachte, Zeit w&auml;re Geld hab auf ordentlich Zinzen gehofft.</td></tr>
<tr><td width=35 align=right valign=top> 4. </td>
<td> Sorry ich habe deine s&uuml;&szlig;e SMS so oft durchgelesen, dass ich keine Zeit hatte dir zur&uuml;ckzuschreiben. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Boys</font></b></td></tr>
<tr><td width=35 align=right valign=top> 5. </td>
<td> Aus Jungs werden M&auml;nner - Nur besseres Spielzeug!</td></tr>
<tr><td width=35 align=right valign=top> 6. </td>
<td> Warum feiern wir eigentlich Weihnachten? Es kommt doch an jeden Tag vor, das ein Junge geboren wird, der sich f&uuml;r Gott h&auml;lt ... </td></tr>
<tr><td width=35 align=right valign=top> 7. </td>
<td> Warum kippt eine Mauer um, wenn ein Boy vorbei geht ? Der Kl&uuml;gere gibt nach. </td></tr>
<tr><td width=35 align=right valign=top> 8. </td>
<td> Ein Junge verbraucht beim Orgasmus 2000 Kalorien: 10 beim Orgasmus und 1990 am n&auml;chsten Tag, wenn er damit bei seinen Freunden angibt. </td></tr>
<tr><td width=35 align=right valign=top> 9. </td>
<td> Was stellt sich ein Boy unter dem Vorspiel  vor? Eine halbe Stunde betteln.</td></tr>
<tr><td width=35 align=right valign=top> 10. </td>
<td> In welchen F&auml;llen behaupten Boys, dass Girls nicht logisch denken? Wenn die M&auml;dchen nicht ihrer Meinung sind.</td></tr>
<tr><td width=35 align=right valign=top> 11. </td>
<td> Jungs wollen alle nur das eine! Aber das nicht nur einmal.</td></tr>
<tr><td width=35 align=right valign=top> 12. </td>
<td> Jungs sind auch nicht mehr das, was sie gewesen  sind. </td></tr>
<tr><td width=35 align=right valign=top> 13. </td>
<td> Jungs haben den kleinsten Garten der Welt: eine Karote, zwei kleine Kartoffeln, etwas Petersilie und eine Megafreude, wenn eine Schnecke vorbeikommt. </td></tr>
<tr><td width=35 align=right valign=top> 14. </td>
<td> Es ist bestimmt kein Zufall, dass man als Vogelscheuchen immer M&auml;nner aufstellt. </td></tr>
</table>
 
<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Charmant</font></b></td></tr>
<tr><td width=35 align=right valign=top> 15. </td>
<td> Dies ist eine SMS von jemand, der dich s&uuml;&szlig;, niedlich, nett, super, genial, lieb, sensationell, galaktisch, sexy und scharf findet! </td></tr>
<tr><td width=35 align=right valign=top> 16. </td>
<td> Hi, du warst in der letzten Folge von BBaywatch gro&szlig;artig. </td></tr>
<tr><td width=35 align=right valign=top> 17. </td>
<td> Du wirst von Tag zu Tag h&uuml;bscher... und siehst heute schon aus wie n&auml;chste Woche. </td></tr>
<tr><td width=35 align=right valign=top> 18. </td>
<td> Hallo, l&auml;chle doch mal! Genau so ! Wenn du dich jetzt sehen k&ouml;nntest,w&uuml;sstest du,warum ich dich so mag ! </td></tr>
<tr><td width=35 align=right valign=top> 19. </td>
<td> Als ich dich das erste Mal sah, habe ich mich immer gefragt, woher ich dich kenne? Doch nun wei&szlig; ich es : Du bist das M&auml;dchen meiner Tr&auml;ume! </td></tr>
<tr><td width=35 align=right valign=top> 20. </td>
<td> K&uuml;ssen ist die Zarteste versuchung, seit es deine Lippen gibt! </td></tr>
<tr><td width=35 align=right valign=top> 21. </td>
<td> Guten Morgen, Prinzessin! Bist du heute mit einem L&auml;cheln aufgestanden oder warum scheint &uuml;berall die Sonne? </td></tr>
<tr><td width=35 align=right valign=top> 22. </td>
<td> Hast du Zucker in den Augen, oder bist du Wirklich so S&uuml;&szlig; ? </td></tr>
<tr><td width=35 align=right valign=top> 23. </td>
<td> Bist du eine Au&szlig;erirdische? weil so was sch&ouml;nes kannes auf diesem Planeten nicht geben. </td></tr>
<tr><td width=35 align=right valign=top> 24. </td>
<td> Bitte L&auml;cheln - Klick - Vielen Dank f&uuml;r das s&uuml;&szlig;este Foto der Welt. </td></tr>
<tr><td width=35 align=right valign=top> 25. </td>
<td> Ich habe nie an Engel geglaubt - bis ich dich mit eigenen Augen gesehen habe. </td></tr>
<tr><td width=35 align=right valign=top> 26. </td>
<td> In der Bibel steht, niemand sei vollkommen. Kein Wunder: Vor 2000 Jahren gab es dich ja auch noch nicht. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Denk an Dich</font></b></td></tr>
<tr><td width=35 align=right valign=top> 27. </td>
<td> H.D.G.D.L.F.I.U.E.U.I.M.D.N.V. <br> (Hab dich ganz doll lieb f&uuml;r immer und ewig und ich m&ouml;chte dich nie verlieren!) </td></tr>
<tr><td width=35 align=right valign=top> 28. </td>
<td> Was schaust du mich so an ? Ich bin nur eine kleine SMS, die den Auftrag hat, bei dir mal nach dem Rechten zu sehen. </td></tr>
<tr><td width=35 align=right valign=top> 29. </td>
<td> Kennst du die Mails, die sagen "Ich vermiss dich so sehr." ? Vergiss sie! Ich vermisse dich viel mehr! </td></tr>
<tr><td width=35 align=right valign=top> 30. </td>
<td> Hey Schatz! Egal wie viel Meilen uns auch trennen, ich bin supergl&uuml;cklich dich zu kennen. </td></tr>
<tr><td width=35 align=right valign=top> 31. </td>
<td> Das Mobilnetz - unendliche Weiten. Wir schreiben das Jahr 2002. Dies ist eine SMS, die Kilometer von Funkwellen unterwegs war und das nur, um dir "Hallo" zu sagen. </td></tr>
<tr><td width=35 align=right valign=top> 32. </td>
<td> Hallo mein Schatz, ich hab dich lieb, auch wenn ich lange nicht mehr schrieb. Drum nimm den Text als ein Geschenk, damit du wei&szlig;t, dass ich an dich denke. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Fie&szlig;</font></b></td></tr>
<tr><td width=35 align=right valign=top> 33. </td>
<td> Es gibt eine Liste von Leuten, die schlauer sind als du. Sie hei&szlig;t Telefonbuch. </td></tr>
<tr><td width=35 align=right valign=top> 34. </td>
<td> Ein Freund ist jemand, der dich mag, obwohl er dich kennt. </td></tr>
<tr><td width=35 align=right valign=top> 35. </td>
<td> Du bist so lieb, du bist so nett, doch f&uuml;rs Bett zu fett. </td></tr>
<tr><td width=35 align=right valign=top> 36. </td>
<td> Wenn ich du w&auml;re, w&auml;re ich gerne ich. </td></tr>
<tr><td width=35 align=right valign=top> 37. </td>
<td> Schau mal in den Spiegel, dann wei&szlig;t du warum ich dir eine SMS schreibe und nicht mit dir rede. </td></tr>
<tr><td width=35 align=right valign=top> 38. </td>
<td> Hast du dir wenigsten das Kennzeichen von dem Auto gemerkt, was dir &uuml;bers Gesicht gefahren ist? </td></tr>
<tr><td width=35 align=right valign=top> 39. </td>
<td> Dein Horoskop f&uuml;r n&auml;chste Woche: <br>Geld: Die Sterne l&auml;cheln! <br>Beruf: Die Sterne l&auml;cheln! <br>
Gesundheit: Die Sterne l&auml;cheln! <br>Sex: Die Sterne lachen sich zu Tode! </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Game Over</font></b></td></tr>
<tr><td width=35 align=right valign=top> 40. </td>
<td> Es macht keinen Sinn, dass du das Feld r&auml;umst, wenn du dich Nacht f&uuml;r Nacht in meine Welt tr&auml;umst. </td></tr>
<tr><td width=35 align=right valign=top> 41. </td>
<td> F&uuml;r dich war ich 'ne dumme Kuh, doch der Idiot, der bist jetzt du! du kriegst nie mehr einen Kuss, denn jetzt mach ich mit dir Schluss. </td></tr>
<tr><td width=35 align=right valign=top> 42. </td>
<td> Dich zu lieben ist eine Ehre, dich zu kriegen ein Kampf, dich zu zu verlieren ein Weltuntergang. Dich zu k&uuml;ssen unbeschreiblich, dich zu vergessen unm&ouml;glich. </td></tr>
<tr><td width=35 align=right valign=top> 43. </td>
<td> Dich geliebt zu haben war die sch&ouml;nste Zeit im meinem Leben. Dich immer noch zu lieben ist die schwerste Zeit in meinem Leben. </td></tr>
<tr><td width=35 align=right valign=top> 44. </td>
<td> He du alter Kuhstallbesen, bist einmal mein Schatz gewesen, weil so ein Schatz, wie du es bist, findet man auf jedem Mist. </td></tr>
<tr><td width=35 align=right valign=top> 45. </td>
<td> Wieder eine schlaflose Nacht, wieder nur an dich gedacht, wieder die ganze Nacht geweint, wieder ein Morgen, an dem alles sinnlos scheint: Hab dich Lieb. </td></tr>
<tr><td width=35 align=right valign=top> 46. </td>
<td> Die Tr&auml;nen rollen &uuml;ber mein Gesicht, weil du nicht bei mir bist. Ich wollt du w&auml;rst f&uuml;r immer mein, aber irgendwie sollte es wohl nicht sein. </td></tr>
<tr><td width=35 align=right valign=top> 47. </td>
<td> Du sagtest, ich sei f&uuml;r Dich Luft. Ich wusste gar nicht, wie sehr du mich brauchst. </td></tr>
<tr><td width=35 align=right valign=top> 48. </td>
<td> Fr&uuml;her war ich dein kleiner Teddyb&auml;r. Wir hatten uns Lieb, sogar sehr. Doch pl&ouml;tzlich h&ouml;rte dein Herz auf f&uuml;r mich zu pochen und so hast du meins gebrochen. </td></tr>
<tr><td width=35 align=right valign=top> 49. </td>
<td> Ich f&uuml;hl mich tot, tief in mir drin und nur der Schmerz l&auml;sst mich wissen, dass ich am Leben bin. </td></tr>
<tr><td width=35 align=right valign=top> 50. </td>
<td> Dass du mich so traurig machst, sollte dir zeigen, wie gl&uuml;cklich du mich h&auml;ttest machen k&ouml;nnen </td></tr>
<tr><td width=35 align=right valign=top> 51. </td>
<td> Ein Korb voller Rosen, ein z&auml;rtlicher Kuss, ein Schlag in die Fresse und hiermit ist Schluss. </td></tr>
<tr><td width=35 align=right valign=top> 52. </td>
<td> Sie wurde entdeckt, die Wahre Definition des Wortes LIEBE: Leider Immer eine bittere Ent&auml;uschung. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Happy Birthday</font></b></td></tr>
<tr><td width=35 align=right valign=top> 53. </td>
<td> Ich gratuliere freilich nun zu sp&auml;t, doch schlimmer w&auml;r's, wen ich es gar nicht t&auml;t. Mein Gru&szlig; erf&uuml;llt, so hoff ich immerhin, auch auch so noch seinen Zweck und Sinn. </td></tr>
<tr><td width=35 align=right valign=top> 54. </td>
<td> Weil heute dein Geburtstag ist, da schenk ich dir was Feines: ein K&uuml;sschen auf die Nasenspitz und noch viel Freunde, Kleines. </td></tr>
<tr><td width=35 align=right valign=top> 55. </td>
<td> Geburstagsgr&uuml;&szlig;e kriegst du viele, doch dieser hier besteht aus Liebe. </td></tr>
<tr><td width=35 align=right valign=top> 56. </td>
<td> Nach einem Gl&uuml;ckwunsch ist mir zu Mute, ich gratuliere herzlich: alles Gute. </td></tr>
<tr><td width=35 align=right valign=top> 57. </td>
<td> Du denkst wohl, du bist etwas Besonderes, weil du heute Geburtstag hast? Du bist doch jeden Tag was Besonderes! HAPPY BIRTHDAY. </td></tr>
<tr><td width=35 align=right valign=top> 58. </td>
<td> 160 kleine Zeichen, die dich mit dieser Mail ereichen, wollen dich heut herzlich gr&uuml;&szlig;en, um dir den Geburtstag zu vers&uuml;&szlig;en. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> I Love You </font></b></td></tr>
<tr><td width=35 align=right valign=top> 59. </td>
<td> Liebe ist das einzige Spiel, bei dem es zwei gl&uuml;ckliche Gewinner gibt. M&ouml;chtest du mein Gegner sein? </td></tr>
<tr><td width=35 align=right valign=top> 60. </td>
<td> Wenn ich nicht mit diesem l&auml;cherlichen 160 Zeichen ausdr&uuml;cken k&ouml;nnte, was ich f&uuml;r dich empfinde... w&auml;ren wir dann nicht beide entt&auml;uscht?! </td></tr>
<tr><td width=35 align=right valign=top> 61. </td>
<td> Ich wollte dir was sagen: Hab es vergesen, Dich hat's betroffen, Lieb war's gemeint. </td></tr>
<tr><td width=35 align=right valign=top> 62. </td>
<td> Sie liebt mich, sie liebt mich nicht... Komm lieber schnell, bevor alle meine Blumen dran glauben m&uuml;ssen. </td></tr>
<tr><td width=35 align=right valign=top> 63. </td>
<td> Ich mag dich Tag um Tag, auch wenn ich's nicht pers&ouml;nlich sag! Eine SMS, das find ich besser - sie wird nicht rot und wirkt viel besser. </td></tr>
<tr><td width=35 align=right valign=top> 64. </td>
<td> Ich fand durch dich das wahre Gl&uuml;ck, durch Liebe auf den ersten Blick. </td></tr>
<tr><td width=35 align=right valign=top> 65. </td>
<td> Bist du gl&auml;ubig? Du bist n&auml;mlich die Antwort auf meine Gebete. </td></tr>
<tr><td width=35 align=right valign=top> 66. </td>
<td> Hi Schatz! H&auml;tte eigentlich den Nobelpreis verdient, hab n&auml;mlich den Sinn des Lebens gefunden... Dich </td></tr>
</table>
     
<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Jokes</font></b></td></tr>
<tr><td width=35 align=right valign=top> 67. </td>
<td> Mann und Frau im Bett. Sagt sie: "W&auml;r das sch&ouml;n, wenn du jetzt geil w&auml;rst." Sagt er: "W&auml;r das geil, wenn du sch&ouml;n w&auml;rst." </td></tr>
<tr><td width=35 align=right valign=top> 68. </td>
<td> W&uuml;rdest du mit mir schlafen? F&uuml;r 100 Euro? Nein? F&uuml;r 50 Euro? Nein? Bitte, bitte, ich brauche das Geld. </td></tr>
<tr><td width=35 align=right valign=top> 69. </td>
<td> Ich will dich - will dich ins Bett zerren, dich so lange bel&auml;stigen, bis du zitterst. Dein K&ouml;rper soll brennen. In Liebe deine Grippe. </td></tr>
<tr><td width=35 align=right valign=top> 70. </td>
<td> Werter Handy benutzer Sie haben soeben einen gravierenden Fehler begangen und eine v&ouml;llig sinnlose SMS gelesen. </td></tr>
<tr><td width=35 align=right valign=top> 71. </td>
<td> Umfrage: Finden sie, dass es zu viele Ausl&auml;nder in Deutschland gibt? 20 % antworten Ja, 10 % Nein und 70 % mt: G&ouml;t&uuml;m&uuml;  siktir lan. (Leck mich am Arsch) </td></tr>
<tr><td width=35 align=right valign=top> 72. </td>
<td> Achtung diese SMS dient nur zur Einspeicherung einer liebensw. Person in die Ged&auml;chtniszentrale des Empf&auml;ngers. Ein L&auml;cheln signalisiert erfolgreiche Speicherung. </td></tr>
<tr><td width=35 align=right valign=top> 73. </td>
<td> Wolltest du schon immer ein Popstar werden? Stell dich heut um 20 Uhr im Bikini vor die T&uuml;r. Unsere Sateliten nehmen dich auf und senden dein Bild zum Casting. </td></tr>
<tr><td width=35 align=right valign=top> 74. </td>
<td> Sehr geehrter Handykunde, sie sind auf Grund eines technischen Defektes nicht erreichbar. Bitte stellen  sie ihr Handy senkrecht und setzen sie sich drauf. Danke </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Kuss</font></b></td></tr>
<tr><td width=35 align=right valign=top> 75. </td>
<td> Gestern ging ich nach Hause, stieg die T&uuml;r hinauf, schloss die Treppe auf, &ouml;ffnete das Licht, rauchte den Schlafanzug, l&ouml;schte das Bett. Und alles wegen Deinem Kuss </td></tr>
<tr><td width=35 align=right valign=top> 76. </td>
<td> Du kannst mich mal kreuzweise... knutschen. Freu mich drauf. </td></tr>
<tr><td width=35 align=right valign=top> 77. </td>
<td> Weil du zum verlieben bist und k&uuml;ssen etwas sch&ouml;nes ist, send ich dir zur Abendruh 1000 K&uuml;sse gratis zu. </td></tr>
<tr><td width=35 align=right valign=top> 78. </td>
<td> Hier ein Gru&szlig; aus weiter Ferne, denn ich hab dich ziemlich gerne. Und weil ich so doll an dich denken muss, kriegste auch noch einen Kuss. </td></tr>
<tr><td width=35 align=right valign=top> 79. </td>
<td> Hast du das Piepsen schon vernommen? Richtig, eine SMS ist gekommen. Mitgeschickt hab ich dir einen Kuss, weil ich gerade ganz doll an dich denken muss. </td></tr>
<tr><td width=35 align=right valign=top> 80. </td>
<td> Deine Arme will ich sp&uuml;ren, Dich zum Mittelpunkt der Erde f&uuml;hren, per SMS lass ich dich wissen, wie sch&ouml;n es w&auml;re, dich zu k&uuml;ssen. </td></tr>
<tr><td width=35 align=right valign=top> 81. </td>
<td> Gute Nacht zu sagen ist nicht schwer, doch es dir zu zu schreiben umso mehr. Ein K&uuml;sschen wollte ich Dir noch schicken, doch mein Handy machte Zicken. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Lehrer &amp; CO.</font></b></td></tr>
<tr><td width=35 align=right valign=top> 82. </td>
<td> Lehrer haben nur 2 Fehler: Alles, was sie sagen, und alles, was sie tun! </td></tr>
<tr><td width=35 align=right valign=top> 83. </td>
<td> Je bekloppter, desto Lehrer </td></tr>
<tr><td width=35 align=right valign=top> 84. </td>
<td> Die ganze Welt ist ein Irrenhaus, und die Schule ist die Zentrale. </td></tr>
<tr><td width=35 align=right valign=top> 85. </td>
<td> Viel Gl&uuml;ck bei deiner Pr&uuml;fung. Ich dr&uuml;cke dir alle Tasten. Und wenn du Hilfe brauchst, schick SOS per SMS. </td></tr>
<tr><td width=35 align=right valign=top> 86. </td>
<td> Mathe ist wie eine verschmutzt Brille: Keiner blickt durch. </td></tr>
<tr><td width=35 align=right valign=top> 87. </td>
<td> Lehrer sind Dealer. Sie sind immerzu bem&uuml;ht, den Stoff rasch an den Mann zu bringen. </td></tr>
<tr><td width=35 align=right valign=top> 88. </td>
<td> Im Falle eines Falles ist Schummeln wirklich alles. </td></tr>
<tr><td width=35 align=right valign=top> 89. </td>
<td> Unser Lehrer hat von nichts 'ne Ahnung. Dauernd fragt er uns. </td></tr>
<tr><td width=35 align=right valign=top> 90. </td>
<td> Ich mach mir meine Katastrophen selber, ich brauche kein Zeugnis. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> M&auml;dchen</font></b></td></tr>
<tr><td width=35 align=right valign=top> 91. </td>
<td> Vorladung! Finden sie sich umgehend bei mir ein, zwecks sex und so! Grund: Sehnsucht in ungesetzlich hohem Ma&szlig;e. </td></tr>
<tr><td width=35 align=right valign=top> 92. </td>
<td> Ich finde, dass sich dein T-Shirt sehr gut auf meinem Schlafzimmerboden machen w&uuml;rde. </td></tr>
<tr><td width=35 align=right valign=top> 93. </td>
<td> Jungs k&ouml;nnen trinken, ohne durst zu haben, M&auml;dchen k&ouml;nnen reden, ohne ein Thema zu haben. </td></tr>
<tr><td width=35 align=right valign=top> 94. </td>
<td> Frauen sind das starke Geschlecht. Wie sonst sollten sie die Einkaufst&uuml;ten tragen. </td></tr>
<tr><td width=35 align=right valign=top> 95. </td>
<td> M&auml;dchen versteht man nicht, man liebt sie. </td></tr>
<tr><td width=35 align=right valign=top> 96. </td>
<td> Warum gibt es mehr M&auml;dchen als Jungs auf der Welt? Weil es mehr zu putzen als zu denken gibt. </td></tr>
<tr><td width=35 align=right valign=top> 97. </td>
<td> M&auml;dchen sind wie Milcht&uuml;ten: schwer aufzurei&szlig;en und schnell sauer. </td></tr>
<tr><td width=35 align=right valign=top> 98. </td>
<td> Mein Herz hast du gefangen. Ich hab nach dir Verlangen. Will dich sp&uuml;ren und ber&uuml;hren. Du darfst mich auch verf&uuml;hren. </td></tr>
<tr><td width=35 align=right valign=top> 99. </td>
<td> Darf ich meine Spiegeleier auf deinem hei&szlig;en Hintern braten? </td></tr>
<tr><td width=35 align=right valign=top> 100. </td>
<td> Gedicht von ich f&uuml;r dir: Indem ich sag, ich liebe dir, weil du bist mein Kuscheltier. Ich hab gedacht, wenn ich dich was schicken, kann ich mit dich heut Abend... </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Na, na, na </font></b></td></tr>
<tr><td width=35 align=right valign=top> 101. </td>
<td> Lass mich dein Eisw&uuml;rfel sein, der an deinem K&ouml;rper heruntergleitet, der deinen Bauchnabel liebkost, um dann in deinem Scho&szlig; zu sterben. </td></tr>
<tr><td width=35 align=right valign=top> 102. </td>
<td> Ich sorg f&uuml;r das Prickeln im Bauch. Sorgst du f&uuml;r den Sekt im Bauchnabel. </td></tr>
<tr><td width=35 align=right valign=top> 103. </td>
<td> Hab schon Gummis in den Taschen und hoffe, du wirst schreiben, wann wir uns aneinander reiben und uns ganz und gar vernaschen. </td></tr>
<tr><td width=35 align=right valign=top> 104. </td>
<td> Ich hoffe, du hast eine gute Haftpflichtversicherung, denn die Beule in meiner Hose bist du verantwortlich. </td></tr>
<tr><td width=35 align=right valign=top> 105. </td>
<td> Ich bin neu in der Stadt. Kannst du mir vielleicht den Weg in deine Wohnung zeigen. </td></tr>
<tr><td width=35 align=right valign=top> 106. </td>
<td> Ich w&auml;re gerne der Grund f&uuml;r deine n&auml;chste schlaflose Nacht. </td></tr>
<tr><td width=35 align=right valign=top> 107. </td>
<td> Seltsam, ich f&uuml;hle mich irgendwie von dir angezogen. Ehrlich gesagt: Von dir ausgezogen, w&auml;re auch nicht schlecht. </td></tr>
<tr><td width=35 align=right valign=top> 108. </td>
<td> Ist dein Bett mal wieder frei, ruf mich an, ich komm vorbei. Dann poppen wir die ganze Nacht... Ups, ich hab nur Spa&szlig; gemacht. </td></tr>
<tr><td width=35 align=right valign=top> 109. </td>
<td> Die &uuml;berm&auml;&szlig;ige Hyperaphrodisie f&uuml;hrt zum Bestreben einer Promiskuit&auml;t, die wiederum das libidin&ouml;se Kopulieren unterst&uuml;tzt. Kurz: &auml;h, 'tschuldigung, poppen? </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Ohne Dich </font></b></td></tr>
<tr><td width=35 align=right valign=top> 110. </td>
<td> Mit deinen Lippen stimmt was nicht, sie liegen nicht auf meinen. </td></tr>
<tr><td width=35 align=right valign=top> 111. </td>
<td> Sprich nie ein hartes Wort, womit du jemanden kr&auml;nkst. Du trifffst vielleicht sein Herz viel tiefer, als du denkst. </td></tr>
<tr><td width=35 align=right valign=top> 112. </td>
<td> Platsch! Das war eine faule Tomate. Sie hat dich getroffen, weil du auf eine SMS nicht geantwortet hast. Also schreib zur&uuml;ck, sonst kommt noch mehr Obst. </td></tr>
<tr><td width=35 align=right valign=top> 113. </td>
<td> Warum blicke ich traurig ins Leere, warum weine ich Tr&auml;nen wie Meere? Warum sind in meinem Herzen Risse? Warum wohl? Weilich ich dich vermisse. </td></tr>
</table>
 
<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> PFUI</font></b></td></tr>
<tr><td width=35 align=right valign=top> 114. </td>
<td> Ich bin nicht so sch&ouml;n wie Brad Pitt, ich bin nicht so stark wie Arnold Schwarzenegger, aber ich lecke wie Lassie. </td></tr>
<tr><td width=35 align=right valign=top> 115. </td>
<td> Was auch immer Drogen bei dir ausl&ouml;sen... ich kann es mit meiner Zunge. </td></tr>
<tr><td width=35 align=right valign=top> 116. </td>
<td> Der Unterschied zwischen Erotik und Perversion: Erotisch ist, wenn man eine Frau mit einer Feder zum Orgasmus bringt. Pervers ist, wenn das Huhn noch dranh&auml;ngt. </td></tr>
<tr><td width=35 align=right valign=top> 117. </td>
<td> Am Mo von hinten, am Di von vorn, am Mi mit Liebe, am Do mit Zorn, am Fr ganz langsam, Am Sa ganz schnell, selbst am So streich ich meiner Katze &uuml;bers Fell. </td></tr>
<tr><td width=35 align=right valign=top> 118. </td>
<td> M&auml;nner denken immer nur an ihren Schwanz! Echt? Soll ich dir mal zeigen was ich denke? </td></tr>
<tr><td width=35 align=right valign=top> 119. </td>
<td> Schallo Hatzi, m&ouml;geln v&ouml;chte ich, bis der Vipfel zibriert, die Schotze Flottert und die Witten tackeln, du seile Gau. </td></tr>
<tr><td width=35 align=right valign=top> 120. </td>
<td> Hey S&uuml;&szlig;e, hast du mal 15 Minuten Zeit und 20 Zentimeter Platz? </td></tr>
<tr><td width=35 align=right valign=top> 121. </td>
<td> Laut neuster Umfrage sind Polen die besten Liebhaber und Indianer die mit den gr&ouml;&szlig;ten Dingern. Mfg Winnetou Kowalsky. </td></tr>
</table>              

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Quatsch</font></b></td></tr>
<tr><td width=35 align=right valign=top> 122. </td>
<td> Mir ist so langweilig. K&ouml;nnen wir nicht mal wieder jemanden eine SMS schicken?  Dein Handy </td></tr>
<tr><td width=35 align=right valign=top> 123. </td>
<td> Achtung dies ist eine Bombendrohung! Legen sie ihr Handy auf die Stra&szlig;e und entfernen sie sich umgehend! ...endlich allein! Dein Handy. </td></tr>
<tr><td width=35 align=right valign=top> 124. </td>
<td> 1, 2, 3, 4, A, B, C, D - dies war der erste Teil der SMS f&uuml;r Grundsch&uuml;ler. Du wirst sie in den n&auml;chsten Tagen &ouml;fter bekommen, um den vers&auml;umten Stoff nachzuholen. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Richtig Frech </font></b></td></tr>
<tr><td width=35 align=right valign=top> 125. </td>
<td> Ich w&uuml;rde gerne mit dir Fr&uuml;hst&uuml;cken! Darf ich dich zum Abendessen einladen? </td></tr>
<tr><td width=35 align=right valign=top> 126. </td>
<td> Viele Gr&uuml;&szlig;e aus Spanien! Wenn diese SMS zeigen k&ouml;nnte, wer sich gerade neben mir in der Sonne r&auml;kelt, w&uuml;rdest du mich hassen. Alles Gute. </td></tr>
<tr><td width=35 align=right valign=top> 127. </td>
<td> Endlich! Der passende Mann zu meiner Bettw&auml;sche. </td></tr>
<tr><td width=35 align=right valign=top> 128. </td>
<td> Gutschein f&uuml;r 100-mal Po streicheln, 100-mal geil anfassen, einmal Hemd zerrei&szlig;en, 200-mal wild knutschen. Einl&ouml;sbar gegen Vorlage dieser SMS! </td></tr>
<tr><td width=35 align=right valign=top> 129. </td>
<td> Sag mir, falls ich mich irre - Aber du willst mich k&uuml;ssen, oder ? </td></tr>
<tr><td width=35 align=right valign=top> 130. </td>
<td> Liege im Bett und w&auml;r &uuml;ber einen obsz&ouml;nen Anruf von dir nicht emp&ouml;rt... </td></tr>
<tr><td width=35 align=right valign=top> 131. </td>
<td> Hey Baby, ich bin Schriftsteller. Ich schreibe gerade an einem Telefonbuch. Kann ich deine Nummer haben? </td></tr>
<tr><td width=35 align=right valign=top> 132. </td>
<td> Nicht, dass du denkst, ich will mit dir ins Bett - der K&uuml;chentisch reicht mir auch. </td></tr>
<tr><td width=35 align=right valign=top> 133. </td>
<td> Kennen wir uns nicht zuf&auml;llig? Ich glaube, ich habe dich letztens in meinen Tr&auml;umen getroffen. </td></tr>
</table>
          
<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Schlaf gut</font></b></td></tr>
<tr><td width=35 align=right valign=top> 134. </td>
<td> Warte... warte... nicht einschlafen, ich will dir noch eine gute Nacht und s&uuml;&szlig;e Traume w&uuml;nschen. </td></tr>
<tr><td width=35 align=right valign=top> 135. </td>
<td> Der Bundesbauminister warnt: Allein zu schlafen F&ouml;rdert Wohnungsnot! </td></tr>
<tr><td width=35 align=right valign=top> 136. </td>
<td> Guten Morgen, hier spricht der Fr&ouml;hliche Weckdienst! Wollte nur fragen ob du auch nicht mehr schlafen kannst? </td></tr>
<tr><td width=35 align=right valign=top> 137. </td>
<td> Schlaf sch&ouml;n ! Aber bitte allein ! </td></tr>
<tr><td width=35 align=right valign=top> 138. </td>
<td> Beep! Ich bin ein Gute-Nacht-Bussi! Mein Absender w&uuml;nscht Dir mit mir eine gute Nacht. *Schmatz* Schlaf gut. </td></tr>
<tr><td width=35 align=right valign=top> 139. </td>
<td> Ein Kleines Schaf h&uuml;pft &uuml;bern Zaun, w&uuml;nscht dir einen s&uuml;&szlig;en Traum.Sch&ouml;neTr&auml;ume, gute Nacht, bis das Morgenlicht erwacht. </td></tr>
<tr><td width=35 align=right valign=top> 140. </td>
<td> Wenn du im Bett liegst heute Nacht und hast deine Augen zugemacht, dann k&uuml;sst ein Engel deine Lider. Tr&auml;um was Sch&ouml;nes, ich mail dir wieder. </td></tr>
<tr><td width=35 align=right valign=top> 141. </td>
<td> Jetzt zu dieser Stund, kommt einfach so und und ohne Grund, ein kleiner Gru&szlig; zur guten Nacht, denn ich hab ganz fest an dich gedacht. </td></tr>
<tr><td width=35 align=right valign=top> 142. </td>
<td> Mein kleiner Engel schlaf nun ein, ich werde immer bei dir sein. Egal ob nah, egal ob fern, es bleibt dabei: Ich hab dich gern... Tr&auml;ume s&uuml;&szlig;. </td></tr>
<tr><td width=35 align=right valign=top> 143. </td>
<td> Ich bin eine Kurznachricht, die dir eine gute Nacht verspricht, die sch&ouml;nsten Tr&auml;ume zu dir lenkt und sagt, dass jemand an dich denkt. Schlaf gut. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Treffen</font></b></td></tr>
<tr><td width=35 align=right valign=top> 144. </td>
<td> Kommst du auch zu meinem Rendezvous mit dir?</td></tr>
<tr><td width=35 align=right valign=top> 145. </td>
<td> Weil du ein prima Kumpel bist, mit dem man gerne zusammen is(s)t, lade ich dich hermit ein, heut Abend mein Gast zu sein. </td></tr>
<tr><td width=35 align=right valign=top> 146. </td>
<td> Hast du mal einen Stift? Ich m&ouml;chte mir deine Nummer aufschreiben. </td></tr>
<tr><td width=35 align=right valign=top> 147. </td>
<td> Dies ist eine geheime Nachricht aus dem 7. Himmel. Wenn du mit dem Absender dieser SMS ausgeht, werden dir drei W&uuml;nsche erf&uuml;llt. </td></tr>
<tr><td width=35 align=right valign=top> 148. </td>
<td> Wir treffen uns im Liebesnest, mach du f&uuml;r uns den Zeitpunkt fest. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Unzertrennlich</font></b></td></tr>
<tr><td width=35 align=right valign=top> 149. </td>
<td> Erkl&auml;r mir meine Rechte, sperr mich ein - ich will von dir verhaftet sein. </td></tr>
<tr><td width=35 align=right valign=top> 150. </td>
<td> Man muss sich im Leben so viel und so oft entscheiden. Wenigsten hast du mir die Wahl der besten Freundin abgenommen </td></tr>
<tr><td width=35 align=right valign=top> 151. </td>
<td> Wo immer du bist, was immer du tust, ob du lachen oder weinen musst, ob dich jemand liebt, oder alle dich hassen, auf mich kannst du dich immer verlassen. </td></tr>
<tr><td width=35 align=right valign=top> 152. </td>
<td> Die wichtigsten Dinge des Lebens sollte man immer bei sich haben: Ich frag mich nur, wie ich dich inn meinen Rucksack stopfen soll ? </td></tr>
<tr><td width=35 align=right valign=top> 153. </td>
<td> Ist bei dir der Ofen aus und wei&szlig;t du nicht mehr ein noch aus, egal welchen Kummer: Hier hast du meine Nummer. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Verzeih mir</font></b></td></tr>
<tr><td width=35 align=right valign=top> 154. </td>
<td> Irren ist menschlich. Aber wenn man richtig Mist bauen will, schickt man eine SMS.</td></tr>
<tr><td width=35 align=right valign=top> 155. </td>
<td> Es tut mir leid, das habe ich nie gewollt. Das sagt die Tr&auml;ne, die mir &uuml;ber das B&auml;ckchen rollt. Nie wieder werde ich das machen, denn wir d&uuml;rfen uns nicht verkrachen. </td></tr>
<tr><td width=35 align=right valign=top> 156. </td>
<td> Nun sitze ich hier und kann dich nicht vergessen. Hast doch gerade noch neben mir gesessen. Nun bin ich wieder ganz allein und frage mich, muss das sein? </td></tr>
<tr><td width=35 align=right valign=top> 157. </td>
<td> Im Bett ein hei&szlig;er Schlummer-Kuss macht mit dem schlimmsten Kummer Schluss. Darf ich doch noch vorbeikommen? </td></tr>
<tr><td width=35 align=right valign=top> 158. </td>
<td> Wer nachtragend ist, hat viel zu schleppen. Sorry, hab's nicht so gemeint... </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Weisheiten</font></b></td></tr>
<tr><td width=35 align=right valign=top> 159. </td>
<td> Sich Sorgen machen hei&szlig;t die Wolken von morgen &uuml;ber die Sonne von heute ziehen. </td></tr>
<tr><td width=35 align=right valign=top> 160. </td>
<td> Lebe immer first class - sonst tuns deine Eltern! </td></tr>
<tr><td width=35 align=right valign=top> 161. </td>
<td> Gl&uuml;ck ist das einzige, was sich verdoppelt, wenn man es teilt. </td></tr>
<tr><td width=35 align=right valign=top> 162. </td>
<td> Nimm dir Zeit f&uuml;r Deine Freunde, sonst die Zeit dir die Freunde. </td></tr>
<tr><td width=35 align=right valign=top> 163. </td>
<td> Den Klugen erkennt man daran, dass er rechtzeit den Mund schlie&szlig;t. </td></tr>
<tr><td width=35 align=right valign=top> 164. </td>
<td> Warte nicht auf das gro&szlig;e Wunder, sonst verpasst du viele kleine. </td></tr>
<tr><td width=35 align=right valign=top> 165. </td>
<td> Wer keine Freunde in der Welt hat, an dem hat die Welt auch keine Freude. </td></tr>
<tr><td width=35 align=right valign=top> 166. </td>
<td> Wer in die Fu&szlig;tapfen anderer tritt, hinterl&auml;sst keine eigenen. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Xtra</font></b></td></tr>
<tr><td width=35 align=right valign=top> 167. </td>
<td> Dir geh&ouml;ren dein 1. Gedanke am Morgen und dein letzter Gedanke am Abend... und einige ziemlich hei&szlig;e Gedanken dazwischen. </td></tr>
<tr><td width=35 align=right valign=top> 168. </td>
<td> Ich verbringe den ganzen Tag damit, an die halben N&auml;chte mit dir zu denken. </td></tr>
<tr><td width=35 align=right valign=top> 169. </td>
<td> Meinen n&auml;chsten will ich schon lieben, aber nicht den N&auml;chstbesten. </td></tr>
<tr><td width=35 align=right valign=top> 170. </td>
<td> Was ist das gute am Regen? Die Frauen werden von alleine feucht. </td></tr>
<tr><td width=35 align=right valign=top> 171. </td>
<td> M&auml;dchen lieben die einfachen Dinge im Leben - z.B. Jungs wie dich. </td></tr>
<tr><td width=35 align=right valign=top> 172. </td>
<td> Ich bin f&uuml;r das verantwortlich, was ich sage, nicht f&uuml;r das, was du verstehst. </td></tr>
<tr><td width=35 align=right valign=top> 173. </td>
<td> Fr&uuml;her war ich nur eingebildet. Heute wei&szlig; ich, dass ich sch&ouml;n bin. </td></tr>
<tr><td width=35 align=right valign=top> 174. </td>
<td> Ich muss dir was sagen, ich sp&uuml;r es im Bauch. Ich trau mich nicht zu fragen, magst du mich auch? </td></tr>
<tr><td width=35 align=right valign=top> 175. </td>
<td> Ein Hab-dich-lieb mit vielen Gr&uuml;&szlig;en soll dir den Tag vers&uuml;&szlig;en. Mit einem Bussi niedlich klein, wird dein Tag heut sicher sein. </td></tr>
</table>

<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Young Love</font></b></td></tr>
<tr><td width=35 align=right valign=top> 176. </td>
<td> Guten Morgen Schlafm&uuml;tze, hier sende ich dir eine Spitzenlaune-sch&ouml;ner-Tag-rundum-gl&uuml;cklich-Wohlf&uuml;hl-SMS.</td></tr>
<tr><td width=35 align=right valign=top> 177. </td>
<td> Habe eine Reise in den 7. Himmel geplant. Willst du mich begleiten? </td></tr>
<tr><td width=35 align=right valign=top> 178. </td>
<td> Hey ich bin Ken. Willst du meine Barbie sein? </td></tr>
<tr><td width=35 align=right valign=top> 179. </td>
<td> Du bist ein BSE-Mensch: Besonders sch&ouml;ner Engel. </td></tr>
</table>
 
<table border=2 cellspacing=2 width=100%>
<tr><td colspan=2> <b><font size="+1"> Zicke</font></b></td></tr>
<tr><td width=35 align=right valign=top> 180. </td>
<td> Ich achte wirklich nicht aufs Aussehen. H&auml;tte ich dich sonst genommen? </td></tr>
<tr><td width=35 align=right valign=top> 181. </td>
<td> </td></tr>
<tr><td width=35 align=right valign=top> 182. </td>
<td> Ich wei&szlig;, du eroberst jedes M&auml;dchen im Sturm. Schade nur dass gerade andauernd die Sonne scheint:-) </td></tr>
<tr><td width=35 align=right valign=top> 183. </td>
<td> Jeden Tag erh&ouml;ht sich zwangsl&auml;ufig die Zahl derer, die mich am Arsch lecken k&ouml;nnen ...  Heute ist Dein Tag. </td></tr>
<tr><td width=35 align=right valign=top> 184. </td>
<td> Alle sagen, ich w&auml;re arrogant! Aber woher wollen die das wissen, mit denen gebe ich mich gar nicht ab. </td></tr>
<tr><td width=35 align=right valign=top> 185. </td>
<td> Oh, hallo du klasse Typ, du gut aussehender, mit Muskeln &uuml;bers&auml;ter Bodybuilder mit erotischem Waschbrettbauch ... Na davon tr&auml;umst  du doch nur. </td></tr>
<tr><td width=35 align=right valign=top> 186. </td>
<td> Vier Worte, die das Ego eines Mannes zerst&ouml;ren: Ist er schon drin? </td></tr>
<tr><td width=35 align=right valign=top> 187. </td>
<td> SOS, Ich liebe dich! Herz an Herz, ich brauche dich! Bin verliebt bis in den Tod, aber nicht in dich, du Vollidiot! </td></tr>
</table>
    
<hr size=4>
<table border=0>
<tr><td colspan=3> <b><font size="+1"> :-) SMS Abk&uuml;rzungen </font></b></td></tr>
<tr><td> HDL</td><td> &nbsp; &nbsp; </td><td> = Hab dich lieb</td></tr>
<tr><td> HDGDL</td><td> &nbsp; &nbsp; </td><td> = Hab dich ganz doll lieb</td></tr>
<tr><td> FIUE</td><td> &nbsp; &nbsp; </td><td> = F&uuml;r immer und ewig </td></tr>
<tr><td> BSE</td><td> &nbsp; &nbsp; </td><td> = Bin so einsam</td></tr>
<tr><td> GN8</td><td> &nbsp; &nbsp; </td><td> = Gute Nacht</td></tr>
<tr><td> DAD</td><td> &nbsp; &nbsp; </td><td> = Denk an dich</td></tr>
<tr><td> HASE</td><td> &nbsp; &nbsp; </td><td> = Habe Sehnsucht</td></tr>
<tr><td> BBB</td><td> &nbsp; &nbsp; </td><td> = Bis bald Baby </td></tr>
<tr><td> TWU</td><td> &nbsp; &nbsp; </td><td> = Treffen wir uns</td></tr>
<tr><td> :-)</td><td> &nbsp; &nbsp; </td><td> bin gut drauf</td></tr>
<tr><td> :-(</td><td> &nbsp; &nbsp; </td><td> bin traurig/ver&auml;rgert </td></tr>
<tr><td> :-P</td><td> &nbsp; &nbsp; </td><td> Zunge rausstecken</td></tr>
<tr><td> ;-)</td><td> &nbsp; &nbsp; </td><td> Augen zwinkern/ ironisch gemeint</td></tr>
<tr><td> :-x</td><td> &nbsp; &nbsp; </td><td> Kuss</td></tr>
<tr><td> :-c</td><td> &nbsp; &nbsp; </td><td> bin total ungl&uuml;cklich</td></tr>
<tr><td> >:-></td><td> &nbsp; &nbsp; </td><td> Teuflisches Grinsen</td></tr>
<tr><td> :D</td><td> &nbsp; &nbsp; </td><td> breites Grinsen</td></tr>
<tr><td> [-_-]zzz</td><td> &nbsp; &nbsp; </td><td> Bin m&uuml;de/ gehe schlafen</td></tr>
<tr><td> @----</td><td> &nbsp; &nbsp; </td><td> Eine Rose f&uuml;r dich</td></tr>
</table>
</p>
<p>J. Rudlaff &lt;rudi@genialus.de&gt;</p>

</td></tr></table>
<br>
</body>
</html>
