<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Nichts &uuml;ber Amiga </title>
</head>
<body background="wolf2.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td width=80> &nbsp; </td><td>

<p align=center><font color="#000080" size="7"><b>Wussten Sie
.....</b></font></p>

<p>Hier kommen wieder ein paar Kalenderblattweisheiten, diesmal aber ganz
unkommentiert. <hr width=80%></p>

<p><b>Wussten Sie, </b><br>
dass nur 2,8 % des Wassers auf der Erde S&uuml;&szlig;wasser ist? Von
diesem kleinen Anteil sind nur 6% fl&uuml;ssig, weit &uuml;ber 90% sind in
den Eiskappen der Pole eingeschlossen. Der Rest ist Wasserdampf in der
Athmosph&auml;re. Etwa 98% des fl&uuml;ssigen Trinkwassers ist Grundwasser.
<hr width=80%></p>

<p><b>Wussten Sie, </b><br> 
dass Rosen keine Dornen besitzen? Der Wissenschaftler nennt diese Spitzen
Stacheln. Das ist keine Wortspielerei. Stacheln geh&ouml;ren zur Rinde und
lassen sich leicht abknicken. Dornen dagegen sind Ausw&uuml;chse des Holzes
und als solches ebenfalls von Rinde umgeben. Rosen besitzen Stacheln! <hr
width=80%></p>

<p><b>Wussten Sie, </b><br>
dass Klapperschlangen W&auml;rme sehen k&ouml;nnen? Sie besitzen zwischen
Nase und Augen ein Organ, das f&uuml;r W&auml;rmestrahlen "geeicht" ist.
Sie k&ouml;nnen damit Unterschiede bei Temperaturen bis zu einem
Tausendstel Grad wahrnehmen. Es erlaubt ihnen, nachts die Beutetiere
aufzusp&uuml;ren. <hr width=80%></p>

<p><b>Wussten Sie, </b><br>    
dass der Specht seine Nahrung nicht riecht, sondern h&ouml;rt? Er klopft
die St&auml;mme ab und h&ouml;rt am Klang genau, ob sich unter der Rinde
irgendwelche Insekteng&auml;nge befinden. Dann erst hackt er mit
kr&auml;ftigen Hieben die Rinde auf und holt sich mit seiner langen Zunge
die Baumsch&auml;dlinge heraus. <hr width=80%></p>

<p><b>Wussten Sie, </b><br> 
dass die Luft nicht so leicht ist, wie wir allgemein glauben? Auf jedem
Quadratzentimeter Oberfl&auml;che dr&uuml;ckt sie mit einem Gewicht von
einem Kilogramm. Aus Gew&ouml;hnung sp&uuml;ren wir die Last nicht mehr.
Wenn wir bedenken, dass wir eine Lufth&uuml;lle von &uuml;ber 1000 km
H&ouml;he &uuml;ber uns haben, dann wird uns ihr Druck schon
verst&auml;ndlicher. <hr width=80%></p>

<p><b>Wussten Sie, </b><br> 
dass ein einziges Vogelpaar w&auml;hrend eines Sommers etwa 6000 Raupen
verzehrt? Nur 1000 Raupen gen&uuml;gen, um einen Nadelbaum absterben zu
lassen. Ein Schwalbenpaar muss t&auml;glich f&uuml;r seine Jungen
mindestens 7000 Insekten fangen! V&ouml;gel helfen uns, die B&auml;ume zu
erhalten. <hr width=80%></p>

<p><b>Jetzt noch eine Anektode: </b><br> 
Auf die Frage. welche B&uuml;cher man denn mitnehmen solle, wenn man
gezwungen w&auml;re, jahrelang auf einer einsamen Insel zu leben,
antwortete der amerikanische Schriftsteller William Saroyan: "Eines
&uuml;ber den Bootsbau, eines &uuml;ber Navigation und eines &uuml;ber
Segeln." </p>

<center>
<table border="8" width=100% cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <br><font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <br><font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <br><font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
</td></tr></table>
<br>
</body>
</html>
