<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Was nun?</b></font><br>
<font color="#000080" size="+1">Hochschulstandort Deutschland </font><br>
<font color="#000080" size="-1">Fundstelle: www.schulbank.de </font></p>

<p> Sp&auml;testens seit der PISA-Studie steht der Schulstandort
Deutschland in der Kritik. Wie steht es um die deutschen Hochschulen? Ist
es f&uuml;r junge Menschen attraktiv, in Deutschland zu studieren? Und
bilden die Universit&auml;ten die Arbeitskr&auml;fte aus, die Wirtschaft
und Gesellschaft brauchen?</p>

<p>Als das "Volk der Dichter und Denker" mag Deutschland noch immer vielen
gelten, und andere werden betonen, dass es die deutsche Ingenieurskunst
war, der dieses Land seinen Aufstieg nach dem Zweiten Weltkrieg verdankt.
Doch geht es nach den Hiobsbotschaften &uuml;ber den Bildungsstandort
Deutschland, dann stehen beide Traditionen - die geistesebenso wie die
naturwissenschaftliche - in krassem Gegensatz zur heutigen Verfassung des
Bildungssystems.</p>

<p>Dem Zulauf zu den 170 Universit&auml;ten und 188 Fachhochschulen in
Deutschland tut dies jedoch keinen Abbruch. Erwarb 1970 nur jeder zehnte
Schulabg&auml;nger die Hochschulreife, so waren es 2000 mit 37,2 Prozent
fast vier Mal so viele. Dies er Anteil ist seit Mitte der neunziger Jahre
konstant. Und jeder dritte junge Mensch beginnt in Deutschland ein
Hochschulstudium - innerhalb von drei Jahrzehnten hat sich die Zahl der
Studienanf&auml;nger verdreifacht. Insgesamt zieht es unver&auml;ndert
viele Menschen in eine Hochschulausbildung in Deutschland. </p>

<p>Das gilt auch f&uuml;r Studierende aus dem Ausland. Seit 25 Jahren
w&auml;chst der Anteil ausl&auml;ndischer Studienanf&auml;nger an deutschen
Hochschulen kontinuierlich. Von knapp 7 Prozent 1975 stieg er auf 17
Prozent im Studienjahr 2000/2001. Dabei ist der Studienstandort Deutschland
vor allem beliebt bei Studenten aus den westeurop&auml;ischen
Nachbarstaaten, Osteuropa und Teilen Asiens. Weniger attraktiv ist
Deutschland hingegen f&uuml;r Studenten aus den Tigerstaaten Asiens und den
USA. </p>

<p>&Uuml;ber mangelnden Zulauf k&ouml;nnen sich die deutschen Hochschulen
somit nicht beklagen. Auf einem anderen Blatt steht, wie gut sie den
Personalbedarf der Wirtschaft abdecken. Dabei ist es zun&auml;chst ein
grundlegender Nachteil, dass in Deutschland zu lange studiert wird und die
Absolventen zu sp&auml;t in den Beruf einsteigen. Wer ein Studium beginnt,
ist im Durchschnitt 21,6 Jahre alt, und erst mit 29,0 Jahren hat er es
abgeschlossen. Noch gravierender sind die Nachteile, die entstehen, wenn
die Akademiker, die die Hochschulen verlassen, anders qualifiziert sind als
die Arbeitskr&auml;fte, die die Wirtschaft nachfragt. In Deutschland hat
der Anteil der Studierenden in den Rechts-, Wirtschafts- und
Sozialwissenschaften in den neunziger Jahren durchg&auml;ngig zugenommen,
ebenso der Anteil angehender Sprach- und Kulturwissenschaftler.
Demgegen&uuml;ber stagniert der Anteil der Studierenden in Mathematik, und
in den ingenieurwissenschaftlichen F&auml;chern geht er deutlich
zur&uuml;ck.</p>

<p>Prek&auml;r ist auch, dass sich die Zahl der Studienanf&auml;nger in den
Lehr-amtsstudieng&auml;ngen in den letzten 25 Jahren nahezu halbiert hat.
So ist ein Mangel ausgerechnet an der Stelle absehbar, an der die Weichen
f&uuml;r den Bildungs- und Wirtschaftsstandort Deutschland gestellt werden:
in der Schule. Zwar zeichnet sich eine Trendwende ab, doch der
Nachwuchsmangel an Ausbildern in naturwissenschaftlichen F&auml;chern und
an berufsbildenden Schulen wird anhalten. In den Naturwissenschaften ist
die Lage insgesamt ung&uuml;nstig. Anlass zur Sorge gibt hier auch der
R&uuml;ckgang der Absolventen in den Studieng&auml;ngen mit den
Abschl&uuml;ssen Diplom, Magister und Promotion.Vor allem bei der Zahl
angehender Physiker und Chemiker sehen die Statistiker erst den Anfang des
Abw&auml;rtstrends.</p>

<p>Durch die Diskussion &uuml;ber die "Green Card" hat die Situation im
Fach Informatik gro&szlig;e &ouml;ffentliche Aufmerksamkeit gefunden. Die
Zahl der Studienanf&auml;nger in Informatik ging in der ersten H&auml;lfte
der neunziger Jahre kontinuierlich zur&uuml;ck, aber seither hat sich die
Zahl der Erstsemester mehr als verdreifacht. Dem Verlauf der
Studienanf&auml;ngerzahlen entsprechend, setzte der R&uuml;ckgang der
Absolventenzahlen 1998 ein. Dieser Trend wird sich voraussichtlich in
diesem Jahr erstmals umkehren. </p>

<p>Fazit: Eine akademische Ausbildung in Deutschland halten viele junge
Menschen aus dem In- und Ausland nach wie vor f&uuml;r lohnend. Das
Vorurteil, der Hochschul-standort Deutschland sei f&uuml;r Ausl&auml;nder
nicht mehr attraktiv, best&auml;tigt sich nicht, wenn man von regionalen
Unterschieden absieht. Das eigentliche Problem ist der Nachwuchsmangel in
ingenieurwissen-schaftlichen F&auml;chern und der mangelnde Gleichklang
zwischen der Konjunktur der Arbeitskr&auml;ftenachfrage und dem Output des
Bildungssystems. Das zeigt sich in aller Sch&auml;rfe an der Situation im
Fach Informatik und in der Lehrerausbildung. Eine Herausforderung f&uuml;r
die Bildungspolitik liegt darin, hier zu einer nachhaltigeren Entwicklung
beizutragen. </p>

</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
