<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x08 - ImageFX 3.0</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00A9.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00A8.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00AA.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00A8.html">ArtEffect 2.6</A> | <A HREF="0x00A9.html">ImageFX 3.0</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00A3.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00A4.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00A5.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00A6.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00A7.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00A8.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00AA.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00AB.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00AC.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00AD.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00AE.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>ImageFX 3.0 - Der Allesk&ouml;nner</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Die beliebte Bildbearbeitung &quot;ImageFX&quot;
erscheint nun in der Version 3.0, getestet haben wir die Version 3.1 vom
28.4.1998, desweiteren werde ich ein paar Kommentare zum Update 3.2 zum
Besten geben. Doch zuerst einmal eine kurze Einf&uuml;hrung. ImageFX und
AdPro - zwei Profiwerkzeuge am Amiga, beide haben ihre Vorteile und
Eigenheiten. Letztere wurden ImageFX in dieser Release teils
abgew&ouml;hnt. Wieso denn nur teils und nicht ganz? Nun, genaugenommen
sind's gleich 2 Versionen von ImageFX, die man da erh&auml;lt...</FONT><BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER WIDTH="60%">
<TR VALIGN=TOP><TD ALIGN=CENTER><FONT SIZE="-1">
Die AmigaScene meint: ImageFX ist ganz klar das beste Programm seiner Art,
gemessen an der Leistung. Auch wenn sich einem auf den ersten Blick noch
nicht alle M&ouml;glichkeiten offenbaren.
<BR></FONT>
</TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Und zwar die &quot;Classic&quot; Version mit den altbekannten
Splitscreens, wo Palette, Panel und Preview Screen
&uuml;bereinandergelagert wurden. Da f&auml;llt mir ein, da&szlig; meine
Lautsprecher, die neben meinem 17&quot;-VGA Monitor stehen, immer ganz laut
zu surren begonnen haben, wenn ich ImageFX im Splitscreenmodus gestartet
habe. (Anm. d. Red.: Naja, es sind wirklich die schlechtesten Lautsprecher
die man sich vorstellen kann, knacksen auch zwischendurch und so...) Die
fertigen Bilder hab ich dann immer in einen Picasso Screen hinein
gerendert. Das war dann doch manchmal etwas umst&auml;ndlich, aber immerhin
enorm Speicher sparend.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ich fang' jetzt aber nochmal ganz von vorne an, n&auml;mlich bei der
Installation. Das Handbuch ist dick, &uuml;bersichtlich, reichlich mit
Bildern versehen und kurz gesagt einfach genial. Die 5 Disks halte ich
bereit, Disk 1 wird eingelegt und los geht das Installieren. Nach einer
Weile werde ich nach Prozessor (Loader-, Saver-, Oparator-Module) und
Grafikkarten System (Render-Module) gefragt. Weiters kann man auch
optionale Extras installieren, f&uuml;r die Nova Design jedoch &quot;keine
Garantie&quot; gibt, dies betrifft Add-Ons wie z.B.: PostScript Loader,
PAR-PEG Loader, MPEG Tools, PhotoCD Loader, und anderer Kleinkram. Das
GIF-Loader Modul mu&szlig; man sich wegen Lizenzbestimmungen von der <A
HREF="http://ftp.novadesign.com/">FTP-Site</A> saugen, oder auch aus dem
Aminet beschaffen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="../images_08/ifx_screentn.jpeg"><IMG WIDTH=200 HEIGHT=150 ALT="[ImageFX Screen]" SRC="../images_08/ifx_screentntn.gif" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=200>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Die neue komfortable Oberfl&auml;che von ImageFX - so wie man sie von den
meisten Programmen dieser Art gewohnt ist.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Programmoberfl&auml;che der normalen Version wartet mit einigen
&Auml;nderungen auf, die ein schnelleres und effizienteres Arbeiten
erm&ouml;glichen: Damals konnte man nur ein Men&uuml;fenster &ouml;ffnen,
einen Effekt ausw&auml;hlen, danach verschwand das Fenster wieder. Jetzt
k&ouml;nnen die Fenster offen bleiben und verschoben werden (Anm. d. Red.:
Fr&uuml;her ist das Men&uuml; - immerhin butterweich - hereingescrollt, man
hat einen Button ausgew&auml;hlt, und dann ist es wieder hinausgescrollt
worden). Sobald ein Fenster offen ist, wird der Button, der das Fenster
aufgerufen hat, schattiert dargestellt. Sehr praktisch, dann kommt man
nicht mehr in Versuchung, gleich noch einmal draufzudr&uuml;cken.
Au&szlig;erdem k&ouml;nnen mehrere Bilder gleichzeitig begutachtet werden
(dank Fenstertechnik), und sogar von ein- und demselben Bild kann einfach
per Icon im Fensterrahmen eine Kopie erzeugt werden. Das sind
nat&uuml;rlich alles Selbstverst&auml;ndlichkeiten, und ImageFX ist so gut,
da&szlig; mir diese Dinge fast nebens&auml;chlich erscheinen.<BR>

<BR>Bei den diversen Effekt-Fenstern kann man nun auch den
Preview-Ausschnitt zoomen, ver&auml;ndern, Realtime Preview an/abstellen
und die Gr&ouml;&szlig;e des Previews ver&auml;ndern. Es gibt eine ganze
Menge neuer Effekte, und wie bei ArtEffect hat man sich auch hier einiges
von Photoshop abgeschaut. Zum Beispiel den Layer Manager, bzw. das
Layer-Konzept an sich. Zwar konnte man bisher Bilder &uuml;bereinander
lagern und zusammenstellen, aber mit der Layer-Technik, mit der ich mich
noch anfreunden mu&szlig;, soll das alles viel einfacher sein. Und ist es
auch - ich hab es gerade eben erst ausprobiert. Viel intuitiver und besser
als bei ArtEffect. Klick and go. Es funktioniert. :-)<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Es k&ouml;nnen nun auch PostScript- und Photoshop-Formate gelesen
werden, au&szlig;erdem wurde ImageFX f&uuml;r alle m&ouml;glichen
Prozessoren optimiert. Die Programme &quot;AutoFX&quot; und &quot;IMP&quot;
sind nach wie vor mit von der Partie. Im Gegensatz zu ArtEffect kommt
ImageFX auch ohne virtuellen Speicher aus, bzw. man kann diese Option auch
wirklich deaktivieren. Die vielen ARexx Scripts sind nat&uuml;rlich auch
dabei, und es gibt eine Menge neuer Hooks (=Zusatzprogramme, die wie ein
PlugIn gestartet werden k&ouml;nnen, oder aber auch von selber laufen):
Clouds zum Beispiel berechnet Wolken (und wie man es von diversen ImageFX
Hooks und Effekten gewohnt ist, kann man wieder Hunderte von Optionen
einstellen), &quot;FX Forge&quot; ist ein sehr m&auml;chtiges Konzept, mit
dem man mit Hilfe von Formeln und ein wenig Mathematik beliebig viele und
beliebig verr&uuml;ckte Spezialeffekte erstellen kann, z.B.
&quot;Radar&quot; - macht aus dem Bild eine Radarscheibe (wohl nur f&uuml;r
Animationen geeignet), oder andere wie z.B.:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Aged_Film<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Bevel<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Blades<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Bubble<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Bulging_Edge_Plus<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Channel_5<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Crystal_Ball<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Diamond_Glass<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> FMagic (1-10)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Fractal_Magic6<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Frame17<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Gravity_Blossom<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Melting_Pot<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Mo'Jellyfish<BR>
</TD><TD WIDTH="50%">
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Motion_Trail<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Page_Curl<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Picassos_Last_Word<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> SawtoothFX<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Seismic<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Sliding_Spirals<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Star_Maker<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Sunraze<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Tangent_Deform<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Vertical_Tile<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Waker_Maker<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Whirl_Blur<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Zoom_Blur<BR>
</TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Wenn man bedenkt, wie gut ImageFX aufgebaut ist, da&szlig; man extrem
viele &quot;Drawing Styles&quot; definieren kann, welche dann konsistent
auf alle Malwerkzeuge angewandt werden, die umfangreiche Hook-Sammlung, die
M&ouml;glichkeit und Leichtigkeit, Makros zu definieren und zu speichern
(Makros werden automatisch als ARexx-Scripts abgespeichert), die vielen
Spezialeffekte, die ARexx Scripts, die M&ouml;glichkeit, mit dem
&quot;ImageFX Multi Processor&quot; (zu Starten per ImageFX's Hook-List
oder per WB-Icon) bequem von 500 x-beliebigen Bildern 10x20-GIFs in
Greyscale in ein bestimmtes Verzeichnis speichern, oder mit dem
weiterentwickelten &quot;AutoFX&quot; ganze Verzeichnisse mit wenigen
Mausklicks bearbeiten - automatisch werden Pre-Scripts, Post-Scripts und
das eigentliche Script erstellt, ohne da&szlig; man auch nur einen Finger
ans Keyboard setzen mu&szlig;. Einfach genial.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Dann gibt's noch den IFX Browser, dem auch noch ein paar ARexx Scripts
spendiert worden sind, und mit dem man ganze Verzeichnisse von Bildern noch
bequemer durchsuchen und bearbeiten kann. Man sucht sich die Files aus, und
w&auml;hlt dann das Arexx-Script aus, das angewendet werden soll, bzw. man
l&auml;dt die entsprechenden Bilder gleich in das laufende (oder falls noch
nicht, dann wird es nat&uuml;rlich gestartet) ImageFX hinein.<BR>

<BR>CineMorph ist ein Morphing-Programm, das ebenfalls bestens mit ImageFX
zusammenarbeitet (kann auch von ImageFX heraus als &quot;Hook&quot;
gestartet werden). Und da es ja sonst (abgesehen von ASDG's Morphing
Programm, ich glaub' das hei&szlig;t &quot;Morph Plus&quot;) kein
vern&uuml;nftiges Morphing Programm am Amiga gibt, d&uuml;rfte wohl
f&uuml;r viele CineMorph erste Wahl sein.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das ARexx-Interface bei ImageFX ist auch genial, &uuml;ber 300
Commands, absolut einfach in der Ausf&uuml;hrung, und insgesamt
ungef&auml;hr 500 Commands f&uuml;r ImageFX, CineMorph und Hooks.
Vielleicht ist es ganz gut, wenn ich ein kurzes Beispiel aus der
Online-Dokumentation hier demonstriere (ich hoffe, deswegen werden mich die
Hersteller nicht gleich lynchen...), also:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>CREATELAYER (3.0)
<BR>
<BR>&nbsp;&nbsp;&nbsp;<B>FORMAT</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;CreateLayer FromBrush/S,FromSwap/S
<BR>
<BR>&nbsp;&nbsp;&nbsp;<B>FUNCTION</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Create a new layer in the current image.
<BR>
<BR>&nbsp;&nbsp;&nbsp;<B>INPUTS</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<U>FromBrush</U>
<BR>&nbsp;&nbsp;&nbsp;The new layer is copied from the current brush.
<BR>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<U>FromSwap</U>
<BR>&nbsp;&nbsp;&nbsp;The new layer is copied from the current swap buffer.
<BR>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Note:&nbsp;&nbsp;If no arguments are specified, an empty layer
<BR>&nbsp;&nbsp;&nbsp;will be created.
<BR>
<BR>&nbsp;&nbsp;&nbsp;<B>RESULT</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;None.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;


<BR>Alles klar? Und die anderen 499 Befehle sehen in der Beschreibung
genauso aus. Kurz, pr&auml;zise, konsistent, einfach, genial. Kein Wunder,
da&szlig; die <B>NASA</B> zur Auswertung ihrer Satellitenfotos ImageFX auf
Amigas verwendet...<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Dann noch ein paar Kommentare zum Update 3.2 von ImageFX: Die
Installation klappt wieder einwandfrei, das alte ImageFX wird gefunden, die
Settings werden nicht ver&auml;ndert, der Patch wird installiert,
au&szlig;erdem wird die vorhandene ImageFX Version automatisch richtig
erkannt und gepr&uuml;ft (Checksumme) und fertig ist das Update. Man
mu&szlig; jedoch noch kurz die ImageFX Disk1 einlegen. Alles bestens. Alles
funktioniert auf Anhieb und kostet mich nicht einmal 2 Minuten Zeit. Was
sich alles in der Version 3.2 ver&auml;ndert hat, will ich jetzt aber nicht
aufz&auml;hlen, f&uuml;r alle, die es interessiert: Das <A
HREF="../images_08/ifx_readme.txt">ReadMe</A> zum Update.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>So, ich lobe das Programm jetzt schon die ganze Zeit in den Himmel und
ein jeder fragt sich wahrscheinlich, ob ich von den Herstellern bezahlt
werde - nein, nat&uuml;rlich hat auch ImageFX seine Schwachstellen.
Zun&auml;chst einmal sind da so Kleinigkeiten: Das eine oder andere Mal ist
das Closegadget schm&auml;ler als normal, die Buttons sind nicht
fontsensitiv, teilweise ist das Programm furchtbar langsam, wenn
gro&szlig;e Bildbereiche verschoben werden, es gibt nicht zu jedem Effekt
einen Preview, und Realtime Preview will immer eigens aktiviert werden. Und
der bequemliche Photoshop-User wird sich &auml;rgern, da&szlig; nicht alles
so aufgebaut ist wie bei seinem Lieblingsprogramm.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Andererseits: Das Handbuch ist spitze, die Dokumentation (Programm,
ARexx) ist wahnsinnig konsistent und sinnvoll aufgebaut, die
Funktionsvielfalt ist unschlagbar, die Installation ist absolut
unproblematisch, die M&ouml;glichkeiten (Bearbeiten, Drucken, Scannen,
Multiprocessing) schier unbegrenzt.<BR>

<BR>Das Programm ist lediglich zeitweise extrem langsam: Manchmal klickt
man ein Icon aus dem Toolbar an, danach wird das Bildfenster aktiviert,
deaktiviert, der Mauspfeil blitzt zweimal auf, dann ist der Spuk vorbei.
Kostet wertvolle Sekundenbruchteile. Und Nova Design (bzw. die
Programmierer) h&auml;tten mehr Feinarbeit leisten m&uuml;ssen. Beim Update
3.2 f&uuml;hrt ein &quot;Pick Color&quot; relativ oft unweigerlich zum
Absturz, sobald man auf ein Bild klickt, und auch beim Aussteigen gibt es
manches Mal Programmfehler.<BR>

<BR>Das Handling ist manchmal sehr gew&ouml;hnungsbed&uuml;rftig und die
zwei verschiedenen Mauspfeile (Mauspfeil wird zum Fadenkreuz, wenn er sich
&uuml;ber einem Bild befindet) verwirren anfangs auch ein wenig. Die
Berechnungen sind teilweise recht langsam und nicht jeder Effekt wurde
f&uuml;r verschiedene Prozessoren optimiert.<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Daf&uuml;r wird ImageFX endlich wieder weiterentwickelt, Photoshop
Loader und Photoshop Filter Factory Kompatibilit&auml;t hat man dem
Programm auch spendiert (ich hab's nicht getestet), es gibt unz&auml;hlige
ARexx-Skripts, Beispiele, Anleitungen, Tips, Treiber f&uuml;r Drucker &amp;
Scanner und dergleichen mehr auf der FTP-Site, der uralte DigiView
Framegrabber wird jetzt auch unterst&uuml;tzt (haha, nein das ist kein
Scherz!), alle Grafikkarten von Firecracker &uuml;ber HAM-E, DCTV bis zu
CV64/PIV werden wie gewohnt (seit V2.1) unterst&uuml;tzt, die
Maskierungsm&ouml;glichkeiten sind absolut superior im Vergleich zu AE2.6,
es gibt 3D-Rotation, 8 Farbpaletten, man kann beliebig zwischen RGB,
Greyscale und Colormapped Images konvertieren, Feuer-, Nebel-, Wolken-,
Blitz-, Hitzeblasen-, Wasser- und Glas-Effekte gibts immer noch und sind
z.T. erg&auml;nzt und verbessert worden, Texturen kann man auf Fl&auml;chen
projezieren, LensFlares und Glitzersterne einem Bild hinzuf&uuml;gen,
Bilder auf Glaskugeln mappen, und noch mehr.<BR>

<BR><CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Trotzdem erscheint mir gerade die Version 3.2 instabil zu sein. Am
Besten von der V3.1 ein Backup machen. Achja, und au&szlig;erdem haut das
mit den Cycle-Gadgets nicht immer so hin, wie man es sich w&uuml;nscht: Da
hilft nur eines: Als <B>Tooltype</B><BR>

<BR><CENTER><TT>CYCLE_GADGET=CLASSACT</TT></CENTER>&nbsp;

<BR>einstellen. Zusammenfassend kann man sagen, da&szlig; ein wenig
&Uuml;berarbeitung dem Programm nicht schaden k&ouml;nnte. So reicht es
eben nicht ganz f&uuml;r eine AS-Award. (Anm. d. Red.: Au&szlig;erdem sind
wir uns noch nicht im Klaren dar&uuml;ber, wie der Award &uuml;berhaupt
auszusehen hat. Das erleichtert meine Entscheidung nat&uuml;rlich
ungemein!)<BR>

<BR><CENTER><A NAME="14" HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=69 HEIGHT=10 ALT="[69]"><IMG SRC="../images/_box_black.gif" WIDTH=31 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=94 HEIGHT=10 ALT="[94]"><IMG SRC="../images/_box_black.gif" WIDTH=6 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=88 HEIGHT=10 ALT="[88]"><IMG SRC="../images/_box_black.gif" WIDTH=12 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=82 HEIGHT=10 ALT="[82]"><IMG SRC="../images/_box_black.gif" WIDTH=18 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=72 HEIGHT=10 ALT="[72]"><IMG SRC="../images/_box_black.gif" WIDTH=28 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=93 HEIGHT=10 ALT="[93]"><IMG SRC="../images/_box_black.gif" WIDTH=7 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=91 HEIGHT=10 ALT="[91]"><IMG SRC="../images/_box_black.gif" WIDTH=9 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#lutz">Bernhard Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00A9.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#robert">Robert Niessner</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00A9.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.novadesign.com/">Nova Design</A> - Die Hersteller<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifxdemocrys.gif">Crystalize</A> (GIF; 12K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifxdemoflar.gif">Lens Flare</A> (GIF; 13K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifxdemoliqu.gif">Liquid</A> (GIF; 13K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifxdemooil.gif">Oil</A> (GIF; 11K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifxdemopinc.gif">Pinch</A> (GIF; 12K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifxbox2.jpeg">Verpackung</A> (JPEG; 9K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifx_screentn.jpeg">ImageFX Screen</A> (JPEG; 154K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_08/ifx_readme.txt">Update 3.2 - Readme</A> (TEXT; 17K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00A8.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00AA.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
