<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x08 - AmigaOS 3.1</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00AC.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00AB.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00AD.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00AC.html">AmigaOS 3.1</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00A3.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00A4.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00A5.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00A6.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00A7.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00A8.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00AA.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00AB.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00AC.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00AD.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00AE.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Geburtstagsinterview mit AmigaOS 3.1</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Wie sich jeder selbst mit Hilfe des
&quot;version&quot;-Befehls davon &uuml;berzeugen kann, wurde die
&quot;exec.library&quot;, der Kern von AmigaOS, dieser Tage f&uuml;nf Jahre
alt. Wir haben das zum Anla&szlig; genommen, das Geburtstagskind zu einem
Interview zu bitten. Lesen sie hier, wie der Betriebssystemsveteran
&uuml;ber seine Gartenzwergsammlung plaudert, den Weg aus seiner
Alkoholsucht beschreibt und begr&uuml;ndet, warum virtueller Speicher dem
Anwender nur schadet und &Ouml;sterreichs Psychiater zu den Besten der Welt
z&auml;hlen.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>(AO: AmigaOS 3.1, AS: AmigaScene)<BR>

<BR><B>AS:</B> Hallo, AmigaOS. Im Namen aller Deiner Anwender darf ich Dir zu
Deinem f&uuml;nften Geburtstag gratulieren.<BR>

<BR><B>AO:</B> Danke, danke. Es ist sch&ouml;n zu wissen, da&szlig; noch immer 37
Leute an mich denken.<BR>

<BR><B>AS:</B> Wir vom AmigaScene verbrachten zuletzt ziemlich viel Zeit damit, <A
HREF="0x00AA.html">Torten</A> zu backen. F&uuml;r Dich haben wir eine
extrasch&ouml;ne gemacht. Hier, bitte. (&Uuml;bergibt die Torte)<BR>

<BR><B>AO:</B> (Nimmt die Torte) Vielen Dank, das ist aber eine nette
&Uuml;berraschung.<BR>

<BR><CENTER><A HREF="../images_08/torte.gif"><IMG WIDTH=192 HEIGHT=192 ALT="[Geburtstagstorte]" SRC="../images_08/tortetn.gif"></A></CENTER>&nbsp;

<BR><B>AS:</B> Als Du vor f&uuml;nf Jahren ver&ouml;ffentlicht wurdest, und man
sich an die Situation von damals erinnert, kann man Dich eigentlich als
Commodores letzten R&ouml;chler bezeichnen...<BR>

<BR><B>AO:</B> Ja, das trifft die Sache von damals ganz gut.<BR>

<BR><B>AS:</B> Konsequenterweise m&uuml;&szlig;te man dich jetzt, etliche Jahre
ohne Update, als Erstickungsanfall umschreiben, oder?<BR>

<BR><B>AO:</B> So drastisch w&uuml;rde ich das nicht sehen, ich r&ouml;chle
eigentlich noch fast mit der selben Kraft wie damals. Schau her!
(Bl&auml;st mit einem Zug alle f&uuml;nf Kerzen auf der Torte aus)<BR>

<BR>Du Schlingel willst doch nur mit so kernigen Formulierungen beinharten
Journalismus vort&auml;uschen!<BR>

<BR><B>AS:</B> Hach, erwischt!<BR>

<BR><B>AO:</B> Und da&szlig; es keine Updates gab, ist nicht ganz richtig. Es gibt
etliche Verbesserungen wie das 64-Bit Filesystem f&uuml;r Festplatten
jenseits der 4 Gigabyte, neue Datatypes f&uuml;r Truecolor Grafiken (24
Bit) und einiges mehr.<BR>

<BR>Das Problem daran ist aber unbestritten, da&szlig; dies alles mehr oder
weniger reine Privatinitiativen sind, wenn auch sehr engagierte. Als
Anwender mu&szlig; man sich das Zeug leider selbst zusammenstoppeln. Die
Qualit&auml;tskontrolle ist dabei nat&uuml;rlich nicht besonders
leicht.<BR>

<BR>Und die Programmierer k&ouml;nnen leider kaum etwas davon
voraussetzen.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Dennoch waren es wohl eher ruhige Jahre um Dich. Was macht man so
als Betriebssystem, wenn man eigentlich nicht viel zu tun hat?<BR>

<BR><B>AO:</B> Betriebssysteme halten sich &uuml;blicherweise mehr im Hintergrund
und wollen mit der &Ouml;ffentlichkeitsarbeit an sich weniger zu tun
haben.<BR>

<BR>Aber ich will ehrlich mit Dir sein, weil irgendwann kommt es sowieso
raus: Bis ESCOM ging es mir noch halbwegs brauchbar, aber kurz nach deren
Niedergang st&uuml;rzte ich ziemlich tief in eine seelische Krise. Da hab
ich dann zu trinken begonnen.<BR>

<BR><B>AS:</B> Inzwischen scheint es Dir aber wieder ganz gut zu gehen, Deine
H&auml;nde zittern jedenfalls nicht.<BR>

<BR><B>AO:</B> Das ist nur, weil ich vor dem Interview sechs Flaschen Bier in mich
hineingesch&uuml;ttet habe.<BR>

<BR>Nein, das war ein Scherz. Ich machte ein paar Alkoholentziehungskuren,
wurde aber immer wieder r&uuml;ckf&auml;llig. Nach der dritten erfolglosen
bin ich dann zu einem Psychiater gegangen.<BR>

<BR>Der hat mir erkl&auml;rt, da&szlig; alles darauf
zur&uuml;ckzuf&uuml;hren ist, da&szlig; ich seit meiner Geburt von allen im
Stich gelassen wurde.<BR>

<BR><B>AS:</B> Und wie therapiert man sowas, wenn, wie in Deiner Situation, kein
Ende davon abzusehen ist?<BR>

<BR><B>AO:</B> Mein Psychiater hat gemeint, ich mu&szlig; den in mir aufgestauten
Ha&szlig;, der eine Folge der Vernachl&auml;ssigung ist, nach au&szlig;en
projizieren und gleichzeitig einen Ersatz f&uuml;r die mir fehlende
Zuneigung finden.<BR>

<BR><B>AS:</B> Und wie sieht das konkret aus?<BR>

<BR><B>AO:</B> Zum einen sammle ich Gartenzwerge. Die sind immer f&uuml;r mich da,
schauen lieb aus und h&ouml;ren mir zu, wenn ich was auf den Herzen habe.
Schau mal aus dem Fenster: Der Alte mit dem wei&szlig;en Bart und dem Hund
hei&szlig;t Jay. Der dort mit der Scheibtruhe voll Kompost, den habe ich
Petro getauft. Und der schmierige da hinten, der aussieht, als ob er Dir
einen kaputten Rasenm&auml;her verkaufen will, hei&szlig;t Jeff.<BR>

<BR>Zum anderen habe ich angefangen, Schweine zu z&uuml;chten. Im Stall
neben der Garage sind drei fette Masteber, die sich kaum mehr r&uuml;hren
k&ouml;nnen. Alle paar Monate schlachte ich einen davon, veranstalte eine
Grillparty und kauf' mir einen neuen. Die hei&szlig;en alle drei Bill.<BR>

<BR>So konnte ich meine Sucht letztendlich bew&auml;ltigen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Werden wir einmal kurz etwas technischer. Von Entwicklerseite her
wird Dir ja oft vorgeworfen, einige eklatante M&auml;ngel zu haben, so z.B.
der fehlende Speicherschutz oder virtueller Speicher, der auf die
Festplatte ausgelagert werden kann.<BR>

<BR><B>AO:</B> Die sind doch alle Proleten! Nur weil der Nachbar einen Spoiler auf
seinem GTI hat, braucht jeder einen, oder was?<BR>

<BR>Ich w&uuml;rde sogar soweit gehen und behaupten, da&szlig; der Code,
den ernsthafte Amiga-Programmierer in die Welt setzen, bez&uuml;glich
Speicherschutz wesentlich besser geschrieben ist als der auf
herk&ouml;mmlichen Systemen. Unter &quot;ernsthaft&quot; meine ich jetzt
jene Leute, die Enforcer und Mungwall/WipeOut verwenden. Damit lassen sich
viel mehr Fehler finden, und vor allem zeigen sie sich fr&uuml;her (i.A.
noch w&auml;hrend der Entwicklungsphase) als bei dem primitiven 08/15-
Speicherschutz der anderen.<BR>

<BR>Bei den Herk&ouml;mmlichen lehnen sich die Programmierer zur&uuml;ck
und jubeln: &quot;Hurra, mein Programm ist abgest&uuml;rzt, ohne das ganze
System mitzurei&szlig;en!&quot; Dabei w&auml;re es doch wichtiger, das
eigene Programm nicht semmeln zu lassen.<BR>

<BR><B>AS:</B> Woanders gibt es aber auch Entwicklerwerkzeuge, die die
Funktionalit&auml;t von Mungwall haben...<BR>

<BR><B>AO:</B> Schon, nur verwendet die kaum wer, weil alle glauben, wegen ihrem
ollen Speicherschutz im Betriebssystem sind die eh super. Meistens sind
diese Tools dann auch noch kostenpflichtig.<BR>

<BR>Und wenn man das Konzept des virtuellen Speichers betrachtet: kaum was
hat dem normalen Anwender mehr Schaden zugef&uuml;gt. Seit es virtuellen
Speicher gibt, sparen die dummen Anwender an realem Speicher. Denn selbst
wenn die Kiste speicherm&auml;&szlig;ig total unterdimensioniert ist, sagt
sie nichts davon, bricht aber geschwindigkeitsm&auml;&szlig;ig total
zusammen. Bei mir hingegen geht in der Regel ein Requester auf, der
verk&uuml;ndet, da&szlig; zuwenig Speicher da ist. Und der Anwender geht
ins Gesch&auml;ft und kauft sich mehr.<BR>

<BR>Nur weil Unix seinerzeit solche Schnapsideen eingef&uuml;hrt hat,
braucht man das doch nicht mir als Mangel vorhalten! Damals waren
blo&szlig; die Rechner so teuer, da&szlig; auf einem immer mehrere Anwender
eingeloggt waren, die die meiste Zeit nicht viel damit taten.<BR>

<BR><B>AS:</B> Na ja, glaubst Du nicht, da&szlig; Du jetzt ein bi&szlig;chen
reaktion&auml;r bist?<BR>

<BR><B>AO:</B> Hah, ich und reaktion&auml;r! Was soll ich den sonst sagen, wenn
sowohl Anwendern als auch Entwicklern heutzutage offensichtlich jegliche
M&uuml;ndigkeit fehlt?<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Wechseln wir lieber wieder das Thema. Hast Du Kontakt zu anderen
Betriebssystemen?<BR>

<BR><B>AO:</B> Mit MacOS bin ich eigentlich ganz gut befreundet. Der ist zwar ein
bisserl d&auml;mlich, aber sonst ganz nett.<BR>

<BR>Alle zwei Wochen treffen wir uns zum Bauernschnapsen mit Windows und
einem alten Unix-Derivat. Ich spiele nat&uuml;rlich mit MacOS im Team. Ein
uriger ZX 81 ist auch immer dort, der z&auml;hlt die Pummerl mit.<BR>

<BR><B>AS:</B> Und wer gewinnt meistens?<BR>

<BR><B>AO:</B> Wir lassen die anderen beiden immer gewinnen. Der Windows ist
n&auml;mlich sofort total eingeschnappt, wenn er verliert und f&auml;ngt
dann alle beschimpfen an. Das versaut nat&uuml;rlich den Abend.<BR>

<BR>Wir haben zwar den Unix schon gebeten, da&szlig; er sich einen anderen
Partner sucht. Aber der denkt sich, wenn er selbst nie was ansagt und immer
brav mit dem Windows mitspielt, gewinnt er auch immer.<BR>

<BR>Soviele von uns gibt es ja leider nicht mehr, als da&szlig; man sich
seine Schnapspartner gro&szlig; aussuchen k&ouml;nnte.<BR>

<BR><B>AS:</B> Der BeOS spielt nie mit?<BR>

<BR><B>AO:</B> &quot;Die&quot; BeOS! Das erste weibliche Betriebssystem.<BR>

<BR><B>AS:</B> &Ouml;ha, das hab ich nicht gewu&szlig;t! Wie kommt es dazu?<BR>

<BR><B>AO:</B> Die BeOS-Designer haben geglaubt, wenn sie einem Unix Arsch und
Titten dranh&auml;ngen, wird sich das toll verkaufen. Ziemlich billige
Rechnung, wenn Du mich fragst.<BR>

<BR>Mal davon abgesehen, h&auml;ngt sie blo&szlig; nur herum und wirft uns
allen vor, da&szlig; wir arrogante Machos sind und sie immer ignorieren,
weil sie eine Frau ist. Dabei waren wir anderen vorher nicht einmal
m&auml;nnlich, da hie&szlig; es immer &quot;das&quot; AmigaOS,
&quot;das&quot; MacOS usw.<BR>

<BR>Auf die Idee, da&szlig; keiner mit ihr was zu tun haben will, weil sie
bl&ouml;d ist und einen furchtbaren Mundgeruch hat, ist sie noch nicht
gekommen. Au&szlig;erdem legt sie sich mit jedem ins Bett. Zuerst mit dem
MacOS, und jetzt geht auch sie mit den Wintel-Rechnern. Die totale
Schlampe, sag' ich Dir. Bei der kannst Du Dir alles holen.<BR>

<BR><B>AS:</B> Jedenfalls scheint bei euch immer was los zu sein. Im Gegensatz
dazu stehen die Programmiersprachen, mit denen bei Dir programmiert wird.
W&auml;hrend auf allen anderen C++, Delphi und Java angesagt sind, wird bei
Dir immer noch das Meiste in in C programmiert.<BR>

<BR><B>AO:</B> Was gegen&uuml;ber BCPL und Assembler schon ein Fortschritt ist,
oder?<BR>

<BR><B>AS:</B> Dar&uuml;ber k&ouml;nnte man jetzt streiten. Aber worauf
f&uuml;hrst Du es zur&uuml;ck, da&szlig; sich bei Dir eigentlich nie etwas
anderes etablieren konnte als C?<BR>

<BR><B>AO:</B> Auf die Objekorientiertheit.<BR>

<BR><B>AS:</B> Aber C++ ist doch objektorientiert!<BR>

<BR><B>AO:</B> Der ZX 81 ist auch ein Computer.<BR>

<BR>Die Sache ist, da&szlig; mit den d&uuml;mmlichen statischen Konzepten
von C++ bei mir nicht viel zu holen ist. Bei den Dingen, die in BOOPSI
steigen, kommt die Dumpfsprache nicht mit. Da kann man sich dann sowieso
nur mehr &uuml;ber w&uuml;ste Typecasts reinretten, und das geht mit C
genausogut. Nur ist bei letzterer im Allgemeinen der Compiler
zuverl&auml;ssiger.<BR>

<BR>Bei Java sind wohl Sun-M&auml;nner selbst schuld: Zuerst stellen sie
sich hin, schreien laut &quot;Wir sind der Underground! Tut's
Java-Programmieren, dann &auml;rgert ihr die ganz b&ouml;sen
Microsoftis!&quot; Danach gehen sie her und k&uuml;mmern sich nicht um die
echten Undergroundler, sprich Entwickler f&uuml;r AmigaOS, RiscOS oder
meinetwegen auch die BeOS. Sogar f&uuml;r den MacOS gibt es nichts wirklich
gescheites.<BR>

<BR>Und dann zeig mir mal eine halbwegs verbreitete Programmiersprache, die
sowas wie die Parameter&uuml;bergabe in Taglisten von sich aus
unterst&uuml;tzen w&uuml;rde? In der Hinsicht hat Java ja auch
s&auml;mtliche Krankheiten von C++ geerbt.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Ok, ok, ich trau' mich eh schon nichts mehr sagen.<BR>

<BR>Also lieber wieder etwas zu Deinem Privatleben: Du lebst jetzt schon
l&auml;ngere Zeit in &Ouml;sterreich. Gab es da anfangs ein
Sprachproblem?<BR>

<BR><B>AO:</B> Nicht wirklich, ich hab ja meine <TT>locale.library</TT>. Mit
Deutsch kommt man schon einigerma&szlig;en durch hier, und den jeweiligen
Dialekt lernt man schnell, da die Grammatik viel weniger schwachsinnig ist
als die deutsche.<BR>

<BR><B>AS:</B> K&ouml;nnen wir vielleicht einmal mit einer &ouml;sterreichischen
Locale rechnen?<BR>

<BR><B>AO:</B> Wo denkst Du hin? Da m&uuml;sste man ja f&uuml;r jedes dritte
Seitental eine eigene machen!<BR>

<BR><B>AS:</B> Wie kommt es &uuml;berhaupt, da&szlig; Du Dir ausgerechnet in
&Ouml;sterreich ein kleines Landhaus gekauft hast, und Deine Therapie hier
gemacht hast?<BR>

<BR><B>AO:</B> Das ergab sich so, weil der Psychiater, der meine Alkoholsucht
behandelte, &Ouml;sterreicher ist.<BR>

<BR><B>AS:</B> Aber Du hast doch lange in den vereinigten Staaten gewohnt. Dort
sind die Psychiater bekanntlich integraler Bestandteil des t&auml;glichen
Lebens, so wie Brieftr&auml;ger und Taxifahrer.<BR>

<BR><B>AO:</B> Das schon, nur wird dort auch jeder Taxifahrer Psychiater, wenn ihm
gerade einmal langweilig ist. Ich hab mir gedacht, ich will einen
ordentlichen. Und die klassische Psychoanalyse ist zu einem gro&szlig;en
Teil auf &ouml;sterreichischem Mist gewachsen, allen voran der alte Sigi
Freud. Nicht zuletzt hat &Ouml;sterreich auch die h&ouml;chste
Selbstmordrate der Welt.<BR>

<BR><B>AS:</B> Was doch eigentlich gegen die hiesigen Psychiater spricht,
oder?<BR>

<BR><B>AO:</B> Mitnichten! In einem Land wie diesem, wo es mehr Tote durch
Selbstmord als Verkehrunf&auml;lle gibt, k&ouml;nnen sie doch jede Menge
Erfahrung sammeln.<BR>

<BR>Im Gegenzug sind ja z.B. auch &ouml;sterreichische Polizisten immer
ganz begeistert von amerikanischen Ermittlungsmethoden. Kein Wunder, bei
der Routine, die die dort aufgrund ihrer hohen Kriminalit&auml;t haben.<BR>

<BR><B>AS:</B> Hm, da k&ouml;nnte was dran sein. Ich habe neulich wo gelesen,
da&szlig; sie &uuml;ber dem Teich vor einiger Zeit die Gef&auml;ngnisse
privatisiert haben. Seitdem sind die dort der schnellstwachsende
Wirtschaftszweig.<BR>

<BR><B>AO:</B> Siehst Du. Kann man &uuml;brigens Aktien f&uuml;r amerikanische
Gef&auml;ngnisse kaufen? Nur f&uuml;r den Fall, das ich auf meine alten
Tage noch einmal schnell reich werden will?<BR>

<BR><B>AS:</B> Da bin ich jetzt &uuml;berfragt. Wundern w&uuml;rde es mich aber
nicht...<BR>

<BR><B>AO:</B> Jedenfalls kann man die Liste der Beispiele fortsetzen: So
f&ouml;rdert schlechte Hygiene das Immunsystem, kulturelle
Anspruchslosigkeit die Verkaufszahlen und finanzielle Armut die
Hilfsbereitschaft und das Zusammengeh&ouml;rigkeitsgef&uuml;hl.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Apropos Zusammengeh&ouml;rigkeit: Hast Du eigentlich den Eindruck,
da&szlig; Deine Popularit&auml;t durch Emulatoren wie <A
HREF="0x009F.html">UAE</A> gestiegen ist?<BR>

<BR><B>AO:</B> Nein. Nur die von AmigaOS 1.3. Fanpost mit Damenunterw&auml;sche
kriege ich deswegen keine.<BR>

<BR><B>AS:</B> Und f&uuml;rchtest Du, da&szlig; AmigaOS 4.0 bzw. 5.0 sie senken
k&ouml;nnten?<BR>

<BR><B>AO:</B> Bwuahahaha, die sollen erst einmal kommen! Ich erinnere nur an den
oft angedrohte AmigaOS 3.5. Joh wo issa denn? Gulli, gulli, draut a si nit
ausischaun, hotta leicht Aunxt?<BR>

<BR>Au&szlig;erdem vertraue ich auf die Bl&ouml;dheit meiner Anwender. Es
gibt ja heute noch viele, die mit AmigaOS 3.0 oder gar 2.0 arbeiten und
dann die Programmierer nerven, warum irgendwas auf ihrem
ach-gar-nicht-so-alten System nicht mehr rennt und komische Requester
&ouml;ffnet, die neuere Libraries verlangen.<BR>

<BR><B>AS:</B> Du meinst, ich sollte Dir zum Abschlu&szlig; noch weitere f&uuml;nf
erfolgreiche Jahre als das aktuellste AmigaOS w&uuml;nschen?<BR>

<BR><B>AO:</B> Genau das.<BR>

<BR><B>AS:</B> Ich danke lieber nur f&uuml;r das Interview.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00AC.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00AB.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00AD.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
