<HTML>
<!-- Converted with AFC/easyHTML (c) Francesco De Napoli -->
<TITLE>Amigazette: Masterizziamo con Make CD</TITLE>
<META NAME="keywords" CONTENT="AMIGAzette, Benny Ronchi, MakeCD">
<META NAME="description" CONTENT="Una recensione su MakeCD 3.2b">
<META NAME="author" CONTENT=Benny Ronchi>
<META NAME="generator" CONTENT=Converted with AFC/easyHTML (c) Francesco De Napoli>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<H1>Masterizziamo con Make CD</H1>
<BR><HR>

  <CENTER>
  <TABLE BORDER=1>
    <TR>
      <TD BGCOLOR="#77BBFF">Nome del prodotto
      <TD BGCOLOR="#FFEEAA"">MakeCd 3.2b
    </TR>
    <TR>
      <TD BGCOLOR="#77BBFF">Produttore
      <TD BGCOLOR="#FFEEAA"><A HREF="http://www.core.de">Core Design</A>
    </TR>
    <TR>
      <TD BGCOLOR="#77BBFF">Costo
      <TD BGCOLOR="#FFEEAA">Lit.75.000 (versione TAO) - Lit.115.000 (versione DAO)
    </TR>
    <TR>
      <TD BGCOLOR="#77BBFF">Configurazione usata per la prova
      <TD BGCOLOR="#FFEEAA">A1200, PowerPC 160 mhz con SCSI-II, 32mb RAM, masterizzatore Panasonic 7502/b 4x scrittura 8x lettura, lettore ide 32x Lite-on.
    </TR>
  </TABLE>
  </CENTER>

<BR><P>

Anche se il mercato Amiga &egrave; indiscutibilmente in profonda crisi, relegando il nostro computer ai margini del mondo dell'informatica, continuano a &quot;vedere la luce&quot; prodotti, sia software che hardware, che hanno dell'incredibile: MakeCD &egrave; sicuramente uno di questi.<BR>
Nato come shareware qualche anno fa, quando il costo dei masterizzatori era decisamente alto, riemp&igrave; un vuoto nel mercato Amiga, fornendo ai suoi utenti un programma di facile utilizzo a un costo estremamente contenuto. Prima di MakeCD gli amighisti dovevano usare MasterISO, un programma dedicato ai professionisti in vendita a circa L.1.100.000 oppure CD-Creator, un programma disponibile solo in tedesco, importato in Italia solo per un breve periodo dalla Fractal Minds.<P>
La versione 3.2b (datata 11.03.99) di MakeCd offre una grandissima stabilit&agrave; (in due anni di utilizzo non sono mai avvenuti crash) e una facilit&agrave; d'uso come pochi altri programmi. La semplicit&agrave; d'uso del programma, garantita dalla funzione di help on line, non pregiudica la sua professionalit&agrave;, riuscendo a soddisfare le necessit&agrave; dei pi&ugrave; esigenti.<BR>
Il programma non ha nulla da invidiare ai pi&ugrave; noti software per PC, superandone molti in qualit&agrave; e affidabilit&agrave;.<BR>
L'installazione &egrave; semplicissima e veloce. Una volta pronto, possiamo settare le impostazioni a seconda delle proprie esigenze e dell'hardware posseduto. Per prima cosa dobbiamo indicare di quali drive di lettura e scrittura intendiamo servirci: MakeCd, nelle ultime versioni, ha ampliato notevolmente il numero dei masterizzatori compatibili, riuscendo a coprire quasi completamente gli standard presenti sul mercato.<BR>
Per la nostra prova &egrave; stato usato come unit&agrave; di lettura un comune lettore Ide 32x, per la scrittura un masterizzatore SCSI-II. Il riconoscimento delle unit&agrave; avviene generalmente in automatico, segnalando all'utente il driver pi&ugrave; adatto; tuttavia pu&ograve; accadere che lettore o masterizzatore non vengano riconosciuti correttamente: allora spetter&agrave; a noi trovare, tra i driver disponibili, quello che garantisca un funzionamento corretto.<BR>
Gli autori di MakeCd comunque consigliano, prima di effettuare un qualsiasi acquisto, di consultare la lista dei masterizzatori direttamente supportati.<P>
MakeCd permette senza problemi di effettuare copie &quot;al volo&quot; sia di cd audio che di dati (per copia &quot;al Volo&quot; si intende senza la necessit&agrave; di scaricare il contenuto del cd su Hard Disk).<P>
<P ALIGN=CENTER><IMG SRC="grafica/makecd1.png"></P>
<P>
A differenza di altri software per PC, &egrave; possibilie masterizzare dati audio a 4x, senza che il cd destinazione abbia problemi di alcun genere.<BR>
Sebbene il manuale lo segnali come eventualit&agrave;, non &egrave; stato mai necessario ridurre la velocit&agrave; di copia. E' inoltre possibile estrarre e conservare su hard disk tracce audio nei formati pi&ugrave; disparati (CDDA, AIFF, WAVE, AIFC, MAUD).<P>
<P ALIGN=CENTER><IMG SRC="grafica/makecd3.png"></P>
<P>
La novit&agrave; sicuramente pi&ugrave; significativa apportata nell'ultima versione di MakeCd (3.2b), &egrave; la possibilit&agrave; di riconoscere direttamente tracce audio in formato mp3 e masterizzarle rendedole utilizzabili su normali lettori CD (hi-fi, portatili, ecc.); MakeCd infatti, utilizza la mpeg.library, convertendo direttamente i brani in tracce audio a 16 bit.<BR>
Usando una PowerPC con processore da 160mhz, MakeCd raggiunge una velocit&agrave; di lettura di circa 1,7x (290kb/sec): con una simile velocit&agrave; di lettura siamo costretti a portare la velocit&agrave; di scrittura ad 1x (praticamente in tempo reale). L'uso del PowerPc diviene quindi una scelta quasi obbligata per questo tipo di uso, poich&eacute; con la mpeg.library in versione 040 ,la velocit&agrave; raggiunta &egrave; di circa 0,4x. Una simile possibilit&agrave; &egrave; disponibile solo su pochi programmi per masterizzare, infatti molti utenti PC sono costretti a convertire i brani mp3 in wave e solo successivamente possono masterizzarli.<BR>
E' disponibile, grazie alla Fractal Minds, la versione con help in linea in italiano, inoltre tra breve dovrebbe essere pronta la traduzione del manuale in formato amigaguide. Per nostra fortuna sono disponibili  periodicamente nuovi aggiornamenti del programma (messi in rete anche tre-quattro volte l'anno), ampliando ogni volta la lista di lettori e masterizzatori supportati.<P>
MakeCd &egrave; disponibile in due versioni: una TAO (Track at once) ed un'altra DAO (Disk at once). Ad eccezione della disponibilit&agrave; del supporto DAO (peraltro non garantito da tutti i masterizzatori), non vi &egrave; alcuna differenza tra le due versioni.<BR>
Su internet comunque &egrave; disponibile una versione light, che ha ben poche limitazioni (massimo 10 tracce e  DAO solo in modo prova). Tali limitazioni sono rilevanti solo se si effettuano copie di Cd audio, divenendo quasi insignificanti nelle copie dei programmi (generalmente composte da una sola traccia), tuttavia si consiglia vivamente l'acquisto della versione completa, per permettere agli autori di continuare lo sviluppo di un programma che davvero non ha eguali.<P>
<P ALIGN=RIGHT><A HREF="mailto:benny.r@tiscalinet.it">Benny Ronchi</A><BR></P>
<HR>
</BODY>
</HTML>
