<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Boderunner</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Boderunner</H1>von<BR><A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>
       
<h3>Vergangenheit:</h3>

<P>1982 erschien f&uuml;r den Commodore 64 ein Spiel, welches ein absoluter
Klassiker in der Geschichte der Computerspiele wurde: Loderunner.
Gleichzeitig war es das allererste Spiel, bei dem ein Leveleditor
zum Erstellen eigener Spielfelder mitgeliefert wurde.</P>

<P>F&uuml;r alle die das Spiel nicht kennen, eine kurze <B>Spielbeschreibung</B>:</P>

<P>Die Aufgabe des Spielers ist es, alle im Level enthaltenen Sch&auml;tze
einzusammeln. In jedem Level befinden sich Sch&auml;tze, Mauern, Leitern,
Kletterstangen und intelligente Gegner, die Sie verst&auml;ndlicherweise am
Spielziel hindern wollen. Die einzigste Waffe des Spielers ist eine
Pistole, mit der man den Boden aufbohrt. Einerseits schafft man sich
Durchg&auml;nge, durch die man sich herunterfallen lassen kann, andererseits
bleiben die Gegner in diesen L&ouml;chern stecken und sind keine Gefahr mehr
f&uuml;r den Spieler. Hat man alle Sch&auml;tze in einem Level aufgesammelt, geht
es per Leiter in den n&auml;chsten Level.</P>

<h3>Gegenwart:</h3>

<P>1998 erschien f&uuml;r den Amiga der Loderunner-Klon &quot;Boderunner&quot;, der sich an
seinem Vorbild orientiert und gleichzeitig in einer zeitgem&auml;&szlig;en Aufmachung
daherkommt.</P>

<P>Somit komme ich gleich zu den <B>Hardwareanforderungen</B> die Boderunner stellt:</P>

<P>Ein Amiga mit AGA-Chipsatz, 2 MB Ram und einem 68020 oder 68030 Prozessor.
Laut Aussage des Autors kommt es auf einem Amiga ab einem 68040-Amiga
zu gro&szlig;en Problemen! Und dem kann ich leider nur beipflichten: W&auml;hrend
Boderunner auf diesen Konfigurationen anstandslos lief, lie&szlig; es sich auf
meinem 68040-Amiga nicht starten !</P>

<P>Da das Spiel aber sehr gelungen ist und ich davon ausgehe, da&szlig; ein Gro&szlig;teil
der Leser einen Amiga mit 68020 oder 68030-Prozessor besitzt, habe ich mich
dennoch entschlossen einen Bericht dar&uuml;ber zu verfassen.</P>

<P>Nach Starten des Spiels erscheint ein gerendertes Titelbild und danach ein
<B>Optionsbildschirm</B>, in dem auszuw&auml;hlen ist, ob man das Spiel startet, den 1-
oder 2-Spieler-Modus (welcher in einem gesplittetem Bildschirm abl&auml;uft!)
w&uuml;nscht, die Musik und/oder den Sound ein- oder ausschalten will oder ob
man die Hiscore-Liste (welche auch wieder l&ouml;schbar ist) anschauen m&ouml;chte.</P>

<P>Nach Auswahl des Spielstarts kann man nun aus 5 verschiedenen Spielwelten
ausw&auml;hlen, die wie folgt lauten:</P>

<UL>
<LI><B>Practice</B> : 6 leichte Level zum Erlernen des Umgangs mit dem Spiel.
</LI><LI><B>Challenge</B>: Eine Auswahl von 18 Leveln, die sich gegen&uuml;ber dem Orginal-
Spiel mit weiteren neuen Spielelementen bereichert sind,
dazu komme ich gleich.
</LI><LI><B>Classic</B>  : Diese 9 Spiellevel erinnern optisch stark an Handheld-Spiele,
welche vor ca. einem Jahrzehnt in Mode waren.
</LI><LI><B>Snowlands</B>: Diese 7 Level spielen in einer Winterlandschaft.
</LI><LI><B>Orginals</B> : Hier sind die ersten 13 Orginal-Loderunner-Level 1:1
&uuml;bernommen worden.
</LI></UL>

<P>Der schon jetzt sehr &uuml;berzeugende Eindruck des Spiels wird nach Anwahl der
Spielwelten nochmal &uuml;bertroffen, denn was hier Grafikpracht aus dem
AGA-Chipsatz herausgeholt worden ist, l&auml;&szlig;t so manches kommerzielle Spiel
weit hinter sich!</P>

<P>Der <B>Spielscreen</B> wird in 48 Farben wiedergegeben und die Hintergrundgrafiken
sind in 256 Farben dargestellt. Dazu werden viele Level - die sich h&auml;ufig
&uuml;ber mehrere Bildschirme hinweg erstrecken - sowie die Hintergrundgrafiken
fl&uuml;ssig parallaxgescrollt, was wirklich sehr sehenswert ist. Die Grafiken
sind sehr detailliert gezeichnet und weisen sehr viel Abwechslung auf, wie
zum Beispiel die Level in der &quot;Snowlands-World&quot;, wo h&auml;ufig ein
Schneetreiben vor sich hin st&uuml;rmt.</P>

<P>Ebenso passen sich die <B>Soundeffekte</B> und die Musik dem hohen Niveau an.</P>

<P>H&auml;ufig stellt man bei grafisch hervorragenden Spielen fest, da&szlig; daf&uuml;r das
Gameplay nicht &uuml;berzeugen kann, aber das ist bei &quot;Boderunner&quot; nicht der
Fall.</P>

<P>Der bereits schon beim Orginal hohe <B>Spielwert</B> wurde hier komplett
&uuml;bernommen und weist auch (durch die Technik bedingt) neue M&ouml;glichkeiten
auf. Ein Beispiel - von vielen - ist, da&szlig; die Spielfigur nur mit einer
Taschenlampe ausger&uuml;stet durch abgedunkelte Level l&auml;uft und bedingt durch
den kleinen Lampenstrahl eine begrenzte Sicht zur Verf&uuml;gung hat, so da&szlig; man
Fallen oder Gegner erst sehr sp&auml;t erkennt. W&auml;hrend sich das Orginal auf
1-Bildschirm-Level beschr&auml;nkte, konnten durch den Levelaufbau &uuml;ber mehrere
Bildschirme hinweg neue Spielm&ouml;glichkeiten geschaffen werden, welche den
Spielspa&szlig; noch um ein Vielfaches erh&ouml;hen.</P>

<P>Au&szlig;erdem ist noch ein neuer Gegner gegen&uuml;ber dem Orginal dazugekommen:
Der Wettlauf gegen die Zeit !</P>

<P>Ebenfalls wurde &quot;Boderunner&quot; auch ein sehr komplexer <B>Level-Editor</B>
beigef&uuml;gt, der allerdings eine gr&ouml;&szlig;ere Einarbeitungszeit ben&ouml;tigt und
leider nicht immer stabil war, was sich durch durch einige Abst&uuml;rze
bemerkbar machte. Hier sollte man vorsichtshalber des&ouml;fteren seine
kreierten Level zwischenspeichern!</P>

<P>Und leider hat sich ein weiterer <B>Bug</B> auch im Spiel selbst eingeschlichen:
Man sollte nach Start des Spiels das Titelbild nicht mit der Maus
wegklicken, denn dann h&auml;ngt sich das Spiel sp&auml;testens nach einem
gespielten Level auf!</P>

<P>Dieser Bug ist aber auch der einzige, der bei mir in ausf&uuml;hrlichen
Testphasen auftrat und das (in Assembler programmierte) Spiel l&auml;uft
ansonsten 100%ig korrekt.</P>

<h3>Zukunft:</h3>

<P>Nun komme ich zu einem gro&szlig;en <B>Wehrmutstropfen</B>:</P>

<P>Dieses Spiel welches im Aminet mit der Version 0.81 ver&ouml;ffentlich wurde,
erhielt im August 1998 noch ein Update auf die Version 0.82.</P>

<P>Diese Version - die nur beim franz&ouml;sischen Autor Christophe Kohler
erh&auml;ltlich ist - weist 56 weitere Level, neue Musikst&uuml;cke, eine High-
Score-Liste der schnellsten Levelzeiten und einen &quot;Hi-Score-Joiner&quot;
auf, mit dem man verschiedene Highscores (z.B. von Freunden) in einem
Highscore zusammenfassen kann.</P>

<P>Und diese Version ist auch definitiv die letzte Boderunner-Version auf
dem Amiga, denn aufgrund minimaler Resonanz auf das Spiel gab C. Kohler
das Projekt auf und programmiert derweil &quot;Boderunner&quot; als PC-Version!</P>

<P>Dies bedeutet, da&szlig; die eingangs erw&auml;hnten M&auml;ngel - die Lauff&auml;higkeit
ausschlie&szlig;lich auf Amigas mit 68020/030 Prozessoren, das Beachten der
Nichtbenutzung der Maus und die Instabilit&auml;t des Level-Editors - nicht
behoben werden!</P>

<P>Und hier mein pers&ouml;nlicher <B>Aufruf</B>: Wenn man ein wirklich rundherum
gelungenes Programm auf dem Amiga sieht, sollte man sich doch wirklich
die M&uuml;he machen, seine pers&ouml;nliche Meinung dem Autor kundzutun (per eMail
oder Brief), da dies die Programmierer motivieren kann und hoffentlich
zum Verbleib am Amiga bewegt!</P>

<P>Denn mit diesem Beispiel (&quot;Boderunner&quot;) ging dem Amiga ein wirklich
hervorragender Autor verloren, der nun sein K&ouml;nnen auf einem PC
weiteraus&uuml;bt!</P>

<h3>Fazit:</h3>

<P>Wie schon unschwer aus meinen Review erkennbar ist, kann ich dieses
Programm - welches Freeware ist! - uneingeschr&auml;nkt empfehlen, sofern man
einen Amiga mit einem 68020 oder 68030 Prozessor besitzt. Neben &quot;Deluxe
Galaga AGA&quot; und <a href="../sw/9803bb.htm">&quot;Blitzbombers&quot;</a> ist &quot;Boderunner&quot; ein Spiel, welches in
keiner PD-Spielesammlung fehlen sollte.</P>

                         <P ALIGN=CENTER><IMG SRC="../images/tip.gif"></P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>BodeRunner</B> 0.81</TD>
</TR>
<TR>
	<td><b>Status:</b></rd>
    <TD>Freeware</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:christophe.kohler@wanadoo.fr">Christophe Kohler</A></TD>
</TR>
</TABLE> 
<br>
Bezugsquelle:
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/game/jump/BodeRunner08.lha">http://ftp.uni-paderborn.de/pub/aminet/game/jump/BodeRunner08.lha</A>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903emu.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903easy.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


