<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - EASY 1541</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>EASY 1541</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>
    
<P>Obwohl wirklich hervorragende C64 Emulatoren auf dem Amiga vorhanden sind
(MagiC64 und Frodo als Beispiel genannt), gibt es zum Orginal-C64 dennoch
keine Alternative.</P>

<P>Sollte man das gro&szlig;e Vergn&uuml;gen haben, da&szlig; einem beide Rechner noch zur
Verf&uuml;gung stehen, stellt man sich doch irgendwann mal die Frage:
Wie transferiere ich Daten zwischen diesen beiden Kultrechnern?</P>

<P>Und hierf&uuml;r gibt es im &quot;Aminet&quot; (unter &quot;misc/emu&quot;) das Programm
&quot;<B>Easy1541</B>&quot; des Italieners Fabrizio Farenga, das erfreulicherweise
Freeware ist und sich uneingeschr&auml;nkt nutzen l&auml;&szlig;t.</P>

<P>Wie es sich aus dem Namen schon ergibt, wird hierzu nebst dem Amiga (ab OS
2.04 und 512 KB Ram wird jedes System unterst&uuml;tzt) auch die Floppy-Disk
1541 des C64 ben&ouml;tigt.</P>

<P>Sollte man vielleicht nur die 1541 besitzen, nicht aber den C64, so kann
man die 1541 auch als alternatives Disklaufwerk am Amiga betreiben, wobei
nat&uuml;rlich die Speicherkapazit&auml;t der 5 1/4 Zoll-Disketten doch etwas zu
w&uuml;nschen &uuml;brig l&auml;&szlig;t, denn es sind je Diskettenseite nur 170 KB!</P>

<P>Bevor man das Programm nutzen kann, gilt es noch eine H&uuml;rde zu nehmen:
Das <B>Verbindungskabel</B> mu&szlig; besorgt werden!</P>

<P>Die billigste Alternative ist es, sofern man ein Hardwarebastler ist,
das Kabel selber zu bauen. Der englischen Anleitung zu &quot;Easy1541&quot; liegt
hierzu ein ausreichend bebildeter Schaltplan bei, welches die
entsprechenden Pinbelegungen der beiden Ports ausweist.</P>

<P>Ist man nicht mit dem Talent begnadet, ein solches Kabel selber zu basteln,
so sollte man bei entsprechenden Amiga-Fachh&auml;ndlern mal nachfragen und auch
die Preise (welche zwischen 19,- DM und 49,- DM liegen) vergleichen.</P>

<P>Eine letzte Alternative w&auml;re es, sich direkt an Fabrizio Farenga zu wenden
oder aber an Christian Bauer (den Programmierer der C64-Emulation &quot;Frodo&quot;),
da auch diese beiden die Kabel zu einem Selbstkostenpreis vertreiben.</P>

<P>Wenn man nun stolzer Besitzer des Kabels ist, kann man endlich (bei
nat&uuml;rlich ausgeschalteten Ger&auml;ten ;) die Kabel am seriellen Bus der 1541
und dem Parallelport des Amiga anschlie&szlig;en. Das Kabel kann nur am Orginal-
Parallelport des Amiga verwendet werden, andere parallele Anschl&uuml;sse
(z.B. HyperCom) sind leider nicht nutzbar.</P>

<P>Nachdem man noch eine Library (welche dem Programmpaket beiliegt)
installiert hat, kann man nun &quot;Easy1541&quot; verwenden.</P>

<P>Easy1541 ist aber kein Programm im herk&ouml;mmlichen Sinne mit einem
GUI, sondern besteht aus acht Befehlen, die per CLI gestartet werden
k&ouml;nnen. Vielfachnutzern dieser  Befehle sei es daher empfohlen, diese
in einen Dateimanager (z.B.  DirectoryOpus) zu integrieren.</P>

<P>Was k&ouml;nnen nun diese <B>Befehle</B>?</P>

<P>Disketten oder einzelne Files k&ouml;nnen gespeichert oder geladen werden,
das Inhaltsverzeichnis wird gelesen, die Disk kann man formatieren, der
gegenw&auml;rtige Status der 1541 wird angezeigt und die Laufwerksnummer
(standardm&auml;&szlig;ig '8') kann ebenfalls ge&auml;ndert werden.</P>

<P>Desweiteren kann man der 1541 auch noch weitere spezifische Befehle (z.B.
Initialisieren einer Disk oder Umbenennen eines Files) mitteilen, die aber
f&uuml;r den allt&auml;glichen Gebrauch nicht unbedingt ben&ouml;tigt werden.</P>

<P>In der <B>Anleitung</B> werden alle verf&uuml;gbaren Befehle auch klar erl&auml;utert.</P>

<P>W&auml;hrend s&auml;mtlicher Operationen wird leider das Multitasking des Amiga
komplett abgeschaltet, so da&szlig; man z.B. beim Beschreiben oder Laden einer
Disk (was 10 Minuten dauert!) ruhig anderen Besch&auml;ftigungen nachgehen kann.</P>

<P>Nachdem ich alle Befehle sehr intensiv auf zwei Amigas (68030 und 68040)
getestet habe, kann ich nur beeindruckt sagen, da&szlig; w&auml;hrend der gesamten
Testzeit keinerlei Bugs o.&auml;. aufgetreten sind und alle Befehle wunschgem&auml;&szlig;
ausgef&uuml;hrt wurden.</P>

<P>Weiterhin ist auch positiv zu verzeichnen, da&szlig; man das 1541-Laufwerk auch
direkt in das Amiga-Filesystem einbinden kann, so da&szlig; eine eingelegte
5 1/4-Zoll-Diskette auch direkt &uuml;ber die Workbench bedient werden kann.</P>

<P>Obwohl nicht alle Befehle nutzbar sind (ein direktes Formatieren ist leider
nicht m&ouml;glich, Diskettenwechsel werden nicht erkannt), bilden aber die
verf&uuml;gbaren Funktionen (Lesen, Schreiben, L&ouml;schen oder Umbenennen eines
Files) eine bequeme Alternative zu den CLI-Befehlen.</P>

<P>Der einzige <B>Kritikpunkt</B> an &quot;Easy1541&quot; ist vielleicht das Fehlen einer
grafischen Benutzeroberf&auml;che, dadurch ist man halt doch &ouml;fter mal gezwungen,
in die Anleitung zu schauen, um die Syntax der jeweiligen Befehle in
Erfahrung zu bringen.</P>

<P><B>Fazit:</B></P>

<P>Alles in allem ist &quot;Easy1541&quot; ein hervorragendes und sehr zuverl&auml;ssiges
Programm, um die C64-Diskimages (welche z.B. auf Emulator-CD&#180;s -Endung
.D64- zu finden sind) auf die Orginal 5 1/4-Zoll-Disketten zu schreiben,
oder aber die Orginal C64-Disketten als Backup auf der HD oder einer
Diskette des Amiga zu sichern.</P>

<P>Und &quot;Easy1541&quot; beweist einmal mehr, was man am Amiga so alles anschliessen
und betreiben kann!</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>Easy1541</B> (Version 1.3)</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Freeware</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:holodream@gol-it.com">Fabrizio Farenga</A></TD>
</TR>
</TABLE> 
<br>
Bezugsquelle:
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/misc/emu/Easy1541.lha.lha">http://ftp.uni-paderborn.de/pub/aminet/misc/emu/Easy1541.lha.lha</A>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903br.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903fa.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


