<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - PD-Emu-Box</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>PD-Emu-Box</H1>von<BR><A HREF="mailto:uridium@t-online.de">Peter Fischer</A>
</DIV>
 
<P>Ansprungpunkte: <A HREF="#news">News</A> / <A HREF="liste.htm">Emulatoren-Liste</A></P>


<HR>

<h3 ALIGN=CENTER>Herzlich Willkommen in der PD-Emu-Box!</h3>

<P>Dieser neue Bereich ist ausschlie&szlig;lich den reichhaltig vorhandenen
Emulatoren f&uuml;r andere Computersysteme und Spielekonsolen auf dem Amiga
gewidmet.</P>

<P>Nachdem der Amiga l&auml;ngere Zeit der Rechner &quot;Nummer 1&quot; f&uuml;r die Entwicklung
von Emulatoren gewesen ist, wurde er Mitte der 90&#180;er Jahre durch die immer
schneller werdenden PCs und Apple-Macintoshs abgel&ouml;st.</P>

<P>Doch der Einsatz von PowerPC-Prozessoren auf dem Amiga l&auml;&szlig;t diesen
Vorsprung wieder schrumpfen, und es erscheinen nun Emulatoren f&uuml;r
rechenintensivere Systeme (z.B. dem Sega Megadrive), die unter 68k-
Rechnern bisher nicht m&ouml;glich gewesen sind.</P>

<P><B>Was erwartet Sie nun in dieser Box?</B></P>

<UL>
<LI>Interessante Neuigkeiten und Kurzvorstellungen aus der Welt der Emulatoren<BR><BR>und<BR><BR></LI>
<LI>eine Auflistung der derzeit erh&auml;ltlichen Emulatoren mit Angabe der Bezugsquellen im Internet.</LI>
</UL>

<P>Diese <A HREF="liste.htm">Liste</A> wird von mir st&auml;ndig aktualisiert, und erscheint als fester
Bestandteil in der &quot;PD-Emu-Box&quot;.</P>

<P>Sollten Sie Erg&auml;nzungen haben oder Unstimmigkeiten feststellen, w&uuml;rde
ich mich freuen, wenn Sie mir diese mitteilen.</P>

<HR>

<h3 ALIGN="CENTER"><A NAME="news">Neuigkeiten aus der Welt der Emulatoren</h3>

<P>Die wohl wichtigste Neuigkeit in der Emulatorszene ist die Ver&ouml;ffentlichung
der Version 3.10 des Apple Macintosh-Emulators &quot;<B>Shapeshifter</B>&quot; und die
gleichzeitige Ver&ouml;ffentlichung als Freeware!</P>

<P>Dies kann man mit einem weinenden und einem lachendem Auge betrachten:</P>

<P>Zum einen, da&szlig; dieser beeindruckende Emulator nun kostenfrei erh&auml;ltlich
ist, (bisher 50,- DM Sharewaregeb&uuml;hr), zum anderen aber, da&szlig; eine
Weiterentwicklung nun nicht mehr erfolgt.</P>

<P>Die elementarste Neuerung der Version 3.10 ist die Unterst&uuml;tzung des
MacOS 8.</P>

<P><A HREF="http://www.uni-mainz.de/~bauec002/SSMain.html">http://www.uni-mainz.de/~bauec002/SSMain.html</A></P>

<HR WIDTH="25%">

<P>In diesem Zusammenhang sei erw&auml;hnt, da&szlig; Apple Computer das <B>MacOS 7.5.3</B>
frei ver&ouml;ffentlicht hat und dieses unter der WWW-Adresse:</P>

<P><A HREF="http://asu.info.apple.com/swupdates.nsf/artnum/n11258">http://asu.info.apple.com/swupdates.nsf/artnum/n11258</A></P>

<P>downzuloaden ist.</P>


<P>Da die Installation dieses Betriebssystems etwas aufwendig ist, steht im
Internet ein <B>Komplettsystem</B> f&uuml;r &quot;Shapeshifter&quot; (ein Bootfile mit dem MacOS
7.5.5 - zur Nutzung wird nur noch das MacRom ben&ouml;tigt) unter der folgenden
Adresse abrufbereit: </P>

<P><A HREF="http://www.virtual-pc.com/nenners/macintosh/library/macinabox.html">http://www.virtual-pc.com/nenners/macintosh/library/macinabox.html</A></P>

<P>Hinweis: Die Gr&ouml;&szlig;e des Files betr&auml;gt gepackt ca. 8 MB!</P>

<HR width=70%>

<P>Nach Aussage von Apple Computer, Inc. wird das zuk&uuml;nftige <B>MacOS 8.6</B> ohne
das bisher ben&ouml;tige MacRom auskommen.</P>

<P>Dies l&auml;&szlig;t hoffen, das neben &quot;Shapeshifter&quot; und &quot;Fusion&quot; weitere Macintosh
-Emulatoren auf dem Amiga-Markt erscheinen!</P>

<P><A HREF="http://cyberdog.apple.com/">http://cyberdog.apple.com/</A></P>

<HR width=70%>

<P>Nach der freien Ver&ouml;ffentlichung von Shapeshifter arbeitet der Autor
Christian Bauer an einem neuen Macintosh-Emulator: Basilisk II</P>

<P><A HREF="http://www.uni-mainz.de/~bauec002/">http://www.uni-mainz.de/~bauec002/</A></P>

<HR width=70%>

<P>Der erste Nintendo 64-Emulator ist unter dem Namen &quot;<B>TrueReality</B>&quot;
erschienen.</P>

<P>Wer jetzt davon tr&auml;umt, eines Tages &quot;Super Mario 64&quot; oder &quot;Zelda 64&quot; auf
dem Amiga zu spielen, mu&szlig; leider entt&auml;uscht werden, denn:</P>

<P>Es ist (trotz vorhandener PPC-Prozessoren) technisch auf dem Amiga nicht
m&ouml;glich, die anspruchsvolle Hardware (u.a. 64-bit MIPS R4300 RISC-CPU und
die speziellen Grafikchips) in angenehmer Geschwindigkeit zu emulieren!</P>

<P>TrueReality (welches einen PPC-Prozessor ben&ouml;tigt) emuliert nur die CPU
des N64, und kommt bei relativ simplen Nintendo 64-Spielen, wie z.B.
&quot;Pong64&quot; gerade auf eine Geschwindigkeit von 16 fps (Frames pro Sekunde)
auf einem PPC603 (200 Mhz) unter AGA!</P>

<P><A HREF="http://www.amidog.com/">http://www.amidog.com/</A></P>

<hr width=70%>

<P>Vom gleichen Autor (Mathias Roslund) stammt der Sega Megadrive-Emulator
&quot;<B>AmiGenerator</B>&quot;. </P>

<P>Dieser liegt in einer 68040+ Version und einer PPC-Version vor und
unterst&uuml;tzt AGA sowie Grafikkarten.</P>

<P>Da sich diese Emulation noch in einem sehr fr&uuml;hen Entwicklungsstadium
befindet, wird derzeit noch kein Sound unterst&uuml;tzt und die Bedienung der
Spiele findet nur per Tastatur statt.</P>

<P>Unter meinem 68040-Prozessor war AmiGenerator lauff&auml;hig, doch erinnerte
die Geschwindigkeit von &quot;Sonic 1&quot; eher an eine Slideshow und eine
annehmbare Nutzung ist nicht m&ouml;glich.</P>

<P>Ganz anders sah es aber unter meinem 603e+ (200Mhz) aus, denn:</P>

<P>Mit einer Wiedergabe von 35 fps bei &quot;Sonic 1&quot; kommt es wirklich zu einer
1:1 Geschwindigkeitsumsetzung des &quot;Sega Megadrive&quot; ohne Grafikfehler!</P>

<P>Zu dem gleichem Ergebnis kam ich bei dem Kampfspiel &quot;Streets of Rage&quot;,
w&auml;hrend &quot;Columns 3&quot; und &quot;Outrun&quot; sich nicht starten lie&szlig;en.</P>

<P>Dieser Emulator ist trotz seiner Einschr&auml;nkungen (kein Sound, keine
Joystick-Unterst&uuml;tzung) f&uuml;r alle PPC-Besitzer schon jetzt einen Download
wert!</P>

<P><A HREF="http://www.amidog.com/amigenerator">http://www.amidog.com/amigenerator</A></P>

<HR width=70%>

<P>Nach einer zweij&auml;hrigen Pause meldete sich Michael Kramer mit neuen
Versionen (1.8 und aktuell 1.81) des C64-Emulators &quot;<B>MagiC64</B>&quot; zur&uuml;ck.</P>

<P>Hier die wichtigsten Neuerungen:</P>

<UL>
<LI>Komplett neugeschriebene CPU6502-Emulation        </LI>
<LI>Die 1541- und VIC-Emulationen wurden verbessert.  </LI>
<LI>&Auml;nderungen im GUI                            </LI>
<LI>Drag&#180;n&#180;Drop ist jetzt m&ouml;glich      </LI>
</UL>

<P><A HREF="http://ns.ac-copy.net/~magic64/">http://ns.ac-copy.net/~magic64/</A></P>

<HR width=70%>

<P>Auch der NES-Emulator &quot;<B>CoolNESs</B>&quot; wurde mit der Version 0.74 hinsichtlich
des Sounds verbessert.</P>

<P>Durch die stetige Optimierung von &quot;CoolNESs&quot; treten leider bei horizontal
scrollenden Spielen (wie z.B. &quot;1942&quot; oder &quot;Twin Cobra&quot;) unangenehme
Grafikfehler auf: Am oberen Bildschirmrand wird der untere Bildschirm
erneut wiedergegeben!</P>

<P>Bis dieser Fehler wieder in einer zuk&uuml;nftigen Version behoben wird,
empfehle ich zus&auml;tzlich zur aktuellen Version noch die Version 0.63
bereitzuhalten (erh&auml;ltlich auf der Aminet CD 24), da dort diese
Grafikfehler noch nicht auftraten.</P>

<P><A HREF="http://hem2.passagen.se/flubba/coolness.html">http://hem2.passagen.se/flubba/coolness.html</A></P>

<HR>

<P>Ansprungpunkte: <A HREF="#news">News</A> / <A HREF="liste.htm">Emulatoren-Liste</A>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903box.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903br.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>



