<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Heretic und Hexen</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Heretic und Hexen</H1>von<BR><A HREF="mailto:uridium@-t-online.de">Peter Fischer</A></DIV>

<h3>Vorbemerkung:</h3>

<P>Nachfolgend handelt es sich nicht um einen Test der angesprochenen Spiele,
sondern um eine Beschreibung des Standes der Technik, sie auf dem Amiga zu
verwenden.</P>

<h3>Hintergrundinformationen:</h3>

<P>Nachdem im Dezember 1997 der Sourcecode von Doom (ID-Software) freigeben
wurde, erschienen bereits kurze Zeit sp&auml;ter sehr gute Amiga-Portierungen
f&uuml;r diesen (in Deutschland) <A HREF="../amz0399/derindex.htm">indizierten</A> 3D-Shooter.</P>

<P>Im Januar 1999 gaben ID-Software und Ravensoft zwei weitere Sourecodes
frei: Heretic und Hexen, die Nachfolger von Doom. Und es dauerte nur
wenige Tage, bis f&uuml;r beide Spiele erste <B>Amiga-Portierungen</B> ver&ouml;ffentlicht
wurden.</P>

<P>Jeweils einen Port, die zum gegenw&auml;rtigen Zeitpunkt schon sehr weit
fortgeschritten sind, habe ich mir f&uuml;r jedes Spiel mal genauer
angeschaut:</P>

<P>Heretic: <B>Heretic Amiga Port v.0.935</B></P>

<P>und</P>

<P>Hexen  :  <B>VAxen Amiga Port 0.6</B></P>

<P>Beide Portierungen wurden von dem polnischen Coder <B>Sebastian
Jedruszkiewicz</B> programmiert. Dieser ist Mitglied der Demo-Gruppe &quot;Venus
Art&quot;, deren PPC-Demos (&quot;The field where I died&quot;, &quot;Absolon&quot; u.a.) schon
f&uuml;r viel Aufsehen in der Amiga-Szene sorgten.</P>

<h3>Technische Voraussetzungen:</h3>

<P>Um es gleich vorwegzunehmen: Es gibt f&uuml;r beide Spiele <B>68k-Portierungen</B>,
die bereits einen 68030-Prozessor und AGA voraussetzen, aber:</P>

<P>Bei einem Bildaufbau von ca. 2 fps (Frames per Sekunde) bei einem 68030
Rechner und ca. 8 fps bei einem 68040er kommt wahrlich keine Spielfreude
auf, denn das Ruckeln hierbei ist zu spielehemmend.</P>

<P>Auf einem Amiga mit &uuml;bertaktetem 68060 Prozessor (66 Mhz) und einer
Grafikkarte konnten immerhin ca.19 fps gemessen werden, was man doch
schon akzeptabel nennen kann.</P>

<P>Aber die wahre Spielfreude kommt erst mit einem PPC-Board auf, denn dort
betr&auml;gt die Framerate (unter AGA) zwischen 26 und 36 fps! Und mit dieser
Konfiguration habe ich auch beide Spiele getestet. Die Wertungen hierf&uuml;r
beziehen sich auch ausschlie&szlig;lich auf die <B>PPC-Versionen</B>, welche auf der
&quot;PowerUp&quot;-Software von Phase 5 basieren!</P>

<h3>Was wird ben&ouml;tigt:</h3>

<UL>
<LI>AGA oder eine Grafikarte</LI>
<LI>16 MB Fast-Ram</LI>
<LI>freier Festplattenspeicher: 19 MB (Heretic) bzw. 24 MB (Hexen)</LI>
<LI>ppc.library</LI>
<LI>doomsound.library und hereticsound.library (beide sind in den Archiven enthalten)</LI>
<LI>und (nat&uuml;rlich) ein spielbares WAD!</LI>
</UL>

<h3>Was ist ein WAD?</h3>

<P>Dieses File beinhaltet alle relevanten Daten des jeweiligen Spiels und
ist Bestandteil der Vollversionen von Heretic bzw. Hexen. Die Gr&ouml;&szlig;e
dieser Files betr&auml;gt bei Heretic 14 MB und bei Hexen gar 20 MB!</P>

<P>W&auml;hrend bei Heretic auch das Shareware-WAD
(Quelle: <A HREF="http://ftp.cdrom.com/pub/idgames/idstuff/heretic">http://ftp.cdrom.com/pub/idgames/idstuff/heretic</A>)
und das registrierte WAD spielbar sind, ben&ouml;tigt VAxen ausschlie&szlig;lich
das kommerzielle WAD!</P>

<P>Da diese Spiele bereits vor Jahren erh&auml;ltlich waren, ist es nicht einfach,
heute noch Vollversionen zu erhalten. Aber die Suche bei einigen Vers&auml;nden
oder Suchanzeigen f&uuml;hrten mich dann doch zum Erwerb dieser!</P>

<P>Nicht unbedingt n&ouml;tig, aber dennoch empfehlenswert, ist die Benutzung der
ADoom-Midi-Instrumente (&quot;Adoom_Ins.lha&quot;, Quelle: Aminet oder Aminet-CD 25
[da das File eine Gr&ouml;&szlig;e von 2,4 MB besitzt]), um auch die gelungenen Musik-
st&uuml;cke h&ouml;ren zu k&ouml;nnen.</P>

<h3>Spielablauf:</h3>

<P>Wer Doom kennt, findet sich in beiden Spiele auch sofort zurecht, denn auch
hier ist das <B>Hauptziel</B>: Anhand einer Ego-Spielperspektive durch Labyrinthe
und Au&szlig;enwelten streifen, kleinere R&auml;tsel l&ouml;sen (Schalter finden) und mit
variantenreichen Waffen alle Gegner vernichten.</P>

<P>Obwohl die <B>Spielszenarien</B> im Fantasy-Bereich angesiedelt sind (die
Handb&uuml;cher weisen darauf hin, da&szlig; man als Elfe (!) versucht, das in die
H&auml;nde der b&ouml;sen M&auml;chte gefallene K&ouml;nigreich zur&uuml;ckzuerobern), stehen beide
Spiele im Bereich der Gewaltt&auml;tigkeit dem Vorg&auml;nger in nichts nach und
<B>daher ist es dringend empfohlen, diese Spiele j&uuml;ngeren Menschen nicht zu
zeigen!</B> </P>

<P>Wenn man dieses (auch f&uuml;r sich selbst!) ber&uuml;cksichtigt, stehen einem zwei
technisch und auch vom Gameplay herausragende Spiele dieser Art zur
Verf&uuml;gung, denn:</P>

<P>Beide Spiele beinhalten jeweils <B>&uuml;ber 40 sehr komplexe Level</B>, zu deren
L&ouml;sung man sehr viel Zeit und Geduld aufbringen mu&szlig;. Aber, wie schon bei
Doom, kommt beim Spielen garantiert keine Langeweile auf, denn stets wird
man mit neuen Fallen und Gegnern konfrontiert. Es stehen 5 verschiedenen
Schwierigkeitslevel zur Wahl, die von leicht bis unl&ouml;sbar gehalten sind.</P>

<P>W&auml;hrend man bei Heretic einen vorgegebenen K&auml;mpfer hat, kann man bei Hexen
einige rollenspiel&auml;hnliche Elemente endecken: Am Anfang w&auml;hlt man zwischen
drei verschiedenen Charakteren aus: einem K&auml;mpfer, Kleriker oder Magier,
deren Werte sich in den Bereichen der Geschwindigkeit, R&uuml;stung, Magie und
Kraft unterscheiden und nach Auffinden von Artifakten kann man in diesen
Bereichen in h&ouml;here Klassen aufsteigen.</P>

<P>Wer nun denkt, es handelt sich bei Hexen um ein Rollenspiel, der t&auml;uscht
sich, denn diese Elemente dienen nur einer h&ouml;heren Durchschlagskraft der
<B>Waffen</B>.</P>

<P>Und bei diesen handelt es sich nicht um die hinl&auml;nglich bekannten Pistolen,
Pumpguns oder Laser, sondern um &Auml;xte, Pfeile und weitere Fabelwaffen, wie
z.B. magische Kugeln, die ein Sperrfeuer entfachen, oder einen H&ouml;llenstab,
der nach Aktivierung einen herabfallenden Feuerregen erzeugt (optisch sehr
gelungen!).</P>

<P>Beide Spiele (1995 und 1996 f&uuml;r den PC programmiert) befinden sich
<B>technisch</B> auf einem hohen Niveau, welches die Vorzeige-Amiga-Shooter
&quot;Genetic Species&quot;, &quot;Nemac IV&quot; oder &quot;Alien Breed 3D 2&quot; nicht erreicht
haben.</P>

<P>Fl&uuml;ssiger Spielablauf (wohlbemerkt bei der PPC-Version), detaillierte und
hochaufl&ouml;sende Texturen, sehenswerte optische Effekte (z.B. beim Gebrauch
der Waffen, beim Sprung in&#180;s Wasser sieht man das Wasser &quot;platschen&quot;, der
Bildschirm &quot;bebt&quot;, wenn Steinbl&ouml;cke herunterfallen usw.), komfortables
Automapping, Einstellung der Bildschirmhelligkeit und 5-fach ver&auml;nderbares
Auf- und Abschauen, sind dort zum gro&szlig;en Teil nicht zu finden.</P>

<P>Desweiteren gibt es bei Heretic die M&ouml;glichkeit, als Spieler zu fliegen
(nach Auffinden der &quot;Inhilicons-Schwingen des Zorns&quot;), w&auml;hrend man bei
Hexen nun auch auf h&ouml;here Positionen springen kann.</P>

<P>Gegen&uuml;ber dem Vorg&auml;ngerprogramm erkennt man eindeutig, da&szlig; die <B>Grafikengine</B>
von ID-Software und Ravensoft seither stetig weiterentwickelt wurde und
zwei neue Referenzprogramme bei den 3D-Shootern nun auch auf dem Amiga
vorhanden sind.</P>

<P>Die <B>Soundeffekte</B> und die Musik sind f&uuml;r beide Programme ausreichend und
k&ouml;nnen stufenlos im Anfangsmenu hinsichtlich der Lautst&auml;rke eingestellt
werden.</P>

<P>Bei beiden Spielen wurde ein netter <B>Joke</B> integriert, der nach Eingabe der
Passw&ouml;rter &quot;Cockadoodledo&quot; (bei Heretic) und &quot;Deliverance&quot; (Hexen) den
Spieler in ein Huhn (!) bzw. ein Schwein (!!) verwandelt, nebst passenden
Tierger&auml;uschen ;).</P>

<P>Allerdings sollte man diese Passw&ouml;rter nur anwenden, wenn gerade kein
Feind in der N&auml;he ist, denn in dieser Phase (nach zirka einer Minute wird
man wieder zur&uuml;ckverwandelt) ist man vollkommen wehrlos.</P>

<P>Nun wieder zur&uuml;ckkommend auf die <B>Amiga-Spezifikationen</B>:</P>

<P>Bemerkenswert ist, da&szlig; beide Portierungen im Multitasking laufen und man
nach Beendigung der Spiele problemlos an seinem Amiga weiterarbeiten kann!</P>

<P><b>Wo viel Licht ist, ist auch Schatten:</b></P>

<P>Dies machte sich bei VAxen (Hexen) bemerkbar, denn nachdem ich einen Level
beendet hatte, bzw. per Cheat einen Levelsprung aktivierte, lie&szlig; sich
leider der n&auml;chste nicht mehr laden, und das Programm &quot;h&auml;ngte sich auf&quot;.</P>

<P>Da es sich bei VAxen aber noch um eine fr&uuml;he Version der Portierung handelt
(Version 0.6) gehe ich davon aus, da&szlig; dieser Bug sicher behoben wird, bzw.
zum gegenw&auml;rtigen Zeitpunkt (Erscheinen dieser Ausgabe) auch schon behoben
ist.</P>

<P>Die Heretic Version (Version 0.935) ist schon weiter fortgeschritten,
hier gibt es keine gravierend spielst&ouml;renden Bugs mehr zu verzeichnen.</P>

<h3>Fazit:</h3>

<P>Um es noch einmal zu sagen: Da die Spiele von ID-Software aufgrund Ihrer
extrem hohen Brutalit&auml;t schon immer f&uuml;r reichlich Diskussionen sorgten,
mu&szlig; jeder f&uuml;r sich in dieser Hinsicht sein pers&ouml;nliches Fazit ziehen, ob
er diese Spiele auch auf seinem Amiga installiert und nutzt!</P>

<P>Wer sich daf&uuml;r entscheidet und einen PPC-Prozessor sein eigen nennt, dem
k&ouml;nnen beide Spiele (hinsichtlich Ihrer Komplexit&auml;t und den zweifelsohne
reichlich vorhandenen Spannungsmomenten sowie den technischen Finessen)
als auch die genannten Amiga-Portierungen nur empfohlen werden!</P>

<P>Aufgrund der Tatsache, da&szlig; ich Portierungen von zwei PC-Spielen getestet
habe und kein kommerzielles Amiga-Spiel, verzichte ich auf eine Bewertung
und verweise jetzt auf die Bezugsquellen:</P>

<P><B>Quellen der Portierungen:</B></P>

<P>Heretic: <A HREF="http://ftp.uni-paderborn.de/pub/aminet/game/shoot/Heretic.lha">http://ftp.uni-paderborn.de/pub/aminet/game/shoot/Heretic.lha</A><BR>
VAxen  : <A HREF="http://ftp.uni-paderborn.de/pub/aminet/game/shoot/VAxen.lha">http://ftp.uni-paderborn.de/pub/aminet/game/shoot/VAxen.lha</A>
 </P>
<P><B>Quellen des Heretic-Shareware-Wads:</B><BR>
<A HREF="http://ftp.cdrom.com/pub/idgames/idstuff/heretic">http://ftp.cdrom.com/pub/idgames/idstuff/heretic</A>
  </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903gag.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903liga.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


