<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Ligamanager 3.2</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Ligamanager 3.2</H1>von<BR><A HREF="mailto:Uridium@t-online.de">Peter Fischer</A></DIV>

<P>Das Programm &quot;Ligamanager&quot; ist ein sehr komplexes
<B>Sportligenverwaltungsprogramm</B>, welches Spielergebnisse, Termine und
Zuschauerzahlen verwaltet, sowie zahlreiche Tabellen und Statistiken
daraus erstellt.. </P>

<h3>Systemvoraussetzungen:</h3>

<P>Ein Amiga mit OS 2.0 oder h&ouml;her, eine Festplatte wird empfohlen.</P>

<h3>Das Programmpaket:</h3>

<P>Die Vollversion wird auf einer Diskette ausgeliefert oder per eMail vom
Autor Marcus Stratmann (nach Bezahlung der Sharewaregeb&uuml;hr in H&ouml;he von
30,-DM) zugesandt.</P>

<P>Nebst dem eigentlichem Hauptprogramm findet man noch einige Hilfsprogramme
zum Erstellen eigener Ligen (inklusive Beispieldaten), eine umfangreiche
Fu&szlig;balldatensammlung im Ligamanagerformat, welche alle Daten der 1. und 2.
Fu&szlig;ballbundesliga sowie den Regionalligen seit Gr&uuml;ndung dieser beinhaltet,
und ein Installationsprogramm.</P>

<h3>Die Installation:</h3>

<P>Das Installationsprogramm kopiert aber leider nicht das gesamte Verzeichnis
auf das Festplattenverzeichnis der Wahl, sondern lediglich die ben&ouml;tigte
Librarys &quot;reqtools.library&quot; in das &quot;Libs&quot;-Verzeichnis und die
Konfigurations-Datei &quot;LigaManager.config.&quot; in das Verzeichnis &quot;Envarc&quot;.</P>

<P>Das Hauptverzeichnis &quot;Ligamanager&quot; mu&szlig; per Hand auf das gew&uuml;nschte
Ziellaufwerk kopiert werden. Hier bleibt zu w&uuml;nschen, da&szlig; bei einer
n&auml;chsten Version gleich &quot;N&auml;gel mit K&ouml;pfen&quot; gemacht werden  und die
vollst&auml;ndige Programminstallation komplett per Installprogramm
durchf&uuml;hrbar ist. </P>

<P>Die o.a. Datensammlung liegt im Lha-Format gepackt vor und mu&szlig; ebenfalls
manuell entpackt und zugewiesen werden.</P>

<h3>Anleitung:</h3>

<P>Den vielf&auml;ltigen M&ouml;glichkeiten des Programms wurde mit einer
&uuml;bersichtlichen und deutschsprachigen Anleitung in einem AmigaGuide-
Dokument Rechnung getragen, welche sehr umfangreich ausgefallen ist
(Gr&ouml;&szlig;e: 163 KB).</P>

<P>Man findet sich auch ohne Studium der Anleitung sofort zurecht, dennoch
ist das Lesen dieser Anleitung sehr zu empfehlen, um die sehr zahlreich
vorhandenen Nutzungsm&ouml;glichkeiten des &quot;Ligamanager&quot; kennenzulernen.</P>

<h3>Start:</h3>

<P>Nach dem Start des &quot;Ligamanager&quot; erwartet einen ein fast leerer Bildschirm,
welcher die aktuelle Versionsnummer, das Systemdatum und einen Hinweis auf
die Benutzung der Men&uuml;s ausgibt.</P>

<P>Und am Anfang stehen die drei Men&uuml;s &quot;Projekt&quot;, &quot;Daten&quot; und &quot;Optionen&quot; zur
Verf&uuml;gung. Diese Men&uuml;s beinhalten derma&szlig;en viele Untermen&uuml;s, da&szlig; deren
komplette Beschreibung den Umfang dieses Tests sprengen w&uuml;rde.</P>

<P>Alle wichtigen Elemente zur Verwaltung von Sportligen sind integriert,
als Beispiel seien nur einige genannt: Ergebniseingabe, unterschiedliche
Tabellenausgaben (auch in grafischer Darstellung), umfangreiche
Statistiken (Rekordergebnisse, Rekordserien), Zuschauerein- und Ausgaben
und vieles mehr.</P>

<P>Im Optionen-Menu stehen einem nicht weniger als 21 verschiede M&ouml;glichkeiten
zur Verf&uuml;gung, die erlauben, das Programm und die Daten seinen eigenen
Bed&uuml;rfnissen anzupassen. </P>

<P>Erfreulicherweise werden auch nur die Menues ausgegeben, die zum
jeweiligen Anla&szlig; ben&ouml;tigt werden (und hiervon erscheinen aktuell nicht
nutzbare Men&uuml;punkte in &quot;Geisterschrift&quot;).</P>

<P>Ebenfalls werden nur die angeforderten Datenausgaben auf dem Bildschirm
dargestellt, so da&szlig; auch dieser nicht grafisch &uuml;berladen ist und man stets
den &Uuml;berblick beh&auml;lt.</P>

<h3>Technische Spezifikationen:</h3>

<P>Ligamanager ist bereits bei einem 68000-Prozessor in angenehmer
Geschwindigkeit nutzbar und h&ouml;here Prozessoren werden durch schnellere
Berechnungen und hierdurch schnellere Bildschirmausgaben unterst&uuml;tzt. Eine
PowerPC-Unterst&uuml;tzung existiert nicht, wird aber auch durch die schnellen
68k-Berechnungen nicht ben&ouml;tigt.</P>

<P>Da &quot;Ligamanager&quot; im Multitasking l&auml;uft, ist jederzeit eine problenlose
R&uuml;ckkehr auf die Workbench m&ouml;glich. </P>

<h3>M&auml;ngel?</h3> 

<P>W&auml;hrend meiner ausf&uuml;hrlichen Testsitzungen trat kein Fehler zutage und
das Programm verrichtete anstandslos seine Dienste. M&ouml;gliche Anwenderfehler
quittierte der &quot;Ligamanager&quot; mit einem Bildschirmblitzen.</P>

<P>Ein wesentlicher Punkt, der nicht in das Programm integriert wurde, ist
die Eingabe von Spielernamen oder Torsch&uuml;tzen, welches den ansonsten sehr
guten Gesamteindruck doch schm&auml;lert.</P>

<h3>Fazit:</h3>

<P>Obwohl das Programm aufgrund der Fu&szlig;ball-Icons auf ein
Fu&szlig;ballligenverwaltungsprogramm schlie&szlig;en l&auml;&szlig;t, lassen sich auch andere
Sportarten, wie z.B. Handball oder Basketball problemlos verwalten, was
den &quot;Ligamanager&quot; auch f&uuml;r eine breitere Schicht der Sportfans
interesssant macht.</P>

<P>Trotz der zwei oben genannten M&auml;ngel (fehlende Komplettinstallation und
das Fehlen der Eingabem&ouml;glichkeit von Spielerdaten) &uuml;berzeugt das Programm
durch die zahlreichen Konfigurations- und Nutzungsm&ouml;glichkeiten und stellt
in diesem Anwendungsbereich die derzeitige Referenz auf dem Amiga dar. Wer
sich selbst davon einen Eindruck machen m&ouml;chte, kann eine leicht
eingeschr&auml;nkte Demoversion im Aminet beziehen. </P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>Ligamanager</B> Version 3.2</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Shareware - Preis der Vollversion: 30,- DM</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:stratmann@gmx.de">Marcus Stratmann</A></TD>
</TR>
</TABLE> 
<br>
Bezugsquelle der Demoversion:<BR>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/biz/dbase/ligamanager.lha">http://ftp.uni-paderborn.de/pub/aminet/biz/dbase/ligamanager.lha</A><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903b3d.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903web.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
