<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - FaYoh 2</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>FaYoh 2</H1>von<BR><A HREF="mailto:uridium@-t-online.de">Peter Fischer</A></DIV>

<P>Nachdem der Amiga im Bereich der &quot;<B>Jump&#180;n&#180;Run</B>&quot;-Spiele &uuml;ber Jahre hinweg mit
au&szlig;erordentlich guten Spielen dieses Genres verw&ouml;hnt worden ist  - &quot;The
Great Giana Sisters&quot;, &quot;Superfrog&quot; oder &quot;Mr. Nutz&quot; als Beispiele genannt -
wurde es hier in den letzten Jahren leider merklich ruhig.</P>

<P>Die schwedische Softwaregruppe &quot;<B>NC.Gamez&quot;</B> nahm sich mit &quot;FaYoh 2 - Another
New Adventure&quot; (so der vollst&auml;ndige Name dieses Spiels) diesem Genre wieder
an und orientierte sich hierbei zweifelsohne an dem Nintendo-Klassiker
&quot;Super Mario&quot;.</P>

<P>Die <B>Vorgeschichte</B> (welche in der englischsprachen Anleitung geschrieben
steht) erz&auml;hlt davon, da&szlig; der Hauptfigur &quot;FaYoh&quot; (ein gr&uuml;ner Kaugummi)
der Kaugummiautomat von dem b&ouml;sen &quot;Don Jockface&quot; gestohlen ist und in
dessen Burg mitgenommen wurde. Die in diesem Kaugummiautomaten gesammelten
Sterne (!) gingen in der Burg verloren, und nun ist es FaYohs Aufgabe, die
Sterne wieder einzusammeln und sich im finalen Kampf &quot;Don Jockface&quot; zu
stellen.</P>

<P>Bevor der Spieler sich dieser Aufgabe annehmen kann, wird ein AGA-Amiga
mit mindestens einem 68020 Prozessor und einer Festplatte vorausgesetzt.</P>

<P>Wenn &quot;FaYoh&quot; gestartet ist, erwartet einen ein <B>Optionsscreen</B>, in dem man
das Spiel starten bzw. bereits gespeicherte Files laden, diese hier auch
wieder l&ouml;schen kann. Information &uuml;ber das Spiel, als auch die M&ouml;glichkeit,
das Spiel zu verlassen und zur Workbench zur&uuml;ckzukehren, bieten die
weiteren Optionen.</P>

<P>Nachdem man sich f&uuml;r den Spielstart entscheidet, erwartet einen eine sehr
gelungene <B>Levelanwahl</B>, in der man die Spielfigur in der Burg zu 16
Spiegeln f&uuml;hrt, welche den Eingang zu den Levels darstellen.</P>

<P>Alle <B>16 Spiellevel</B> sind sofort und jederzeit anw&auml;hlbar, weitere 5 Level,
die die Endgegner beinhalten, sind erst nach Absolvierung von jeweils 4
Abschnitten zug&auml;nglich. Weiterhin besteht hier noch die M&ouml;glichkeit, im
Austausch von 10.000 Punkten seinen Spielstand abzuspeichern und nach
bereits 2.000 erspielten Punkten diese gegen ein Spiel &quot;Memory&quot; (!)
einzul&ouml;sen, wo weitere Zusatzleben erh&auml;ltlich sind.</P>

<P>Der <B>Spielablauf</B> ist eindeutig an dem Vorbild &quot;Super Mario&quot; orientiert,
auch hier gilt es von unten mit dem Kopf an Felsen zu springen, um aus
diesen Gegenst&auml;nde (wie z.B. M&uuml;nzen) &quot;herauszuquetschen&quot;. Weiterhin
sammelt man die verlorenen Sterne, Fr&uuml;chte oder auch Schl&uuml;ssel (die
Barrikaden verschwinden lassen) auf, und weicht Fallen (z.B.
herabfallenden Dornen) aus.</P>

<P>Der <B>Feinde</B> entledigt man sich ebenfalls durch gezielte Spr&uuml;nge auf deren
K&ouml;pfe. Dies ist die einzige M&ouml;glichkeit, sich zu wehren. Hier vermisse
ich pers&ouml;nlich die M&ouml;glichkeit auch mittels Sch&uuml;ssen die Gegner zu
bek&auml;mpfen.</P>

<P>Die zum Teil sehr gro&szlig; ausgefallenen Level spielen sowohl in der Burg,
als auch im Freien und im Wasser. Hierzu verwandelt sich &quot;FaYoh&quot; in einen
Fisch und durchquert diese schwimmend.</P>

<P>Weitere <B>Metamorphosen</B> finden statt, wenn &quot;FaYoh&quot; einen Propeller findet,
mit dem er fliegen kann oder einen goldenen Anzug, mit dem er f&uuml;r die
Gegner unsichtbar bleibt, solange er nicht einen davon ber&uuml;hrt.</P>

<P>Die <B>cartoonartige Grafik</B> und die niedlichen Charaktere des Spiel sind sehr
gelungen, sowie hervorragend animiert und erinnern auch hier an das gro&szlig;e
Vorbild. Die wenigen Soundeffekte sind von der Qualit&auml;t her ausreichend,
und die stetig vorhandenen Musikst&uuml;cke sind nett arrangiert und h&ouml;renswert.</P>

<P>Auch die <B>Steuerung</B> &uuml;berzeugt und die Kollisitionsabfrage ist auch sehr
genau, was auch erforderlich ist, denn: Das Spiel ist teilweise sehr
schwer und man ben&ouml;tigt schon millimetergenaue Spr&uuml;nge, um nicht mit
einem Feind zusammenzusto&szlig;en, denn nach bereits einer Feindesber&uuml;hrung
hat man eines seiner (von am Anfang drei) vorhandenen Leben verloren.</P>

<P>Aber auch bei diesem Spiel gilt: <B>Wo viel Licht ist, ist auch Schatten!</B></P>

<P>Dies macht sich dadurch bemerkbar, da&szlig; man bei einem Lebensverlust alle
bereits aufgesammelten Gegenst&auml;nde komplett verliert und man sie alle
ein erneutes Mal aufsammeln mu&szlig;, was zum Teil doch ein wenig frustrierend
und langatmig ist.</P>

<P>Da die meisten Level sich in der Burg befinden, wiederholen sich die
Grafiken sehr h&auml;ufig  - hier h&auml;tte ich mir doch noch ein wenig mehr
Abwechslung f&uuml;r das Auge gew&uuml;nscht. Das gleiche gilt auch f&uuml;r die
verschiedenen Gegner, die h&auml;ufig nur aus umherlaufenden Soldaten und
fliegenden V&ouml;geln bestehen.</P>

<P>Wer sich von dem Spiel selbst ein Bild machen m&ouml;chte, kann dies durch eine
Demoversion (die 4 Level und einen Endgegner beinhaltet) tun, die im Aminet
ver&ouml;ffentlich wurde.</P>

<P><B>Fazit:</B></P>

<P>Alles in allem zeichnet sich &quot;FaYoh 2&quot; (welches in BlitzBasic programmiert
wurde) durch eine sehr gute technische Umsetzung aus, die im Bereich der
PD-Spiele durchaus nicht selbstverst&auml;ndlich ist. Die Motivation bleibt
durch das gute Gameplay und den sehr hohen Schwierigkeitsgrad lange
erhalten.</P>

<P>Leider hat es &quot;FaYoh 2&quot; vers&auml;umt, aufgrund einiger kleiner M&auml;ngel, welche
ich im Text erw&auml;hnt habe, sich in die eingangs erw&auml;hnten Klassiker
einzureihen, aber f&uuml;r den Preis von nur 5,- DM (!!!) kann ich dieses
Spiel allen Jump&#180;n&#180;Run-Fans trotzdem bedingungslos empfehlen.</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>FaYoh 2 - Another New Adventure</B></TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Shareware - Preis der Vollversion: 5,- DM</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:marjoh@algonet.se">Marcus Johansson</A></TD>
</TR>
</TABLE>
<br>
Bezugsquelle der Demoversion:<br>
<A HREF="http://ftp.uni-paderborn.de/pub/aminet/game/jump/FaYoh2.lha">http://ftp.uni-paderborn.de/pub/aminet/game/jump/FaYoh2.lha</A>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903easy.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903gag.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


