<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - GAG - Neuronensturm</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>GAG-&quot;Neuronensturm&quot;</H1>von<BR><A HREF="mailto:uridium@-t-online.de">Peter Fischer</A></DIV>


<h3>Vorwort:</h3>

<P>Ich schreibe hier einen Kurztest eines Projekts meines Chefredakteurs
Gregor Franz!</P>

<P>Jetzt kommt man nat&uuml;rlich unwillk&uuml;rlich auf den Gedanken: Der AmZeiger
macht jetzt schon Tests &uuml;ber seine eigenen Projekte oder der Gregor hat
mich dazu gezwungen, einen Test dar&uuml;ber zu schreiben (Hallo Gregor, wo
bleiben denn die versprochenenen 100.000,- DM f&uuml;r den Text ? ;-)</P>

<P>Und als weiteres Argument kann man auch erw&auml;hnen, da&szlig; dieses Adventure
nicht vollendet ist und (leider) wohl auch nicht vollendet wird!</P>

<h3>Warum dennoch die Erw&auml;hnung?</h3>

<P>H&auml;tte jeder andere dieses Projekt entworfen, so w&uuml;rde dieser Test hier
auch erscheinen, denn die Idee, die hinter diesem unvollendetem
Textadventure steht, ist wirklich bemerkenswert. Es ist das allererste
Textadventure, welches in einem <B>Hypertext-Verfahren</B>, n&auml;mlich dem
&quot;AmigaGuide&quot; geschrieben ist!</P>

<P>Und dieser Test soll auch andere Autoren motivieren, sich mit einfachen
Mitteln sein eigenes Textadventure zu schreiben!</P>

<h3>Was wird ben&ouml;tigt:</h3>

<P>Das Programm &quot;Multiview&quot; oder &quot;AmigaGuide&quot; zur Ausgabe.</P>

<h3>Die Technik:</h3>

<P>Im Zeichen der multimedialen Adventures ist es meines Erachtens sehr
erfreulich, da&szlig; Zur&uuml;ck zu den Anf&auml;ngen der Adventures gegangen wird,
und mal wieder ein Textadventure erscheint, da diese in Ermangelung
von Grafiken die eigene Phantasie anregen, &auml;hnlich wie beim Lesen
eines Buches.</P>

<P>Dadurch werden minimale technische Voraussetzungen erwartet (jeder
Amiga ab OS 2.0), so da&szlig; man sofort losspielen kann.</P>

<h3>Das Adventure:</h3>

<P>Nachdem man den &quot;GAG-Neuronensturm&quot;-Guide ge&ouml;ffnet hat, findet man einige
Hinweis-Buttons vor und erf&auml;hrt, da&szlig; &quot;GAG&quot; f&uuml;r &quot;<B>GuideAdventureGame</B>&quot; steht.
Die wichtigsten Kn&ouml;pfe sind aber sicherlich &quot;Start&quot; und
&quot;Spielstandseingabe&quot;.</P>

<P>Nach Dr&uuml;cken des &quot;Start&quot;-Buttons, wird einem eine (in Deutsch verfa&szlig;te)
Einf&uuml;hrungsgeschichte pr&auml;sentiert, die im <B>Science Fiction</B>-Bereich
angesiedelt ist. Danach befindet man sich in einem Benutzermenu, welches
alle bekannten Adventurebefehle beinhaltet, wie z.B. &quot;Nehme&quot;, Gebe&quot;,
&quot;Benutze&quot;, &quot;Gehe vor&quot; usw., die komfortabel per Mausklick auf den
jeweiligen Knopf ausgef&uuml;hrt werden.</P>

<P>Und hiermit kann man selbst anfangen, das Adventure zu l&ouml;sen...</P>

<P>An und Wann erscheint auf der oberen Info-Leiste des Guides ein Code,
den man sich notieren sollte, wenn man es nicht schafft, das Adventure
an einem St&uuml;ck durchzuspielen. Dieser Code kann bei dem Button
&quot;<B>Spielstandseingabe</B>&quot; eingegeben werden und man spielt direkt ab diesem
Zwischenstand wieder weiter.</P>

<P>Durch diese einfache Methode wurde auch das letzte Hindernis zur
Erstellung eigener Textadventures bequem und einfach gel&ouml;st!</P>

<h3>Fazit:</h3>

<P>Durch dieses Adventure wurde eindrucksvoll bewiesen, da&szlig; man ohne
tiefgr&uuml;ndige Programmierkenntnisse Adventures schreiben kann, die
lediglich auf einem AmigaGuide basieren, aber auch z.B. als HTML-
Dokument gefertigt werden k&ouml;nnen!</P>

<P>Leider hat ein AmigaGuide- oder HTML-Dokument den <B>Nachteil</B>, da&szlig; man sich
mit einem Textanzeiger oder einem Texteditor problemlos den Quelltext
ansehen kann, aber dies sollte man zur eigenen Spannungserhaltung
vermeiden!</P>

<P>Aber zum Verfassen eigener Adventures sollte man zur Veranschaulichung
doch mal einen Blick in den Quellcode von &quot;GAG-Neuronensturm&quot; werfen!</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>GAG- &quot;Neuronensturm&quot;</B>, Version 1.10</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>eMail-Ware</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></TD>
</TR>
</TABLE> 
<br>
Bezugsquelle: <A HREF="http://ftp.uni-paderborn.de/pub/aminet/game/text/GAG-Neuro.lha">http://ftp.uni-paderborn.de/pub/aminet/game/text/GAG-Neuro.lha</A>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903fa.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903b3d.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


