<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - WEBup V39.1</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>WEBup V39.1</H1>von<BR><A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<h3>Im Anfang war das Chaos</h3>

<P>Jeder, der eine eigene oder fremde Homepage betreuen mu&szlig;, kennt das
Problem: Nach kurzer Zeit hat man keinen &Uuml;berblick mehr, welche Dateien
in welcher Version denn nun auf dem Server liegen. Mu&szlig; diese HTML-Datei
neu hochgeladen werden, oder hat sich nichts ver&auml;ndert? Ist vielleicht
ein neues Bild dazugekommen, oder wurde eines gel&ouml;scht?</P>

<P>Bisher mu&szlig;te man aufwendig per Hand und FTP-Zugriff die Dateien auf der
Festplatte mit den Dateien auf dem Webserver beim Provider abgleichen. Mit
WEBup ist dies jetzt ein ganzes St&uuml;ck leichter, verspricht der Autor des
Programms, Christian Krapp.</P>

<h3>Bestandsaufnahme</h3>

<P>WEBup ist ein einzelnes, kleines Programm (23 KByte), das eigenst&auml;ndig mit
dem Provider Kontakt aufnimmt und nur die Dateien hochl&auml;dt, bzw. l&ouml;scht,
die sich seit dem letzten Upload lokal ver&auml;ndert haben.</P>

<P>Wie die Versionsnummer schon nahelegt, braucht WEBup au&szlig;er einem TCP/IP-
Stack noch mindestens OS 3.0 (V39) und nat&uuml;rlich eine Homepage im Internet
oder auch LAN (Netzwerk).</P>

<P>Die Dokumentation ist in Deutsch und Englisch, ein jeder sollte damit
zurechtkommen. Was fehlt, sind vielleicht ein oder zwei Beispiele, denn
WEBup ist ein reines Shell-Programm und verlangt zum Betrieb einige
Parameter.</P>

<P>Voraussetzung f&uuml;r WEBup ist, da&szlig; sich die Homepage auf der heimischen
Festplatte in einem eigenen Verzeichnis befindet. Beim ersten Upload legt
WEBup dann die Datei &quot;WEBup.transfered&quot; an, in der Name, Gr&ouml;&szlig;e und Datum
der einzelnen Dateien und Verzeichnisse verzeichnet sind.</P>

<P>Der Upload von Verzeichnissen klappt auch reibungslos, sogar leere
Verzeichnisse k&ouml;nnen ber&uuml;cksichtigt werden. Mittels Patternmatching lassen
sich auch nur bestimmte Dateien zum Upload ausw&auml;hlen. Ein weiterer Schalter
unterdr&uuml;ckt den Upload ganz und erzeugt nur die &quot;WEBup.transfered&quot;-Datei. </P>

<h3>Nachgetragen</h3>

<P>Hat man schon eine Homepage am Netz und will WEBup nachtr&auml;glich einsetzen,
mu&szlig; man entweder die ganze Seite nochmal hochladen, oder kann sich einfach
nur die transfered-Datei erzeugen lassen. Der Nachteil bei der letzten
Methode ist, da&szlig; WEBup nur die Dateien manipuliert, die sich lokal
ver&auml;ndert haben und in der transfered-Datei stehen. Waren auf dem Server
noch andere Dateien, als die lokalen, werden diese nicht anger&uuml;hrt.</P>

<P>Allerdings mu&szlig; das nicht negativ sein, denn manchmal erzeugt der Provider
bestimmte Dateien, die besser nicht angetastet werden sollten. Der Apache-
Webserver benutzt z.B. eine Datei &quot;.htaccess&quot; zur Regulierung von Zugriffen
f&uuml;r ein Verzeichnis.</P>

<h3>Praxistest</h3>

<P>Ich konnte WEBup an zwei verschiedenen Providern testen: T-Online und
ecore. T-Online ist der pingeligere der beiden und WEBup arbeitet hier
ohne Fehler, was nicht im mindesten selbstverst&auml;ndlich ist. Um so
&uuml;berraschender ist ein Problem mit ecore: Der Upload endet mit &quot;99%
transfered&quot; und mu&szlig; mit Control+C abgebrochen werden, was auch
funktioniert. Trotzdem wurden alle Dateien vollst&auml;ndig hochgeladen.
Anscheinend wartet WEBup auf eine letzte Best&auml;tigung vom Server, die
nie kommt.</P>

<P>Die Geschwindigkeit ist maximal: MiamiDeluxe zeigt eine Geschwindigkeit
von 8 KByte/Sekunde (ISDN) an, jedoch braucht jeder Homepage-Server nach
jeder einzelnen Datei eine kurze Denkpause, bevor er die n&auml;chste annimmt.
Aber das ist nicht WEBup's Fehler.</P>

<h3>Geheimnis</h3>

<P>Besondere Vorsicht sollte man an den Tag legen, wenn man WEBup in Skripten
einsetzt. Man mu&szlig; unverschl&uuml;sselt (!) Usernamen und Pa&szlig;wort zum Homepage
Server angeben. Ger&auml;t so ein Skript in die falschen H&auml;nde, ist der Zugang
zur Homepage und meist auch zum Provider weit offen.</P>

<h3>Komfort</h3>

<P>WEBup verspr&uuml;ht noch den Charme eines typischen Shellprogramms. Hat man
die Parameter ein paarmal eingetippt, braucht man nicht mal mehr einen
Spickzettel. Trotzdem sind zumindest Konfigurationsdateien w&uuml;nschenswert,
in denen auch Pa&szlig;wort und Username verschl&uuml;sselt abgelegt werden. Das
w&uuml;rde den Komfort und die Benutzerfreundlichkeit deutlich ansteigen lassen,
mit der zunehmenden Popularit&auml;t k&ouml;nnten auch exotischere Provider besser
unterst&uuml;tzt werden.</P>

<P>Die Verwendung im Startskript des TCP-Stacks kann ich im Gegensatz zum
Autor nicht bef&uuml;rworten. Solange das Pa&szlig;wort dem Programm unverschl&uuml;sselt
&uuml;bergeben wird, ist es f&uuml;r jeden Virus und Trojaner &uuml;ber einen Eintrag in
der DOS-Proze&szlig;struktur (UBYTE *pr_Arguments) als Klartext lesbar. Wenn ich
jetzt nur keinen auf dumme Gedanken gebracht habe...</P>

<P>Was man jetzt schon bekommt, ist ein Programm, das seinen Dienst (mit dem
richtigen Provider) voll und ganz verrichtet. Nervrequester oder
funktionelle Einschr&auml;nkungen der nichtregistrierten Version gibt es nicht.
Im Hinblick auf die - wenn auch nur leichten - Probleme bei ecore und der
unkomfortablen Bedienung ist der Preis von 20 DM nur im befriedigenden
Bereich. Allerdings ist das Programm auch schon seit einem Jahr in der
Entwicklung, also kann man den Autor ruhig mit einer Registrierung
motivieren.</P>

<TABLE cellpadding=2 BORDER=0>
<TR>
	<td><b>Programm:</b></td>
    <TD><B>WEBup</B> (V 39.1)</TD>
</TR>
<TR>
	<td><b>Status:</b></td>
    <TD>Shareware - Preis der Vollversion: 20,- DM</TD>
</TR>
<TR>
	<td><b>Autor:</b></td>
    <TD><A HREF="mailto:Christian.Krapp@A-City.De">Christian Krapp</A></TD>
</TR>
</TABLE> 
<br>
<P>Bezugsquelle:<BR>

<A HREF="http://ftp.uni-paderborn.de/pub/aminet/comm/www/WEBup.lha">http://ftp.uni-paderborn.de/pub/aminet/comm/www/WEBup.lha</A> </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903liga.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9903mon.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


