<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Toimitukselliset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vuosikokous 2002 - ripaus historiaa</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu&nbsp;Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/vuosikokous_banneri.jpg" alt="" height="178" width="500" border="0"></font></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;inen vuosikokous pidettiin t&auml;n&auml;kin vuonna Oulussa, Pakkahuoneenkatu 30:n kerhotilassa lauantaina 28. syyskuuta kello 14 alkaen. Sis&auml;&auml;np&auml;&auml;sy oli avoin kaikille, ja paikan p&auml;&auml;ll&auml; k&auml;vikin yhteens&auml; n. 60 henkil&ouml;&auml;. Aina uskollinen Gentle Eye Ky saapui paikalle AmigaOne-emolevyjen kera. Tapaamisen kohokohta oli ilman muuta Thendic-Francen j&auml;rjest&auml;m&auml; Pegasos-tietokoneen ensiesittely Suomessa.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Pohjoisessa vipisi j&auml;lleen</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml;n vuoden vuosikokous p&auml;&auml;tyi j&auml;lleen Ouluun varteenotettavien vaihtoehtojen puutteessa. T&auml;m&auml; ei kovin paljon tahtia haitannut, sill&auml; asiassa oli hyv&auml;kin puoli: kokoustila oli jo iskuryhm&auml;lle tuttu ja sijainti Oulun keskustassa hyv&auml;. Kun lauantaiaamu koitti, oli j&auml;rjest&auml;jill&auml; kuitenkin tavallista enemm&auml;n vipin&auml;&auml; vatsanpohjassa: kokouksessa olisi tarkoitus vahvistaa yhdistyksen viiden ensimm&auml;isen tilikauden tilinp&auml;&auml;t&ouml;kset ja my&ouml;nt&auml;&auml; hallituksille vastuuvapaus, ja tuote-esittelij&ouml;it&auml;kin oli tulossa Suomen lis&auml;ksi ulkomailta asti.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/pieni_vuosi2002_02.jpg" alt=" " height="192" width="256" border="1"></font></div>
									</td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Homma l&auml;hti k&auml;yntiin aamukymmenelt&auml;. L&auml;hes samaan syssyyn saapui paikalle my&ouml;s Thendic-Francen l&auml;hett&auml;m&auml; Coyote Flux -tiimin&auml;kin tunnettu tehokaksikko Sharwin ja Rakesh Raghoebardayal, joiden seurassa tuli my&ouml;s AmiTCP/IP-ryhm&auml;n Tomi Ollila. Sharwin ja Rakesh toivat mukanaan kiintolevyn, n&auml;pp&auml;imist&ouml;n, hiiren ja tietenkin Pegasos-emolevyn, jolle Oulun iskuryhm&auml; taikoi ATX-tornikotelon, monitorin ja kaiuttimet. Asennuspuuhissa avusti my&ouml;s uusi hallituksen j&auml;sen, Sami Yl&ouml;nen. Samaan aikaan &quot;muonavastaava&quot; Sirpa P&ouml;yh&ouml;nen j&auml;rjesti kokouksen tarjoiluosaston kuntoon; tarjolla oli tuttuun tapaa virvoitusjuomia ja pikkupurtavaa vierailijoille.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/pieni_vuosi2002_05.jpg" alt=" " height="192" width="256" border="1"></font></div>
									</td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Yhdistyksen toiminnan kannalta kokouksen historiallisin hetki oli viiden ensimm&auml;isen tilikauden valmistuminen. Ison urakan tehnyt Janne Sir&eacute;n luovutti kirjanpitokansion juhlallisesti puheenjohtaja Anu&nbsp;Seiloselle, jolta kansio siirtyi kirjanpitoa jatkavan Jarmo Piipon haltuun. Tilintarkastaja Janne&nbsp;Lardot ei l&ouml;yt&auml;nyt kirjanpidosta moitittavaa, ja vuosikokouksessa tilinp&auml;&auml;t&ouml;kset hyv&auml;ksyttiinkin mykist&auml;v&auml;n yksimielisesti. N&auml;inkin ison asian ollessa kyseess&auml; varsinainen historiallinen hetki tuntui menev&auml;n liian nopeasti. Totta - kyseess&auml; on periaatteessa vain mapillinen paperia, mutta sen takana on ollut paljon kovaa ty&ouml;t&auml; ja opiskeluakin. Janne teki kirjanpidon jatkoa ajatellen korvaamatonta pohjaty&ouml;t&auml;. T&auml;st&auml; on hyv&auml; jatkaa.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/pieni_vuosi2002_07.jpg" alt=" " height="192" width="256" border="1"></font></div>
									</td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Varsinaisesta kokouksesta ei valitettavasti kuvia kertynyt, sill&auml; valokuvaajamme joutui l&auml;htem&auml;&auml;n kokouksen ajaksi verkko-ongelmia selvittelem&auml;&auml;n. Verkko-ongelmien vuoksi my&ouml;s kokouksen Internet-ulottuvuus koki kolauksen - IRC-yhteys periaatteessa toimi alusta asti, mutta Shoutcast-&auml;&auml;nil&auml;hetys ja web-kamera saatiin k&auml;yntiin vasta viiden j&auml;lkeen. Pitip&auml; t&auml;st&auml;kin kokouksesta hakea oppia kantap&auml;&auml;n kautta - suuri kiitos kuuluu #saku-kanavalla py&ouml;rineille, joiden ideoiden ja kekseli&auml;isyyden ansiosta saatiin sent&auml;&auml;n jotain ulos. Yhteisty&ouml; n&auml;ytti j&auml;lleen voimansa. Petteri Vallin Sakubot-bottikin oli j&auml;lleen kaivettu naftaliinista, ja se olikin vahtinut kanavaa jo syyskuun alkupuolelta asti.<br>
								<br>Kokoukselle oli varattu aikaa hulppeat kaksi tuntia, mutta kustannustehokkaaseen tapaan se vedettiin l&auml;pi noin 40 minuutissa. Yhdistyksen hallitus muuttui hieman, ja kokonaan uutena j&auml;senen&auml; ryhm&auml;&auml;n liittyi Saku-tapahtumien ja -tapaamisten veteraani Sami Yl&ouml;nen. Yhdistyksen graafisen ilmeen uudistaminen oli my&ouml;s aiheena, ja se alkoikin jo osittain vuosikokouksen logosta ja julisteista. Uudistus on tarkoitus aloittaa Saku-lehdest&auml; ja ulottaa my&ouml;hemmin my&ouml;s yhdistyksen kotisivuille. Uudistuksen toteuttaa yhdistyksen mediavastaava Terho Henriksson yhdess&auml; muun hallituksen kanssa.<br>
								<br>
								J&auml;senmaksu pysyi ennallaan, ja se on vuodelle 2003 suuruudeltaan 11 euroa. Muistattehan, ett&auml; taannoisen s&auml;&auml;nt&ouml;muutoksen mukainen j&auml;senlaskutavan muutos n&auml;kyy nyt j&auml;senrekisteriss&auml;! Kahden vuoden ajan j&auml;senmaksun maksamatta j&auml;tt&auml;minen katsotaan yhdistyksest&auml; </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">eroamiseksi, joten </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">vuonna 2000 maksun maksaneiden j&auml;senyys p&auml;&auml;ttyy </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">t&auml;m&auml;n vuoden loppuun. Tietoa j&auml;senmaksun maksamisesta l&ouml;ytyy <a href="yhdistys.html" target="_self">t&auml;st&auml; lehdest&auml;</a> sek&auml; <a href="http://saku.amigafin.org/yhdistys/liittyminen.html" target="_blank">yhdistyksen kotisivulta</a>.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">...ja sitten itse asiaan!</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/pieni_vuosi2002_25.jpg" alt="" height="192" width="256" border="1"></div>
									</td>
									<td valign="top"><img src="kuvat/pieni_vuosi2002_11.jpg" alt="" height="192" width="256" border="1"></td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kokouksen j&auml;lkeen seurasi tietenkin illan odotetuin osuus. Amiga-j&auml;lleenmyyj&auml; Gentle Eye Ky oli j&auml;lleen paikalla runsaudensarvensa kera. Boogie itse ei valitettavasti p&auml;&auml;ssyt paikalle, mutta &quot;varamiehitys&quot; hoiti hommansa mainiosti. Heill&auml; oli aikaa v&auml;lill&auml; ottaa rennomminkin - siit&auml;kin huolimatta, ett&auml; mukana tuoduista AmigaOne-emolevyist&auml; kumpikaan ei ollut toimintakunnossa. P&ouml;yd&auml;ll&auml; olleesta AmigaOneG3-SE-emolevyst&auml; puuttui toimiva BIOS, eik&auml; torniin kasattu AmigaOne-XE:n prototyyppi suostunut boottaamaan Linuxiin. Yhdistys aikookin esitell&auml; toimivaa AmigaOnea my&ouml;hemmin.  </font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/pieni_vuosi2002_10.jpg" alt="" height="192" width="256" border="1"></div>
									</td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Taustaviihdykkeeksi tapahtumaan saatiin&nbsp;Esa Haapaniemen CD32-combo, joka py&ouml;ritteli mm. Amiga-aiheisia videoita (huomaa my&ouml;s laavalamppu). J&auml;senmaksuja maksettiin ilahduttavaan tahtiin, ja yhdistyksen talous n&auml;ytt&auml;&auml; j&auml;lleen paremmalta. My&ouml;s jokunen Saku CD-ROM #3 sek&auml; Saku 2001 Theme meni kaupaksi. Puolenkymment&auml; k&auml;vij&auml;&auml; k&auml;ytti hyv&auml;kseen Vaporware-tuotteiden rekister&ouml;intipalvelua.&nbsp;T&auml;ll&auml; kertaa suosituin ohjelma oli AmTelnet 2, ja kaikille rekister&ouml;ineille on jo toimitettu rekister&ouml;intiavaimet s&auml;hk&ouml;postitse. Pienen viiv&auml;styksen vuoksi kaikki rekister&ouml;ineet saivat kaupan p&auml;&auml;lle my&ouml;s NetInfo II:n avaimet. Vaporwaren Oliver Wagner kiitt&auml;&auml; Suomen&nbsp;Amiga-k&auml;ytt&auml;ji&auml; kannatuksesta.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Sokerina pohjalla:&nbsp;Pegasoksen ensiesittely</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/pieni_vuosi2002_19.jpg" alt="" height="192" width="256" border="1"></div>
									</td>
									<td valign="top"><img src="kuvat/pieni_vuosi2002_20.jpg" alt="" height="192" width="256" border="1"></td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tapaamisen odotetuin osuus oli kuitenkin ep&auml;ilem&auml;tt&auml; Pegasos-tietokoneen ensiesittely Suomessa. Thendic-Francen Rakesh ja Sharwin Raghoebardayal esitteliv&auml;t sek&auml; MorphOS:ia ett&auml; joitakin hy&ouml;tyohjelmia. Vaikuttaviin esityksiin lukeutuivat J Miner, valokuvaty&ouml;kalu joka luo 2D-valokuvista 3D-kuvia, sek&auml; MorphOS:n lukuisat ominaisuudet ja emulointiohjelmistot. MorphOS:n kaunis MUI:ta k&auml;ytt&auml;v&auml; Ambient-ty&ouml;p&ouml;yt&auml; her&auml;tti ihastusta, vaikka kokouksessa ollut esittelykokoonpano ei ollutkaan viel&auml; t&auml;ysin vakaa - MorphOS oli tuolloin viel&auml; kehitysvaiheessa. Laitteisto boottasi MorphOS:iin muutamassa sekunnissa, ja ty&ouml;p&ouml;yd&auml;ll&auml; tuhertaminen oli sujuvaa, vaikka ominaisuuksia viel&auml; puuttuikin.<br>
								<br>
								Yleis&ouml;kin p&auml;&auml;stettiin v&auml;lill&auml; Pegasoksen kimppuun. Ja Pegasos kiinnosti - onhan kyseess&auml; ensimm&auml;inen uusi Amigaan liittyv&auml; tietokone vuosikymmeneen, ja se oli nyt konkreettisesti kokeiltavana. Ensimm&auml;ist&auml; kertaa tuntui silt&auml;, ett&auml; ehk&auml; hommasta viel&auml; jotain tulee; t&auml;h&auml;n asti oli saatu vuosikaudet lukea toteutumattomia lupauksia ja armotonta hypetyst&auml; tuotteista ja p&auml;iv&auml;m&auml;&auml;rist&auml;, joista yksik&auml;&auml;n ei pit&auml;nyt kutiaan. Pegasos oli t&auml;&auml;ll&auml;, ja se oli Oikea. Ei se v&auml;ltt&auml;m&auml;tt&auml; makeann&auml;lk&auml;&auml; t&auml;ysin tyydytt&auml;nyt, mutta ainakaan karkkihammasta ei en&auml;&auml; kolota niin pahasti. </font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
									<tr>
										<td colspan="4" valign="top">&nbsp;</td>
									</tr>
									<tr>
										<td valign="top" width="50%"></td>
										<td valign="top">
											<div align="center">
												<img src="kuvat/pieni_vuosi2002_27.jpg" alt="" height="192" width="256" border="1"></div>
										</td>
									<td valign="top"><img src="kuvat/pieni_vuosi2002_16.jpg" alt="" height="192" width="256" border="1"></td>
									<td valign="top" width="50%"></td>
									</tr>
									<tr>
										<td colspan="4" valign="top">&nbsp;</td>
									</tr>
								</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Sill&auml; v&auml;lin kun yleis&ouml; paukutti Pegasosta, Sharwin ja Rakesh osallistuivat IRC-keskusteluun #saku-kanavalla. Veljeksill&auml; olikin kova vauhti p&auml;&auml;ll&auml; iltaan asti - puhuttavaa riitti niin kokouksessa kuin sen ulkopuolellakin. Etenkin Sharwin tuntui olevan varsinainen energiapommi, joka kirjaimellisesti pomppi paikasta toiseen tapaamisessa. Kokouksen Internet-palvelukseen oli valjastettu Janne Sir&eacute;nin kannettava tietokone, ja web-kameran lis&auml;ksi tapahtumakuvia napsittiin mm. Nokia 7650 -kamerapuhelimella sek&auml; lukuisilla digikameroilla.<br>
								<br>
								Suomalaiset MorphOS-kehitt&auml;j&auml;t Harry &quot;Piru&quot; Sintonen ja Teemu&nbsp;&quot;Zuikkis&quot; Suikki osallistuivat my&ouml;s tapahtumaan ja vastailivat MorphOS:ia koskeviin kysymyksiin. Harry Sintonen tunnetaan mm. lukuisista Amigan ty&ouml;kaluohjelmista, joista tunnetuin lienee Blizzard-turboille suunnattu Blizkick-ohjelma. Teemu&nbsp;Suikki taas on Delfina-&auml;&auml;nikortin kehitt&auml;ji&auml;. Moni kokoukseen tullut mainitsikin, ett&auml; n&auml;m&auml; suomalaiset &quot;Amiga-legendat&quot; oli hauskaa n&auml;hd&auml; liven&auml;. Eik&auml; tuntunut pojillakaan ihan tyls&auml;&auml; olevan - juttua riitti, ja kiipesip&auml; Piru p&auml;iv&auml;n p&auml;&auml;tteeksi viel&auml; p&ouml;yd&auml;llekin&nbsp;Pegasosta nuuskimaan. T&auml;st&auml; ja muista h&auml;mment&auml;vist&auml; tapahtumista voit katsella lis&auml;&auml; todistusaineistoa kokouksen <a href="http://saku.amigafin.org/yhdistys/tapahtumat/vuosi2002/kuvat/index_1.html" target="_blank">valokuvaraportista</a> yhdistyksen kotisivuilla.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/pieni_vuosi2002_31.jpg" alt="" height="256" width="192" border="1"></div>
									</td>
									<td valign="top"><img src="kuvat/pieni_vuosi2002_36.jpg" alt="" height="256" width="192" border="1"></td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kaiken s&auml;hellyksen ja vastoink&auml;ymistenkin j&auml;lkeen vuosikokouksen lopputulos oli kiitett&auml;v&auml;. Olimme j&auml;lleen n&auml;ytt&auml;neet, ett&auml; piskuinen k&auml;ytt&auml;j&auml;ryhm&auml;mme on t&auml;ynn&auml; sisua. Menneisyyden virheist&auml; otamme opiksi, tulevaisuutta katsomme avoimin mielin ja haluamme hoitaa yhdistyst&auml;mme kunnialla jatkossakin. Kun tiliasiat ovat viimein kunnossa, kirjanpito etenee ja muutkin yhdistysvelvoitteet ovat hoidossa, on helpompi keskitty&auml; olennaiseen: Amiga-maailman tapahtumien seuraamiseen ja uutuuksien tuomiseen suomalaisten harrastajien ulottuville.<br>
								<br>
								Kokouksen viimeisess&auml; kuvaparissa on kaksi ovea. Vasemmanpuoleinen on kokouksessa esitellyn Pegasoksen syd&auml;n, sen piskuinen emolevy. Oviko? Kyll&auml;. Se on ovi uuteen maailmaan, jossa viimeinkin voimme saada jotain uutta hyppysiimme. Se ei ehk&auml; mullista maailmaa kuten Amiga teki l&auml;hes kaksi vuosikymment&auml; sitten, mutta ainakin se on pitk&auml;st&auml; aikaa vaihtoehto. Oikeanpuoleinen on vuosikokouspaikan ovi h&auml;m&auml;rtyv&auml;ss&auml; syysillassa. Sen oven takana yhdistys n&auml;ytti j&auml;lleen, ett&auml; tapahtuipa Amiga-maailmassa mit&auml; tahansa, meill&auml; ei ole aikomustakaan j&auml;tt&auml;&auml; leikki&auml; kesken. Ja vaihteeksi n&auml;ytt&auml;isi silt&auml;, ett&auml; ehk&auml; niit&auml; leikkikalujakin viel&auml; tulee.<br>
								<br>
								Kiitokset kokouksen j&auml;rjestelyist&auml; seuraaville henkil&ouml;ille (aakkosj&auml;rjestyksess&auml;): Esa Haapaniemi, Timo Karjalainen, Sami Louko, Marko Lustim&auml;ki, Tuomo M&auml;mmel&auml;, Jarmo Piippo, Sirpa P&ouml;yh&ouml;nen, Anu Seilonen, Janne Sir&eacute;n, Lari Temmes ja Petteri Valli.<br>
								<br>
								
								
								
									
								
								&gt; <a href="http://saku.amigafin.org/yhdistys/tapahtumat/vuosi2002/index.html" target="_blank">Vuosikokous 2002 -sivusto</a><br>
								
								
								
									
								
								&gt; <a href="poytakirja.html" target="_self">Vuosikokouksen p&ouml;yt&auml;kirja</a></font></div>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Toimitukselliset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>