<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Vakiot</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Errata</b></font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font size="2">Saku #32:ssa olleessa BeOS-jutussa (Testit-osasto) kerrottiin, ettei BeOS 5.0 Personal Edition suostuisi asentumaan omalle osiolleen. Jutun kirjoittaja Risto M&auml;ki-Pet&auml;ys sai aiheesta palautetta, jonka katsoimme parhaaksi julkaista t&auml;ss&auml;.&nbsp;Kiitos Sami Nurmiselle tarkennuksista.</font>
						<p>Siit&auml; ett&auml; BeOS 5 Personal Edition el&auml;&auml; oman tiedostonsa sis&auml;ll&auml;: Latasin kyseisen ohjelman <a href="http://ftp.sunet.se/pub/os/BeOS/beos/BeOS5-PersonalEdition.exe">Ruotsin serverilt&auml;</a>. Se asentui todella mallikkaasti ja niin edelleen, l&auml;hes kaikki toimi modeemia lukuunottamatta. Mukana tuli Installer-ohjelma, jolla voi asentaa BeOSin minne tahansa osiolle, eik&auml; tarvitse menn&auml; Windowsiin tai k&auml;ytt&auml;&auml; buuttia alussa. T&auml;ss&auml; versiossa kyseinen Installer ainakin tuli mukana ja hyvin toimii, en tied&auml; edes mit&auml; j&auml;&auml;n kaipaamaan koko versioon n&auml;hden... Nyt BeOS on poistettu Windowsista ja py&ouml;rii omalla osiollaan!</p>
						<p>Ohjelmasta voi k&auml;ynnist&auml;&auml; osiointiohjelman, jolla sitten luodaan oma, BeOS-tiedostoj&auml;rjestelm&auml;&auml; k&auml;ytt&auml;v&auml; osio. Kun se on luotu, palataan Installer-ohjelmaan, valitaan milt&auml; osiolta (ensimm&auml;isell&auml; kerralla siit&auml; BeOS-valeosiosta) ja minne (eli t&auml;nne &auml;sken luotuun osioon) BeOS kopioidaan. Sitten vain painetaan Begin ja kone hoitaa loput. Puheet siit&auml;, ettei BeOSia saisi omalle osiolleen, ovat siis v&auml;&auml;ri&auml;...</p>
						<p>Sami Nurminen</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Edellisen Sakun HTML-version yhdistyksen tiedotteissa oli pari virhett&auml;.&nbsp;Tiedote k&auml;ytt&auml;j&auml;tapaamisesta oli kahteen kertaan englanniksi ja tiedote Janne Sir&eacute;nin Jyrki-esiintymisest&auml; puuttui kokonaan. Kyseinen tiedote julkaistaan t&auml;ss&auml; Sakussa.
						<p>Anu&nbsp;Seilonen</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Edellisen Sakun k&auml;nnykk&auml;kuorijutussa (Sekalaiset-osasto) oli kuvatekstiss&auml; virheit&auml;. Kuvan oikeanpuoleisin kuori on 5110:n ja sen vieress&auml; vasemmalla puolella 6110:n kuori. N&auml;iden kahden kuvatekstit olivat siis vaihtaneet paikkaa. Sama virhe oli my&ouml;s yhdistyksen vuosikokouksessa jaossa ja esill&auml; olleessa esitteess&auml;. Kiitokset Pekka Martikaiselle tarkkasilm&auml;isyydest&auml;.
						<p>Anu&nbsp;Seilonen</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Errata-palstalla julkaistaan korjauksia aiempien numeroiden k&ouml;mm&auml;hdyksiin. Voit l&auml;hett&auml;&auml; toimitukseen palautetta seuraavaan osoitteeseen postitse.<br>
						<br>
						Saku<br>
						c/o Anu Seilonen<br>
						Sammaltie 51<br>
						90650 Oulu<br>
						<br>
						Internet: <a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a><br>
						Sakunet: 65:10/6.0 (Anu Seilonen)<br>
						BBS: Amiga Zone, (015) 348 968 (24h)</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
